; ModuleID = 'build/actinius_icarus_bee_ns/s2ram/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.__cpu_context = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/s2ram/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/s2ram")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/s2ram")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/s2ram")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !111, file: !173, line: 65, type: !174, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !166, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/s2ram")
!113 = !{!102, !103, !114, !119, !126}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !116, file: !115, line: 167, baseType: !125)
!115 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !115, file: !115, line: 134, type: !117, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !111, retainedNodes: !120)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !119}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!120 = !{!121, !122, !124}
!121 = !DILocalVariable(name: "time_us", arg: 1, scope: !116, file: !115, line: 134, type: !119)
!122 = !DILocalVariable(name: "delay_cycles", scope: !116, file: !115, line: 168, type: !123)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!124 = !DILocalVariable(name: "cycles", scope: !116, file: !115, line: 171, type: !119)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !128, line: 1928, baseType: !129)
!128 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 1909, size: 11360, elements: !130)
!130 = !{!131, !137, !138, !139, !140, !144, !145, !146, !147, !151, !152, !156, !157, !158, !159, !160, !164, !165}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !129, file: !128, line: 1910, baseType: !132, size: 8192)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 8192, elements: !135)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !119)
!135 = !{!136}
!136 = !DISubrange(count: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !129, file: !128, line: 1911, baseType: !133, size: 32, offset: 8192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !129, file: !128, line: 1912, baseType: !133, size: 32, offset: 8224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !129, file: !128, line: 1913, baseType: !133, size: 32, offset: 8256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !129, file: !128, line: 1914, baseType: !141, size: 1984, offset: 8288)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 1984, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 62)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !129, file: !128, line: 1915, baseType: !134, size: 32, offset: 10272)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !129, file: !128, line: 1916, baseType: !133, size: 32, offset: 10304)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !129, file: !128, line: 1917, baseType: !134, size: 32, offset: 10336)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !129, file: !128, line: 1918, baseType: !148, size: 96, offset: 10368)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 96, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 3)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !129, file: !128, line: 1919, baseType: !134, size: 32, offset: 10464)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !129, file: !128, line: 1920, baseType: !153, size: 256, offset: 10496)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 256, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 8)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !129, file: !128, line: 1921, baseType: !134, size: 32, offset: 10752)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !129, file: !128, line: 1922, baseType: !133, size: 32, offset: 10784)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !129, file: !128, line: 1923, baseType: !134, size: 32, offset: 10816)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !129, file: !128, line: 1924, baseType: !134, size: 32, offset: 10848)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !129, file: !128, line: 1925, baseType: !161, size: 416, offset: 10880)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 416, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 13)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !129, file: !128, line: 1926, baseType: !134, size: 32, offset: 11296)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !129, file: !128, line: 1927, baseType: !134, size: 32, offset: 11328)
!166 = !{!109, !167}
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !116, file: !115, line: 161, type: !169, isLocal: true, isDefinition: true, align: 128)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 48, elements: !149)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !172)
!172 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!173 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !177)
!176 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!177 = !{!178, !185}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !175, file: !176, line: 60, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!103, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !176, line: 48, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !175, file: !176, line: 65, baseType: !182, size: 32, offset: 32)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !188, file: !230, line: 27, type: !259, isLocal: true, isDefinition: true)
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !190, retainedTypes: !202, globals: !227, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/s2ram")
!190 = !{!191, !30}
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !192, line: 27, baseType: !32, size: 32, elements: !193)
!192 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201}
!194 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!195 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!196 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!197 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!198 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!199 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!200 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!201 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!202 = !{!102, !203, !103, !24, !207, !223, !119, !225}
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !204, line: 46, baseType: !205)
!204 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !206)
!206 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !209, line: 54, size: 96, elements: !210)
!209 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = !{!211, !218, !222}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !208, file: !209, line: 55, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !213, line: 33, baseType: !214)
!213 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !213, line: 29, size: 32, elements: !215)
!215 = !{!216}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !214, file: !213, line: 30, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !208, file: !209, line: 60, baseType: !219, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DISubroutineType(types: !221)
!221 = !{null, !191}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !208, file: !209, line: 65, baseType: !219, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !226)
!226 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!227 = !{!186, !228, !234, !236, !249, !251}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !188, file: !230, line: 44, type: !231, isLocal: true, isDefinition: true)
!230 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, elements: !233)
!232 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!233 = !{}
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !188, file: !230, line: 49, type: !231, isLocal: true, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !188, file: !230, line: 36, type: !238, isLocal: true, isDefinition: true)
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 128, elements: !247)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !192, line: 114, size: 128, elements: !240)
!240 = !{!241, !242, !245, !246}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !239, file: !192, line: 115, baseType: !191, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !239, file: !192, line: 141, baseType: !243, size: 8, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !244)
!244 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !239, file: !192, line: 149, baseType: !119, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !239, file: !192, line: 156, baseType: !119, size: 32, offset: 96)
!247 = !{!248}
!248 = !DISubrange(count: 1)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !188, file: !230, line: 40, type: !238, isLocal: true, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !188, file: !230, line: 28, type: !253, isLocal: true, isDefinition: true)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !213, line: 40, baseType: !254)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !213, line: 35, size: 64, elements: !255)
!255 = !{!256, !258}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !254, file: !213, line: 36, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !254, file: !213, line: 37, baseType: !257, size: 32, offset: 32)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 32, elements: !247)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !261, line: 22, baseType: !262)
!261 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!262 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!263 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!264 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !267, file: !298, line: 50, type: !285, isLocal: true, isDefinition: true)
!267 = distinct !DICompileUnit(language: DW_LANG_C99, file: !268, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !190, retainedTypes: !269, globals: !295, splitDebugInlining: false, nameTableKind: None)
!268 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/s2ram")
!269 = !{!270, !203, !272, !103, !102, !119, !225, !274, !223, !285, !286}
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !271)
!271 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !273, line: 214, baseType: !32)
!273 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !276, line: 45, size: 64, elements: !277)
!276 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!277 = !{!278, !284}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !275, file: !276, line: 46, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !213, line: 33, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !213, line: 29, size: 32, elements: !281)
!281 = !{!282}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !280, file: !213, line: 30, baseType: !283, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !275, file: !276, line: 48, baseType: !119, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !276, line: 38, size: 64, elements: !288)
!288 = !{!289, !290}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !287, file: !276, line: 39, baseType: !279, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !287, file: !276, line: 41, baseType: !291, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !276, line: 35, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !285}
!295 = !{!296, !300, !308, !265, !310, !320}
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "latency_lock", scope: !267, file: !298, line: 44, type: !299, isLocal: true, isDefinition: true)
!298 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, elements: !233)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !267, file: !298, line: 46, type: !302, isLocal: true, isDefinition: true)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !213, line: 40, baseType: !303)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !213, line: 35, size: 64, elements: !304)
!304 = !{!305, !307}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !303, file: !213, line: 36, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !303, file: !213, line: 37, baseType: !306, size: 32, offset: 32)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "latency_subs", scope: !267, file: !298, line: 52, type: !302, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !267, file: !298, line: 39, type: !312, isLocal: true, isDefinition: true)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !313, elements: !318)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !298, line: 35, size: 96, elements: !314)
!314 = !{!315, !316, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !313, file: !298, line: 36, baseType: !191, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !313, file: !298, line: 37, baseType: !243, size: 8, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !313, file: !298, line: 38, baseType: !260, size: 32, offset: 64)
!318 = !{!319}
!319 = !DISubrange(count: 0)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !267, file: !298, line: 48, type: !285, isLocal: true, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !324, file: !331, line: 47, type: !345, isLocal: true, isDefinition: true)
!324 = distinct !DICompileUnit(language: DW_LANG_C99, file: !325, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !326, retainedTypes: !327, globals: !328, splitDebugInlining: false, nameTableKind: None)
!325 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/s2ram")
!326 = !{!191}
!327 = !{!272, !103}
!328 = !{!329, !322, !341}
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "cpus_states", scope: !324, file: !331, line: 50, type: !332, isLocal: true, isDefinition: true)
!331 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 32, elements: !247)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !192, line: 114, size: 128, elements: !336)
!336 = !{!337, !338, !339, !340}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !335, file: !192, line: 115, baseType: !191, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !335, file: !192, line: 141, baseType: !243, size: 8, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !335, file: !192, line: 149, baseType: !119, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !335, file: !192, line: 156, baseType: !119, size: 32, offset: 96)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !324, file: !331, line: 55, type: !343, isLocal: true, isDefinition: true)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 8, elements: !247)
!344 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, elements: !318)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "_cpu_context", scope: !348, file: !353, line: 15, type: !354, isLocal: false, isDefinition: true)
!348 = distinct !DICompileUnit(language: DW_LANG_C99, file: !349, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !350, splitDebugInlining: false, nameTableKind: None)
!349 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/cortex_m/pm_s2ram.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/s2ram")
!350 = !{!346, !351}
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "marker", scope: !348, file: !353, line: 20, type: !119, isLocal: false, isDefinition: true)
!353 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/cortex_m/pm_s2ram.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "_cpu_context_t", file: !355, line: 69, baseType: !356)
!355 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/cortex_m/cpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__cpu_context", file: !355, line: 54, size: 352, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "msp", scope: !356, file: !355, line: 56, baseType: !119, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "msplim", scope: !356, file: !355, line: 57, baseType: !119, size: 32, offset: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !356, file: !355, line: 58, baseType: !119, size: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "psplim", scope: !356, file: !355, line: 59, baseType: !119, size: 32, offset: 96)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "apsr", scope: !356, file: !355, line: 60, baseType: !119, size: 32, offset: 128)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "ipsr", scope: !356, file: !355, line: 61, baseType: !119, size: 32, offset: 160)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "epsr", scope: !356, file: !355, line: 62, baseType: !119, size: 32, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "primask", scope: !356, file: !355, line: 63, baseType: !119, size: 32, offset: 224)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "faultmask", scope: !356, file: !355, line: 64, baseType: !119, size: 32, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !356, file: !355, line: 65, baseType: !119, size: 32, offset: 288)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !356, file: !355, line: 66, baseType: !119, size: 32, offset: 320)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "static_regions", scope: !371, file: !378, line: 62, type: !510, isLocal: true, isDefinition: true)
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !373, globals: !374, splitDebugInlining: false, nameTableKind: None)
!372 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/s2ram")
!373 = !{!272, !103, !119, !102}
!374 = !{!375, !369}
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !377, file: !378, line: 198, type: !497, isLocal: true, isDefinition: true)
!377 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !378, file: !378, line: 175, type: !379, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !371, retainedNodes: !494)
!378 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!379 = !DISubroutineType(types: !380)
!380 = !{null, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !383, line: 245, size: 1024, elements: !384)
!383 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!384 = !{!385, !450, !463, !464, !465, !466, !472, !489}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !382, file: !383, line: 247, baseType: !386, size: 384)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !383, line: 57, size: 384, elements: !387)
!387 = !{!388, !416, !424, !425, !426, !437, !438, !439}
!388 = !DIDerivedType(tag: DW_TAG_member, scope: !386, file: !383, line: 60, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !386, file: !383, line: 60, size: 64, elements: !390)
!390 = !{!391, !407}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !389, file: !383, line: 61, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !393, line: 49, baseType: !394)
!393 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !393, line: 37, size: 64, elements: !395)
!395 = !{!396, !402}
!396 = !DIDerivedType(tag: DW_TAG_member, scope: !394, file: !393, line: 38, baseType: !397, size: 32)
!397 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !394, file: !393, line: 38, size: 32, elements: !398)
!398 = !{!399, !401}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !397, file: !393, line: 39, baseType: !400, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !397, file: !393, line: 40, baseType: !400, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, scope: !394, file: !393, line: 42, baseType: !403, size: 32, offset: 32)
!403 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !394, file: !393, line: 42, size: 32, elements: !404)
!404 = !{!405, !406}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !403, file: !393, line: 43, baseType: !400, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !403, file: !393, line: 44, baseType: !400, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !389, file: !383, line: 62, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !409, line: 49, size: 64, elements: !410)
!409 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !408, file: !409, line: 50, baseType: !412, size: 64)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 64, elements: !414)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!414 = !{!415}
!415 = !DISubrange(count: 2)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !386, file: !383, line: 68, baseType: !417, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !419, line: 233, baseType: !420)
!419 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 231, size: 64, elements: !421)
!421 = !{!422}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !420, file: !419, line: 232, baseType: !423, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !393, line: 48, baseType: !394)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !386, file: !383, line: 71, baseType: !243, size: 8, offset: 96)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !386, file: !383, line: 74, baseType: !243, size: 8, offset: 104)
!426 = !DIDerivedType(tag: DW_TAG_member, scope: !386, file: !383, line: 90, baseType: !427, size: 16, offset: 112)
!427 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !386, file: !383, line: 90, size: 16, elements: !428)
!428 = !{!429, !436}
!429 = !DIDerivedType(tag: DW_TAG_member, scope: !427, file: !383, line: 91, baseType: !430, size: 16)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !427, file: !383, line: 91, size: 16, elements: !431)
!431 = !{!432, !435}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !430, file: !383, line: 96, baseType: !433, size: 8)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !434)
!434 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !430, file: !383, line: 97, baseType: !243, size: 8, offset: 8)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !427, file: !383, line: 100, baseType: !171, size: 16)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !386, file: !383, line: 107, baseType: !119, size: 32, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !386, file: !383, line: 127, baseType: !102, size: 32, offset: 160)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !386, file: !383, line: 131, baseType: !440, size: 192, offset: 192)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !419, line: 244, size: 192, elements: !441)
!441 = !{!442, !443, !449}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !440, file: !419, line: 245, baseType: !392, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !440, file: !419, line: 246, baseType: !444, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !419, line: 242, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !448}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !440, file: !419, line: 249, baseType: !205, size: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !382, file: !383, line: 250, baseType: !451, size: 288, offset: 384)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !452, line: 25, size: 288, elements: !453)
!452 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!453 = !{!454, !455, !456, !457, !458, !459, !460, !461, !462}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !451, file: !452, line: 26, baseType: !119, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !451, file: !452, line: 27, baseType: !119, size: 32, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !451, file: !452, line: 28, baseType: !119, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !451, file: !452, line: 29, baseType: !119, size: 32, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !451, file: !452, line: 30, baseType: !119, size: 32, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !451, file: !452, line: 31, baseType: !119, size: 32, offset: 160)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !451, file: !452, line: 32, baseType: !119, size: 32, offset: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !451, file: !452, line: 33, baseType: !119, size: 32, offset: 224)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !451, file: !452, line: 34, baseType: !119, size: 32, offset: 256)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !382, file: !383, line: 253, baseType: !102, size: 32, offset: 672)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !382, file: !383, line: 256, baseType: !418, size: 64, offset: 704)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !382, file: !383, line: 294, baseType: !103, size: 32, offset: 768)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !382, file: !383, line: 300, baseType: !467, size: 96, offset: 800)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !383, line: 149, size: 96, elements: !468)
!468 = !{!469, !470, !471}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !467, file: !383, line: 153, baseType: !22, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !467, file: !383, line: 162, baseType: !272, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !467, file: !383, line: 168, baseType: !272, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !382, file: !383, line: 325, baseType: !473, size: 32, offset: 896)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !475, line: 5073, size: 160, elements: !476)
!475 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!476 = !{!477, !486, !487}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !474, file: !475, line: 5074, baseType: !478, size: 96)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !479, line: 56, size: 96, elements: !480)
!479 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!480 = !{!481, !484, !485}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !478, file: !479, line: 57, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !479, line: 57, flags: DIFlagFwdDecl)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !478, file: !479, line: 58, baseType: !102, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !478, file: !479, line: 59, baseType: !272, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !474, file: !475, line: 5075, baseType: !418, size: 64, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !474, file: !475, line: 5076, baseType: !488, offset: 160)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, elements: !233)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !382, file: !383, line: 343, baseType: !490, size: 64, offset: 928)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !452, line: 60, size: 64, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !490, file: !452, line: 63, baseType: !119, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !490, file: !452, line: 66, baseType: !119, size: 32, offset: 32)
!494 = !{!495, !496}
!495 = !DILocalVariable(name: "thread", arg: 1, scope: !377, file: !378, line: 175, type: !381)
!496 = !DILocalVariable(name: "region_num", scope: !377, file: !378, line: 200, type: !243)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, elements: !318)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !499, line: 52, size: 96, elements: !500)
!499 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!500 = !{!501, !502, !503}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !498, file: !499, line: 53, baseType: !22, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !498, file: !499, line: 54, baseType: !272, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !498, file: !499, line: 55, baseType: !504, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !505, line: 304, baseType: !506)
!505 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !505, line: 301, size: 32, elements: !507)
!507 = !{!508, !509}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !506, file: !505, line: 302, baseType: !171, size: 16)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !506, file: !505, line: 303, baseType: !171, size: 16, offset: 16)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 96, elements: !247)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !514, file: !570, line: 39, type: !243, isLocal: true, isDefinition: true)
!514 = distinct !DICompileUnit(language: DW_LANG_C99, file: !515, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !516, globals: !561, splitDebugInlining: false, nameTableKind: None)
!515 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/s2ram")
!516 = !{!517, !102, !103, !545}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !519, line: 1495, baseType: !520)
!519 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !519, line: 1474, size: 448, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !535}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !520, file: !519, line: 1476, baseType: !133, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !520, file: !519, line: 1477, baseType: !134, size: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !520, file: !519, line: 1478, baseType: !134, size: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !520, file: !519, line: 1479, baseType: !134, size: 32, offset: 96)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !520, file: !519, line: 1480, baseType: !134, size: 32, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !520, file: !519, line: 1481, baseType: !134, size: 32, offset: 160)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !520, file: !519, line: 1482, baseType: !134, size: 32, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !520, file: !519, line: 1483, baseType: !134, size: 32, offset: 224)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !520, file: !519, line: 1484, baseType: !134, size: 32, offset: 256)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !520, file: !519, line: 1485, baseType: !134, size: 32, offset: 288)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !520, file: !519, line: 1486, baseType: !134, size: 32, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !520, file: !519, line: 1487, baseType: !534, size: 32, offset: 352)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32, elements: !247)
!535 = !DIDerivedType(tag: DW_TAG_member, scope: !520, file: !519, line: 1488, baseType: !536, size: 64, offset: 384)
!536 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !520, file: !519, line: 1488, size: 64, elements: !537)
!537 = !{!538, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !536, file: !519, line: 1489, baseType: !539, size: 64)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 64, elements: !414)
!540 = !DIDerivedType(tag: DW_TAG_member, scope: !536, file: !519, line: 1490, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !536, file: !519, line: 1490, size: 64, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !541, file: !519, line: 1491, baseType: !134, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !541, file: !519, line: 1492, baseType: !134, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !548, line: 27, size: 128, elements: !549)
!548 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!549 = !{!550, !551, !554}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !547, file: !548, line: 29, baseType: !119, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !547, file: !548, line: 31, baseType: !552, size: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !547, file: !548, line: 37, baseType: !555, size: 64, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !505, line: 298, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !505, line: 289, size: 64, elements: !557)
!557 = !{!558, !559, !560}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !556, file: !505, line: 291, baseType: !243, size: 5, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !556, file: !505, line: 293, baseType: !243, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !556, file: !505, line: 295, baseType: !119, size: 32, offset: 32)
!561 = !{!512, !562}
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !514, file: !564, line: 31, type: !565, isLocal: true, isDefinition: true)
!564 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 160, elements: !247)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !564, line: 21, size: 160, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !566, file: !564, line: 22, baseType: !103, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !566, file: !564, line: 23, baseType: !547, size: 128, offset: 32)
!570 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !573, file: !580, line: 21, type: !106, isLocal: true, isDefinition: true)
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !575, globals: !579, splitDebugInlining: false, nameTableKind: None)
!574 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/s2ram")
!575 = !{!576, !103, !102}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !578, line: 22, baseType: !103)
!578 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!579 = !{!571}
!580 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !583, file: !588, line: 13, type: !607, isLocal: true, isDefinition: true)
!583 = distinct !DICompileUnit(language: DW_LANG_C99, file: !584, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !585, splitDebugInlining: false, nameTableKind: None)
!584 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/s2ram")
!585 = !{!586, !581}
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "mpu_config", scope: !583, file: !588, line: 37, type: !589, isLocal: false, isDefinition: true)
!588 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !548, line: 41, size: 64, elements: !591)
!591 = !{!592, !593}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !590, file: !548, line: 43, baseType: !119, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !590, file: !548, line: 45, baseType: !594, size: 32, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !548, line: 27, size: 128, elements: !597)
!597 = !{!598, !599, !600}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !596, file: !548, line: 29, baseType: !119, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !596, file: !548, line: 31, baseType: !552, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !596, file: !548, line: 37, baseType: !601, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !505, line: 298, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !505, line: 289, size: 64, elements: !603)
!603 = !{!604, !605, !606}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !602, file: !505, line: 291, baseType: !243, size: 5, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !602, file: !505, line: 293, baseType: !243, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !602, file: !505, line: 295, baseType: !119, size: 32, offset: 32)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 256, elements: !414)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "__init_board_actinius_icarus_bee_init", scope: !610, file: !711, line: 39, type: !712, isLocal: true, isDefinition: true, align: 32)
!610 = distinct !DICompileUnit(language: DW_LANG_C99, file: !611, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !612, retainedTypes: !624, globals: !710, splitDebugInlining: false, nameTableKind: None)
!611 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/actinius_icarus_bee/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/s2ram")
!612 = !{!613, !619}
!613 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !614, line: 506, baseType: !32, size: 32, elements: !615)
!614 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!615 = !{!616, !617, !618}
!616 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!617 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!618 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!619 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !614, line: 512, baseType: !32, size: 32, elements: !620)
!620 = !{!621, !622, !623}
!621 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!622 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!623 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!624 = !{!625, !699, !704, !665, !619, !613, !709, !102}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !614, line: 523, size: 288, elements: !628)
!628 = !{!629, !655, !661, !666, !670, !671, !672, !676, !695}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !627, file: !614, line: 524, baseType: !630, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 32)
!631 = !DISubroutineType(types: !632)
!632 = !{!103, !633, !653, !654}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !636, line: 378, size: 192, elements: !637)
!636 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!637 = !{!638, !639, !640, !641, !648, !649}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !635, file: !636, line: 380, baseType: !552, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !635, file: !636, line: 382, baseType: !13, size: 32, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !635, file: !636, line: 384, baseType: !13, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !635, file: !636, line: 386, baseType: !642, size: 32, offset: 96)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 32)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !636, line: 351, size: 16, elements: !644)
!644 = !{!645, !646}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !643, file: !636, line: 359, baseType: !243, size: 8)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !643, file: !636, line: 364, baseType: !647, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!647 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !635, file: !636, line: 388, baseType: !102, size: 32, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !635, file: !636, line: 396, baseType: !650, size: 32, offset: 160)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !636, line: 43, baseType: !270)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !614, line: 237, baseType: !243)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !614, line: 257, baseType: !119)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !627, file: !614, line: 530, baseType: !656, size: 32, offset: 32)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 32)
!657 = !DISubroutineType(types: !658)
!658 = !{!103, !633, !659}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !614, line: 229, baseType: !119)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !627, file: !614, line: 532, baseType: !662, size: 32, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 32)
!663 = !DISubroutineType(types: !664)
!664 = !{!103, !633, !665, !660}
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !614, line: 216, baseType: !119)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !627, file: !614, line: 535, baseType: !667, size: 32, offset: 96)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!668 = !DISubroutineType(types: !669)
!669 = !{!103, !633, !665}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !627, file: !614, line: 537, baseType: !667, size: 32, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !627, file: !614, line: 539, baseType: !667, size: 32, offset: 160)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !627, file: !614, line: 541, baseType: !673, size: 32, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 32)
!674 = !DISubroutineType(types: !675)
!675 = !{!103, !633, !653, !613, !619}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !627, file: !614, line: 544, baseType: !677, size: 32, offset: 224)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 32)
!678 = !DISubroutineType(types: !679)
!679 = !{!103, !633, !680, !647}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !614, line: 478, size: 96, elements: !682)
!682 = !{!683, !689, !694}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !681, file: !614, line: 482, baseType: !684, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !213, line: 33, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !213, line: 29, size: 32, elements: !686)
!686 = !{!687}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !685, file: !213, line: 30, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !681, file: !614, line: 485, baseType: !690, size: 32, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !614, line: 464, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !633, !680, !665}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !681, file: !614, line: 493, baseType: !665, size: 32, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !627, file: !614, line: 547, baseType: !696, size: 32, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = !DISubroutineType(types: !698)
!698 = !{!119, !633}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !614, line: 428, size: 32, elements: !702)
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !701, file: !614, line: 434, baseType: !665, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !614, line: 441, size: 32, elements: !707)
!707 = !{!708}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !706, file: !614, line: 447, baseType: !665, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!710 = !{!608}
!711 = !DIFile(filename: "zephyr/boards/arm/actinius_icarus_bee/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !714)
!714 = !{!715, !719}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !713, file: !176, line: 60, baseType: !716, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!717 = !DISubroutineType(types: !718)
!718 = !{!103, !633}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !713, file: !176, line: 65, baseType: !633, size: 32, offset: 32)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "__device_dts_ord_48", scope: !722, file: !926, line: 733, type: !1029, isLocal: false, isDefinition: true, align: 32)
!722 = distinct !DICompileUnit(language: DW_LANG_C99, file: !723, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !724, retainedTypes: !842, globals: !922, splitDebugInlining: false, nameTableKind: None)
!723 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/s2ram")
!724 = !{!725, !731, !30, !736, !741, !745, !749, !753, !759, !763, !807, !814, !833}
!725 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !726, line: 23, baseType: !32, size: 32, elements: !727)
!726 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!727 = !{!728, !729, !730}
!728 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!729 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!730 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !726, line: 48, baseType: !32, size: 32, elements: !732)
!732 = !{!733, !734, !735}
!733 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!734 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!735 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!736 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !737, line: 167, baseType: !32, size: 32, elements: !738)
!737 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!738 = !{!739, !740}
!739 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!740 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!741 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !737, line: 107, baseType: !32, size: 32, elements: !742)
!742 = !{!743, !744}
!743 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!744 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!745 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !737, line: 208, baseType: !32, size: 32, elements: !746)
!746 = !{!747, !748}
!747 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!748 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!749 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !737, line: 261, baseType: !32, size: 32, elements: !750)
!750 = !{!751, !752}
!751 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!752 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!753 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !737, line: 237, baseType: !32, size: 32, elements: !754)
!754 = !{!755, !756, !757, !758}
!755 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!756 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!757 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!758 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!759 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !737, line: 152, baseType: !32, size: 32, elements: !760)
!760 = !{!761, !762}
!761 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!762 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!763 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 71, baseType: !103, size: 32, elements: !764)
!764 = !{!765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806}
!765 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!766 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!767 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!768 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!769 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!770 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!771 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!772 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!773 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!774 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!775 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!776 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!777 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!778 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!779 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!780 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!781 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!782 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!783 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!784 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!785 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!786 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!787 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!788 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!789 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!790 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!791 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!792 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!793 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!794 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!795 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!796 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!797 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!798 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!799 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!800 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!801 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!802 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!803 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!804 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!805 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!806 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!807 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !808, line: 44, baseType: !32, size: 32, elements: !809)
!808 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!809 = !{!810, !811, !812, !813}
!810 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!811 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!812 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!813 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!814 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !815, line: 54, baseType: !32, size: 32, elements: !816)
!815 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!816 = !{!817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832}
!817 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!818 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!819 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!820 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!821 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!822 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!823 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!824 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!825 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!826 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!827 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!828 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!829 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!830 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!831 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!832 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!833 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !834, line: 53, baseType: !32, size: 32, elements: !835)
!834 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!835 = !{!836, !837, !838, !839, !840, !841}
!836 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!837 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!838 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!839 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!840 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!841 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!842 = !{!725, !102, !103, !843, !885, !886, !887, !888, !203, !119, !225, !647, !889, !890, !285, !891, !921, !272}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !128, line: 923, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 883, size: 10464, elements: !846)
!846 = !{!847, !848, !849, !850, !851, !855, !856, !857, !858, !859, !860, !861, !862, !866, !867, !868, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !845, file: !128, line: 884, baseType: !134, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !845, file: !128, line: 885, baseType: !134, size: 32, offset: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !845, file: !128, line: 886, baseType: !134, size: 32, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !845, file: !128, line: 887, baseType: !134, size: 32, offset: 96)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !845, file: !128, line: 888, baseType: !852, size: 896, offset: 128)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 896, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 28)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !845, file: !128, line: 889, baseType: !134, size: 32, offset: 1024)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !845, file: !128, line: 890, baseType: !134, size: 32, offset: 1056)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !845, file: !128, line: 891, baseType: !134, size: 32, offset: 1088)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !845, file: !128, line: 892, baseType: !134, size: 32, offset: 1120)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !845, file: !128, line: 893, baseType: !852, size: 896, offset: 1152)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !845, file: !128, line: 894, baseType: !134, size: 32, offset: 2048)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !845, file: !128, line: 895, baseType: !134, size: 32, offset: 2080)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !845, file: !128, line: 896, baseType: !863, size: 960, offset: 2112)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 960, elements: !864)
!864 = !{!865}
!865 = !DISubrange(count: 30)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !845, file: !128, line: 897, baseType: !134, size: 32, offset: 3072)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !845, file: !128, line: 898, baseType: !134, size: 32, offset: 3104)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !845, file: !128, line: 899, baseType: !869, size: 3008, offset: 3136)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 3008, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 94)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !845, file: !128, line: 900, baseType: !134, size: 32, offset: 6144)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !845, file: !128, line: 901, baseType: !134, size: 32, offset: 6176)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !845, file: !128, line: 902, baseType: !134, size: 32, offset: 6208)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !845, file: !128, line: 903, baseType: !133, size: 32, offset: 6240)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !845, file: !128, line: 904, baseType: !141, size: 1984, offset: 6272)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !845, file: !128, line: 905, baseType: !133, size: 32, offset: 8256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !845, file: !128, line: 907, baseType: !133, size: 32, offset: 8288)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !845, file: !128, line: 910, baseType: !133, size: 32, offset: 8320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !845, file: !128, line: 911, baseType: !133, size: 32, offset: 8352)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !845, file: !128, line: 913, baseType: !133, size: 32, offset: 8384)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !845, file: !128, line: 917, baseType: !133, size: 32, offset: 8416)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !845, file: !128, line: 919, baseType: !141, size: 1984, offset: 8448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !845, file: !128, line: 920, baseType: !134, size: 32, offset: 10432)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !737, line: 146, baseType: !741)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !737, line: 164, baseType: !759)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !519, line: 485, baseType: !893)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !519, line: 468, size: 28704, elements: !894)
!894 = !{!895, !899, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !916, !920}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !893, file: !519, line: 470, baseType: !896, size: 512)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 512, elements: !897)
!897 = !{!898}
!898 = !DISubrange(count: 16)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !893, file: !519, line: 471, baseType: !900, size: 512, offset: 512)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 512, elements: !897)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !893, file: !519, line: 472, baseType: !896, size: 512, offset: 1024)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !893, file: !519, line: 473, baseType: !900, size: 512, offset: 1536)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !893, file: !519, line: 474, baseType: !896, size: 512, offset: 2048)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !893, file: !519, line: 475, baseType: !900, size: 512, offset: 2560)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !893, file: !519, line: 476, baseType: !896, size: 512, offset: 3072)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !893, file: !519, line: 477, baseType: !900, size: 512, offset: 3584)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !893, file: !519, line: 478, baseType: !896, size: 512, offset: 4096)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !893, file: !519, line: 479, baseType: !900, size: 512, offset: 4608)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !893, file: !519, line: 480, baseType: !896, size: 512, offset: 5120)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !893, file: !519, line: 481, baseType: !900, size: 512, offset: 5632)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !893, file: !519, line: 482, baseType: !912, size: 3968, offset: 6144)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 3968, elements: !914)
!913 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !243)
!914 = !{!915}
!915 = !DISubrange(count: 496)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !893, file: !519, line: 483, baseType: !917, size: 18560, offset: 10112)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 18560, elements: !918)
!918 = !{!919}
!919 = !DISubrange(count: 580)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !893, file: !519, line: 484, baseType: !134, size: 32, offset: 28672)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !808, line: 56, baseType: !102)
!922 = !{!923, !973, !1014, !720, !1019, !1044, !1046, !1063, !1065, !1075, !1078, !1093, !1131, !1145}
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "on", scope: !925, file: !926, line: 549, type: !260, isLocal: true, isDefinition: true)
!925 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !926, file: !926, line: 547, type: !927, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !722, retainedNodes: !929)
!926 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!927 = !DISubroutineType(types: !928)
!928 = !{null, !731}
!929 = !{!930, !931, !934}
!930 = !DILocalVariable(name: "start_mode", arg: 1, scope: !925, file: !926, line: 547, type: !731)
!931 = !DILocalVariable(name: "err", scope: !932, file: !926, line: 553, type: !103)
!932 = distinct !DILexicalBlock(scope: !933, file: !926, line: 552, column: 31)
!933 = distinct !DILexicalBlock(scope: !925, file: !926, line: 552, column: 6)
!934 = !DILocalVariable(name: "mgr", scope: !932, file: !926, line: 554, type: !935)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !937, line: 154, size: 224, elements: !938)
!937 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!938 = !{!939, !951, !952, !968, !970, !971, !972}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !936, file: !937, line: 158, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !213, line: 40, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !213, line: 35, size: 64, elements: !942)
!942 = !{!943, !950}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !941, file: !213, line: 36, baseType: !944, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !213, line: 33, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !213, line: 29, size: 32, elements: !947)
!947 = !{!948}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !946, file: !213, line: 30, baseType: !949, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !941, file: !213, line: 37, baseType: !944, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !936, file: !937, line: 163, baseType: !940, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !936, file: !937, line: 166, baseType: !953, size: 32, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !937, line: 133, size: 96, elements: !956)
!956 = !{!957, !966, !967}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !955, file: !937, line: 135, baseType: !958, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !937, line: 129, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!960 = !DISubroutineType(types: !961)
!961 = !{null, !935, !962}
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !937, line: 101, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 32)
!964 = !DISubroutineType(types: !965)
!965 = !{null, !935, !103}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !955, file: !937, line: 138, baseType: !958, size: 32, offset: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !955, file: !937, line: 143, baseType: !958, size: 32, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !936, file: !937, line: 169, baseType: !969, offset: 160)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !232, line: 43, elements: !233)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !936, file: !937, line: 172, baseType: !103, size: 32, offset: 160)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !936, file: !937, line: 175, baseType: !171, size: 16, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !936, file: !937, line: 178, baseType: !171, size: 16, offset: 208)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(name: "cli", scope: !925, file: !926, line: 550, type: !975, isLocal: true, isDefinition: true)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !937, line: 273, size: 128, elements: !976)
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !975, file: !937, line: 280, baseType: !945, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !975, file: !937, line: 283, baseType: !979, size: 96, offset: 32)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !980, line: 138, size: 96, elements: !981)
!980 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!981 = !{!982, !1011, !1012}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !979, file: !980, line: 149, baseType: !983, size: 32)
!983 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !980, line: 139, size: 32, elements: !984)
!984 = !{!985, !1006}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !983, file: !980, line: 145, baseType: !986, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !475, line: 5397, size: 128, elements: !988)
!988 = !{!989, !1004, !1005}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !987, file: !475, line: 5399, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !393, line: 48, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !393, line: 37, size: 64, elements: !992)
!992 = !{!993, !999}
!993 = !DIDerivedType(tag: DW_TAG_member, scope: !991, file: !393, line: 38, baseType: !994, size: 32)
!994 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !991, file: !393, line: 38, size: 32, elements: !995)
!995 = !{!996, !998}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !994, file: !393, line: 39, baseType: !997, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !994, file: !393, line: 40, baseType: !997, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, scope: !991, file: !393, line: 42, baseType: !1000, size: 32, offset: 32)
!1000 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !991, file: !393, line: 42, size: 32, elements: !1001)
!1001 = !{!1002, !1003}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1000, file: !393, line: 43, baseType: !997, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1000, file: !393, line: 44, baseType: !997, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !987, file: !475, line: 5405, baseType: !32, size: 32, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !987, file: !475, line: 5408, baseType: !103, size: 32, offset: 96)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !983, file: !980, line: 148, baseType: !1007, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !980, line: 98, baseType: !1008)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 32)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{null, null}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !979, file: !980, line: 165, baseType: !134, size: 32, offset: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !979, file: !980, line: 174, baseType: !1013, size: 32, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_48", scope: !722, file: !926, line: 733, type: !1016, isLocal: false, isDefinition: true, align: 16)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 80, elements: !1017)
!1017 = !{!1018}
!1018 = !DISubrange(count: 5)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_48", scope: !722, file: !926, line: 733, type: !1021, isLocal: true, isDefinition: true, align: 32)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !1023)
!1023 = !{!1024, !1043}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1022, file: !176, line: 60, baseType: !1025, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 32)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!103, !1028}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !636, line: 378, size: 192, elements: !1031)
!1031 = !{!1032, !1033, !1034, !1035, !1041, !1042}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1030, file: !636, line: 380, baseType: !552, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1030, file: !636, line: 382, baseType: !13, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1030, file: !636, line: 384, baseType: !13, size: 32, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1030, file: !636, line: 386, baseType: !1036, size: 32, offset: 96)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 32)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !636, line: 351, size: 16, elements: !1038)
!1038 = !{!1039, !1040}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1037, file: !636, line: 359, baseType: !243, size: 8)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1037, file: !636, line: 364, baseType: !647, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1030, file: !636, line: 388, baseType: !102, size: 32, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1030, file: !636, line: 396, baseType: !650, size: 32, offset: 160)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1022, file: !176, line: 65, baseType: !1028, size: 32, offset: 32)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !722, file: !926, line: 79, type: !260, isLocal: true, isDefinition: true)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(name: "data", scope: !722, file: !926, line: 702, type: !1048, isLocal: true, isDefinition: true)
