; ModuleID = 'build/96b_neonkey/tmp108/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_spinlock }
%struct.k_spinlock = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.k_spinlock }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %struct.k_spinlock, i32*, i32, %struct.sensor_trigger }
%struct.sensor_trigger = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/tmp108/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/tmp108")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 98, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/tmp108")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5504, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 86)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2752, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/tmp108")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !111, file: !129, line: 56, type: !130, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !128, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/tmp108")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !116, line: 259, baseType: !117)
!116 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f411xe.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 250, size: 224, elements: !118)
!118 = !{!119, !122, !123, !124, !125, !126, !127}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !117, file: !116, line: 252, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !117, file: !116, line: 253, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !117, file: !116, line: 254, baseType: !120, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !117, file: !116, line: 255, baseType: !120, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !117, file: !116, line: 256, baseType: !120, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !117, file: !116, line: 257, baseType: !120, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !117, file: !116, line: 258, baseType: !120, size: 32, offset: 192)
!128 = !{!109}
!129 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !165}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !131, file: !132, line: 60, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DISubroutineType(types: !137)
!137 = !{!103, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !{!143, !147, !148, !149, !158, !159}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !141, line: 380, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !140, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !140, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !140, file: !141, line: 386, baseType: !150, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !152)
!152 = !{!153, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !151, file: !141, line: 359, baseType: !154, size: 8)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !155)
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !151, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!157 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !140, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !141, line: 43, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !164)
!164 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !131, file: !132, line: 65, baseType: !138, size: 32, offset: 32)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !168, file: !171, line: 71, type: !172, isLocal: true, isDefinition: true, align: 32)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !170, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/tmp108")
!170 = !{!166}
!171 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !174)
!174 = !{!175, !194}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !173, file: !132, line: 60, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DISubroutineType(types: !178)
!178 = !{!103, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !182)
!182 = !{!183, !184, !185, !186, !192, !193}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !141, line: 380, baseType: !144, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !181, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !181, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !181, file: !141, line: 386, baseType: !187, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !188, file: !141, line: 359, baseType: !154, size: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !188, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !181, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !173, file: !132, line: 65, baseType: !179, size: 32, offset: 32)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "static_regions", scope: !197, file: !206, line: 62, type: !348, isLocal: true, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !199, globals: !202, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/tmp108")
!199 = !{!200, !103, !121, !102}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !201, line: 214, baseType: !32)
!201 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!202 = !{!203, !195}
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !205, file: !206, line: 198, type: !334, isLocal: true, isDefinition: true)
!205 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !206, file: !206, line: 175, type: !207, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !197, retainedNodes: !329)
!206 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!207 = !DISubroutineType(types: !208)
!208 = !{null, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !211, line: 245, size: 1024, elements: !212)
!211 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !{!213, !282, !295, !296, !297, !298, !304, !324}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !210, file: !211, line: 247, baseType: !214, size: 384)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !211, line: 57, size: 384, elements: !215)
!215 = !{!216, !244, !252, !253, !254, !267, !268, !269}
!216 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 60, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 60, size: 64, elements: !218)
!218 = !{!219, !235}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !217, file: !211, line: 61, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !221, line: 49, baseType: !222)
!221 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !221, line: 37, size: 64, elements: !223)
!223 = !{!224, !230}
!224 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 38, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 38, size: 32, elements: !226)
!226 = !{!227, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !225, file: !221, line: 39, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !221, line: 40, baseType: !228, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 42, baseType: !231, size: 32, offset: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 42, size: 32, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !231, file: !221, line: 43, baseType: !228, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !231, file: !221, line: 44, baseType: !228, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !217, file: !211, line: 62, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !237, line: 49, size: 64, elements: !238)
!237 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !236, file: !237, line: 50, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 64, elements: !242)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!242 = !{!243}
!243 = !DISubrange(count: 2)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !214, file: !211, line: 68, baseType: !245, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !247, line: 233, baseType: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 231, size: 64, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !248, file: !247, line: 232, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !221, line: 48, baseType: !222)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !214, file: !211, line: 71, baseType: !154, size: 8, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !214, file: !211, line: 74, baseType: !154, size: 8, offset: 104)
!254 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 90, baseType: !255, size: 16, offset: 112)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 90, size: 16, elements: !256)
!256 = !{!257, !264}
!257 = !DIDerivedType(tag: DW_TAG_member, scope: !255, file: !211, line: 91, baseType: !258, size: 16)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !255, file: !211, line: 91, size: 16, elements: !259)
!259 = !{!260, !263}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !258, file: !211, line: 96, baseType: !261, size: 8)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !262)
!262 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !258, file: !211, line: 97, baseType: !154, size: 8, offset: 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !255, file: !211, line: 100, baseType: !265, size: 16)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !266)
!266 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !214, file: !211, line: 107, baseType: !121, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !214, file: !211, line: 127, baseType: !102, size: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !214, file: !211, line: 131, baseType: !270, size: 192, offset: 192)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !247, line: 244, size: 192, elements: !271)
!271 = !{!272, !273, !279}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !270, file: !247, line: 245, baseType: !220, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !270, file: !247, line: 246, baseType: !274, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !247, line: 242, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !278}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !270, file: !247, line: 249, baseType: !280, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !281)
!281 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !210, file: !211, line: 250, baseType: !283, size: 288, offset: 384)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !284, line: 25, size: 288, elements: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !283, file: !284, line: 26, baseType: !121, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !283, file: !284, line: 27, baseType: !121, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !283, file: !284, line: 28, baseType: !121, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !283, file: !284, line: 29, baseType: !121, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !283, file: !284, line: 30, baseType: !121, size: 32, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !283, file: !284, line: 31, baseType: !121, size: 32, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !283, file: !284, line: 32, baseType: !121, size: 32, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !283, file: !284, line: 33, baseType: !121, size: 32, offset: 224)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !283, file: !284, line: 34, baseType: !121, size: 32, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !210, file: !211, line: 253, baseType: !102, size: 32, offset: 672)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !210, file: !211, line: 256, baseType: !246, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !210, file: !211, line: 294, baseType: !103, size: 32, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !210, file: !211, line: 300, baseType: !299, size: 96, offset: 800)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !211, line: 149, size: 96, elements: !300)
!300 = !{!301, !302, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !299, file: !211, line: 153, baseType: !22, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !299, file: !211, line: 162, baseType: !200, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !299, file: !211, line: 168, baseType: !200, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !210, file: !211, line: 325, baseType: !305, size: 32, offset: 896)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !307, line: 5073, size: 192, elements: !308)
!307 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = !{!309, !318, !319}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !306, file: !307, line: 5074, baseType: !310, size: 96)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !311, line: 56, size: 96, elements: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = !{!313, !316, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !310, file: !311, line: 57, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !311, line: 57, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !310, file: !311, line: 58, baseType: !102, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !310, file: !311, line: 59, baseType: !200, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !306, file: !307, line: 5075, baseType: !246, size: 64, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !306, file: !307, line: 5076, baseType: !320, size: 32, offset: 160)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !321, line: 43, size: 32, elements: !322)
!321 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = !{!323}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !320, file: !321, line: 52, baseType: !22, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !210, file: !211, line: 343, baseType: !325, size: 64, offset: 928)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !284, line: 60, size: 64, elements: !326)
!326 = !{!327, !328}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !325, file: !284, line: 63, baseType: !121, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !325, file: !284, line: 66, baseType: !121, size: 32, offset: 32)
!329 = !{!330, !331, !332, !333}
!330 = !DILocalVariable(name: "thread", arg: 1, scope: !205, file: !206, line: 175, type: !209)
!331 = !DILocalVariable(name: "region_num", scope: !205, file: !206, line: 200, type: !154)
!332 = !DILocalVariable(name: "guard_start", scope: !205, file: !206, line: 265, type: !22)
!333 = !DILocalVariable(name: "guard_size", scope: !205, file: !206, line: 266, type: !200)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 96, elements: !346)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !336, line: 52, size: 96, elements: !337)
!336 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!337 = !{!338, !339, !340}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !335, file: !336, line: 53, baseType: !22, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !335, file: !336, line: 54, baseType: !200, size: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !335, file: !336, line: 55, baseType: !341, size: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !342, line: 151, baseType: !343)
!342 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !342, line: 149, size: 32, elements: !344)
!344 = !{!345}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !343, file: !342, line: 150, baseType: !121, size: 32)
!346 = !{!347}
!347 = !DISubrange(count: 1)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !349, size: 96, elements: !346)
!349 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !335)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !352, file: !385, line: 39, type: !154, isLocal: true, isDefinition: true)
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !354, globals: !384, splitDebugInlining: false, nameTableKind: None)
!353 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/tmp108")
!354 = !{!355, !102, !103, !372, !154}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !357, line: 1226, baseType: !358)
!357 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !357, line: 1213, size: 352, elements: !359)
!359 = !{!360, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !358, file: !357, line: 1215, baseType: !361, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !358, file: !357, line: 1216, baseType: !120, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !358, file: !357, line: 1217, baseType: !120, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !358, file: !357, line: 1218, baseType: !120, size: 32, offset: 96)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !358, file: !357, line: 1219, baseType: !120, size: 32, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !358, file: !357, line: 1220, baseType: !120, size: 32, offset: 160)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !358, file: !357, line: 1221, baseType: !120, size: 32, offset: 192)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !358, file: !357, line: 1222, baseType: !120, size: 32, offset: 224)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !358, file: !357, line: 1223, baseType: !120, size: 32, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !358, file: !357, line: 1224, baseType: !120, size: 32, offset: 288)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !358, file: !357, line: 1225, baseType: !120, size: 32, offset: 320)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !374)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !375, line: 27, size: 96, elements: !376)
!375 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!376 = !{!377, !378, !379}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !374, file: !375, line: 29, baseType: !121, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !374, file: !375, line: 31, baseType: !144, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !374, file: !375, line: 37, baseType: !380, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !342, line: 146, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !342, line: 141, size: 32, elements: !382)
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !381, file: !342, line: 143, baseType: !121, size: 32)
!384 = !{!350}
!385 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !388, file: !395, line: 21, type: !106, isLocal: true, isDefinition: true)
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !390, globals: !394, splitDebugInlining: false, nameTableKind: None)
!389 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/tmp108")
!390 = !{!391, !103, !102}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !393, line: 22, baseType: !103)
!393 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!394 = !{!386}
!395 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !398, file: !403, line: 13, type: !420, isLocal: true, isDefinition: true)
!398 = distinct !DICompileUnit(language: DW_LANG_C99, file: !399, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !400, splitDebugInlining: false, nameTableKind: None)
!399 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/tmp108")
!400 = !{!401, !396}
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "mpu_config", scope: !398, file: !403, line: 37, type: !404, isLocal: false, isDefinition: true)
!403 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !375, line: 41, size: 64, elements: !406)
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !405, file: !375, line: 43, baseType: !121, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !405, file: !375, line: 45, baseType: !409, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !375, line: 27, size: 96, elements: !412)
!412 = !{!413, !414, !415}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !411, file: !375, line: 29, baseType: !121, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !411, file: !375, line: 31, baseType: !144, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !411, file: !375, line: 37, baseType: !416, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !342, line: 146, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !342, line: 141, size: 32, elements: !418)
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !417, file: !342, line: 143, baseType: !121, size: 32)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 192, elements: !242)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !423, file: !507, line: 72, type: !591, isLocal: true, isDefinition: true)
!423 = distinct !DICompileUnit(language: DW_LANG_C99, file: !424, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !425, retainedTypes: !493, globals: !504, splitDebugInlining: false, nameTableKind: None)
!424 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/tmp108")
!425 = !{!30, !426}
!426 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 65, baseType: !103, size: 32, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492}
!428 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!429 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!430 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!431 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!432 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!433 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!434 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!435 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!436 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!437 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!438 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!439 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!440 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!441 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!442 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!443 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!444 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!445 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!446 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!447 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!448 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!449 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!450 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!451 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!452 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!453 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!454 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!455 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!456 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!457 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!458 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!459 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!460 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!461 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!462 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!463 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!464 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!465 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!466 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!467 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!468 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!469 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!470 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!471 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!472 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!473 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!474 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!475 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!476 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!477 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!478 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!479 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!480 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!481 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!482 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!483 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!484 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!485 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!486 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!487 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!488 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!489 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!490 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!491 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!492 = !DIEnumerator(name: "SPI5_IRQn", value: 85)
!493 = !{!200, !103, !102, !494}
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !116, line: 244, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 236, size: 192, elements: !497)
!497 = !{!498, !499, !500, !501, !502, !503}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !496, file: !116, line: 238, baseType: !120, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !496, file: !116, line: 239, baseType: !120, size: 32, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !496, file: !116, line: 240, baseType: !120, size: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !496, file: !116, line: 241, baseType: !120, size: 32, offset: 96)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !496, file: !116, line: 242, baseType: !120, size: 32, offset: 128)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !496, file: !116, line: 243, baseType: !120, size: 32, offset: 160)
!504 = !{!505, !511, !527, !538, !555, !421, !557, !571, !573, !575, !577, !579, !581, !583, !585, !587, !589}
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !423, file: !507, line: 424, type: !508, isLocal: false, isDefinition: true, align: 16)
!507 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 4)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "__device_dts_ord_39", scope: !423, file: !507, line: 424, type: !513, isLocal: false, isDefinition: true, align: 32)
!513 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !515)
!515 = !{!516, !517, !518, !519, !525, !526}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !514, file: !141, line: 380, baseType: !144, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !514, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !514, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !514, file: !141, line: 386, baseType: !520, size: 32, offset: 96)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 32)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !522)
!522 = !{!523, !524}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !521, file: !141, line: 359, baseType: !154, size: 8)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !521, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !514, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !514, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_39", scope: !423, file: !507, line: 424, type: !529, isLocal: true, isDefinition: true, align: 32)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !531)
!531 = !{!532, !537}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !530, file: !132, line: 60, baseType: !533, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 32)
!534 = !DISubroutineType(types: !535)
!535 = !{!103, !536}
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !530, file: !132, line: 65, baseType: !536, size: 32, offset: 32)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "exti_data", scope: !423, file: !507, line: 423, type: !540, isLocal: true, isDefinition: true)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !507, line: 107, size: 1472, elements: !541)
!541 = !{!542}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !540, file: !507, line: 109, baseType: !543, size: 1472)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 1472, elements: !553)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !507, line: 101, size: 64, elements: !545)
!545 = !{!546, !552}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !544, file: !507, line: 102, baseType: !547, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !548, line: 63, baseType: !549)
!548 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 32)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !103, !102}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !544, file: !507, line: 103, baseType: !102, size: 32, offset: 32)
!553 = !{!554}
!554 = !DISubrange(count: 23)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_39", scope: !423, file: !507, line: 424, type: !521, isLocal: true, isDefinition: true, align: 8)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !559, file: !507, line: 493, type: !564, isLocal: true, isDefinition: true, align: 32)
!559 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !507, file: !507, line: 460, type: !560, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !423, retainedNodes: !562)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !536}
!562 = !{!563}
!563 = !DILocalVariable(name: "dev", arg: 1, scope: !559, file: !507, line: 460, type: !536)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !565)
!565 = !{!566, !568, !569, !570}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !564, file: !10, line: 55, baseType: !567, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !564, file: !10, line: 57, baseType: !567, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !564, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !564, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !559, file: !507, line: 497, type: !564, isLocal: true, isDefinition: true, align: 32)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !559, file: !507, line: 507, type: !564, isLocal: true, isDefinition: true, align: 32)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !559, file: !507, line: 512, type: !564, isLocal: true, isDefinition: true, align: 32)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !559, file: !507, line: 516, type: !564, isLocal: true, isDefinition: true, align: 32)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !559, file: !507, line: 523, type: !564, isLocal: true, isDefinition: true, align: 32)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !559, file: !507, line: 527, type: !564, isLocal: true, isDefinition: true, align: 32)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !559, file: !507, line: 581, type: !564, isLocal: true, isDefinition: true, align: 32)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !559, file: !507, line: 586, type: !564, isLocal: true, isDefinition: true, align: 32)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !559, file: !507, line: 591, type: !564, isLocal: true, isDefinition: true, align: 32)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !559, file: !507, line: 595, type: !564, isLocal: true, isDefinition: true, align: 32)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 736, elements: !553)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !116, line: 134, baseType: !426)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !596, file: !601, line: 25, type: !629, isLocal: false, isDefinition: true, align: 16)
!596 = distinct !DICompileUnit(language: DW_LANG_C99, file: !597, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !598, splitDebugInlining: false, nameTableKind: None)
!597 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/tmp108/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/tmp108")
!598 = !{!599, !594, !605, !607, !609, !611, !613, !615, !617, !619, !621, !623, !625, !627}
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !596, file: !601, line: 20, type: !602, isLocal: false, isDefinition: true, align: 16)
!601 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/tmp108")
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 240, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 15)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_73", scope: !596, file: !601, line: 32, type: !508, isLocal: false, isDefinition: true, align: 16)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_72", scope: !596, file: !601, line: 39, type: !508, isLocal: false, isDefinition: true, align: 16)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_71", scope: !596, file: !601, line: 46, type: !508, isLocal: false, isDefinition: true, align: 16)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_70", scope: !596, file: !601, line: 53, type: !508, isLocal: false, isDefinition: true, align: 16)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_69", scope: !596, file: !601, line: 60, type: !508, isLocal: false, isDefinition: true, align: 16)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_68", scope: !596, file: !601, line: 67, type: !508, isLocal: false, isDefinition: true, align: 16)
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !596, file: !601, line: 74, type: !508, isLocal: false, isDefinition: true, align: 16)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_67", scope: !596, file: !601, line: 81, type: !508, isLocal: false, isDefinition: true, align: 16)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_45", scope: !596, file: !601, line: 88, type: !508, isLocal: false, isDefinition: true, align: 16)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_65", scope: !596, file: !601, line: 95, type: !508, isLocal: false, isDefinition: true, align: 16)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_31", scope: !596, file: !601, line: 102, type: !508, isLocal: false, isDefinition: true, align: 16)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_28", scope: !596, file: !601, line: 109, type: !508, isLocal: false, isDefinition: true, align: 16)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 48, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 3)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !634, file: !698, line: 398, type: !731, isLocal: true, isDefinition: true)
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !635, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !636, retainedTypes: !649, globals: !695, splitDebugInlining: false, nameTableKind: None)
!635 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/tmp108")
!636 = !{!637, !30, !642}
!637 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !638, line: 197, baseType: !32, size: 32, elements: !639)
!638 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!639 = !{!640, !641}
!640 = !DIEnumerator(name: "SUCCESS", value: 0)
!641 = !DIEnumerator(name: "ERROR", value: 1)
!642 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !643, line: 44, baseType: !32, size: 32, elements: !644)
!643 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!644 = !{!645, !646, !647, !648}
!645 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!646 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!647 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!648 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!649 = !{!102, !103, !121, !650, !688, !694}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 370, baseType: !652)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 336, size: 1152, elements: !653)
!653 = !{!654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !687}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !652, file: !116, line: 338, baseType: !120, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !652, file: !116, line: 339, baseType: !120, size: 32, offset: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !652, file: !116, line: 340, baseType: !120, size: 32, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !652, file: !116, line: 341, baseType: !120, size: 32, offset: 96)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !652, file: !116, line: 342, baseType: !120, size: 32, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !652, file: !116, line: 343, baseType: !120, size: 32, offset: 160)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !652, file: !116, line: 344, baseType: !120, size: 32, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !652, file: !116, line: 345, baseType: !121, size: 32, offset: 224)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !652, file: !116, line: 346, baseType: !120, size: 32, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !652, file: !116, line: 347, baseType: !120, size: 32, offset: 288)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !652, file: !116, line: 348, baseType: !665, size: 64, offset: 320)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, elements: !242)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !652, file: !116, line: 349, baseType: !120, size: 32, offset: 384)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !652, file: !116, line: 350, baseType: !120, size: 32, offset: 416)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !652, file: !116, line: 351, baseType: !120, size: 32, offset: 448)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !652, file: !116, line: 352, baseType: !121, size: 32, offset: 480)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !652, file: !116, line: 353, baseType: !120, size: 32, offset: 512)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !652, file: !116, line: 354, baseType: !120, size: 32, offset: 544)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !652, file: !116, line: 355, baseType: !665, size: 64, offset: 576)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !652, file: !116, line: 356, baseType: !120, size: 32, offset: 640)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !652, file: !116, line: 357, baseType: !120, size: 32, offset: 672)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !652, file: !116, line: 358, baseType: !120, size: 32, offset: 704)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !652, file: !116, line: 359, baseType: !121, size: 32, offset: 736)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !652, file: !116, line: 360, baseType: !120, size: 32, offset: 768)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !652, file: !116, line: 361, baseType: !120, size: 32, offset: 800)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !652, file: !116, line: 362, baseType: !665, size: 64, offset: 832)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !652, file: !116, line: 363, baseType: !120, size: 32, offset: 896)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !652, file: !116, line: 364, baseType: !120, size: 32, offset: 928)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !652, file: !116, line: 365, baseType: !665, size: 64, offset: 960)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !652, file: !116, line: 366, baseType: !120, size: 32, offset: 1024)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !652, file: !116, line: 367, baseType: !120, size: 32, offset: 1056)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !652, file: !116, line: 368, baseType: !686, size: 32, offset: 1088)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 32, elements: !346)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !652, file: !116, line: 369, baseType: !120, size: 32, offset: 1120)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 32)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !690, line: 343, size: 64, elements: !691)
!690 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!691 = !{!692, !693}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !689, file: !690, line: 344, baseType: !121, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !689, file: !690, line: 345, baseType: !121, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!695 = !{!696, !702, !718, !729, !632}
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !634, file: !698, line: 752, type: !699, isLocal: false, isDefinition: true, align: 16)
!698 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 704, elements: !700)
!700 = !{!701}
!701 = !DISubrange(count: 44)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "__device_dts_ord_8", scope: !634, file: !698, line: 752, type: !704, isLocal: false, isDefinition: true, align: 32)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !706)
!706 = !{!707, !708, !709, !710, !716, !717}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !705, file: !141, line: 380, baseType: !144, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !705, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !705, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !705, file: !141, line: 386, baseType: !711, size: 32, offset: 96)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !712, file: !141, line: 359, baseType: !154, size: 8)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !712, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !705, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !705, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_8", scope: !634, file: !698, line: 752, type: !720, isLocal: true, isDefinition: true, align: 32)
!720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !722)
!722 = !{!723, !728}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !721, file: !132, line: 60, baseType: !724, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = !DISubroutineType(types: !726)
!726 = !{!103, !727}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !721, file: !132, line: 65, baseType: !727, size: 32, offset: 32)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_8", scope: !634, file: !698, line: 752, type: !712, isLocal: true, isDefinition: true, align: 8)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !643, line: 100, size: 224, elements: !732)
!732 = !{!733, !739, !740, !749, !754, !759, !765}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !731, file: !643, line: 101, baseType: !734, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !643, line: 76, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 32)
!736 = !DISubroutineType(types: !737)
!737 = !{!103, !727, !738}
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !643, line: 56, baseType: !102)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !731, file: !643, line: 102, baseType: !734, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !731, file: !643, line: 103, baseType: !741, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !643, line: 83, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 32)
!743 = !DISubroutineType(types: !744)
!744 = !{!103, !727, !738, !745, !102}
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !643, line: 72, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !727, !738, !102}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !731, file: !643, line: 104, baseType: !750, size: 32, offset: 96)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !643, line: 79, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!752 = !DISubroutineType(types: !753)
!753 = !{!103, !727, !738, !694}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !731, file: !643, line: 105, baseType: !755, size: 32, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !643, line: 88, baseType: !756)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 32)
!757 = !DISubroutineType(types: !758)
!758 = !{!642, !727, !738}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !731, file: !643, line: 106, baseType: !760, size: 32, offset: 160)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !643, line: 92, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DISubroutineType(types: !763)
!763 = !{!103, !727, !738, !764}
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !643, line: 64, baseType: !102)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !731, file: !643, line: 107, baseType: !766, size: 32, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !643, line: 96, baseType: !767)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 32)
!768 = !DISubroutineType(types: !769)
!769 = !{!103, !727, !738, !102}
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !772, file: !829, line: 603, type: !831, isLocal: true, isDefinition: true, align: 32)
!772 = distinct !DICompileUnit(language: DW_LANG_C99, file: !773, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !774, globals: !826, splitDebugInlining: false, nameTableKind: None)
!773 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/tmp108")
!774 = !{!102, !103, !775}
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !778, line: 336, size: 160, elements: !779)
!778 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!779 = !{!780, !800, !804, !808, !821}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !777, file: !778, line: 365, baseType: !781, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DISubroutineType(types: !783)
!783 = !{!103, !784, !799}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !787)
!787 = !{!788, !789, !790, !791, !797, !798}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !786, file: !141, line: 380, baseType: !144, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !786, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !786, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !786, file: !141, line: 386, baseType: !792, size: 32, offset: 96)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 32)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !794)
!794 = !{!795, !796}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !793, file: !141, line: 359, baseType: !154, size: 8)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !793, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !786, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !786, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !777, file: !778, line: 366, baseType: !801, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !784, !155}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !777, file: !778, line: 374, baseType: !805, size: 32, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!806 = !DISubroutineType(types: !807)
!807 = !{!103, !784}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !777, file: !778, line: 377, baseType: !809, size: 32, offset: 96)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!810 = !DISubroutineType(types: !811)
!811 = !{!103, !784, !812}
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !778, line: 122, size: 64, elements: !815)
!815 = !{!816, !817, !818, !819, !820}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !814, file: !778, line: 123, baseType: !121, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !814, file: !778, line: 124, baseType: !154, size: 8, offset: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !814, file: !778, line: 125, baseType: !154, size: 8, offset: 40)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !814, file: !778, line: 126, baseType: !154, size: 8, offset: 48)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !814, file: !778, line: 127, baseType: !154, size: 8, offset: 56)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !777, file: !778, line: 379, baseType: !822, size: 32, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 32)
!823 = !DISubroutineType(types: !824)
!824 = !{!103, !784, !825}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!826 = !{!770, !827}
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !772, file: !829, line: 38, type: !830, isLocal: true, isDefinition: true)
!829 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !784)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !832, file: !132, line: 60, baseType: !805, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !832, file: !132, line: 65, baseType: !784, size: 32, offset: 32)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !838, file: !1008, line: 762, type: !1117, isLocal: true, isDefinition: true)
!838 = distinct !DICompileUnit(language: DW_LANG_C99, file: !839, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !840, retainedTypes: !858, globals: !1005, splitDebugInlining: false, nameTableKind: None)
!839 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/tmp108")
!840 = !{!30, !841, !847, !852, !642}
!841 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !842, line: 506, baseType: !32, size: 32, elements: !843)
!842 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!843 = !{!844, !845, !846}
!844 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!845 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!846 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!847 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !842, line: 512, baseType: !32, size: 32, elements: !848)
!848 = !{!849, !850, !851}
!849 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!850 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!851 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!852 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !548, line: 43, baseType: !32, size: 32, elements: !853)
!853 = !{!854, !855, !856, !857}
!854 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!855 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!856 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!857 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!858 = !{!102, !103, !859, !929, !934, !894, !847, !841, !939, !940, !121, !954, !909, !964, !965, !966}
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !842, line: 523, size: 288, elements: !862)
!862 = !{!863, !884, !890, !895, !899, !900, !901, !905, !925}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !861, file: !842, line: 524, baseType: !864, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!865 = !DISubroutineType(types: !866)
!866 = !{!103, !867, !882, !883}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !870)
!870 = !{!871, !872, !873, !874, !880, !881}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !869, file: !141, line: 380, baseType: !144, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !869, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !869, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !869, file: !141, line: 386, baseType: !875, size: 32, offset: 96)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !877)
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !876, file: !141, line: 359, baseType: !154, size: 8)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !876, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !869, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !869, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !842, line: 237, baseType: !154)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !842, line: 257, baseType: !121)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !861, file: !842, line: 530, baseType: !885, size: 32, offset: 32)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DISubroutineType(types: !887)
!887 = !{!103, !867, !888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !842, line: 229, baseType: !121)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !861, file: !842, line: 532, baseType: !891, size: 32, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 32)
!892 = !DISubroutineType(types: !893)
!893 = !{!103, !867, !894, !889}
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !842, line: 216, baseType: !121)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !861, file: !842, line: 535, baseType: !896, size: 32, offset: 96)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 32)
!897 = !DISubroutineType(types: !898)
!898 = !{!103, !867, !894}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !861, file: !842, line: 537, baseType: !896, size: 32, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !861, file: !842, line: 539, baseType: !896, size: 32, offset: 160)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !861, file: !842, line: 541, baseType: !902, size: 32, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = !DISubroutineType(types: !904)
!904 = !{!103, !867, !882, !841, !847}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !861, file: !842, line: 544, baseType: !906, size: 32, offset: 224)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 32)
!907 = !DISubroutineType(types: !908)
!908 = !{!103, !867, !909, !157}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !842, line: 478, size: 96, elements: !911)
!911 = !{!912, !919, !924}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !910, file: !842, line: 482, baseType: !913, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !914, line: 33, baseType: !915)
!914 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !914, line: 29, size: 32, elements: !916)
!916 = !{!917}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !915, file: !914, line: 30, baseType: !918, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !910, file: !842, line: 485, baseType: !920, size: 32, offset: 32)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !842, line: 464, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 32)
!922 = !DISubroutineType(types: !923)
!923 = !{null, !867, !909, !894}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !910, file: !842, line: 493, baseType: !894, size: 32, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !861, file: !842, line: 547, baseType: !926, size: 32, offset: 256)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DISubroutineType(types: !928)
!928 = !{!121, !867}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !842, line: 428, size: 32, elements: !932)
!932 = !{!933}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !931, file: !842, line: 434, baseType: !894, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !842, line: 441, size: 32, elements: !937)
!937 = !{!938}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !936, file: !842, line: 447, baseType: !894, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !116, line: 276, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 265, size: 320, elements: !943)
!943 = !{!944, !945, !946, !947, !948, !949, !950, !951, !952}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !942, file: !116, line: 267, baseType: !120, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !942, file: !116, line: 268, baseType: !120, size: 32, offset: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !942, file: !116, line: 269, baseType: !120, size: 32, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !942, file: !116, line: 270, baseType: !120, size: 32, offset: 96)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !942, file: !116, line: 271, baseType: !120, size: 32, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !942, file: !116, line: 272, baseType: !120, size: 32, offset: 160)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !942, file: !116, line: 273, baseType: !120, size: 32, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !942, file: !116, line: 274, baseType: !120, size: 32, offset: 224)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !942, file: !116, line: 275, baseType: !953, size: 64, offset: 256)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !242)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !116, line: 289, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 282, size: 288, elements: !957)
!957 = !{!958, !959, !960, !962, !963}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !956, file: !116, line: 284, baseType: !120, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !956, file: !116, line: 285, baseType: !120, size: 32, offset: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !956, file: !116, line: 286, baseType: !961, size: 128, offset: 64)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !509)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !956, file: !116, line: 287, baseType: !665, size: 64, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !956, file: !116, line: 288, baseType: !120, size: 32, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !643, line: 100, size: 224, elements: !969)
!969 = !{!970, !975, !976, !985, !990, !995, !1000}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !968, file: !643, line: 101, baseType: !971, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !643, line: 76, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = !DISubroutineType(types: !974)
!974 = !{!103, !867, !738}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !968, file: !643, line: 102, baseType: !971, size: 32, offset: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !968, file: !643, line: 103, baseType: !977, size: 32, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !643, line: 83, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = !DISubroutineType(types: !980)
!980 = !{!103, !867, !738, !981, !102}
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !643, line: 72, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 32)
!983 = !DISubroutineType(types: !984)
!984 = !{null, !867, !738, !102}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !968, file: !643, line: 104, baseType: !986, size: 32, offset: 96)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !643, line: 79, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!988 = !DISubroutineType(types: !989)
!989 = !{!103, !867, !738, !694}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !968, file: !643, line: 105, baseType: !991, size: 32, offset: 128)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !643, line: 88, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DISubroutineType(types: !994)
!994 = !{!642, !867, !738}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !968, file: !643, line: 106, baseType: !996, size: 32, offset: 160)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !643, line: 92, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 32)
!998 = !DISubroutineType(types: !999)
!999 = !{!103, !867, !738, !764}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !968, file: !643, line: 107, baseType: !1001, size: 32, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !643, line: 96, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 32)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!103, !867, !738, !102}
!1005 = !{!1006, !1012, !1014, !1024, !1029, !1031, !1033, !1035, !1037, !1039, !1041, !1043, !1045, !1047, !1049, !1051, !1053, !1055, !1057, !1059, !1061, !1063, !1065, !1067, !1069, !1083, !1085, !1087, !1089, !1091, !1093, !1095, !1097, !1099, !1101, !1103, !1105, !1107, !1109, !1111, !836, !1113, !1115, !1128, !1130, !1132, !1134, !1136, !1138}
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_67", scope: !838, file: !1008, line: 762, type: !1009, isLocal: false, isDefinition: true, align: 16)
!1008 = !DIFile(filename: "zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 80, elements: !1010)
!1010 = !{!1011}
!1011 = !DISubrange(count: 5)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(name: "__device_dts_ord_67", scope: !838, file: !1008, line: 762, type: !868, isLocal: false, isDefinition: true, align: 32)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_67", scope: !838, file: !1008, line: 762, type: !1016, isLocal: true, isDefinition: true, align: 32)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !1018)
!1018 = !{!1019, !1023}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1017, file: !132, line: 60, baseType: !1020, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 32)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!103, !867}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1017, file: !132, line: 65, baseType: !867, size: 32, offset: 32)
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !838, file: !1008, line: 766, type: !1026, isLocal: false, isDefinition: true, align: 16)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 160, elements: !1027)
!1027 = !{!1028}
!1028 = !DISubrange(count: 10)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(name: "__device_dts_ord_19", scope: !838, file: !1008, line: 766, type: !868, isLocal: false, isDefinition: true, align: 32)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_19", scope: !838, file: !1008, line: 766, type: !1016, isLocal: true, isDefinition: true, align: 32)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_68", scope: !838, file: !1008, line: 770, type: !1009, isLocal: false, isDefinition: true, align: 16)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(name: "__device_dts_ord_68", scope: !838, file: !1008, line: 770, type: !868, isLocal: false, isDefinition: true, align: 32)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_68", scope: !838, file: !1008, line: 770, type: !1016, isLocal: true, isDefinition: true, align: 32)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_69", scope: !838, file: !1008, line: 774, type: !1009, isLocal: false, isDefinition: true, align: 16)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(name: "__device_dts_ord_69", scope: !838, file: !1008, line: 774, type: !868, isLocal: false, isDefinition: true, align: 32)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_69", scope: !838, file: !1008, line: 774, type: !1016, isLocal: true, isDefinition: true, align: 32)
!1045 = !DIGlobalVariableExpression(var: !1046, expr: !DIExpression())
!1046 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_70", scope: !838, file: !1008, line: 778, type: !1009, isLocal: false, isDefinition: true, align: 16)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
