; ModuleID = 'build/adafruit_trinket_m0/drivers/led_pwm/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.3, i8*, i32 }
%union.anon.3 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer.18 = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon.3 }
%struct.mpsc_pbuf_buffer_config.19 = type { i32*, i32, void (%struct.mpsc_pbuf_buffer.18*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }
%union.log_msg_generic = type { %struct.log_msg }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/led_pwm/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/led_pwm")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/led_pwm")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !237, line: 15, type: !247, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !107, globals: !234, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/led_pwm/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/led_pwm")
!29 = !{!30, !37}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !38, line: 27, baseType: !32, size: 32, elements: !39)
!38 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!40 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!41 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!42 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!43 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!44 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!45 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!46 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!47 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!48 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!49 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!50 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!51 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!52 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!53 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!54 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!55 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!56 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!106 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!107 = !{!108, !109, !123, !124, !117, !125, !135, !154, !227, !228, !232}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !122}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !110, file: !111, line: 80, baseType: !114, size: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !115)
!115 = !{!116, !119, !120, !121}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !114, file: !111, line: 47, baseType: !117, size: 8)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !118)
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !114, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !114, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !114, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !110, file: !111, line: 82, baseType: !108, size: 32)
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !127)
!127 = !{!128, !146, !150}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !126, file: !31, line: 89, baseType: !129, size: 96)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !130)
!130 = !{!131, !143, !144}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !129, file: !31, line: 67, baseType: !132, size: 32)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !133)
!133 = !{!134, !136, !137, !138, !139, !140, !141, !142}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !132, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !132, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !132, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !132, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !132, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !132, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !129, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !129, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !135)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !126, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 32, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 4)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !31, line: 94, baseType: !151, offset: 128)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: -1)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "led_driver_api", file: !157, line: 113, size: 224, elements: !158)
!157 = !DIFile(filename: "zephyr/include/zephyr/drivers/led.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!158 = !{!159, !189, !191, !196, !212, !217, !222}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !156, file: !157, line: 115, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_on", file: !157, line: 89, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{!123, !164, !135}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !167, line: 378, size: 192, elements: !168)
!167 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!168 = !{!169, !173, !174, !175, !182, !183}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !166, file: !167, line: 380, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!172 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !166, file: !167, line: 382, baseType: !13, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !166, file: !167, line: 384, baseType: !13, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !166, file: !167, line: 386, baseType: !176, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !167, line: 351, size: 16, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !177, file: !167, line: 359, baseType: !117, size: 8)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !177, file: !167, line: 364, baseType: !181, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!181 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !166, file: !167, line: 388, baseType: !108, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !166, file: !167, line: 396, baseType: !184, size: 32, offset: 160)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !167, line: 43, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !188)
!188 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !156, file: !157, line: 116, baseType: !190, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_off", file: !157, line: 97, baseType: !161)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "blink", scope: !156, file: !157, line: 118, baseType: !192, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_blink", file: !157, line: 54, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!123, !164, !135, !135, !135}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "get_info", scope: !156, file: !157, line: 119, baseType: !197, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_get_info", file: !157, line: 63, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{!123, !164, !135, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "led_info", file: !157, line: 41, size: 128, elements: !205)
!205 = !{!206, !207, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !204, file: !157, line: 42, baseType: !170, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !204, file: !157, line: 43, baseType: !135, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "num_colors", scope: !204, file: !157, line: 44, baseType: !117, size: 8, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "color_mapping", scope: !204, file: !157, line: 45, baseType: !210, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "set_brightness", scope: !156, file: !157, line: 120, baseType: !213, size: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_set_brightness", file: !157, line: 72, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DISubroutineType(types: !216)
!216 = !{!123, !164, !135, !117}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "set_color", scope: !156, file: !157, line: 121, baseType: !218, size: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_set_color", file: !157, line: 80, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DISubroutineType(types: !221)
!221 = !{!123, !164, !135, !117, !210}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "write_channels", scope: !156, file: !157, line: 122, baseType: !223, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_write_channels", file: !157, line: 105, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DISubroutineType(types: !226)
!226 = !{!123, !164, !135, !135, !210}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !229, line: 46, baseType: !230)
!229 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !231)
!231 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !233)
!233 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!234 = !{!25, !235, !241, !244}
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "led_label", scope: !27, file: !237, line: 19, type: !238, isLocal: false, isDefinition: true)
!237 = !DIFile(filename: "zephyr/samples/drivers/led_pwm/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 32, elements: !239)
!239 = !{!240}
!240 = !DISubrange(count: 1)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "num_leds", scope: !27, file: !237, line: 23, type: !243, isLocal: false, isDefinition: true)
!243 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !237, line: 15, type: !246, isLocal: true, isDefinition: true)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !249, line: 16, size: 64, elements: !250)
!249 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!250 = !{!251, !252}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !248, file: !249, line: 17, baseType: !170, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !248, file: !249, line: 18, baseType: !117, size: 8, offset: 32)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !255, file: !309, line: 18, type: !311, isLocal: false, isDefinition: true)
!255 = distinct !DICompileUnit(language: DW_LANG_C99, file: !256, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !257, retainedTypes: !258, globals: !306, splitDebugInlining: false, nameTableKind: None)
!256 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/led_pwm")
!257 = !{!30}
!258 = !{!22, !108, !24, !259, !261, !263, !264, !123, !227, !266, !268, !269, !270, !271, !272, !274, !124, !117, !285, !135, !170}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !265, line: 214, baseType: !32)
!265 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !273)
!273 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !276)
!276 = !{!277, !284}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !275, file: !111, line: 80, baseType: !278, size: 32)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !279)
!279 = !{!280, !281, !282, !283}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !278, file: !111, line: 47, baseType: !117, size: 8)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !278, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !278, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !278, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !275, file: !111, line: 82, baseType: !108, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !287)
!287 = !{!288, !304, !305}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !286, file: !31, line: 89, baseType: !289, size: 96)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !290)
!290 = !{!291, !302, !303}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !289, file: !31, line: 67, baseType: !292, size: 32)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !293)
!293 = !{!294, !295, !296, !297, !298, !299, !300, !301}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !292, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !292, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !292, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !292, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !292, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !292, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !292, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !292, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !289, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !289, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !286, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !286, file: !31, line: 94, baseType: !151, offset: 128)
!306 = !{!253, !307}
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !255, file: !309, line: 18, type: !310, isLocal: true, isDefinition: true)
!309 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !249, line: 16, size: 64, elements: !313)
!313 = !{!314, !315}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !312, file: !249, line: 17, baseType: !170, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !312, file: !249, line: 18, baseType: !117, size: 8, offset: 32)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "_char_out", scope: !318, file: !323, line: 54, type: !324, isLocal: false, isDefinition: true)
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !320, retainedTypes: !321, globals: !322, splitDebugInlining: false, nameTableKind: None)
!319 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/led_pwm")
!320 = !{!37}
!321 = !{!108, !123}
!322 = !{!316}
!323 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = !DISubroutineType(types: !326)
!326 = !{!123, !123}
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !329, file: !1061, line: 202, type: !1062, isLocal: true, isDefinition: true, align: 32)
!329 = distinct !DICompileUnit(language: DW_LANG_C99, file: !330, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !320, retainedTypes: !331, globals: !1060, splitDebugInlining: false, nameTableKind: None)
!330 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/drivers/led_pwm")
!331 = !{!108, !123, !332, !456, !793, !794, !861}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !334, line: 335, baseType: !335)
!334 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !334, line: 320, size: 288, elements: !336)
!336 = !{!337, !348, !356, !370, !381, !392, !396, !407, !408, !419, !420, !435, !436, !446}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !335, file: !334, line: 321, baseType: !338, size: 16)
!338 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !334, line: 50, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 43, size: 16, elements: !341)
!341 = !{!342, !347}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !340, file: !334, line: 48, baseType: !343, size: 16)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !340, file: !334, line: 44, size: 16, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !343, file: !334, line: 45, baseType: !272, size: 7, flags: DIFlagBitField, extraData: i64 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !343, file: !334, line: 47, baseType: !272, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !340, file: !334, line: 49, baseType: !272, size: 16)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !335, file: !334, line: 322, baseType: !349, size: 16, offset: 16)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 16, elements: !354)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !351, line: 52, baseType: !352)
!351 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21e18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !117)
!354 = !{!355}
!355 = !DISubrange(count: 2)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !335, file: !334, line: 323, baseType: !357, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !334, line: 107, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 94, size: 32, elements: !360)
!360 = !{!361, !369}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !359, file: !334, line: 105, baseType: !362, size: 32)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !359, file: !334, line: 95, size: 32, elements: !363)
!363 = !{!364, !365, !366, !367, !368}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !362, file: !334, line: 97, baseType: !135, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !362, file: !334, line: 99, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !362, file: !334, line: 100, baseType: !135, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !362, file: !334, line: 102, baseType: !135, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !362, file: !334, line: 103, baseType: !135, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !359, file: !334, line: 106, baseType: !135, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !335, file: !334, line: 324, baseType: !371, size: 32, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !334, line: 155, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 148, size: 32, elements: !374)
!374 = !{!375, !380}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !373, file: !334, line: 153, baseType: !376, size: 32)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !373, file: !334, line: 149, size: 32, elements: !377)
!377 = !{!378, !379}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !376, file: !334, line: 150, baseType: !135, size: 16, flags: DIFlagBitField, extraData: i64 0)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !376, file: !334, line: 151, baseType: !135, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !373, file: !334, line: 154, baseType: !135, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !335, file: !334, line: 325, baseType: !382, size: 8, offset: 96)
!382 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !334, line: 194, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 187, size: 8, elements: !385)
!385 = !{!386, !391}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !384, file: !334, line: 192, baseType: !387, size: 8)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !384, file: !334, line: 188, size: 8, elements: !388)
!388 = !{!389, !390}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !387, file: !334, line: 189, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !387, file: !334, line: 190, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !384, file: !334, line: 193, baseType: !117, size: 8)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !335, file: !334, line: 326, baseType: !393, size: 24, offset: 104)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 24, elements: !394)
!394 = !{!395}
!395 = !DISubrange(count: 3)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !335, file: !334, line: 327, baseType: !397, size: 8, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !334, line: 215, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 208, size: 8, elements: !400)
!400 = !{!401, !406}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !399, file: !334, line: 213, baseType: !402, size: 8)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !399, file: !334, line: 209, size: 8, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !402, file: !334, line: 210, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !402, file: !334, line: 211, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !399, file: !334, line: 214, baseType: !117, size: 8)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !335, file: !334, line: 328, baseType: !393, size: 24, offset: 136)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !335, file: !334, line: 329, baseType: !409, size: 8, offset: 160)
!409 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !334, line: 236, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 229, size: 8, elements: !412)
!412 = !{!413, !418}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !411, file: !334, line: 234, baseType: !414, size: 8)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !411, file: !334, line: 230, size: 8, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !414, file: !334, line: 231, baseType: !352, size: 1, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !414, file: !334, line: 232, baseType: !352, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !411, file: !334, line: 235, baseType: !117, size: 8)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !335, file: !334, line: 330, baseType: !393, size: 24, offset: 168)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !335, file: !334, line: 331, baseType: !421, size: 16, offset: 192)
!421 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !334, line: 262, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 250, size: 16, elements: !424)
!424 = !{!425, !434}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !423, file: !334, line: 260, baseType: !426, size: 16)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !423, file: !334, line: 251, size: 16, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !426, file: !334, line: 252, baseType: !272, size: 1, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !426, file: !334, line: 253, baseType: !272, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !426, file: !334, line: 254, baseType: !272, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !426, file: !334, line: 255, baseType: !272, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !426, file: !334, line: 256, baseType: !272, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !426, file: !334, line: 258, baseType: !272, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !423, file: !334, line: 261, baseType: !272, size: 16)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !335, file: !334, line: 332, baseType: !349, size: 16, offset: 208)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !335, file: !334, line: 333, baseType: !437, size: 32, offset: 224)
!437 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !334, line: 290, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 284, size: 32, elements: !440)
!440 = !{!441, !445}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !439, file: !334, line: 288, baseType: !442, size: 32)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !334, line: 285, size: 32, elements: !443)
!443 = !{!444}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !442, file: !334, line: 286, baseType: !135, size: 22, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !439, file: !334, line: 289, baseType: !135, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !335, file: !334, line: 334, baseType: !447, size: 16, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !448)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !334, line: 308, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 303, size: 16, elements: !450)
!450 = !{!451, !455}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !449, file: !334, line: 306, baseType: !452, size: 16)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !449, file: !334, line: 304, size: 16, elements: !453)
!453 = !{!454}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !452, file: !334, line: 305, baseType: !272, size: 16, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !449, file: !334, line: 307, baseType: !272, size: 16)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !458, line: 928, baseType: !459)
!458 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !458, line: 899, size: 672, elements: !460)
!460 = !{!461, !485, !509, !535, !560, !576, !577, !595, !596, !613, !624, !625, !640, !660, !661, !673, !685, !695, !696, !713, !715, !726, !727, !739, !751, !752, !763, !779}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !459, file: !458, line: 900, baseType: !462, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !463)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !458, line: 64, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 43, size: 32, elements: !465)
!465 = !{!466, !484}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !464, file: !458, line: 62, baseType: !467, size: 32)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !464, file: !458, line: 44, size: 32, elements: !468)
!468 = !{!469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !467, file: !458, line: 45, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !467, file: !458, line: 46, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !467, file: !458, line: 47, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !467, file: !458, line: 48, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !467, file: !458, line: 49, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !467, file: !458, line: 50, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !467, file: !458, line: 51, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !467, file: !458, line: 52, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !467, file: !458, line: 53, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !467, file: !458, line: 54, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !467, file: !458, line: 55, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !467, file: !458, line: 56, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !467, file: !458, line: 58, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !467, file: !458, line: 59, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !467, file: !458, line: 60, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !464, file: !458, line: 63, baseType: !135, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !459, file: !458, line: 901, baseType: !486, size: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !458, line: 125, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 104, size: 32, elements: !489)
!489 = !{!490, !508}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !488, file: !458, line: 123, baseType: !491, size: 32)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !488, file: !458, line: 105, size: 32, elements: !492)
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !491, file: !458, line: 106, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !491, file: !458, line: 107, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !491, file: !458, line: 108, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !491, file: !458, line: 109, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !491, file: !458, line: 110, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !491, file: !458, line: 111, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !491, file: !458, line: 112, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !491, file: !458, line: 113, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !491, file: !458, line: 114, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !491, file: !458, line: 115, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !491, file: !458, line: 116, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !491, file: !458, line: 117, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !491, file: !458, line: 119, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !491, file: !458, line: 120, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !491, file: !458, line: 121, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !488, file: !458, line: 124, baseType: !135, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !459, file: !458, line: 902, baseType: !510, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !511)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !458, line: 186, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 165, size: 32, elements: !513)
!513 = !{!514, !534}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !512, file: !458, line: 184, baseType: !515, size: 32)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !512, file: !458, line: 166, size: 32, elements: !516)
!516 = !{!517, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !515, file: !458, line: 167, baseType: !518, size: 1, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !135)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !515, file: !458, line: 168, baseType: !518, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !515, file: !458, line: 169, baseType: !518, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !515, file: !458, line: 170, baseType: !518, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !515, file: !458, line: 171, baseType: !518, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !515, file: !458, line: 172, baseType: !518, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !515, file: !458, line: 173, baseType: !518, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !515, file: !458, line: 174, baseType: !518, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !515, file: !458, line: 175, baseType: !518, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !515, file: !458, line: 176, baseType: !518, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !515, file: !458, line: 177, baseType: !518, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !515, file: !458, line: 178, baseType: !518, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !515, file: !458, line: 180, baseType: !518, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !515, file: !458, line: 181, baseType: !518, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !515, file: !458, line: 182, baseType: !518, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !512, file: !458, line: 185, baseType: !135, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !459, file: !458, line: 903, baseType: !536, size: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !458, line: 247, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 226, size: 32, elements: !540)
!540 = !{!541, !559}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !539, file: !458, line: 245, baseType: !542, size: 32)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !539, file: !458, line: 227, size: 32, elements: !543)
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !542, file: !458, line: 228, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !542, file: !458, line: 229, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !542, file: !458, line: 230, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !542, file: !458, line: 231, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !542, file: !458, line: 232, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !542, file: !458, line: 233, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !542, file: !458, line: 234, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !542, file: !458, line: 235, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !542, file: !458, line: 236, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !542, file: !458, line: 237, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !542, file: !458, line: 238, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !542, file: !458, line: 239, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !542, file: !458, line: 241, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !542, file: !458, line: 242, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !542, file: !458, line: 243, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !539, file: !458, line: 246, baseType: !135, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !459, file: !458, line: 904, baseType: !561, size: 16, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !458, line: 300, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 287, size: 16, elements: !564)
!564 = !{!565, !575}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !563, file: !458, line: 298, baseType: !566, size: 16)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !563, file: !458, line: 288, size: 16, elements: !567)
!567 = !{!568, !569, !570, !571, !572, !573, !574}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !566, file: !458, line: 290, baseType: !272, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !566, file: !458, line: 291, baseType: !272, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !566, file: !458, line: 293, baseType: !272, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !566, file: !458, line: 294, baseType: !272, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !566, file: !458, line: 295, baseType: !272, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !566, file: !458, line: 296, baseType: !272, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !566, file: !458, line: 297, baseType: !272, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !563, file: !458, line: 299, baseType: !272, size: 16)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !459, file: !458, line: 905, baseType: !349, size: 16, offset: 144)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !459, file: !458, line: 906, baseType: !578, size: 16, offset: 160)
!578 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !458, line: 352, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 336, size: 16, elements: !581)
!581 = !{!582, !594}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !580, file: !458, line: 350, baseType: !583, size: 16)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !580, file: !458, line: 337, size: 16, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !593}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !583, file: !458, line: 339, baseType: !272, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !583, file: !458, line: 340, baseType: !272, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !583, file: !458, line: 341, baseType: !272, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !583, file: !458, line: 342, baseType: !272, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !583, file: !458, line: 343, baseType: !272, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !583, file: !458, line: 344, baseType: !272, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !583, file: !458, line: 345, baseType: !272, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !583, file: !458, line: 346, baseType: !272, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !583, file: !458, line: 348, baseType: !272, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !580, file: !458, line: 351, baseType: !272, size: 16)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !459, file: !458, line: 907, baseType: !349, size: 16, offset: 176)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !459, file: !458, line: 908, baseType: !597, size: 32, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !598)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !458, line: 398, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 381, size: 32, elements: !600)
!600 = !{!601, !612}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !599, file: !458, line: 396, baseType: !602, size: 32)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !599, file: !458, line: 382, size: 32, elements: !603)
!603 = !{!604, !605, !606, !607, !608, !609, !610, !611}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !602, file: !458, line: 384, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !602, file: !458, line: 385, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !602, file: !458, line: 386, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !602, file: !458, line: 388, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !602, file: !458, line: 389, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !602, file: !458, line: 390, baseType: !135, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !602, file: !458, line: 392, baseType: !135, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !602, file: !458, line: 394, baseType: !135, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !599, file: !458, line: 397, baseType: !135, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !459, file: !458, line: 909, baseType: !614, size: 8, offset: 224)
!614 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !615)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !458, line: 433, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 426, size: 8, elements: !617)
!617 = !{!618, !623}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !616, file: !458, line: 431, baseType: !619, size: 8)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !616, file: !458, line: 427, size: 8, elements: !620)
!620 = !{!621, !622}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !619, file: !458, line: 428, baseType: !117, size: 5, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !619, file: !458, line: 430, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !616, file: !458, line: 432, baseType: !117, size: 8)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !459, file: !458, line: 910, baseType: !393, size: 24, offset: 232)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !459, file: !458, line: 911, baseType: !626, size: 32, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !458, line: 462, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 448, size: 32, elements: !629)
!629 = !{!630, !639}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !628, file: !458, line: 460, baseType: !631, size: 32)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !628, file: !458, line: 449, size: 32, elements: !632)
!632 = !{!633, !634, !635, !636, !637, !638}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !631, file: !458, line: 451, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !631, file: !458, line: 453, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !631, file: !458, line: 454, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !631, file: !458, line: 455, baseType: !135, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !631, file: !458, line: 457, baseType: !135, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !631, file: !458, line: 459, baseType: !135, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !628, file: !458, line: 461, baseType: !135, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !459, file: !458, line: 912, baseType: !641, size: 16, offset: 288)
!641 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !458, line: 520, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 503, size: 16, elements: !644)
!644 = !{!645, !659}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !643, file: !458, line: 518, baseType: !646, size: 16)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !643, file: !458, line: 504, size: 16, elements: !647)
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !646, file: !458, line: 506, baseType: !272, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !646, file: !458, line: 507, baseType: !272, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !646, file: !458, line: 508, baseType: !272, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !646, file: !458, line: 509, baseType: !272, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !646, file: !458, line: 510, baseType: !272, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !646, file: !458, line: 511, baseType: !272, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !646, file: !458, line: 512, baseType: !272, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !646, file: !458, line: 513, baseType: !272, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !646, file: !458, line: 514, baseType: !272, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !646, file: !458, line: 515, baseType: !272, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !646, file: !458, line: 516, baseType: !272, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !643, file: !458, line: 519, baseType: !272, size: 16)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !459, file: !458, line: 913, baseType: !349, size: 16, offset: 304)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !459, file: !458, line: 914, baseType: !662, size: 32, offset: 320)
!662 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !458, line: 559, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 552, size: 32, elements: !665)
!665 = !{!666, !672}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !664, file: !458, line: 557, baseType: !667, size: 32)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !664, file: !458, line: 553, size: 32, elements: !668)
!668 = !{!669, !670, !671}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !667, file: !458, line: 554, baseType: !135, size: 10, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !667, file: !458, line: 555, baseType: !135, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !667, file: !458, line: 556, baseType: !135, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !664, file: !458, line: 558, baseType: !135, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !459, file: !458, line: 915, baseType: !674, size: 32, offset: 352)
!674 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !458, line: 585, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 578, size: 32, elements: !677)
!677 = !{!678, !684}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !676, file: !458, line: 583, baseType: !679, size: 32)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !676, file: !458, line: 579, size: 32, elements: !680)
!680 = !{!681, !682, !683}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !679, file: !458, line: 580, baseType: !135, size: 16, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !679, file: !458, line: 581, baseType: !135, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !679, file: !458, line: 582, baseType: !135, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !676, file: !458, line: 584, baseType: !135, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !459, file: !458, line: 916, baseType: !686, size: 8, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !458, line: 610, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 604, size: 8, elements: !689)
!689 = !{!690, !694}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !688, file: !458, line: 608, baseType: !691, size: 8)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !688, file: !458, line: 605, size: 8, elements: !692)
!692 = !{!693}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !691, file: !458, line: 607, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !688, file: !458, line: 609, baseType: !117, size: 8)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !459, file: !458, line: 917, baseType: !393, size: 24, offset: 392)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !459, file: !458, line: 918, baseType: !697, size: 32, offset: 416)
!697 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !458, line: 639, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 622, size: 32, elements: !700)
!700 = !{!701, !712}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !699, file: !458, line: 637, baseType: !702, size: 32)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !699, file: !458, line: 623, size: 32, elements: !703)
!703 = !{!704, !705, !706, !707, !708, !709, !710, !711}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !702, file: !458, line: 625, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !702, file: !458, line: 626, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !702, file: !458, line: 627, baseType: !135, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !702, file: !458, line: 629, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !702, file: !458, line: 631, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !702, file: !458, line: 632, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !702, file: !458, line: 634, baseType: !135, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !702, file: !458, line: 635, baseType: !135, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !699, file: !458, line: 638, baseType: !135, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !459, file: !458, line: 919, baseType: !714, size: 32, offset: 448)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 32, elements: !148)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !459, file: !458, line: 920, baseType: !716, size: 16, offset: 480)
!716 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !458, line: 715, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 706, size: 16, elements: !719)
!719 = !{!720, !725}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !718, file: !458, line: 713, baseType: !721, size: 16)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !718, file: !458, line: 707, size: 16, elements: !722)
!722 = !{!723, !724}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !721, file: !458, line: 709, baseType: !272, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !721, file: !458, line: 711, baseType: !272, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !718, file: !458, line: 714, baseType: !272, size: 16)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !459, file: !458, line: 921, baseType: !349, size: 16, offset: 496)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !459, file: !458, line: 922, baseType: !728, size: 32, offset: 512)
!728 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !458, line: 739, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 729, size: 32, elements: !731)
!731 = !{!732, !738}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !730, file: !458, line: 737, baseType: !733, size: 32)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !730, file: !458, line: 730, size: 32, elements: !734)
!734 = !{!735, !736, !737}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !733, file: !458, line: 732, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !733, file: !458, line: 733, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !733, file: !458, line: 735, baseType: !135, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !730, file: !458, line: 738, baseType: !135, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !459, file: !458, line: 923, baseType: !740, size: 8, offset: 544)
!740 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !458, line: 765, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 756, size: 8, elements: !743)
!743 = !{!744, !750}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !742, file: !458, line: 763, baseType: !745, size: 8)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !742, file: !458, line: 757, size: 8, elements: !746)
!746 = !{!747, !748, !749}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !745, file: !458, line: 759, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !745, file: !458, line: 761, baseType: !117, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !745, file: !458, line: 762, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !742, file: !458, line: 764, baseType: !117, size: 8)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !459, file: !458, line: 924, baseType: !393, size: 24, offset: 552)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !459, file: !458, line: 925, baseType: !753, size: 32, offset: 576)
!753 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !754)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !458, line: 789, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 781, size: 32, elements: !756)
!756 = !{!757, !762}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !755, file: !458, line: 787, baseType: !758, size: 32)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !755, file: !458, line: 782, size: 32, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !758, file: !458, line: 783, baseType: !135, size: 12, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !758, file: !458, line: 785, baseType: !135, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !755, file: !458, line: 788, baseType: !135, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !459, file: !458, line: 926, baseType: !764, size: 32, offset: 608)
!764 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !458, line: 820, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 805, size: 32, elements: !767)
!767 = !{!768, !778}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !766, file: !458, line: 818, baseType: !769, size: 32)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !766, file: !458, line: 806, size: 32, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776, !777}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !769, file: !458, line: 807, baseType: !135, size: 2, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !769, file: !458, line: 808, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !769, file: !458, line: 809, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !769, file: !458, line: 810, baseType: !135, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !769, file: !458, line: 812, baseType: !135, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !769, file: !458, line: 814, baseType: !135, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !769, file: !458, line: 816, baseType: !135, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !766, file: !458, line: 819, baseType: !135, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !459, file: !458, line: 927, baseType: !780, size: 8, offset: 640)
!780 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !458, line: 881, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !458, line: 872, size: 8, elements: !784)
!784 = !{!785, !792}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !783, file: !458, line: 879, baseType: !786, size: 8)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !783, file: !458, line: 873, size: 8, elements: !787)
!787 = !{!788, !789, !790, !791}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !786, file: !458, line: 874, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !786, file: !458, line: 875, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !786, file: !458, line: 876, baseType: !117, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !786, file: !458, line: 877, baseType: !117, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !783, file: !458, line: 880, baseType: !117, size: 8)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !796, line: 290, baseType: !797)
!796 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !796, line: 284, size: 96, elements: !798)
!798 = !{!799, !809, !820, !833, !850}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !797, file: !796, line: 285, baseType: !800, size: 8)
!800 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !796, line: 49, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !796, line: 43, size: 8, elements: !803)
!803 = !{!804, !808}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !802, file: !796, line: 47, baseType: !805, size: 8)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !802, file: !796, line: 44, size: 8, elements: !806)
!806 = !{!807}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !805, file: !796, line: 45, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !802, file: !796, line: 48, baseType: !117, size: 8)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !797, file: !796, line: 286, baseType: !810, size: 8, offset: 8)
!810 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !796, line: 67, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !796, line: 61, size: 8, elements: !814)
!814 = !{!815, !819}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !813, file: !796, line: 65, baseType: !816, size: 8)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !813, file: !796, line: 62, size: 8, elements: !817)
!817 = !{!818}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !816, file: !796, line: 64, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !813, file: !796, line: 66, baseType: !117, size: 8)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !797, file: !796, line: 287, baseType: !821, size: 16, offset: 16)
!821 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !796, line: 89, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !796, line: 79, size: 16, elements: !824)
!824 = !{!825, !832}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !823, file: !796, line: 87, baseType: !826, size: 16)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !823, file: !796, line: 80, size: 16, elements: !827)
!827 = !{!828, !829, !830, !831}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !826, file: !796, line: 81, baseType: !272, size: 6, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !826, file: !796, line: 83, baseType: !272, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !826, file: !796, line: 85, baseType: !272, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !826, file: !796, line: 86, baseType: !272, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !823, file: !796, line: 88, baseType: !272, size: 16)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !797, file: !796, line: 288, baseType: !834, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !796, line: 214, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !796, line: 199, size: 32, elements: !837)
!837 = !{!838, !849}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !836, file: !796, line: 212, baseType: !839, size: 32)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !836, file: !796, line: 200, size: 32, elements: !840)
!840 = !{!841, !842, !843, !844, !845, !846, !847, !848}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !839, file: !796, line: 201, baseType: !135, size: 4, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !839, file: !796, line: 203, baseType: !135, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !839, file: !796, line: 205, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !839, file: !796, line: 206, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !839, file: !796, line: 207, baseType: !135, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !839, file: !796, line: 208, baseType: !135, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !839, file: !796, line: 209, baseType: !135, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !839, file: !796, line: 210, baseType: !135, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !836, file: !796, line: 213, baseType: !135, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !797, file: !796, line: 289, baseType: !851, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !796, line: 268, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !796, line: 260, size: 32, elements: !854)
!854 = !{!855, !860}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !853, file: !796, line: 266, baseType: !856, size: 32)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !853, file: !796, line: 261, size: 32, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !856, file: !796, line: 262, baseType: !135, size: 4, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !856, file: !796, line: 264, baseType: !135, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !853, file: !796, line: 267, baseType: !135, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !863, line: 513, baseType: !864)
!863 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !863, line: 494, size: 480, elements: !865)
!865 = !{!866, !872, !882, !886, !896, !906, !916, !926, !930, !946, !962, !978, !1008, !1012, !1022, !1032, !1042, !1044}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !864, file: !863, line: 495, baseType: !867, size: 8)
!867 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !863, line: 45, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !863, line: 43, size: 8, elements: !870)
!870 = !{!871}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !869, file: !863, line: 44, baseType: !117, size: 8)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !864, file: !863, line: 496, baseType: !873, size: 8, offset: 8)
!873 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !863, line: 61, baseType: !875)
!875 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !863, line: 55, size: 8, elements: !876)
!876 = !{!877, !881}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !875, file: !863, line: 59, baseType: !878, size: 8)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !875, file: !863, line: 56, size: 8, elements: !879)
!879 = !{!880}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !878, file: !863, line: 57, baseType: !117, size: 2, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !875, file: !863, line: 60, baseType: !117, size: 8)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !864, file: !863, line: 497, baseType: !883, size: 48, offset: 16)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 48, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 6)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !864, file: !863, line: 498, baseType: !887, size: 8, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !863, line: 86, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !863, line: 80, size: 8, elements: !890)
!890 = !{!891, !895}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !889, file: !863, line: 84, baseType: !892, size: 8)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !889, file: !863, line: 81, size: 8, elements: !893)
!893 = !{!894}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !892, file: !863, line: 82, baseType: !117, size: 3, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !889, file: !863, line: 85, baseType: !117, size: 8)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !864, file: !863, line: 499, baseType: !897, size: 8, offset: 72)
!897 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !863, line: 121, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !863, line: 115, size: 8, elements: !900)
!900 = !{!901, !905}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !899, file: !863, line: 119, baseType: !902, size: 8)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !899, file: !863, line: 116, size: 8, elements: !903)
!903 = !{!904}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !902, file: !863, line: 117, baseType: !117, size: 3, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !899, file: !863, line: 120, baseType: !117, size: 8)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !864, file: !863, line: 500, baseType: !907, size: 8, offset: 80)
!907 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !863, line: 156, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !863, line: 150, size: 8, elements: !910)
!910 = !{!911, !915}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !909, file: !863, line: 154, baseType: !912, size: 8)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !909, file: !863, line: 151, size: 8, elements: !913)
!913 = !{!914}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !912, file: !863, line: 152, baseType: !117, size: 3, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !909, file: !863, line: 155, baseType: !117, size: 8)
