; ModuleID = 'build/adafruit_feather_nrf52840/sensor/tmp112/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct.k_spinlock = type { i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_spinlock }
%struct.arm_mpu_region = type { i32, i8*, %struct.k_spinlock }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/sensor/tmp112/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/sensor/tmp112")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/sensor/tmp112")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/sensor/tmp112")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !111, file: !154, line: 27, type: !184, isLocal: true, isDefinition: true)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !125, globals: !151, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/sensor/tmp112")
!113 = !{!114, !30}
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !115, line: 27, baseType: !32, size: 32, elements: !116)
!115 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!118 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!119 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!120 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!121 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!122 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!123 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!124 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!125 = !{!102, !126, !103, !24, !130, !146, !148, !149}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !127, line: 46, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !129)
!129 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !132, line: 54, size: 96, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !141, !145}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !131, file: !132, line: 55, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !137)
!136 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !138)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !136, line: 30, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !131, file: !132, line: 60, baseType: !142, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !114}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !131, file: !132, line: 65, baseType: !142, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !150)
!150 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!151 = !{!109, !152, !159, !161, !174, !176}
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !111, file: !154, line: 44, type: !155, isLocal: true, isDefinition: true)
!154 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, size: 32, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{!158}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !155, file: !156, line: 52, baseType: !22, size: 32)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !111, file: !154, line: 49, type: !155, isLocal: true, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !111, file: !154, line: 36, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 128, elements: !172)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !115, line: 114, size: 128, elements: !165)
!165 = !{!166, !167, !170, !171}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !164, file: !115, line: 115, baseType: !114, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !164, file: !115, line: 141, baseType: !168, size: 8, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !169)
!169 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !164, file: !115, line: 149, baseType: !148, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !164, file: !115, line: 156, baseType: !148, size: 32, offset: 96)
!172 = !{!173}
!173 = !DISubrange(count: 1)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !111, file: !154, line: 40, type: !163, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !111, file: !154, line: 28, type: !178, isLocal: true, isDefinition: true)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !180)
!180 = !{!181, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !179, file: !136, line: 36, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !179, file: !136, line: 37, baseType: !182, size: 32, offset: 32)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 32, elements: !172)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !186, line: 22, baseType: !187)
!186 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!187 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!188 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!189 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !192, file: !223, line: 50, type: !210, isLocal: true, isDefinition: true)
!192 = distinct !DICompileUnit(language: DW_LANG_C99, file: !193, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !194, globals: !220, splitDebugInlining: false, nameTableKind: None)
!193 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/sensor/tmp112")
!194 = !{!195, !126, !197, !103, !102, !148, !149, !199, !146, !210, !211}
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !196)
!196 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !198, line: 214, baseType: !32)
!198 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !201, line: 45, size: 64, elements: !202)
!201 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!202 = !{!203, !209}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !200, file: !201, line: 46, baseType: !204, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !206)
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !136, line: 30, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !200, file: !201, line: 48, baseType: !148, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !201, line: 38, size: 64, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !212, file: !201, line: 39, baseType: !204, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !212, file: !201, line: 41, baseType: !216, size: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !201, line: 35, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !210}
!220 = !{!221, !227, !235, !190, !237, !247}
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "latency_lock", scope: !192, file: !223, line: 44, type: !224, isLocal: true, isDefinition: true)
!223 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, size: 32, elements: !225)
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !224, file: !156, line: 52, baseType: !22, size: 32)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !192, file: !223, line: 46, type: !229, isLocal: true, isDefinition: true)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !231)
!231 = !{!232, !234}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !230, file: !136, line: 36, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !230, file: !136, line: 37, baseType: !233, size: 32, offset: 32)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "latency_subs", scope: !192, file: !223, line: 52, type: !229, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !192, file: !223, line: 39, type: !239, isLocal: true, isDefinition: true)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, elements: !245)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !223, line: 35, size: 96, elements: !241)
!241 = !{!242, !243, !244}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !240, file: !223, line: 36, baseType: !114, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !240, file: !223, line: 37, baseType: !168, size: 8, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !240, file: !223, line: 38, baseType: !185, size: 32, offset: 64)
!245 = !{!246}
!246 = !DISubrange(count: 0)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !192, file: !223, line: 48, type: !210, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !251, file: !258, line: 47, type: !272, isLocal: true, isDefinition: true)
!251 = distinct !DICompileUnit(language: DW_LANG_C99, file: !252, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !253, retainedTypes: !254, globals: !255, splitDebugInlining: false, nameTableKind: None)
!252 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/sensor/tmp112")
!253 = !{!114}
!254 = !{!197, !103}
!255 = !{!256, !249, !268}
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "cpus_states", scope: !251, file: !258, line: 50, type: !259, isLocal: true, isDefinition: true)
!258 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 32, elements: !172)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !115, line: 114, size: 128, elements: !263)
!263 = !{!264, !265, !266, !267}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !262, file: !115, line: 115, baseType: !114, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !262, file: !115, line: 141, baseType: !168, size: 8, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !262, file: !115, line: 149, baseType: !148, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !262, file: !115, line: 156, baseType: !148, size: 32, offset: 96)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !251, file: !258, line: 55, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 8, elements: !172)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, elements: !245)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "static_regions", scope: !275, file: !282, line: 62, type: !417, isLocal: true, isDefinition: true)
!275 = distinct !DICompileUnit(language: DW_LANG_C99, file: !276, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !277, globals: !278, splitDebugInlining: false, nameTableKind: None)
!276 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/sensor/tmp112")
!277 = !{!197, !103, !148, !102}
!278 = !{!279, !273}
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !281, file: !282, line: 198, type: !405, isLocal: true, isDefinition: true)
!281 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !282, file: !282, line: 175, type: !283, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !275, retainedNodes: !402)
!282 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = !DISubroutineType(types: !284)
!284 = !{null, !285}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !287, line: 245, size: 1024, elements: !288)
!287 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!288 = !{!289, !356, !369, !370, !371, !372, !378, !397}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !286, file: !287, line: 247, baseType: !290, size: 384)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !287, line: 57, size: 384, elements: !291)
!291 = !{!292, !320, !328, !329, !330, !343, !344, !345}
!292 = !DIDerivedType(tag: DW_TAG_member, scope: !290, file: !287, line: 60, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !290, file: !287, line: 60, size: 64, elements: !294)
!294 = !{!295, !311}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !293, file: !287, line: 61, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !297, line: 49, baseType: !298)
!297 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !297, line: 37, size: 64, elements: !299)
!299 = !{!300, !306}
!300 = !DIDerivedType(tag: DW_TAG_member, scope: !298, file: !297, line: 38, baseType: !301, size: 32)
!301 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !298, file: !297, line: 38, size: 32, elements: !302)
!302 = !{!303, !305}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !301, file: !297, line: 39, baseType: !304, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !301, file: !297, line: 40, baseType: !304, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, scope: !298, file: !297, line: 42, baseType: !307, size: 32, offset: 32)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !298, file: !297, line: 42, size: 32, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !307, file: !297, line: 43, baseType: !304, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !307, file: !297, line: 44, baseType: !304, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !293, file: !287, line: 62, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !313, line: 49, size: 64, elements: !314)
!313 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !312, file: !313, line: 50, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 64, elements: !318)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!318 = !{!319}
!319 = !DISubrange(count: 2)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !290, file: !287, line: 68, baseType: !321, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !323, line: 233, baseType: !324)
!323 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 231, size: 64, elements: !325)
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !324, file: !323, line: 232, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !297, line: 48, baseType: !298)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !290, file: !287, line: 71, baseType: !168, size: 8, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !290, file: !287, line: 74, baseType: !168, size: 8, offset: 104)
!330 = !DIDerivedType(tag: DW_TAG_member, scope: !290, file: !287, line: 90, baseType: !331, size: 16, offset: 112)
!331 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !290, file: !287, line: 90, size: 16, elements: !332)
!332 = !{!333, !340}
!333 = !DIDerivedType(tag: DW_TAG_member, scope: !331, file: !287, line: 91, baseType: !334, size: 16)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !331, file: !287, line: 91, size: 16, elements: !335)
!335 = !{!336, !339}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !334, file: !287, line: 96, baseType: !337, size: 8)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !338)
!338 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !334, file: !287, line: 97, baseType: !168, size: 8, offset: 8)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !331, file: !287, line: 100, baseType: !341, size: 16)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !342)
!342 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !290, file: !287, line: 107, baseType: !148, size: 32, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !290, file: !287, line: 127, baseType: !102, size: 32, offset: 160)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !290, file: !287, line: 131, baseType: !346, size: 192, offset: 192)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !323, line: 244, size: 192, elements: !347)
!347 = !{!348, !349, !355}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !346, file: !323, line: 245, baseType: !296, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !346, file: !323, line: 246, baseType: !350, size: 32, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !323, line: 242, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !354}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !346, file: !323, line: 249, baseType: !128, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !286, file: !287, line: 250, baseType: !357, size: 288, offset: 384)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !358, line: 25, size: 288, elements: !359)
!358 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!359 = !{!360, !361, !362, !363, !364, !365, !366, !367, !368}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !357, file: !358, line: 26, baseType: !148, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !357, file: !358, line: 27, baseType: !148, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !357, file: !358, line: 28, baseType: !148, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !357, file: !358, line: 29, baseType: !148, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !357, file: !358, line: 30, baseType: !148, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !357, file: !358, line: 31, baseType: !148, size: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !357, file: !358, line: 32, baseType: !148, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !357, file: !358, line: 33, baseType: !148, size: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !357, file: !358, line: 34, baseType: !148, size: 32, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !286, file: !287, line: 253, baseType: !102, size: 32, offset: 672)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !286, file: !287, line: 256, baseType: !322, size: 64, offset: 704)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !286, file: !287, line: 294, baseType: !103, size: 32, offset: 768)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !286, file: !287, line: 300, baseType: !373, size: 96, offset: 800)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !287, line: 149, size: 96, elements: !374)
!374 = !{!375, !376, !377}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !373, file: !287, line: 153, baseType: !22, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !373, file: !287, line: 162, baseType: !197, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !373, file: !287, line: 168, baseType: !197, size: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !286, file: !287, line: 325, baseType: !379, size: 32, offset: 896)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 32)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !381, line: 5073, size: 192, elements: !382)
!381 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!382 = !{!383, !392, !393}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !380, file: !381, line: 5074, baseType: !384, size: 96)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !385, line: 56, size: 96, elements: !386)
!385 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!386 = !{!387, !390, !391}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !384, file: !385, line: 57, baseType: !388, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !385, line: 57, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !384, file: !385, line: 58, baseType: !102, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !384, file: !385, line: 59, baseType: !197, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !380, file: !381, line: 5075, baseType: !322, size: 64, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !380, file: !381, line: 5076, baseType: !394, size: 32, offset: 160)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, size: 32, elements: !395)
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !394, file: !156, line: 52, baseType: !22, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !286, file: !287, line: 343, baseType: !398, size: 64, offset: 928)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !358, line: 60, size: 64, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !398, file: !358, line: 63, baseType: !148, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !398, file: !358, line: 66, baseType: !148, size: 32, offset: 32)
!402 = !{!403, !404}
!403 = !DILocalVariable(name: "thread", arg: 1, scope: !281, file: !282, line: 175, type: !285)
!404 = !DILocalVariable(name: "region_num", scope: !281, file: !282, line: 200, type: !168)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, elements: !245)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !407, line: 52, size: 96, elements: !408)
!407 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!408 = !{!409, !410, !411}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !406, file: !407, line: 53, baseType: !22, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !406, file: !407, line: 54, baseType: !197, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !406, file: !407, line: 55, baseType: !412, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !413, line: 151, baseType: !414)
!413 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !413, line: 149, size: 32, elements: !415)
!415 = !{!416}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !414, file: !413, line: 150, baseType: !148, size: 32)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 96, elements: !172)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !421, file: !457, line: 39, type: !168, isLocal: true, isDefinition: true)
!421 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !423, globals: !456, splitDebugInlining: false, nameTableKind: None)
!422 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/sensor/tmp112")
!423 = !{!424, !102, !103, !442, !168}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !426, line: 1226, baseType: !427)
!426 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 1213, size: 352, elements: !428)
!428 = !{!429, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !427, file: !426, line: 1215, baseType: !430, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !148)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !427, file: !426, line: 1216, baseType: !431, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !427, file: !426, line: 1217, baseType: !431, size: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !427, file: !426, line: 1218, baseType: !431, size: 32, offset: 96)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !427, file: !426, line: 1219, baseType: !431, size: 32, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !427, file: !426, line: 1220, baseType: !431, size: 32, offset: 160)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !427, file: !426, line: 1221, baseType: !431, size: 32, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !427, file: !426, line: 1222, baseType: !431, size: 32, offset: 224)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !427, file: !426, line: 1223, baseType: !431, size: 32, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !427, file: !426, line: 1224, baseType: !431, size: 32, offset: 288)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !427, file: !426, line: 1225, baseType: !431, size: 32, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !445, line: 27, size: 96, elements: !446)
!445 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!446 = !{!447, !448, !451}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !444, file: !445, line: 29, baseType: !148, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !444, file: !445, line: 31, baseType: !449, size: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !444, file: !445, line: 37, baseType: !452, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !413, line: 146, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !413, line: 141, size: 32, elements: !454)
!454 = !{!455}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !453, file: !413, line: 143, baseType: !148, size: 32)
!456 = !{!419}
!457 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !460, file: !467, line: 21, type: !106, isLocal: true, isDefinition: true)
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !461, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !462, globals: !466, splitDebugInlining: false, nameTableKind: None)
!461 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/sensor/tmp112")
!462 = !{!463, !103, !102}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !465, line: 22, baseType: !103)
!465 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!466 = !{!458}
!467 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !470, file: !475, line: 13, type: !492, isLocal: true, isDefinition: true)
!470 = distinct !DICompileUnit(language: DW_LANG_C99, file: !471, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !472, splitDebugInlining: false, nameTableKind: None)
!471 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/sensor/tmp112")
!472 = !{!473, !468}
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "mpu_config", scope: !470, file: !475, line: 37, type: !476, isLocal: false, isDefinition: true)
!475 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !445, line: 41, size: 64, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !477, file: !445, line: 43, baseType: !148, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !477, file: !445, line: 45, baseType: !481, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !445, line: 27, size: 96, elements: !484)
!484 = !{!485, !486, !487}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !483, file: !445, line: 29, baseType: !148, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !483, file: !445, line: 31, baseType: !449, size: 32, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !483, file: !445, line: 37, baseType: !488, size: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !413, line: 146, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !413, line: 141, size: 32, elements: !490)
!490 = !{!491}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !489, file: !413, line: 143, baseType: !148, size: 32)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 192, elements: !318)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !495, file: !665, line: 93, type: !666, isLocal: true, isDefinition: true, align: 32)
!495 = distinct !DICompileUnit(language: DW_LANG_C99, file: !496, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !497, globals: !660, splitDebugInlining: false, nameTableKind: None)
!496 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/sensor/tmp112")
!497 = !{!498, !168, !102, !103, !578, !148, !579, !615, !626}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !500, line: 1071, baseType: !501)
!500 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !500, line: 1035, size: 19584, elements: !502)
!502 = !{!503, !507, !508, !509, !513, !514, !516, !517, !518, !519, !520, !521, !525, !526, !527, !531, !532, !536, !537, !541, !542, !546, !547, !548, !549, !550, !551, !552, !556, !557, !558, !559, !563, !564, !568}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !501, file: !500, line: 1036, baseType: !504, size: 960)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 960, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 30)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !501, file: !500, line: 1037, baseType: !431, size: 32, offset: 960)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !501, file: !500, line: 1038, baseType: !431, size: 32, offset: 992)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !501, file: !500, line: 1039, baseType: !510, size: 1088, offset: 1024)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 1088, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 34)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !501, file: !500, line: 1040, baseType: !431, size: 32, offset: 2112)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !501, file: !500, line: 1041, baseType: !515, size: 64, offset: 2144)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 64, elements: !318)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !501, file: !500, line: 1042, baseType: !431, size: 32, offset: 2208)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !501, file: !500, line: 1043, baseType: !431, size: 32, offset: 2240)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !501, file: !500, line: 1044, baseType: !431, size: 32, offset: 2272)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !501, file: !500, line: 1045, baseType: !431, size: 32, offset: 2304)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !501, file: !500, line: 1046, baseType: !431, size: 32, offset: 2336)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !501, file: !500, line: 1047, baseType: !522, size: 3808, offset: 2368)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 3808, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 119)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !501, file: !500, line: 1048, baseType: !431, size: 32, offset: 6176)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !501, file: !500, line: 1049, baseType: !431, size: 32, offset: 6208)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !501, file: !500, line: 1050, baseType: !528, size: 1952, offset: 6240)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 1952, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 61)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !501, file: !500, line: 1051, baseType: !431, size: 32, offset: 8192)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !501, file: !500, line: 1052, baseType: !533, size: 288, offset: 8224)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 288, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 9)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !501, file: !500, line: 1053, baseType: !430, size: 32, offset: 8512)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !501, file: !500, line: 1054, baseType: !538, size: 96, offset: 8544)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 96, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 3)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !501, file: !500, line: 1055, baseType: !430, size: 32, offset: 8640)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !501, file: !500, line: 1056, baseType: !543, size: 1568, offset: 8672)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 1568, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 49)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !501, file: !500, line: 1057, baseType: !431, size: 32, offset: 10240)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !501, file: !500, line: 1058, baseType: !538, size: 96, offset: 10272)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !501, file: !500, line: 1059, baseType: !431, size: 32, offset: 10368)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !501, file: !500, line: 1060, baseType: !515, size: 64, offset: 10400)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !501, file: !500, line: 1061, baseType: !431, size: 32, offset: 10464)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !501, file: !500, line: 1062, baseType: !431, size: 32, offset: 10496)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !501, file: !500, line: 1063, baseType: !553, size: 672, offset: 10528)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 672, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 21)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !501, file: !500, line: 1064, baseType: !431, size: 32, offset: 11200)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !501, file: !500, line: 1065, baseType: !430, size: 32, offset: 11232)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !501, file: !500, line: 1066, baseType: !431, size: 32, offset: 11264)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !501, file: !500, line: 1067, baseType: !560, size: 1504, offset: 11296)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 1504, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 47)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !501, file: !500, line: 1068, baseType: !430, size: 32, offset: 12800)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !501, file: !500, line: 1069, baseType: !565, size: 5600, offset: 12832)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 5600, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 175)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !501, file: !500, line: 1070, baseType: !569, size: 1152, offset: 18432)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, size: 1152, elements: !534)
!570 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !500, line: 278, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !500, line: 272, size: 128, elements: !573)
!573 = !{!574, !575, !576, !577}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !572, file: !500, line: 273, baseType: !431, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !572, file: !500, line: 274, baseType: !431, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !572, file: !500, line: 275, baseType: !431, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !572, file: !500, line: 277, baseType: !430, size: 32, offset: 96)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !426, line: 468, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 445, size: 1120, elements: !582)
!582 = !{!583, !584, !585, !586, !587, !588, !589, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !608, !612, !614}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !581, file: !426, line: 447, baseType: !430, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !581, file: !426, line: 448, baseType: !431, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !581, file: !426, line: 449, baseType: !431, size: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !581, file: !426, line: 450, baseType: !431, size: 32, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !581, file: !426, line: 451, baseType: !431, size: 32, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !581, file: !426, line: 452, baseType: !431, size: 32, offset: 160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !581, file: !426, line: 453, baseType: !590, size: 96, offset: 192)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 96, elements: !592)
!591 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !168)
!592 = !{!593}
!593 = !DISubrange(count: 12)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !581, file: !426, line: 454, baseType: !431, size: 32, offset: 288)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !581, file: !426, line: 455, baseType: !431, size: 32, offset: 320)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !581, file: !426, line: 456, baseType: !431, size: 32, offset: 352)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !581, file: !426, line: 457, baseType: !431, size: 32, offset: 384)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !581, file: !426, line: 458, baseType: !431, size: 32, offset: 416)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !581, file: !426, line: 459, baseType: !431, size: 32, offset: 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !581, file: !426, line: 460, baseType: !431, size: 32, offset: 480)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !581, file: !426, line: 461, baseType: !515, size: 64, offset: 512)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !581, file: !426, line: 462, baseType: !430, size: 32, offset: 576)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !581, file: !426, line: 463, baseType: !430, size: 32, offset: 608)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !581, file: !426, line: 464, baseType: !605, size: 128, offset: 640)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 128, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 4)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !581, file: !426, line: 465, baseType: !609, size: 160, offset: 768)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 160, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 5)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !581, file: !426, line: 466, baseType: !613, size: 160, offset: 928)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 160, elements: !610)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !581, file: !426, line: 467, baseType: !431, size: 32, offset: 1088)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !617, file: !616, line: 167, baseType: !625)
!616 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!617 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !616, file: !616, line: 134, type: !618, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !495, retainedNodes: !620)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !148}
!620 = !{!621, !622, !624}
!621 = !DILocalVariable(name: "time_us", arg: 1, scope: !617, file: !616, line: 134, type: !148)
!622 = !DILocalVariable(name: "delay_cycles", scope: !617, file: !616, line: 168, type: !623)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !615)
!624 = !DILocalVariable(name: "cycles", scope: !617, file: !616, line: 171, type: !148)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !500, line: 2399, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !500, line: 2373, size: 10880, elements: !629)
!629 = !{!630, !634, !635, !636, !637, !641, !642, !647, !648, !649, !650, !651, !652, !656, !657, !658, !659}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !628, file: !500, line: 2374, baseType: !631, size: 8192)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 8192, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !628, file: !500, line: 2375, baseType: !430, size: 32, offset: 8192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !628, file: !500, line: 2376, baseType: !430, size: 32, offset: 8224)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !628, file: !500, line: 2377, baseType: !430, size: 32, offset: 8256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !628, file: !500, line: 2378, baseType: !638, size: 1984, offset: 8288)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 1984, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 62)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !628, file: !500, line: 2379, baseType: !431, size: 32, offset: 10272)
!642 = !DIDerivedType(tag: DW_TAG_member, scope: !628, file: !500, line: 2381, baseType: !643, size: 32, offset: 10304)
!643 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !628, file: !500, line: 2381, size: 32, elements: !644)
!644 = !{!645, !646}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !643, file: !500, line: 2382, baseType: !431, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !643, file: !500, line: 2383, baseType: !431, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !628, file: !500, line: 2386, baseType: !431, size: 32, offset: 10336)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !628, file: !500, line: 2387, baseType: !431, size: 32, offset: 10368)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !628, file: !500, line: 2389, baseType: !431, size: 32, offset: 10400)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !628, file: !500, line: 2391, baseType: !431, size: 32, offset: 10432)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !628, file: !500, line: 2393, baseType: !431, size: 32, offset: 10464)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !628, file: !500, line: 2394, baseType: !653, size: 256, offset: 10496)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 256, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 8)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !628, file: !500, line: 2395, baseType: !431, size: 32, offset: 10752)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !628, file: !500, line: 2396, baseType: !430, size: 32, offset: 10784)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !628, file: !500, line: 2397, baseType: !431, size: 32, offset: 10816)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !628, file: !500, line: 2398, baseType: !431, size: 32, offset: 10848)
!660 = !{!493, !661}
!661 = !DIGlobalVariableExpression(var: !662, expr: !DIExpression())
!662 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !617, file: !616, line: 161, type: !663, isLocal: true, isDefinition: true, align: 128)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 48, elements: !539)
!664 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !341)
!665 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !668, line: 51, size: 64, elements: !669)
!668 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!669 = !{!670, !677}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !667, file: !668, line: 60, baseType: !671, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = !DISubroutineType(types: !673)
!673 = !{!103, !674}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !676)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !668, line: 48, flags: DIFlagFwdDecl)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !667, file: !668, line: 65, baseType: !674, size: 32, offset: 32)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "__device_dts_ord_38", scope: !680, file: !916, line: 733, type: !1022, isLocal: false, isDefinition: true, align: 32)
!680 = distinct !DICompileUnit(language: DW_LANG_C99, file: !681, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !682, retainedTypes: !825, globals: !912, splitDebugInlining: false, nameTableKind: None)
!681 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/sensor/tmp112")
!682 = !{!683, !689, !30, !694, !699, !706, !714, !722, !731, !735, !790, !797, !816}
!683 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !684, line: 23, baseType: !32, size: 32, elements: !685)
!684 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!685 = !{!686, !687, !688}
!686 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!687 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!688 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!689 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !684, line: 48, baseType: !32, size: 32, elements: !690)
!690 = !{!691, !692, !693}
!691 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!692 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!693 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!694 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !695, line: 167, baseType: !32, size: 32, elements: !696)
!695 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!696 = !{!697, !698}
!697 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!698 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!699 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !695, line: 107, baseType: !32, size: 32, elements: !700)
!700 = !{!701, !702, !703, !704, !705}
!701 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!702 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!703 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!704 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!705 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!706 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !695, line: 208, baseType: !32, size: 32, elements: !707)
!707 = !{!708, !709, !710, !711, !712, !713}
!708 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!709 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!710 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!711 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!712 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!713 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!714 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !695, line: 261, baseType: !32, size: 32, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721}
!716 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!717 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!718 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!719 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!720 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!721 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!722 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !695, line: 237, baseType: !32, size: 32, elements: !723)
!723 = !{!724, !725, !726, !727, !728, !729, !730}
!724 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!725 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!726 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!727 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!728 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!729 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!730 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !695, line: 152, baseType: !32, size: 32, elements: !732)
!732 = !{!733, !734}
!733 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!734 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!735 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !500, line: 71, baseType: !103, size: 32, elements: !736)
!736 = !{!737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789}
!737 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!738 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!739 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!740 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!741 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!742 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!743 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!744 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!745 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!746 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!747 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!748 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!749 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!750 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!751 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!752 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!753 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!754 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!755 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!756 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!757 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!758 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!759 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!760 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!761 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!762 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!763 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!764 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!765 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!766 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!767 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!768 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!769 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!770 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!771 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!772 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!773 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!774 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!775 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!776 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!777 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!778 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!779 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!780 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!781 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!782 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!783 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!784 = !DIEnumerator(name: "USBD_IRQn", value: 39)
!785 = !DIEnumerator(name: "UARTE1_IRQn", value: 40)
!786 = !DIEnumerator(name: "QSPI_IRQn", value: 41)
!787 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 42)
!788 = !DIEnumerator(name: "PWM3_IRQn", value: 45)
!789 = !DIEnumerator(name: "SPIM3_IRQn", value: 47)
!790 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !791, line: 44, baseType: !32, size: 32, elements: !792)
!791 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!792 = !{!793, !794, !795, !796}
!793 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!794 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!795 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!796 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!797 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !798, line: 54, baseType: !32, size: 32, elements: !799)
!798 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!799 = !{!800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815}
!800 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!801 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!802 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!803 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!804 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!805 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!806 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!807 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!808 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!809 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!810 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!811 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!812 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!813 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!814 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!815 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!816 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !817, line: 53, baseType: !32, size: 32, elements: !818)
!817 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!818 = !{!819, !820, !821, !822, !823, !824}
!819 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!820 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!821 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!822 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!823 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!824 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!825 = !{!683, !102, !103, !826, !875, !876, !877, !878, !126, !148, !149, !879, !578, !880, !210, !881, !911, !197}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !500, line: 1022, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !500, line: 979, size: 11712, elements: !829)
!829 = !{!830, !831, !832, !833, !834, !835, !836, !837, !841, !842, !843, !844, !845, !846, !847, !848, !849, !853, !854, !855, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !828, file: !500, line: 980, baseType: !431, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !828, file: !500, line: 981, baseType: !431, size: 32, offset: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !828, file: !500, line: 982, baseType: !431, size: 32, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !828, file: !500, line: 983, baseType: !431, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !828, file: !500, line: 984, baseType: !431, size: 32, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !828, file: !500, line: 985, baseType: !431, size: 32, offset: 160)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !828, file: !500, line: 986, baseType: !431, size: 32, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !828, file: !500, line: 987, baseType: !838, size: 1824, offset: 224)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 1824, elements: !839)
!839 = !{!840}
!840 = !DISubrange(count: 57)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !828, file: !500, line: 988, baseType: !431, size: 32, offset: 2048)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !828, file: !500, line: 989, baseType: !431, size: 32, offset: 2080)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !828, file: !500, line: 990, baseType: !430, size: 32, offset: 2112)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !828, file: !500, line: 991, baseType: !431, size: 32, offset: 2144)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !828, file: !500, line: 992, baseType: !431, size: 32, offset: 2176)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !828, file: !500, line: 993, baseType: !609, size: 160, offset: 2208)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTARTED", scope: !828, file: !500, line: 994, baseType: !431, size: 32, offset: 2368)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTOPPED", scope: !828, file: !500, line: 996, baseType: !431, size: 32, offset: 2400)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !828, file: !500, line: 998, baseType: !850, size: 3744, offset: 2432)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 3744, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 117)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !828, file: !500, line: 999, baseType: !431, size: 32, offset: 6176)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !828, file: !500, line: 1000, baseType: !431, size: 32, offset: 6208)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !828, file: !500, line: 1001, baseType: !856, size: 2016, offset: 6240)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 2016, elements: !857)
!857 = !{!858}
!858 = !DISubrange(count: 63)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !828, file: !500, line: 1002, baseType: !430, size: 32, offset: 8256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !828, file: !500, line: 1004, baseType: !430, size: 32, offset: 8288)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !828, file: !500, line: 1005, baseType: !430, size: 32, offset: 8320)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !828, file: !500, line: 1006, baseType: !430, size: 32, offset: 8352)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !828, file: !500, line: 1008, baseType: !430, size: 32, offset: 8384)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !828, file: !500, line: 1009, baseType: !430, size: 32, offset: 8416)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !828, file: !500, line: 1011, baseType: !638, size: 1984, offset: 8448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !828, file: !500, line: 1012, baseType: !431, size: 32, offset: 10432)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !828, file: !500, line: 1013, baseType: !538, size: 96, offset: 10464)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "HFXODEBOUNCE", scope: !828, file: !500, line: 1014, baseType: !431, size: 32, offset: 10560)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !828, file: !500, line: 1016, baseType: !538, size: 96, offset: 10592)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !828, file: !500, line: 1017, baseType: !431, size: 32, offset: 10688)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !828, file: !500, line: 1018, baseType: !653, size: 256, offset: 10720)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !828, file: !500, line: 1019, baseType: !431, size: 32, offset: 10976)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !828, file: !500, line: 1020, baseType: !553, size: 672, offset: 11008)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "LFRCMODE", scope: !828, file: !500, line: 1021, baseType: !431, size: 32, offset: 11680)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !695, line: 146, baseType: !699)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !695, line: 164, baseType: !731)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 32)
!879 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !426, line: 426, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 411, size: 28704, elements: !884)
!884 = !{!885, !887, !891, !892, !893, !894, !895, !896, !897, !898, !902, !906, !910}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !883, file: !426, line: 413, baseType: !886, size: 256)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 256, elements: !654)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !883, file: !426, line: 414, baseType: !888, size: 768, offset: 256)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 768, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 24)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !883, file: !426, line: 415, baseType: !886, size: 256, offset: 1024)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !883, file: !426, line: 416, baseType: !888, size: 768, offset: 1280)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !883, file: !426, line: 417, baseType: !886, size: 256, offset: 2048)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !883, file: !426, line: 418, baseType: !888, size: 768, offset: 2304)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !883, file: !426, line: 419, baseType: !886, size: 256, offset: 3072)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !883, file: !426, line: 420, baseType: !888, size: 768, offset: 3328)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !883, file: !426, line: 421, baseType: !886, size: 256, offset: 4096)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !883, file: !426, line: 422, baseType: !899, size: 1792, offset: 4352)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 1792, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 56)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !883, file: !426, line: 423, baseType: !903, size: 1920, offset: 6144)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 1920, elements: !904)
!904 = !{!905}
!905 = !DISubrange(count: 240)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !883, file: !426, line: 424, baseType: !907, size: 20608, offset: 8064)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 20608, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 644)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !883, file: !426, line: 425, baseType: !431, size: 32, offset: 28672)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !791, line: 56, baseType: !102)
!912 = !{!913, !965, !1006, !678, !1012, !1038, !1040, !1057, !1059, !1069, !1072, !1087, !1125, !1139}
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "on", scope: !915, file: !916, line: 549, type: !185, isLocal: true, isDefinition: true)
!915 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !916, file: !916, line: 547, type: !917, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !680, retainedNodes: !919)
!916 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!917 = !DISubroutineType(types: !918)
!918 = !{null, !689}
!919 = !{!920, !921, !924}
!920 = !DILocalVariable(name: "start_mode", arg: 1, scope: !915, file: !916, line: 547, type: !689)
!921 = !DILocalVariable(name: "err", scope: !922, file: !916, line: 553, type: !103)
!922 = distinct !DILexicalBlock(scope: !923, file: !916, line: 552, column: 31)
!923 = distinct !DILexicalBlock(scope: !915, file: !916, line: 552, column: 6)
!924 = !DILocalVariable(name: "mgr", scope: !922, file: !916, line: 554, type: !925)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !927, line: 154, size: 256, elements: !928)
!927 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!928 = !{!929, !941, !942, !958, !962, !963, !964}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !926, file: !927, line: 158, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !932)
!932 = !{!933, !940}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !931, file: !136, line: 36, baseType: !934, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !937)
!937 = !{!938}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !936, file: !136, line: 30, baseType: !939, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !931, file: !136, line: 37, baseType: !934, size: 32, offset: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !926, file: !927, line: 163, baseType: !930, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !926, file: !927, line: 166, baseType: !943, size: 32, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !927, line: 133, size: 96, elements: !946)
!946 = !{!947, !956, !957}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !945, file: !927, line: 135, baseType: !948, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !927, line: 129, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 32)
!950 = !DISubroutineType(types: !951)
!951 = !{null, !925, !952}
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !927, line: 101, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 32)
!954 = !DISubroutineType(types: !955)
!955 = !{null, !925, !103}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !945, file: !927, line: 138, baseType: !948, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !945, file: !927, line: 143, baseType: !948, size: 32, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !926, file: !927, line: 169, baseType: !959, size: 32, offset: 160)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, size: 32, elements: !960)
!960 = !{!961}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !959, file: !156, line: 52, baseType: !22, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !926, file: !927, line: 172, baseType: !103, size: 32, offset: 192)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !926, file: !927, line: 175, baseType: !341, size: 16, offset: 224)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !926, file: !927, line: 178, baseType: !341, size: 16, offset: 240)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(name: "cli", scope: !915, file: !916, line: 550, type: !967, isLocal: true, isDefinition: true)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !927, line: 273, size: 128, elements: !968)
!968 = !{!969, !970}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !967, file: !927, line: 280, baseType: !935, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !967, file: !927, line: 283, baseType: !971, size: 96, offset: 32)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !972, line: 138, size: 96, elements: !973)
!972 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!973 = !{!974, !1003, !1004}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !971, file: !972, line: 149, baseType: !975, size: 32)
!975 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !972, line: 139, size: 32, elements: !976)
!976 = !{!977, !998}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !975, file: !972, line: 145, baseType: !978, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !381, line: 5397, size: 128, elements: !980)
!980 = !{!981, !996, !997}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !979, file: !381, line: 5399, baseType: !982, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !297, line: 48, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !297, line: 37, size: 64, elements: !984)
!984 = !{!985, !991}
!985 = !DIDerivedType(tag: DW_TAG_member, scope: !983, file: !297, line: 38, baseType: !986, size: 32)
!986 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !983, file: !297, line: 38, size: 32, elements: !987)
!987 = !{!988, !990}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !986, file: !297, line: 39, baseType: !989, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !986, file: !297, line: 40, baseType: !989, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, scope: !983, file: !297, line: 42, baseType: !992, size: 32, offset: 32)
!992 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !983, file: !297, line: 42, size: 32, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !992, file: !297, line: 43, baseType: !989, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !992, file: !297, line: 44, baseType: !989, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !979, file: !381, line: 5405, baseType: !32, size: 32, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !979, file: !381, line: 5408, baseType: !103, size: 32, offset: 96)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !975, file: !972, line: 148, baseType: !999, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !972, line: 98, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{null, null}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !971, file: !972, line: 165, baseType: !431, size: 32, offset: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !971, file: !972, line: 174, baseType: !1005, size: 32, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_38", scope: !680, file: !916, line: 733, type: !1008, isLocal: false, isDefinition: true, align: 16)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1009, size: 80, elements: !610)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !1011, line: 43, baseType: !195)
!1011 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_38", scope: !680, file: !916, line: 733, type: !1014, isLocal: true, isDefinition: true, align: 32)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !668, line: 51, size: 64, elements: !1016)
!1016 = !{!1017, !1037}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1015, file: !668, line: 60, baseType: !1018, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 32)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!103, !1021}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !1011, line: 378, size: 192, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1034, !1035}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1023, file: !1011, line: 380, baseType: !449, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1023, file: !1011, line: 382, baseType: !13, size: 32, offset: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1023, file: !1011, line: 384, baseType: !13, size: 32, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1023, file: !1011, line: 386, baseType: !1029, size: 32, offset: 96)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 32)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !1011, line: 351, size: 16, elements: !1031)
!1031 = !{!1032, !1033}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1030, file: !1011, line: 359, baseType: !168, size: 8)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1030, file: !1011, line: 364, baseType: !879, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1023, file: !1011, line: 388, baseType: !102, size: 32, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1023, file: !1011, line: 396, baseType: !1036, size: 32, offset: 160)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1015, file: !668, line: 65, baseType: !1021, size: 32, offset: 32)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !680, file: !916, line: 79, type: !185, isLocal: true, isDefinition: true)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(name: "data", scope: !680, file: !916, line: 702, type: !1042, isLocal: true, isDefinition: true)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !916, line: 69, size: 704, elements: !1043)
!1043 = !{!1044, !1046}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !1042, file: !916, line: 70, baseType: !1045, size: 512)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 512, elements: !318)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !1042, file: !916, line: 71, baseType: !1047, size: 192, offset: 512)
