; ModuleID = 'build/adafruit_feather_m0_basic_proto/synchronization/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/synchronization/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/synchronization")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/synchronization")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "threadA_sem", scope: !27, file: !116, line: 72, type: !117, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/synchronization")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !106, !107, !109, !110, !111}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !103, line: 46, baseType: !104)
!103 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !105)
!105 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 214, baseType: !32)
!108 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!25, !114, !143, !153, !251, !253}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "threadB_sem", scope: !27, file: !116, line: 73, type: !117, isLocal: false, isDefinition: true, align: 32)
!116 = !DIFile(filename: "zephyr/samples/synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !118, line: 2909, size: 128, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120, !141, !142}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !117, file: !118, line: 2910, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !123, file: !122, line: 232, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !129)
!129 = !{!130, !136}
!130 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 38, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 38, size: 32, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !127, line: 39, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !127, line: 40, baseType: !134, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 42, baseType: !137, size: 32, offset: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 42, size: 32, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !137, file: !127, line: 43, baseType: !134, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !127, line: 44, baseType: !134, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !117, file: !118, line: 2911, baseType: !32, size: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !117, file: !118, line: 2912, baseType: !32, size: 32, offset: 96)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "threadA_stack_area", scope: !27, file: !116, line: 88, type: !145, isLocal: false, isDefinition: true, align: 64)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 8192, elements: !151)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !147, line: 47, size: 8, elements: !148)
!147 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !147, line: 48, baseType: !150, size: 8)
!150 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!151 = !{!152}
!152 = !DISubrange(count: 1024)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "threadA_data", scope: !27, file: !116, line: 89, type: !155, isLocal: true, isDefinition: true)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !156, line: 245, size: 1216, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{!158, !208, !221, !222, !223, !227, !228, !246}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !155, file: !156, line: 247, baseType: !159, size: 448)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !156, line: 57, size: 448, elements: !160)
!160 = !{!161, !175, !177, !180, !181, !194, !195, !196, !197}
!161 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 60, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 60, size: 64, elements: !163)
!163 = !{!164, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !162, file: !156, line: 61, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !162, file: !156, line: 62, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 49, size: 64, elements: !169)
!168 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !167, file: !168, line: 50, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!173 = !{!174}
!174 = !DISubrange(count: 2)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !159, file: !156, line: 68, baseType: !176, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !159, file: !156, line: 71, baseType: !178, size: 8, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !179)
!179 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !159, file: !156, line: 74, baseType: !178, size: 8, offset: 104)
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 90, baseType: !182, size: 16, offset: 112)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 90, size: 16, elements: !183)
!183 = !{!184, !191}
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !182, file: !156, line: 91, baseType: !185, size: 16)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !182, file: !156, line: 91, size: 16, elements: !186)
!186 = !{!187, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !185, file: !156, line: 96, baseType: !188, size: 8)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !189)
!189 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !185, file: !156, line: 97, baseType: !178, size: 8, offset: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !182, file: !156, line: 100, baseType: !192, size: 16)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !193)
!193 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !159, file: !156, line: 107, baseType: !110, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_mask", scope: !159, file: !156, line: 123, baseType: !178, size: 8, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !159, file: !156, line: 127, baseType: !106, size: 32, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !159, file: !156, line: 131, baseType: !198, size: 192, offset: 256)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !199)
!199 = !{!200, !201, !207}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !198, file: !122, line: 245, baseType: !165, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !198, file: !122, line: 246, baseType: !202, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !198, file: !122, line: 249, baseType: !104, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !155, file: !156, line: 250, baseType: !209, size: 288, offset: 448)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !210, line: 25, size: 288, elements: !211)
!210 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !209, file: !210, line: 26, baseType: !110, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !209, file: !210, line: 27, baseType: !110, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !209, file: !210, line: 28, baseType: !110, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !209, file: !210, line: 29, baseType: !110, size: 32, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !209, file: !210, line: 30, baseType: !110, size: 32, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !209, file: !210, line: 31, baseType: !110, size: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !209, file: !210, line: 32, baseType: !110, size: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !209, file: !210, line: 33, baseType: !110, size: 32, offset: 224)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !209, file: !210, line: 34, baseType: !110, size: 32, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !155, file: !156, line: 253, baseType: !106, size: 32, offset: 736)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !155, file: !156, line: 256, baseType: !121, size: 64, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !155, file: !156, line: 279, baseType: !224, size: 256, offset: 832)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !155, file: !156, line: 294, baseType: !109, size: 32, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !155, file: !156, line: 325, baseType: !229, size: 32, offset: 1120)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 160, elements: !231)
!231 = !{!232, !241, !242}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !230, file: !118, line: 5074, baseType: !233, size: 96)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !234, line: 56, size: 96, elements: !235)
!234 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = !{!236, !239, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !233, file: !234, line: 57, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !234, line: 57, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !233, file: !234, line: 58, baseType: !106, size: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !233, file: !234, line: 59, baseType: !107, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !230, file: !118, line: 5075, baseType: !121, size: 64, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !230, file: !118, line: 5076, baseType: !243, offset: 160)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !244, line: 43, elements: !245)
!244 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!245 = !{}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !155, file: !156, line: 343, baseType: !247, size: 64, offset: 1152)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !210, line: 60, size: 64, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !247, file: !210, line: 63, baseType: !110, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !247, file: !210, line: 66, baseType: !110, size: 32, offset: 32)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "threadB_stack_area", scope: !27, file: !116, line: 91, type: !145, isLocal: false, isDefinition: true, align: 64)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "threadB_data", scope: !27, file: !116, line: 92, type: !155, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "_char_out", scope: !257, file: !261, line: 54, type: !262, isLocal: false, isDefinition: true)
!257 = distinct !DICompileUnit(language: DW_LANG_C99, file: !258, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !259, globals: !260, splitDebugInlining: false, nameTableKind: None)
!258 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/synchronization")
!259 = !{!106, !109}
!260 = !{!255}
!261 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DISubroutineType(types: !264)
!264 = !{!109, !109}
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !267, file: !1001, line: 202, type: !1002, isLocal: true, isDefinition: true, align: 32)
!267 = distinct !DICompileUnit(language: DW_LANG_C99, file: !268, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !269, globals: !1000, splitDebugInlining: false, nameTableKind: None)
!268 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/synchronization")
!269 = !{!106, !109, !270, !392, !731, !732, !799}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !272, line: 335, baseType: !273)
!272 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !272, line: 320, size: 288, elements: !274)
!274 = !{!275, !286, !292, !306, !317, !328, !332, !343, !344, !355, !356, !371, !372, !382}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !273, file: !272, line: 321, baseType: !276, size: 16)
!276 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !272, line: 50, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !272, line: 43, size: 16, elements: !279)
!279 = !{!280, !285}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !278, file: !272, line: 48, baseType: !281, size: 16)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !278, file: !272, line: 44, size: 16, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !281, file: !272, line: 45, baseType: !192, size: 7, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !281, file: !272, line: 47, baseType: !192, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !278, file: !272, line: 49, baseType: !192, size: 16)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !273, file: !272, line: 322, baseType: !287, size: 16, offset: 16)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 16, elements: !173)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !289, line: 52, baseType: !290)
!289 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !178)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !273, file: !272, line: 323, baseType: !293, size: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !272, line: 107, baseType: !295)
!295 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !272, line: 94, size: 32, elements: !296)
!296 = !{!297, !305}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !295, file: !272, line: 105, baseType: !298, size: 32)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !295, file: !272, line: 95, size: 32, elements: !299)
!299 = !{!300, !301, !302, !303, !304}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !298, file: !272, line: 97, baseType: !110, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !298, file: !272, line: 99, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !298, file: !272, line: 100, baseType: !110, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !298, file: !272, line: 102, baseType: !110, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !298, file: !272, line: 103, baseType: !110, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !295, file: !272, line: 106, baseType: !110, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !273, file: !272, line: 324, baseType: !307, size: 32, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !272, line: 155, baseType: !309)
!309 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !272, line: 148, size: 32, elements: !310)
!310 = !{!311, !316}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !309, file: !272, line: 153, baseType: !312, size: 32)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !309, file: !272, line: 149, size: 32, elements: !313)
!313 = !{!314, !315}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !312, file: !272, line: 150, baseType: !110, size: 16, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !312, file: !272, line: 151, baseType: !110, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !309, file: !272, line: 154, baseType: !110, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !273, file: !272, line: 325, baseType: !318, size: 8, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !272, line: 194, baseType: !320)
!320 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !272, line: 187, size: 8, elements: !321)
!321 = !{!322, !327}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !320, file: !272, line: 192, baseType: !323, size: 8)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !320, file: !272, line: 188, size: 8, elements: !324)
!324 = !{!325, !326}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !323, file: !272, line: 189, baseType: !178, size: 1, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !323, file: !272, line: 190, baseType: !178, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !320, file: !272, line: 193, baseType: !178, size: 8)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !273, file: !272, line: 326, baseType: !329, size: 24, offset: 104)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 24, elements: !330)
!330 = !{!331}
!331 = !DISubrange(count: 3)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !273, file: !272, line: 327, baseType: !333, size: 8, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !272, line: 215, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !272, line: 208, size: 8, elements: !336)
!336 = !{!337, !342}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !335, file: !272, line: 213, baseType: !338, size: 8)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !335, file: !272, line: 209, size: 8, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !338, file: !272, line: 210, baseType: !178, size: 1, flags: DIFlagBitField, extraData: i64 0)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !338, file: !272, line: 211, baseType: !178, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !335, file: !272, line: 214, baseType: !178, size: 8)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !273, file: !272, line: 328, baseType: !329, size: 24, offset: 136)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !273, file: !272, line: 329, baseType: !345, size: 8, offset: 160)
!345 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !272, line: 236, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !272, line: 229, size: 8, elements: !348)
!348 = !{!349, !354}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !347, file: !272, line: 234, baseType: !350, size: 8)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !347, file: !272, line: 230, size: 8, elements: !351)
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !350, file: !272, line: 231, baseType: !290, size: 1, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !350, file: !272, line: 232, baseType: !290, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !347, file: !272, line: 235, baseType: !178, size: 8)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !273, file: !272, line: 330, baseType: !329, size: 24, offset: 168)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !273, file: !272, line: 331, baseType: !357, size: 16, offset: 192)
!357 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !272, line: 262, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !272, line: 250, size: 16, elements: !360)
!360 = !{!361, !370}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !359, file: !272, line: 260, baseType: !362, size: 16)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !359, file: !272, line: 251, size: 16, elements: !363)
!363 = !{!364, !365, !366, !367, !368, !369}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !362, file: !272, line: 252, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !362, file: !272, line: 253, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !362, file: !272, line: 254, baseType: !192, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !362, file: !272, line: 255, baseType: !192, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !362, file: !272, line: 256, baseType: !192, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !362, file: !272, line: 258, baseType: !192, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !359, file: !272, line: 261, baseType: !192, size: 16)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !273, file: !272, line: 332, baseType: !287, size: 16, offset: 208)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !273, file: !272, line: 333, baseType: !373, size: 32, offset: 224)
!373 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !272, line: 290, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !272, line: 284, size: 32, elements: !376)
!376 = !{!377, !381}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !375, file: !272, line: 288, baseType: !378, size: 32)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !375, file: !272, line: 285, size: 32, elements: !379)
!379 = !{!380}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !378, file: !272, line: 286, baseType: !110, size: 22, flags: DIFlagBitField, extraData: i64 0)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !375, file: !272, line: 289, baseType: !110, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !273, file: !272, line: 334, baseType: !383, size: 16, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !384)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !272, line: 308, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !272, line: 303, size: 16, elements: !386)
!386 = !{!387, !391}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !385, file: !272, line: 306, baseType: !388, size: 16)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !385, file: !272, line: 304, size: 16, elements: !389)
!389 = !{!390}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !388, file: !272, line: 305, baseType: !192, size: 16, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !385, file: !272, line: 307, baseType: !192, size: 16)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !394, line: 928, baseType: !395)
!394 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 899, size: 672, elements: !396)
!396 = !{!397, !421, !445, !471, !496, !512, !513, !531, !532, !549, !560, !561, !576, !596, !597, !609, !621, !631, !632, !649, !653, !664, !665, !677, !689, !690, !701, !717}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !395, file: !394, line: 900, baseType: !398, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !399)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !394, line: 64, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 43, size: 32, elements: !401)
!401 = !{!402, !420}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !400, file: !394, line: 62, baseType: !403, size: 32)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !394, line: 44, size: 32, elements: !404)
!404 = !{!405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !403, file: !394, line: 45, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !403, file: !394, line: 46, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !403, file: !394, line: 47, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !403, file: !394, line: 48, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !403, file: !394, line: 49, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !403, file: !394, line: 50, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !403, file: !394, line: 51, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !403, file: !394, line: 52, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !403, file: !394, line: 53, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !403, file: !394, line: 54, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !403, file: !394, line: 55, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !403, file: !394, line: 56, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !403, file: !394, line: 58, baseType: !110, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !403, file: !394, line: 59, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !403, file: !394, line: 60, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !400, file: !394, line: 63, baseType: !110, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !395, file: !394, line: 901, baseType: !422, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !394, line: 125, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 104, size: 32, elements: !425)
!425 = !{!426, !444}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !424, file: !394, line: 123, baseType: !427, size: 32)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !424, file: !394, line: 105, size: 32, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !427, file: !394, line: 106, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !427, file: !394, line: 107, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !427, file: !394, line: 108, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !427, file: !394, line: 109, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !427, file: !394, line: 110, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !427, file: !394, line: 111, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !427, file: !394, line: 112, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !427, file: !394, line: 113, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !427, file: !394, line: 114, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !427, file: !394, line: 115, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !427, file: !394, line: 116, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !427, file: !394, line: 117, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !427, file: !394, line: 119, baseType: !110, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !427, file: !394, line: 120, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !427, file: !394, line: 121, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !424, file: !394, line: 124, baseType: !110, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !395, file: !394, line: 902, baseType: !446, size: 32, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !394, line: 186, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 165, size: 32, elements: !449)
!449 = !{!450, !470}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !448, file: !394, line: 184, baseType: !451, size: 32)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !448, file: !394, line: 166, size: 32, elements: !452)
!452 = !{!453, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !451, file: !394, line: 167, baseType: !454, size: 1, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !451, file: !394, line: 168, baseType: !454, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !451, file: !394, line: 169, baseType: !454, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !451, file: !394, line: 170, baseType: !454, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !451, file: !394, line: 171, baseType: !454, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !451, file: !394, line: 172, baseType: !454, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !451, file: !394, line: 173, baseType: !454, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !451, file: !394, line: 174, baseType: !454, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !451, file: !394, line: 175, baseType: !454, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !451, file: !394, line: 176, baseType: !454, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !451, file: !394, line: 177, baseType: !454, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !451, file: !394, line: 178, baseType: !454, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !451, file: !394, line: 180, baseType: !454, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !451, file: !394, line: 181, baseType: !454, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !451, file: !394, line: 182, baseType: !454, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !448, file: !394, line: 185, baseType: !110, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !395, file: !394, line: 903, baseType: !472, size: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !394, line: 247, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 226, size: 32, elements: !476)
!476 = !{!477, !495}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !475, file: !394, line: 245, baseType: !478, size: 32)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !475, file: !394, line: 227, size: 32, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !478, file: !394, line: 228, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !478, file: !394, line: 229, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !478, file: !394, line: 230, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !478, file: !394, line: 231, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !478, file: !394, line: 232, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !478, file: !394, line: 233, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !478, file: !394, line: 234, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !478, file: !394, line: 235, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !478, file: !394, line: 236, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !478, file: !394, line: 237, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !478, file: !394, line: 238, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !478, file: !394, line: 239, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !478, file: !394, line: 241, baseType: !110, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !478, file: !394, line: 242, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !478, file: !394, line: 243, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !475, file: !394, line: 246, baseType: !110, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !395, file: !394, line: 904, baseType: !497, size: 16, offset: 128)
!497 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !394, line: 300, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 287, size: 16, elements: !500)
!500 = !{!501, !511}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !499, file: !394, line: 298, baseType: !502, size: 16)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !499, file: !394, line: 288, size: 16, elements: !503)
!503 = !{!504, !505, !506, !507, !508, !509, !510}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !502, file: !394, line: 290, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !502, file: !394, line: 291, baseType: !192, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !502, file: !394, line: 293, baseType: !192, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !502, file: !394, line: 294, baseType: !192, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !502, file: !394, line: 295, baseType: !192, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !502, file: !394, line: 296, baseType: !192, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !502, file: !394, line: 297, baseType: !192, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !499, file: !394, line: 299, baseType: !192, size: 16)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !395, file: !394, line: 905, baseType: !287, size: 16, offset: 144)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !395, file: !394, line: 906, baseType: !514, size: 16, offset: 160)
!514 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !394, line: 352, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 336, size: 16, elements: !517)
!517 = !{!518, !530}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !516, file: !394, line: 350, baseType: !519, size: 16)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !516, file: !394, line: 337, size: 16, elements: !520)
!520 = !{!521, !522, !523, !524, !525, !526, !527, !528, !529}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !519, file: !394, line: 339, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !519, file: !394, line: 340, baseType: !192, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !519, file: !394, line: 341, baseType: !192, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !519, file: !394, line: 342, baseType: !192, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !519, file: !394, line: 343, baseType: !192, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !519, file: !394, line: 344, baseType: !192, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !519, file: !394, line: 345, baseType: !192, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !519, file: !394, line: 346, baseType: !192, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !519, file: !394, line: 348, baseType: !192, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !516, file: !394, line: 351, baseType: !192, size: 16)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !395, file: !394, line: 907, baseType: !287, size: 16, offset: 176)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !395, file: !394, line: 908, baseType: !533, size: 32, offset: 192)
!533 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !394, line: 398, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 381, size: 32, elements: !536)
!536 = !{!537, !548}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !535, file: !394, line: 396, baseType: !538, size: 32)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !535, file: !394, line: 382, size: 32, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !538, file: !394, line: 384, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !538, file: !394, line: 385, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !538, file: !394, line: 386, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !538, file: !394, line: 388, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !538, file: !394, line: 389, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !538, file: !394, line: 390, baseType: !110, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !538, file: !394, line: 392, baseType: !110, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !538, file: !394, line: 394, baseType: !110, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !535, file: !394, line: 397, baseType: !110, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !395, file: !394, line: 909, baseType: !550, size: 8, offset: 224)
!550 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !394, line: 433, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 426, size: 8, elements: !553)
!553 = !{!554, !559}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !552, file: !394, line: 431, baseType: !555, size: 8)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !552, file: !394, line: 427, size: 8, elements: !556)
!556 = !{!557, !558}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !555, file: !394, line: 428, baseType: !178, size: 5, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !555, file: !394, line: 430, baseType: !178, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !552, file: !394, line: 432, baseType: !178, size: 8)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !395, file: !394, line: 910, baseType: !329, size: 24, offset: 232)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !395, file: !394, line: 911, baseType: !562, size: 32, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !394, line: 462, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 448, size: 32, elements: !565)
!565 = !{!566, !575}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !564, file: !394, line: 460, baseType: !567, size: 32)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !564, file: !394, line: 449, size: 32, elements: !568)
!568 = !{!569, !570, !571, !572, !573, !574}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !567, file: !394, line: 451, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !567, file: !394, line: 453, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !567, file: !394, line: 454, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !567, file: !394, line: 455, baseType: !110, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !567, file: !394, line: 457, baseType: !110, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !567, file: !394, line: 459, baseType: !110, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !564, file: !394, line: 461, baseType: !110, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !395, file: !394, line: 912, baseType: !577, size: 16, offset: 288)
!577 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !394, line: 520, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 503, size: 16, elements: !580)
!580 = !{!581, !595}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !579, file: !394, line: 518, baseType: !582, size: 16)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !579, file: !394, line: 504, size: 16, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !582, file: !394, line: 506, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !582, file: !394, line: 507, baseType: !192, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !582, file: !394, line: 508, baseType: !192, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !582, file: !394, line: 509, baseType: !192, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !582, file: !394, line: 510, baseType: !192, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !582, file: !394, line: 511, baseType: !192, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !582, file: !394, line: 512, baseType: !192, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !582, file: !394, line: 513, baseType: !192, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !582, file: !394, line: 514, baseType: !192, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !582, file: !394, line: 515, baseType: !192, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !582, file: !394, line: 516, baseType: !192, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !579, file: !394, line: 519, baseType: !192, size: 16)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !395, file: !394, line: 913, baseType: !287, size: 16, offset: 304)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !395, file: !394, line: 914, baseType: !598, size: 32, offset: 320)
!598 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !394, line: 559, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 552, size: 32, elements: !601)
!601 = !{!602, !608}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !600, file: !394, line: 557, baseType: !603, size: 32)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !600, file: !394, line: 553, size: 32, elements: !604)
!604 = !{!605, !606, !607}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !603, file: !394, line: 554, baseType: !110, size: 10, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !603, file: !394, line: 555, baseType: !110, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !603, file: !394, line: 556, baseType: !110, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !600, file: !394, line: 558, baseType: !110, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !395, file: !394, line: 915, baseType: !610, size: 32, offset: 352)
!610 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !394, line: 585, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 578, size: 32, elements: !613)
!613 = !{!614, !620}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !612, file: !394, line: 583, baseType: !615, size: 32)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !612, file: !394, line: 579, size: 32, elements: !616)
!616 = !{!617, !618, !619}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !615, file: !394, line: 580, baseType: !110, size: 16, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !615, file: !394, line: 581, baseType: !110, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !615, file: !394, line: 582, baseType: !110, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !612, file: !394, line: 584, baseType: !110, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !395, file: !394, line: 916, baseType: !622, size: 8, offset: 384)
!622 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !394, line: 610, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 604, size: 8, elements: !625)
!625 = !{!626, !630}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !624, file: !394, line: 608, baseType: !627, size: 8)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !624, file: !394, line: 605, size: 8, elements: !628)
!628 = !{!629}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !627, file: !394, line: 607, baseType: !178, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !624, file: !394, line: 609, baseType: !178, size: 8)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !395, file: !394, line: 917, baseType: !329, size: 24, offset: 392)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !395, file: !394, line: 918, baseType: !633, size: 32, offset: 416)
!633 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !394, line: 639, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 622, size: 32, elements: !636)
!636 = !{!637, !648}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !635, file: !394, line: 637, baseType: !638, size: 32)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !635, file: !394, line: 623, size: 32, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !638, file: !394, line: 625, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !638, file: !394, line: 626, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !638, file: !394, line: 627, baseType: !110, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !638, file: !394, line: 629, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !638, file: !394, line: 631, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !638, file: !394, line: 632, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !638, file: !394, line: 634, baseType: !110, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !638, file: !394, line: 635, baseType: !110, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !635, file: !394, line: 638, baseType: !110, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !395, file: !394, line: 919, baseType: !650, size: 32, offset: 448)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 32, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 4)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !395, file: !394, line: 920, baseType: !654, size: 16, offset: 480)
!654 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !394, line: 715, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 706, size: 16, elements: !657)
!657 = !{!658, !663}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !656, file: !394, line: 713, baseType: !659, size: 16)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !656, file: !394, line: 707, size: 16, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !659, file: !394, line: 709, baseType: !192, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !659, file: !394, line: 711, baseType: !192, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !656, file: !394, line: 714, baseType: !192, size: 16)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !395, file: !394, line: 921, baseType: !287, size: 16, offset: 496)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !395, file: !394, line: 922, baseType: !666, size: 32, offset: 512)
!666 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !394, line: 739, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 729, size: 32, elements: !669)
!669 = !{!670, !676}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !668, file: !394, line: 737, baseType: !671, size: 32)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !668, file: !394, line: 730, size: 32, elements: !672)
!672 = !{!673, !674, !675}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !671, file: !394, line: 732, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !671, file: !394, line: 733, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !671, file: !394, line: 735, baseType: !110, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !668, file: !394, line: 738, baseType: !110, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !395, file: !394, line: 923, baseType: !678, size: 8, offset: 544)
!678 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !394, line: 765, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 756, size: 8, elements: !681)
!681 = !{!682, !688}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !680, file: !394, line: 763, baseType: !683, size: 8)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !680, file: !394, line: 757, size: 8, elements: !684)
!684 = !{!685, !686, !687}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !683, file: !394, line: 759, baseType: !178, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !683, file: !394, line: 761, baseType: !178, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !683, file: !394, line: 762, baseType: !178, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !680, file: !394, line: 764, baseType: !178, size: 8)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !395, file: !394, line: 924, baseType: !329, size: 24, offset: 552)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !395, file: !394, line: 925, baseType: !691, size: 32, offset: 576)
!691 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !394, line: 789, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 781, size: 32, elements: !694)
!694 = !{!695, !700}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !693, file: !394, line: 787, baseType: !696, size: 32)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !693, file: !394, line: 782, size: 32, elements: !697)
!697 = !{!698, !699}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !696, file: !394, line: 783, baseType: !110, size: 12, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !696, file: !394, line: 785, baseType: !110, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !693, file: !394, line: 788, baseType: !110, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !395, file: !394, line: 926, baseType: !702, size: 32, offset: 608)
!702 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !394, line: 820, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 805, size: 32, elements: !705)
!705 = !{!706, !716}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !704, file: !394, line: 818, baseType: !707, size: 32)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !704, file: !394, line: 806, size: 32, elements: !708)
!708 = !{!709, !710, !711, !712, !713, !714, !715}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !707, file: !394, line: 807, baseType: !110, size: 2, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !707, file: !394, line: 808, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !707, file: !394, line: 809, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !707, file: !394, line: 810, baseType: !110, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !707, file: !394, line: 812, baseType: !110, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !707, file: !394, line: 814, baseType: !110, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !707, file: !394, line: 816, baseType: !110, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !704, file: !394, line: 819, baseType: !110, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !395, file: !394, line: 927, baseType: !718, size: 8, offset: 640)
!718 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !720)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !394, line: 881, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !394, line: 872, size: 8, elements: !722)
!722 = !{!723, !730}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !721, file: !394, line: 879, baseType: !724, size: 8)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !721, file: !394, line: 873, size: 8, elements: !725)
!725 = !{!726, !727, !728, !729}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !724, file: !394, line: 874, baseType: !178, size: 1, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !724, file: !394, line: 875, baseType: !178, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !724, file: !394, line: 876, baseType: !178, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !724, file: !394, line: 877, baseType: !178, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !721, file: !394, line: 880, baseType: !178, size: 8)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !734, line: 290, baseType: !735)
!734 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !734, line: 284, size: 96, elements: !736)
!736 = !{!737, !747, !758, !771, !788}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !735, file: !734, line: 285, baseType: !738, size: 8)
!738 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !734, line: 49, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !734, line: 43, size: 8, elements: !741)
!741 = !{!742, !746}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !740, file: !734, line: 47, baseType: !743, size: 8)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !740, file: !734, line: 44, size: 8, elements: !744)
!744 = !{!745}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !743, file: !734, line: 45, baseType: !178, size: 1, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !740, file: !734, line: 48, baseType: !178, size: 8)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !735, file: !734, line: 286, baseType: !748, size: 8, offset: 8)
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !750)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !734, line: 67, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !734, line: 61, size: 8, elements: !752)
!752 = !{!753, !757}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !751, file: !734, line: 65, baseType: !754, size: 8)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !751, file: !734, line: 62, size: 8, elements: !755)
!755 = !{!756}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !754, file: !734, line: 64, baseType: !178, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !751, file: !734, line: 66, baseType: !178, size: 8)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !735, file: !734, line: 287, baseType: !759, size: 16, offset: 16)
!759 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !734, line: 89, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !734, line: 79, size: 16, elements: !762)
!762 = !{!763, !770}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !761, file: !734, line: 87, baseType: !764, size: 16)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !761, file: !734, line: 80, size: 16, elements: !765)
!765 = !{!766, !767, !768, !769}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !764, file: !734, line: 81, baseType: !192, size: 6, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !764, file: !734, line: 83, baseType: !192, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !764, file: !734, line: 85, baseType: !192, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !764, file: !734, line: 86, baseType: !192, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !761, file: !734, line: 88, baseType: !192, size: 16)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !735, file: !734, line: 288, baseType: !772, size: 32, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !734, line: 214, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !734, line: 199, size: 32, elements: !775)
!775 = !{!776, !787}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !774, file: !734, line: 212, baseType: !777, size: 32)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !774, file: !734, line: 200, size: 32, elements: !778)
!778 = !{!779, !780, !781, !782, !783, !784, !785, !786}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !777, file: !734, line: 201, baseType: !110, size: 4, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !777, file: !734, line: 203, baseType: !110, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !777, file: !734, line: 205, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !777, file: !734, line: 206, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !777, file: !734, line: 207, baseType: !110, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !777, file: !734, line: 208, baseType: !110, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !777, file: !734, line: 209, baseType: !110, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !777, file: !734, line: 210, baseType: !110, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !774, file: !734, line: 213, baseType: !110, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !735, file: !734, line: 289, baseType: !789, size: 32, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !734, line: 268, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !734, line: 260, size: 32, elements: !792)
!792 = !{!793, !798}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !791, file: !734, line: 266, baseType: !794, size: 32)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !791, file: !734, line: 261, size: 32, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !794, file: !734, line: 262, baseType: !110, size: 4, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !794, file: !734, line: 264, baseType: !110, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !791, file: !734, line: 267, baseType: !110, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !801, line: 513, baseType: !802)
!801 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !801, line: 494, size: 480, elements: !803)
!803 = !{!804, !810, !820, !824, !834, !844, !854, !864, !868, !884, !900, !916, !946, !950, !960, !970, !980, !984}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !802, file: !801, line: 495, baseType: !805, size: 8)
!805 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !801, line: 45, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !801, line: 43, size: 8, elements: !808)
!808 = !{!809}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !807, file: !801, line: 44, baseType: !178, size: 8)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !802, file: !801, line: 496, baseType: !811, size: 8, offset: 8)
!811 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !801, line: 61, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !801, line: 55, size: 8, elements: !814)
!814 = !{!815, !819}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !813, file: !801, line: 59, baseType: !816, size: 8)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !813, file: !801, line: 56, size: 8, elements: !817)
!817 = !{!818}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !816, file: !801, line: 57, baseType: !178, size: 2, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !813, file: !801, line: 60, baseType: !178, size: 8)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !802, file: !801, line: 497, baseType: !821, size: 48, offset: 16)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 48, elements: !822)
!822 = !{!823}
!823 = !DISubrange(count: 6)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !802, file: !801, line: 498, baseType: !825, size: 8, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !826)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !801, line: 86, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !801, line: 80, size: 8, elements: !828)
!828 = !{!829, !833}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !827, file: !801, line: 84, baseType: !830, size: 8)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !827, file: !801, line: 81, size: 8, elements: !831)
!831 = !{!832}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !830, file: !801, line: 82, baseType: !178, size: 3, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !827, file: !801, line: 85, baseType: !178, size: 8)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !802, file: !801, line: 499, baseType: !835, size: 8, offset: 72)
!835 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !801, line: 121, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !801, line: 115, size: 8, elements: !838)
!838 = !{!839, !843}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !837, file: !801, line: 119, baseType: !840, size: 8)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !837, file: !801, line: 116, size: 8, elements: !841)
!841 = !{!842}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !840, file: !801, line: 117, baseType: !178, size: 3, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !837, file: !801, line: 120, baseType: !178, size: 8)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !802, file: !801, line: 500, baseType: !845, size: 8, offset: 80)
!845 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !801, line: 156, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !801, line: 150, size: 8, elements: !848)
!848 = !{!849, !853}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !847, file: !801, line: 154, baseType: !850, size: 8)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !847, file: !801, line: 151, size: 8, elements: !851)
!851 = !{!852}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !850, file: !801, line: 152, baseType: !178, size: 3, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !847, file: !801, line: 155, baseType: !178, size: 8)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !802, file: !801, line: 501, baseType: !855, size: 8, offset: 88)
!855 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !856)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !801, line: 191, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !801, line: 185, size: 8, elements: !858)
!858 = !{!859, !863}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !857, file: !801, line: 189, baseType: !860, size: 8)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !857, file: !801, line: 186, size: 8, elements: !861)
!861 = !{!862}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !860, file: !801, line: 187, baseType: !178, size: 3, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !857, file: !801, line: 190, baseType: !178, size: 8)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !802, file: !801, line: 502, baseType: !865, size: 64, offset: 96)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 64, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 8)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !802, file: !801, line: 503, baseType: !869, size: 32, offset: 160)
!869 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !801, line: 232, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !801, line: 220, size: 32, elements: !872)
!872 = !{!873, !883}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !871, file: !801, line: 230, baseType: !874, size: 32)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !871, file: !801, line: 221, size: 32, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881, !882}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !874, file: !801, line: 222, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !874, file: !801, line: 223, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !874, file: !801, line: 224, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !874, file: !801, line: 225, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !874, file: !801, line: 226, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !874, file: !801, line: 227, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !874, file: !801, line: 228, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !871, file: !801, line: 231, baseType: !110, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !802, file: !801, line: 504, baseType: !885, size: 32, offset: 192)
!885 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !801, line: 268, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !801, line: 256, size: 32, elements: !888)
!888 = !{!889, !899}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !887, file: !801, line: 266, baseType: !890, size: 32)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !887, file: !801, line: 257, size: 32, elements: !891)
!891 = !{!892, !893, !894, !895, !896, !897, !898}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !890, file: !801, line: 258, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !890, file: !801, line: 259, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !890, file: !801, line: 260, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !890, file: !801, line: 261, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !890, file: !801, line: 262, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_", scope: !890, file: !801, line: 263, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "EIC_", scope: !890, file: !801, line: 264, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !887, file: !801, line: 267, baseType: !110, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "APBBMASK", scope: !802, file: !801, line: 505, baseType: !901, size: 32, offset: 224)
!901 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !902)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBMASK_Type", file: !801, line: 304, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !801, line: 292, size: 32, elements: !904)
!904 = !{!905, !915}
