; ModuleID = 'build/adafruit_feather_m0_basic_proto/sensor/ms5837/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.3, i8*, i32 }
%union.anon.3 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer.18 = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon.3 }
%struct.mpsc_pbuf_buffer_config.19 = type { i32*, i32, void (%struct.mpsc_pbuf_buffer.18*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/sensor/ms5837/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/sensor/ms5837")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/sensor/ms5837")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !328, line: 13, type: !330, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !206, globals: !325, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/sensor/ms5837/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/sensor/ms5837")
!29 = !{!30, !37, !101, !121, !136}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_channel", file: !38, line: 53, baseType: !32, size: 32, elements: !39)
!38 = !DIFile(filename: "zephyr/include/zephyr/drivers/sensor.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!40 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_X", value: 0)
!41 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_Y", value: 1)
!42 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_Z", value: 2)
!43 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_XYZ", value: 3)
!44 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_X", value: 4)
!45 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_Y", value: 5)
!46 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_Z", value: 6)
!47 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_XYZ", value: 7)
!48 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_X", value: 8)
!49 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_Y", value: 9)
!50 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_Z", value: 10)
!51 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_XYZ", value: 11)
!52 = !DIEnumerator(name: "SENSOR_CHAN_DIE_TEMP", value: 12)
!53 = !DIEnumerator(name: "SENSOR_CHAN_AMBIENT_TEMP", value: 13)
!54 = !DIEnumerator(name: "SENSOR_CHAN_PRESS", value: 14)
!55 = !DIEnumerator(name: "SENSOR_CHAN_PROX", value: 15)
!56 = !DIEnumerator(name: "SENSOR_CHAN_HUMIDITY", value: 16)
!57 = !DIEnumerator(name: "SENSOR_CHAN_LIGHT", value: 17)
!58 = !DIEnumerator(name: "SENSOR_CHAN_IR", value: 18)
!59 = !DIEnumerator(name: "SENSOR_CHAN_RED", value: 19)
!60 = !DIEnumerator(name: "SENSOR_CHAN_GREEN", value: 20)
!61 = !DIEnumerator(name: "SENSOR_CHAN_BLUE", value: 21)
!62 = !DIEnumerator(name: "SENSOR_CHAN_ALTITUDE", value: 22)
!63 = !DIEnumerator(name: "SENSOR_CHAN_PM_1_0", value: 23)
!64 = !DIEnumerator(name: "SENSOR_CHAN_PM_2_5", value: 24)
!65 = !DIEnumerator(name: "SENSOR_CHAN_PM_10", value: 25)
!66 = !DIEnumerator(name: "SENSOR_CHAN_DISTANCE", value: 26)
!67 = !DIEnumerator(name: "SENSOR_CHAN_CO2", value: 27)
!68 = !DIEnumerator(name: "SENSOR_CHAN_VOC", value: 28)
!69 = !DIEnumerator(name: "SENSOR_CHAN_GAS_RES", value: 29)
!70 = !DIEnumerator(name: "SENSOR_CHAN_VOLTAGE", value: 30)
!71 = !DIEnumerator(name: "SENSOR_CHAN_CURRENT", value: 31)
!72 = !DIEnumerator(name: "SENSOR_CHAN_POWER", value: 32)
!73 = !DIEnumerator(name: "SENSOR_CHAN_RESISTANCE", value: 33)
!74 = !DIEnumerator(name: "SENSOR_CHAN_ROTATION", value: 34)
!75 = !DIEnumerator(name: "SENSOR_CHAN_POS_DX", value: 35)
!76 = !DIEnumerator(name: "SENSOR_CHAN_POS_DY", value: 36)
!77 = !DIEnumerator(name: "SENSOR_CHAN_POS_DZ", value: 37)
!78 = !DIEnumerator(name: "SENSOR_CHAN_RPM", value: 38)
!79 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_VOLTAGE", value: 39)
!80 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_AVG_CURRENT", value: 40)
!81 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STDBY_CURRENT", value: 41)
!82 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_MAX_LOAD_CURRENT", value: 42)
!83 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TEMP", value: 43)
!84 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STATE_OF_CHARGE", value: 44)
!85 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_FULL_CHARGE_CAPACITY", value: 45)
!86 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_REMAINING_CHARGE_CAPACITY", value: 46)
!87 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_NOM_AVAIL_CAPACITY", value: 47)
!88 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_FULL_AVAIL_CAPACITY", value: 48)
!89 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_AVG_POWER", value: 49)
!90 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STATE_OF_HEALTH", value: 50)
!91 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TIME_TO_EMPTY", value: 51)
!92 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TIME_TO_FULL", value: 52)
!93 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_CYCLE_COUNT", value: 53)
!94 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIGN_VOLTAGE", value: 54)
!95 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIRED_VOLTAGE", value: 55)
!96 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIRED_CHARGING_CURRENT", value: 56)
!97 = !DIEnumerator(name: "SENSOR_CHAN_ALL", value: 57)
!98 = !DIEnumerator(name: "SENSOR_CHAN_COMMON_COUNT", value: 58)
!99 = !DIEnumerator(name: "SENSOR_CHAN_PRIV_START", value: 58)
!100 = !DIEnumerator(name: "SENSOR_CHAN_MAX", value: 32767)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_attribute", file: !38, line: 274, baseType: !32, size: 32, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120}
!103 = !DIEnumerator(name: "SENSOR_ATTR_SAMPLING_FREQUENCY", value: 0)
!104 = !DIEnumerator(name: "SENSOR_ATTR_LOWER_THRESH", value: 1)
!105 = !DIEnumerator(name: "SENSOR_ATTR_UPPER_THRESH", value: 2)
!106 = !DIEnumerator(name: "SENSOR_ATTR_SLOPE_TH", value: 3)
!107 = !DIEnumerator(name: "SENSOR_ATTR_SLOPE_DUR", value: 4)
!108 = !DIEnumerator(name: "SENSOR_ATTR_HYSTERESIS", value: 5)
!109 = !DIEnumerator(name: "SENSOR_ATTR_OVERSAMPLING", value: 6)
!110 = !DIEnumerator(name: "SENSOR_ATTR_FULL_SCALE", value: 7)
!111 = !DIEnumerator(name: "SENSOR_ATTR_OFFSET", value: 8)
!112 = !DIEnumerator(name: "SENSOR_ATTR_CALIB_TARGET", value: 9)
!113 = !DIEnumerator(name: "SENSOR_ATTR_CONFIGURATION", value: 10)
!114 = !DIEnumerator(name: "SENSOR_ATTR_CALIBRATION", value: 11)
!115 = !DIEnumerator(name: "SENSOR_ATTR_FEATURE_MASK", value: 12)
!116 = !DIEnumerator(name: "SENSOR_ATTR_ALERT", value: 13)
!117 = !DIEnumerator(name: "SENSOR_ATTR_FF_DUR", value: 14)
!118 = !DIEnumerator(name: "SENSOR_ATTR_COMMON_COUNT", value: 15)
!119 = !DIEnumerator(name: "SENSOR_ATTR_PRIV_START", value: 15)
!120 = !DIEnumerator(name: "SENSOR_ATTR_MAX", value: 32767)
!121 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_trigger_type", file: !38, line: 203, baseType: !32, size: 32, elements: !122)
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!123 = !DIEnumerator(name: "SENSOR_TRIG_TIMER", value: 0)
!124 = !DIEnumerator(name: "SENSOR_TRIG_DATA_READY", value: 1)
!125 = !DIEnumerator(name: "SENSOR_TRIG_DELTA", value: 2)
!126 = !DIEnumerator(name: "SENSOR_TRIG_NEAR_FAR", value: 3)
!127 = !DIEnumerator(name: "SENSOR_TRIG_THRESHOLD", value: 4)
!128 = !DIEnumerator(name: "SENSOR_TRIG_TAP", value: 5)
!129 = !DIEnumerator(name: "SENSOR_TRIG_DOUBLE_TAP", value: 6)
!130 = !DIEnumerator(name: "SENSOR_TRIG_FREEFALL", value: 7)
!131 = !DIEnumerator(name: "SENSOR_TRIG_MOTION", value: 8)
!132 = !DIEnumerator(name: "SENSOR_TRIG_STATIONARY", value: 9)
!133 = !DIEnumerator(name: "SENSOR_TRIG_COMMON_COUNT", value: 10)
!134 = !DIEnumerator(name: "SENSOR_TRIG_PRIV_START", value: 10)
!135 = !DIEnumerator(name: "SENSOR_TRIG_MAX", value: 32767)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !137, line: 27, baseType: !32, size: 32, elements: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205}
!139 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!140 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!141 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!142 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!143 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!144 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!145 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!146 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!147 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!148 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!149 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!150 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!151 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!152 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!153 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!154 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!155 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!156 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!157 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!158 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!159 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!160 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!161 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!162 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!163 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!164 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!165 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!166 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!167 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!168 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!169 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!170 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!171 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!172 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!173 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!174 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!175 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!176 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!177 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!178 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!179 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!180 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!181 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!182 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!183 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!184 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!185 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!186 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!187 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!188 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!189 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!190 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!191 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!192 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!193 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!194 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!195 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!196 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!197 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!198 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!199 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!200 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!201 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!202 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!203 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!204 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!205 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!206 = !{!207, !208, !222, !223, !216, !224, !234, !253}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !210, line: 78, size: 32, elements: !211)
!210 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = !{!212, !221}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !209, file: !210, line: 80, baseType: !213, size: 32)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !210, line: 45, size: 32, elements: !214)
!214 = !{!215, !218, !219, !220}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !213, file: !210, line: 47, baseType: !216, size: 8)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !217)
!217 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !213, file: !210, line: 50, baseType: !216, size: 8, offset: 8)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !213, file: !210, line: 53, baseType: !216, size: 8, offset: 16)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !213, file: !210, line: 56, baseType: !216, size: 8, offset: 24)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !209, file: !210, line: 82, baseType: !207, size: 32)
!222 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !226)
!226 = !{!227, !245, !249}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !225, file: !31, line: 89, baseType: !228, size: 96)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !229)
!229 = !{!230, !242, !243}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !228, file: !31, line: 67, baseType: !231, size: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !232)
!232 = !{!233, !235, !236, !237, !238, !239, !240, !241}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !231, file: !31, line: 52, baseType: !234, size: 1, flags: DIFlagBitField, extraData: i64 0)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !231, file: !31, line: 52, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !231, file: !31, line: 52, baseType: !234, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !231, file: !31, line: 53, baseType: !234, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !231, file: !31, line: 54, baseType: !234, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !231, file: !31, line: 55, baseType: !234, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !231, file: !31, line: 56, baseType: !234, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !231, file: !31, line: 57, baseType: !234, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !228, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !228, file: !31, line: 76, baseType: !244, size: 32, offset: 64)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !234)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !225, file: !31, line: 93, baseType: !246, size: 32, offset: 96)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, size: 32, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 4)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !225, file: !31, line: 94, baseType: !250, offset: 128)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !216, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: -1)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_driver_api", file: !38, line: 397, size: 160, elements: !256)
!256 = !{!257, !294, !300, !315, !320}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "attr_set", scope: !255, file: !38, line: 398, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_attr_set_t", file: !38, line: 354, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DISubroutineType(types: !261)
!261 = !{!222, !262, !37, !101, !287}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !265, line: 378, size: 192, elements: !266)
!265 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!266 = !{!267, !271, !272, !273, !280, !281}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !264, file: !265, line: 380, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !270)
!270 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !264, file: !265, line: 382, baseType: !13, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !264, file: !265, line: 384, baseType: !13, size: 32, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !264, file: !265, line: 386, baseType: !274, size: 32, offset: 96)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !265, line: 351, size: 16, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !275, file: !265, line: 359, baseType: !216, size: 8)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !275, file: !265, line: 364, baseType: !279, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!279 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !264, file: !265, line: 388, baseType: !207, size: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !264, file: !265, line: 396, baseType: !282, size: 32, offset: 160)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !265, line: 43, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !286)
!286 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_value", file: !38, line: 43, size: 64, elements: !290)
!290 = !{!291, !293}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !289, file: !38, line: 45, baseType: !292, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !222)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !289, file: !38, line: 47, baseType: !292, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "attr_get", scope: !255, file: !38, line: 399, baseType: !295, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_attr_get_t", file: !38, line: 365, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DISubroutineType(types: !298)
!298 = !{!222, !262, !37, !101, !299}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "trigger_set", scope: !255, file: !38, line: 400, baseType: !301, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_trigger_set_t", file: !38, line: 376, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = !DISubroutineType(types: !304)
!304 = !{!222, !262, !305, !311}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_trigger", file: !38, line: 264, size: 64, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !307, file: !38, line: 266, baseType: !121, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "chan", scope: !307, file: !38, line: 268, baseType: !37, size: 32, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_trigger_handler_t", file: !38, line: 345, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !262, !305}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fetch", scope: !255, file: !38, line: 401, baseType: !316, size: 32, offset: 96)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_sample_fetch_t", file: !38, line: 385, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!318 = !DISubroutineType(types: !319)
!319 = !{!222, !262, !37}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "channel_get", scope: !255, file: !38, line: 402, baseType: !321, size: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_channel_get_t", file: !38, line: 393, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DISubroutineType(types: !324)
!324 = !{!222, !262, !37, !299}
!325 = !{!25, !326}
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !328, line: 13, type: !329, isLocal: true, isDefinition: true)
!328 = !DIFile(filename: "zephyr/samples/sensor/ms5837/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !332, line: 16, size: 64, elements: !333)
!332 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !331, file: !332, line: 17, baseType: !268, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !331, file: !332, line: 18, baseType: !216, size: 8, offset: 32)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !338, file: !359, line: 18, type: !360, isLocal: false, isDefinition: true)
!338 = distinct !DICompileUnit(language: DW_LANG_C99, file: !339, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !340, globals: !358, splitDebugInlining: false, nameTableKind: None)
!339 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/sensor/ms5837")
!340 = !{!22, !207, !24, !341, !343, !345, !346, !222, !348, !349, !351, !353, !354, !355, !356, !268}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!342 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 32)
!344 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !347, line: 214, baseType: !32)
!347 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 32)
!350 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!352 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !357)
!357 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!358 = !{!336}
!359 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !332, line: 16, size: 64, elements: !362)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !361, file: !332, line: 17, baseType: !268, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !361, file: !332, line: 18, baseType: !216, size: 8, offset: 32)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "_char_out", scope: !367, file: !372, line: 54, type: !373, isLocal: false, isDefinition: true)
!367 = distinct !DICompileUnit(language: DW_LANG_C99, file: !368, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !369, retainedTypes: !370, globals: !371, splitDebugInlining: false, nameTableKind: None)
!368 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/sensor/ms5837")
!369 = !{!136}
!370 = !{!207, !222}
!371 = !{!365}
!372 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DISubroutineType(types: !375)
!375 = !{!222, !222}
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !378, file: !1112, line: 202, type: !1113, isLocal: true, isDefinition: true, align: 32)
!378 = distinct !DICompileUnit(language: DW_LANG_C99, file: !379, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !369, retainedTypes: !380, globals: !1111, splitDebugInlining: false, nameTableKind: None)
!379 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/sensor/ms5837")
!380 = !{!207, !222, !381, !505, !842, !843, !910}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !383, line: 335, baseType: !384)
!383 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !383, line: 320, size: 288, elements: !385)
!385 = !{!386, !397, !405, !419, !430, !441, !445, !456, !457, !468, !469, !484, !485, !495}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !384, file: !383, line: 321, baseType: !387, size: 16)
!387 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !383, line: 50, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !383, line: 43, size: 16, elements: !390)
!390 = !{!391, !396}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !389, file: !383, line: 48, baseType: !392, size: 16)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !389, file: !383, line: 44, size: 16, elements: !393)
!393 = !{!394, !395}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !392, file: !383, line: 45, baseType: !356, size: 7, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !392, file: !383, line: 47, baseType: !356, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !389, file: !383, line: 49, baseType: !356, size: 16)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !384, file: !383, line: 322, baseType: !398, size: 16, offset: 16)
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 16, elements: !403)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !400, line: 52, baseType: !401)
!400 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !216)
!403 = !{!404}
!404 = !DISubrange(count: 2)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !384, file: !383, line: 323, baseType: !406, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !407)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !383, line: 107, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !383, line: 94, size: 32, elements: !409)
!409 = !{!410, !418}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !408, file: !383, line: 105, baseType: !411, size: 32)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !408, file: !383, line: 95, size: 32, elements: !412)
!412 = !{!413, !414, !415, !416, !417}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !411, file: !383, line: 97, baseType: !234, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !411, file: !383, line: 99, baseType: !234, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !411, file: !383, line: 100, baseType: !234, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !411, file: !383, line: 102, baseType: !234, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !411, file: !383, line: 103, baseType: !234, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !408, file: !383, line: 106, baseType: !234, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !384, file: !383, line: 324, baseType: !420, size: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !383, line: 155, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !383, line: 148, size: 32, elements: !423)
!423 = !{!424, !429}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !422, file: !383, line: 153, baseType: !425, size: 32)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !422, file: !383, line: 149, size: 32, elements: !426)
!426 = !{!427, !428}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !425, file: !383, line: 150, baseType: !234, size: 16, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !425, file: !383, line: 151, baseType: !234, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !422, file: !383, line: 154, baseType: !234, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !384, file: !383, line: 325, baseType: !431, size: 8, offset: 96)
!431 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !383, line: 194, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !383, line: 187, size: 8, elements: !434)
!434 = !{!435, !440}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !433, file: !383, line: 192, baseType: !436, size: 8)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !433, file: !383, line: 188, size: 8, elements: !437)
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !436, file: !383, line: 189, baseType: !216, size: 1, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !436, file: !383, line: 190, baseType: !216, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !433, file: !383, line: 193, baseType: !216, size: 8)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !384, file: !383, line: 326, baseType: !442, size: 24, offset: 104)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 24, elements: !443)
!443 = !{!444}
!444 = !DISubrange(count: 3)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !384, file: !383, line: 327, baseType: !446, size: 8, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !383, line: 215, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !383, line: 208, size: 8, elements: !449)
!449 = !{!450, !455}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !448, file: !383, line: 213, baseType: !451, size: 8)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !448, file: !383, line: 209, size: 8, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !451, file: !383, line: 210, baseType: !216, size: 1, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !451, file: !383, line: 211, baseType: !216, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !448, file: !383, line: 214, baseType: !216, size: 8)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !384, file: !383, line: 328, baseType: !442, size: 24, offset: 136)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !384, file: !383, line: 329, baseType: !458, size: 8, offset: 160)
!458 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !383, line: 236, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !383, line: 229, size: 8, elements: !461)
!461 = !{!462, !467}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !460, file: !383, line: 234, baseType: !463, size: 8)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !460, file: !383, line: 230, size: 8, elements: !464)
!464 = !{!465, !466}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !463, file: !383, line: 231, baseType: !401, size: 1, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !463, file: !383, line: 232, baseType: !401, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !460, file: !383, line: 235, baseType: !216, size: 8)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !384, file: !383, line: 330, baseType: !442, size: 24, offset: 168)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !384, file: !383, line: 331, baseType: !470, size: 16, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !383, line: 262, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !383, line: 250, size: 16, elements: !473)
!473 = !{!474, !483}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !472, file: !383, line: 260, baseType: !475, size: 16)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !472, file: !383, line: 251, size: 16, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !475, file: !383, line: 252, baseType: !356, size: 1, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !475, file: !383, line: 253, baseType: !356, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !475, file: !383, line: 254, baseType: !356, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !475, file: !383, line: 255, baseType: !356, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !475, file: !383, line: 256, baseType: !356, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !475, file: !383, line: 258, baseType: !356, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !472, file: !383, line: 261, baseType: !356, size: 16)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !384, file: !383, line: 332, baseType: !398, size: 16, offset: 208)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !384, file: !383, line: 333, baseType: !486, size: 32, offset: 224)
!486 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !383, line: 290, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !383, line: 284, size: 32, elements: !489)
!489 = !{!490, !494}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !488, file: !383, line: 288, baseType: !491, size: 32)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !488, file: !383, line: 285, size: 32, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !491, file: !383, line: 286, baseType: !234, size: 22, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !488, file: !383, line: 289, baseType: !234, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !384, file: !383, line: 334, baseType: !496, size: 16, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !497)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !383, line: 308, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !383, line: 303, size: 16, elements: !499)
!499 = !{!500, !504}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !498, file: !383, line: 306, baseType: !501, size: 16)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !498, file: !383, line: 304, size: 16, elements: !502)
!502 = !{!503}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !501, file: !383, line: 305, baseType: !356, size: 16, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !498, file: !383, line: 307, baseType: !356, size: 16)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !507, line: 928, baseType: !508)
!507 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !507, line: 899, size: 672, elements: !509)
!509 = !{!510, !534, !558, !584, !609, !625, !626, !644, !645, !662, !673, !674, !689, !709, !710, !722, !734, !744, !745, !762, !764, !775, !776, !788, !800, !801, !812, !828}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !508, file: !507, line: 900, baseType: !511, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !512)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !507, line: 64, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 43, size: 32, elements: !514)
!514 = !{!515, !533}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !513, file: !507, line: 62, baseType: !516, size: 32)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !513, file: !507, line: 44, size: 32, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !516, file: !507, line: 45, baseType: !234, size: 1, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !516, file: !507, line: 46, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !516, file: !507, line: 47, baseType: !234, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !516, file: !507, line: 48, baseType: !234, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !516, file: !507, line: 49, baseType: !234, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !516, file: !507, line: 50, baseType: !234, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !516, file: !507, line: 51, baseType: !234, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !516, file: !507, line: 52, baseType: !234, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !516, file: !507, line: 53, baseType: !234, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !516, file: !507, line: 54, baseType: !234, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !516, file: !507, line: 55, baseType: !234, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !516, file: !507, line: 56, baseType: !234, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !516, file: !507, line: 58, baseType: !234, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !516, file: !507, line: 59, baseType: !234, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !516, file: !507, line: 60, baseType: !234, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !513, file: !507, line: 63, baseType: !234, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !508, file: !507, line: 901, baseType: !535, size: 32, offset: 32)
!535 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !507, line: 125, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 104, size: 32, elements: !538)
!538 = !{!539, !557}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !537, file: !507, line: 123, baseType: !540, size: 32)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !537, file: !507, line: 105, size: 32, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !540, file: !507, line: 106, baseType: !234, size: 1, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !540, file: !507, line: 107, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !540, file: !507, line: 108, baseType: !234, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !540, file: !507, line: 109, baseType: !234, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !540, file: !507, line: 110, baseType: !234, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !540, file: !507, line: 111, baseType: !234, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !540, file: !507, line: 112, baseType: !234, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !540, file: !507, line: 113, baseType: !234, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !540, file: !507, line: 114, baseType: !234, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !540, file: !507, line: 115, baseType: !234, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !540, file: !507, line: 116, baseType: !234, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !540, file: !507, line: 117, baseType: !234, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !540, file: !507, line: 119, baseType: !234, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !540, file: !507, line: 120, baseType: !234, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !540, file: !507, line: 121, baseType: !234, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !537, file: !507, line: 124, baseType: !234, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !508, file: !507, line: 902, baseType: !559, size: 32, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !560)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !507, line: 186, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 165, size: 32, elements: !562)
!562 = !{!563, !583}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !561, file: !507, line: 184, baseType: !564, size: 32)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !561, file: !507, line: 166, size: 32, elements: !565)
!565 = !{!566, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !564, file: !507, line: 167, baseType: !567, size: 1, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !234)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !564, file: !507, line: 168, baseType: !567, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !564, file: !507, line: 169, baseType: !567, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !564, file: !507, line: 170, baseType: !567, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !564, file: !507, line: 171, baseType: !567, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !564, file: !507, line: 172, baseType: !567, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !564, file: !507, line: 173, baseType: !567, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !564, file: !507, line: 174, baseType: !567, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !564, file: !507, line: 175, baseType: !567, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !564, file: !507, line: 176, baseType: !567, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !564, file: !507, line: 177, baseType: !567, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !564, file: !507, line: 178, baseType: !567, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !564, file: !507, line: 180, baseType: !567, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !564, file: !507, line: 181, baseType: !567, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !564, file: !507, line: 182, baseType: !567, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !561, file: !507, line: 185, baseType: !234, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !508, file: !507, line: 903, baseType: !585, size: 32, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !507, line: 247, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 226, size: 32, elements: !589)
!589 = !{!590, !608}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !588, file: !507, line: 245, baseType: !591, size: 32)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !588, file: !507, line: 227, size: 32, elements: !592)
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !591, file: !507, line: 228, baseType: !234, size: 1, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !591, file: !507, line: 229, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !591, file: !507, line: 230, baseType: !234, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !591, file: !507, line: 231, baseType: !234, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !591, file: !507, line: 232, baseType: !234, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !591, file: !507, line: 233, baseType: !234, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !591, file: !507, line: 234, baseType: !234, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !591, file: !507, line: 235, baseType: !234, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !591, file: !507, line: 236, baseType: !234, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !591, file: !507, line: 237, baseType: !234, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !591, file: !507, line: 238, baseType: !234, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !591, file: !507, line: 239, baseType: !234, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !591, file: !507, line: 241, baseType: !234, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !591, file: !507, line: 242, baseType: !234, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !591, file: !507, line: 243, baseType: !234, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !588, file: !507, line: 246, baseType: !234, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !508, file: !507, line: 904, baseType: !610, size: 16, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !507, line: 300, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 287, size: 16, elements: !613)
!613 = !{!614, !624}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !612, file: !507, line: 298, baseType: !615, size: 16)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !612, file: !507, line: 288, size: 16, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !615, file: !507, line: 290, baseType: !356, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !615, file: !507, line: 291, baseType: !356, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !615, file: !507, line: 293, baseType: !356, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !615, file: !507, line: 294, baseType: !356, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !615, file: !507, line: 295, baseType: !356, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !615, file: !507, line: 296, baseType: !356, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !615, file: !507, line: 297, baseType: !356, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !612, file: !507, line: 299, baseType: !356, size: 16)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !508, file: !507, line: 905, baseType: !398, size: 16, offset: 144)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !508, file: !507, line: 906, baseType: !627, size: 16, offset: 160)
!627 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !507, line: 352, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 336, size: 16, elements: !630)
!630 = !{!631, !643}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !629, file: !507, line: 350, baseType: !632, size: 16)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !629, file: !507, line: 337, size: 16, elements: !633)
!633 = !{!634, !635, !636, !637, !638, !639, !640, !641, !642}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !632, file: !507, line: 339, baseType: !356, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !632, file: !507, line: 340, baseType: !356, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !632, file: !507, line: 341, baseType: !356, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !632, file: !507, line: 342, baseType: !356, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !632, file: !507, line: 343, baseType: !356, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !632, file: !507, line: 344, baseType: !356, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !632, file: !507, line: 345, baseType: !356, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !632, file: !507, line: 346, baseType: !356, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !632, file: !507, line: 348, baseType: !356, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !629, file: !507, line: 351, baseType: !356, size: 16)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !508, file: !507, line: 907, baseType: !398, size: 16, offset: 176)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !508, file: !507, line: 908, baseType: !646, size: 32, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !647)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !507, line: 398, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 381, size: 32, elements: !649)
!649 = !{!650, !661}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !648, file: !507, line: 396, baseType: !651, size: 32)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !648, file: !507, line: 382, size: 32, elements: !652)
!652 = !{!653, !654, !655, !656, !657, !658, !659, !660}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !651, file: !507, line: 384, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !651, file: !507, line: 385, baseType: !234, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !651, file: !507, line: 386, baseType: !234, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !651, file: !507, line: 388, baseType: !234, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !651, file: !507, line: 389, baseType: !234, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !651, file: !507, line: 390, baseType: !234, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !651, file: !507, line: 392, baseType: !234, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !651, file: !507, line: 394, baseType: !234, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !648, file: !507, line: 397, baseType: !234, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !508, file: !507, line: 909, baseType: !663, size: 8, offset: 224)
!663 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !507, line: 433, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 426, size: 8, elements: !666)
!666 = !{!667, !672}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !665, file: !507, line: 431, baseType: !668, size: 8)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !665, file: !507, line: 427, size: 8, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !668, file: !507, line: 428, baseType: !216, size: 5, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !668, file: !507, line: 430, baseType: !216, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !665, file: !507, line: 432, baseType: !216, size: 8)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !508, file: !507, line: 910, baseType: !442, size: 24, offset: 232)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !508, file: !507, line: 911, baseType: !675, size: 32, offset: 256)
!675 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !507, line: 462, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 448, size: 32, elements: !678)
!678 = !{!679, !688}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !677, file: !507, line: 460, baseType: !680, size: 32)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !677, file: !507, line: 449, size: 32, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !687}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !680, file: !507, line: 451, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !680, file: !507, line: 453, baseType: !234, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !680, file: !507, line: 454, baseType: !234, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !680, file: !507, line: 455, baseType: !234, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !680, file: !507, line: 457, baseType: !234, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !680, file: !507, line: 459, baseType: !234, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !677, file: !507, line: 461, baseType: !234, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !508, file: !507, line: 912, baseType: !690, size: 16, offset: 288)
!690 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !507, line: 520, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 503, size: 16, elements: !693)
!693 = !{!694, !708}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !692, file: !507, line: 518, baseType: !695, size: 16)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !692, file: !507, line: 504, size: 16, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !695, file: !507, line: 506, baseType: !356, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !695, file: !507, line: 507, baseType: !356, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !695, file: !507, line: 508, baseType: !356, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !695, file: !507, line: 509, baseType: !356, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !695, file: !507, line: 510, baseType: !356, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !695, file: !507, line: 511, baseType: !356, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !695, file: !507, line: 512, baseType: !356, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !695, file: !507, line: 513, baseType: !356, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !695, file: !507, line: 514, baseType: !356, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !695, file: !507, line: 515, baseType: !356, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !695, file: !507, line: 516, baseType: !356, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !692, file: !507, line: 519, baseType: !356, size: 16)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !508, file: !507, line: 913, baseType: !398, size: 16, offset: 304)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !508, file: !507, line: 914, baseType: !711, size: 32, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !507, line: 559, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 552, size: 32, elements: !714)
!714 = !{!715, !721}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !713, file: !507, line: 557, baseType: !716, size: 32)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !713, file: !507, line: 553, size: 32, elements: !717)
!717 = !{!718, !719, !720}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !716, file: !507, line: 554, baseType: !234, size: 10, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !716, file: !507, line: 555, baseType: !234, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !716, file: !507, line: 556, baseType: !234, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !713, file: !507, line: 558, baseType: !234, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !508, file: !507, line: 915, baseType: !723, size: 32, offset: 352)
!723 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !507, line: 585, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 578, size: 32, elements: !726)
!726 = !{!727, !733}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !725, file: !507, line: 583, baseType: !728, size: 32)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !725, file: !507, line: 579, size: 32, elements: !729)
!729 = !{!730, !731, !732}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !728, file: !507, line: 580, baseType: !234, size: 16, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !728, file: !507, line: 581, baseType: !234, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !728, file: !507, line: 582, baseType: !234, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !725, file: !507, line: 584, baseType: !234, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !508, file: !507, line: 916, baseType: !735, size: 8, offset: 384)
!735 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !507, line: 610, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 604, size: 8, elements: !738)
!738 = !{!739, !743}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !737, file: !507, line: 608, baseType: !740, size: 8)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !737, file: !507, line: 605, size: 8, elements: !741)
!741 = !{!742}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !740, file: !507, line: 607, baseType: !216, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !737, file: !507, line: 609, baseType: !216, size: 8)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !508, file: !507, line: 917, baseType: !442, size: 24, offset: 392)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !508, file: !507, line: 918, baseType: !746, size: 32, offset: 416)
!746 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !507, line: 639, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 622, size: 32, elements: !749)
!749 = !{!750, !761}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !748, file: !507, line: 637, baseType: !751, size: 32)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !748, file: !507, line: 623, size: 32, elements: !752)
!752 = !{!753, !754, !755, !756, !757, !758, !759, !760}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !751, file: !507, line: 625, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !751, file: !507, line: 626, baseType: !234, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !751, file: !507, line: 627, baseType: !234, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !751, file: !507, line: 629, baseType: !234, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !751, file: !507, line: 631, baseType: !234, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !751, file: !507, line: 632, baseType: !234, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !751, file: !507, line: 634, baseType: !234, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !751, file: !507, line: 635, baseType: !234, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !748, file: !507, line: 638, baseType: !234, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !508, file: !507, line: 919, baseType: !763, size: 32, offset: 448)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 32, elements: !247)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !508, file: !507, line: 920, baseType: !765, size: 16, offset: 480)
!765 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !507, line: 715, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 706, size: 16, elements: !768)
!768 = !{!769, !774}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !767, file: !507, line: 713, baseType: !770, size: 16)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !767, file: !507, line: 707, size: 16, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !770, file: !507, line: 709, baseType: !356, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !770, file: !507, line: 711, baseType: !356, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !767, file: !507, line: 714, baseType: !356, size: 16)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !508, file: !507, line: 921, baseType: !398, size: 16, offset: 496)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !508, file: !507, line: 922, baseType: !777, size: 32, offset: 512)
!777 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !507, line: 739, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 729, size: 32, elements: !780)
!780 = !{!781, !787}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !779, file: !507, line: 737, baseType: !782, size: 32)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !779, file: !507, line: 730, size: 32, elements: !783)
!783 = !{!784, !785, !786}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !782, file: !507, line: 732, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !782, file: !507, line: 733, baseType: !234, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !782, file: !507, line: 735, baseType: !234, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !779, file: !507, line: 738, baseType: !234, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !508, file: !507, line: 923, baseType: !789, size: 8, offset: 544)
!789 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !507, line: 765, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 756, size: 8, elements: !792)
!792 = !{!793, !799}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !791, file: !507, line: 763, baseType: !794, size: 8)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !791, file: !507, line: 757, size: 8, elements: !795)
!795 = !{!796, !797, !798}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !794, file: !507, line: 759, baseType: !216, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !794, file: !507, line: 761, baseType: !216, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !794, file: !507, line: 762, baseType: !216, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !791, file: !507, line: 764, baseType: !216, size: 8)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !508, file: !507, line: 924, baseType: !442, size: 24, offset: 552)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !508, file: !507, line: 925, baseType: !802, size: 32, offset: 576)
!802 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !507, line: 789, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 781, size: 32, elements: !805)
!805 = !{!806, !811}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !804, file: !507, line: 787, baseType: !807, size: 32)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !804, file: !507, line: 782, size: 32, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !807, file: !507, line: 783, baseType: !234, size: 12, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !807, file: !507, line: 785, baseType: !234, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !804, file: !507, line: 788, baseType: !234, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !508, file: !507, line: 926, baseType: !813, size: 32, offset: 608)
!813 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !507, line: 820, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 805, size: 32, elements: !816)
!816 = !{!817, !827}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !815, file: !507, line: 818, baseType: !818, size: 32)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !815, file: !507, line: 806, size: 32, elements: !819)
!819 = !{!820, !821, !822, !823, !824, !825, !826}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !818, file: !507, line: 807, baseType: !234, size: 2, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !818, file: !507, line: 808, baseType: !234, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !818, file: !507, line: 809, baseType: !234, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !818, file: !507, line: 810, baseType: !234, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !818, file: !507, line: 812, baseType: !234, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !818, file: !507, line: 814, baseType: !234, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !818, file: !507, line: 816, baseType: !234, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !815, file: !507, line: 819, baseType: !234, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !508, file: !507, line: 927, baseType: !829, size: 8, offset: 640)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !507, line: 881, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !507, line: 872, size: 8, elements: !833)
!833 = !{!834, !841}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !832, file: !507, line: 879, baseType: !835, size: 8)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !832, file: !507, line: 873, size: 8, elements: !836)
!836 = !{!837, !838, !839, !840}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !835, file: !507, line: 874, baseType: !216, size: 1, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !835, file: !507, line: 875, baseType: !216, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !835, file: !507, line: 876, baseType: !216, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !835, file: !507, line: 877, baseType: !216, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !832, file: !507, line: 880, baseType: !216, size: 8)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !845, line: 290, baseType: !846)
!845 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !845, line: 284, size: 96, elements: !847)
!847 = !{!848, !858, !869, !882, !899}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !846, file: !845, line: 285, baseType: !849, size: 8)
!849 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !845, line: 49, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !845, line: 43, size: 8, elements: !852)
!852 = !{!853, !857}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !851, file: !845, line: 47, baseType: !854, size: 8)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !851, file: !845, line: 44, size: 8, elements: !855)
!855 = !{!856}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !854, file: !845, line: 45, baseType: !216, size: 1, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !851, file: !845, line: 48, baseType: !216, size: 8)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !846, file: !845, line: 286, baseType: !859, size: 8, offset: 8)
!859 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !861)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !845, line: 67, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !845, line: 61, size: 8, elements: !863)
!863 = !{!864, !868}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !862, file: !845, line: 65, baseType: !865, size: 8)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !862, file: !845, line: 62, size: 8, elements: !866)
!866 = !{!867}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !865, file: !845, line: 64, baseType: !216, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !862, file: !845, line: 66, baseType: !216, size: 8)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !846, file: !845, line: 287, baseType: !870, size: 16, offset: 16)
!870 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !845, line: 89, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !845, line: 79, size: 16, elements: !873)
!873 = !{!874, !881}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !872, file: !845, line: 87, baseType: !875, size: 16)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !872, file: !845, line: 80, size: 16, elements: !876)
!876 = !{!877, !878, !879, !880}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !875, file: !845, line: 81, baseType: !356, size: 6, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !875, file: !845, line: 83, baseType: !356, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !875, file: !845, line: 85, baseType: !356, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !875, file: !845, line: 86, baseType: !356, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !872, file: !845, line: 88, baseType: !356, size: 16)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !846, file: !845, line: 288, baseType: !883, size: 32, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !845, line: 214, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !845, line: 199, size: 32, elements: !886)
!886 = !{!887, !898}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !885, file: !845, line: 212, baseType: !888, size: 32)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !885, file: !845, line: 200, size: 32, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !888, file: !845, line: 201, baseType: !234, size: 4, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !888, file: !845, line: 203, baseType: !234, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !888, file: !845, line: 205, baseType: !234, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !888, file: !845, line: 206, baseType: !234, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !888, file: !845, line: 207, baseType: !234, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !888, file: !845, line: 208, baseType: !234, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !888, file: !845, line: 209, baseType: !234, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !888, file: !845, line: 210, baseType: !234, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !885, file: !845, line: 213, baseType: !234, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !846, file: !845, line: 289, baseType: !900, size: 32, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !845, line: 268, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !845, line: 260, size: 32, elements: !903)
!903 = !{!904, !909}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !902, file: !845, line: 266, baseType: !905, size: 32)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !902, file: !845, line: 261, size: 32, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !905, file: !845, line: 262, baseType: !234, size: 4, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !905, file: !845, line: 264, baseType: !234, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !902, file: !845, line: 267, baseType: !234, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !912, line: 513, baseType: !913)
!912 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !912, line: 494, size: 480, elements: !914)
!914 = !{!915, !921, !931, !935, !945, !955, !965, !975, !979, !995, !1011, !1027, !1057, !1061, !1071, !1081, !1091, !1095}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !913, file: !912, line: 495, baseType: !916, size: 8)
!916 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !912, line: 45, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !912, line: 43, size: 8, elements: !919)
!919 = !{!920}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !918, file: !912, line: 44, baseType: !216, size: 8)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !913, file: !912, line: 496, baseType: !922, size: 8, offset: 8)
!922 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !912, line: 61, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !912, line: 55, size: 8, elements: !925)
!925 = !{!926, !930}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !924, file: !912, line: 59, baseType: !927, size: 8)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !924, file: !912, line: 56, size: 8, elements: !928)
!928 = !{!929}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !927, file: !912, line: 57, baseType: !216, size: 2, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !924, file: !912, line: 60, baseType: !216, size: 8)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !913, file: !912, line: 497, baseType: !932, size: 48, offset: 16)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 48, elements: !933)
!933 = !{!934}
!934 = !DISubrange(count: 6)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !913, file: !912, line: 498, baseType: !936, size: 8, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !912, line: 86, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !912, line: 80, size: 8, elements: !939)
!939 = !{!940, !944}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !938, file: !912, line: 84, baseType: !941, size: 8)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !938, file: !912, line: 81, size: 8, elements: !942)
!942 = !{!943}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !941, file: !912, line: 82, baseType: !216, size: 3, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !938, file: !912, line: 85, baseType: !216, size: 8)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !913, file: !912, line: 499, baseType: !946, size: 8, offset: 72)
!946 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !947)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !912, line: 121, baseType: !948)
!948 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !912, line: 115, size: 8, elements: !949)
!949 = !{!950, !954}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !948, file: !912, line: 119, baseType: !951, size: 8)
