; ModuleID = 'build/96b_meerkat96/minimal/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pinctrl_soc_pinmux = type { i32, i32, i32, i8 }
%struct.imx_gpio_config = type { %union.anon.1, %struct.GPIO_Type*, %struct.pinctrl_soc_pinmux*, i8 }
%union.anon.1 = type { i32 }
%struct.GPIO_Type = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.gpio_driver_api = type { i32 (%struct.device*, i8, i32)*, i32 (%struct.device*, i32*)*, i32 (%struct.device*, i32, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i8, i32, i32)*, i32 (%struct.device*, %struct.gpio_callback*, i1)*, i32 (%struct.device*)* }
%struct.gpio_callback = type { %struct._snode, void (%struct.device*, %struct.gpio_callback*, i32)*, i32 }
%struct._snode = type { %struct._snode* }
%struct.imx_gpio_data = type { %union.anon.1, %struct._slist }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.imx_uart_config = type { %struct.UART_Type*, i32, i8, %struct.pinctrl_dev_config*, void (%struct.device*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/minimal/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/minimal")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/minimal")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/minimal")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !111, file: !530, line: 258, type: !531, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !396, globals: !529, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/minimal")
!113 = !{!114, !146, !156, !205, !211, !332, !367}
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !115, line: 54, baseType: !32, size: 32, elements: !116)
!115 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145}
!117 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!118 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!119 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!120 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!121 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!122 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!123 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!124 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!125 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!126 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!127 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!128 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!129 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!130 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!131 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!132 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!133 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!134 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!135 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!136 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!137 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!138 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!139 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!140 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!141 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!142 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!143 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!144 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!145 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!146 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !115, line: 224, baseType: !32, size: 32, elements: !147)
!147 = !{!148, !149, !150, !151, !152, !153, !154, !155}
!148 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!149 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!150 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!151 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!152 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!153 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!154 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!155 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !115, line: 275, baseType: !32, size: 32, elements: !157)
!157 = !{!158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204}
!158 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!159 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!160 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!161 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!162 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!163 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!164 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!165 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!166 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!167 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!168 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!169 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!170 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!171 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!172 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!173 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!174 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!175 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!176 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!177 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!178 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!179 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!180 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!181 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!182 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!183 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!184 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!185 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!186 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!187 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!188 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!189 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!190 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!191 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!192 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!193 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!194 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!195 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!196 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!197 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!198 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!199 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!200 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!201 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!202 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!203 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!204 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!205 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !115, line: 327, baseType: !32, size: 32, elements: !206)
!206 = !{!207, !208, !209, !210}
!207 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!208 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!209 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!210 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!211 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !212, line: 76, baseType: !32, size: 32, elements: !213)
!212 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!214 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!215 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!216 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!217 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!218 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!219 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!220 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!221 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!222 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!223 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!224 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!225 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!226 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!227 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!228 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!229 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!230 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!231 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!232 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!233 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!234 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!235 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!236 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!237 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!238 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!239 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!240 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!241 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!242 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!243 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!244 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!245 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!246 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!247 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!248 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!249 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!250 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!251 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!252 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!253 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!254 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!255 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!256 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!257 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!258 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!259 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!260 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!261 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!262 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!263 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!264 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!265 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!266 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!267 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!268 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!269 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!270 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!271 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!272 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!273 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!274 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!275 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!276 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!277 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!278 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!279 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!280 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!281 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!282 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!283 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!284 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!285 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!286 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!287 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!288 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!289 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!290 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!291 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!292 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!293 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!294 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!295 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!296 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!297 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!298 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!299 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!300 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!301 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!302 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!303 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!304 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!305 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!306 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!307 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!308 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!309 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!310 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!311 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!312 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!313 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!314 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!315 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!316 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!317 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!318 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!319 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!320 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!321 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!322 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!323 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!324 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!325 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!326 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!327 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!328 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!329 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!330 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!331 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!332 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !115, line: 237, baseType: !32, size: 32, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366}
!334 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!335 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!336 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!337 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!338 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!339 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!340 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!341 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!342 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!343 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!344 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!345 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!346 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!347 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!348 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!349 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!350 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!351 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!352 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!353 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!354 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!355 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!356 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!357 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!358 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!359 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!360 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!361 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!362 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!363 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!364 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!365 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!366 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!367 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !212, line: 44, baseType: !32, size: 32, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395}
!369 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!370 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!371 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!372 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!373 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!374 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!375 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!376 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!377 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!378 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!379 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!380 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!381 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!382 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!383 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!384 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!385 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!386 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!387 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!388 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!389 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!390 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!391 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!392 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!393 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!394 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!395 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!396 = !{!397, !472, !515, !528, !404}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !399, line: 4575, baseType: !400)
!399 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 4532, size: 390144, elements: !401)
!401 = !{!402, !405, !406, !407, !408, !414, !424, !428, !438, !442}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !400, file: !399, line: 4533, baseType: !403, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !400, file: !399, line: 4534, baseType: !403, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !400, file: !399, line: 4535, baseType: !403, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !400, file: !399, line: 4536, baseType: !403, size: 32, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !400, file: !399, line: 4537, baseType: !409, size: 16256, offset: 128)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 16256, elements: !412)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !411)
!411 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!412 = !{!413}
!413 = !DISubrange(count: 2032)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !400, file: !399, line: 4543, baseType: !415, size: 4224, offset: 16384)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 4224, elements: !422)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !399, line: 4538, size: 128, elements: !417)
!417 = !{!418, !419, !420, !421}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !416, file: !399, line: 4539, baseType: !403, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_SET", scope: !416, file: !399, line: 4540, baseType: !403, size: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_CLR", scope: !416, file: !399, line: 4541, baseType: !403, size: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_TOG", scope: !416, file: !399, line: 4542, baseType: !403, size: 32, offset: 96)
!422 = !{!423}
!423 = !DISubrange(count: 33)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !400, file: !399, line: 4544, baseType: !425, size: 110464, offset: 20608)
!425 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 110464, elements: !426)
!426 = !{!427}
!427 = !DISubrange(count: 13808)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !400, file: !399, line: 4550, baseType: !429, size: 24448, offset: 131072)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 24448, elements: !436)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !399, line: 4545, size: 128, elements: !431)
!431 = !{!432, !433, !434, !435}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !430, file: !399, line: 4546, baseType: !403, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_SET", scope: !430, file: !399, line: 4547, baseType: !403, size: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_CLR", scope: !430, file: !399, line: 4548, baseType: !403, size: 32, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_TOG", scope: !430, file: !399, line: 4549, baseType: !403, size: 32, offset: 96)
!436 = !{!437}
!437 = !DISubrange(count: 191)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !400, file: !399, line: 4551, baseType: !439, size: 106624, offset: 155520)
!439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 106624, elements: !440)
!440 = !{!441}
!441 = !DISubrange(count: 13328)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !400, file: !399, line: 4574, baseType: !443, size: 128000, offset: 262144)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 128000, elements: !470)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !400, file: !399, line: 4552, size: 1024, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !466, !467, !468, !469}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT", scope: !444, file: !399, line: 4553, baseType: !403, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_SET", scope: !444, file: !399, line: 4554, baseType: !403, size: 32, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_CLR", scope: !444, file: !399, line: 4555, baseType: !403, size: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_TOG", scope: !444, file: !399, line: 4556, baseType: !403, size: 32, offset: 96)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "MISC", scope: !444, file: !399, line: 4557, baseType: !403, size: 32, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_SET", scope: !444, file: !399, line: 4558, baseType: !403, size: 32, offset: 160)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_CLR", scope: !444, file: !399, line: 4559, baseType: !403, size: 32, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_TOG", scope: !444, file: !399, line: 4560, baseType: !403, size: 32, offset: 224)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "POST", scope: !444, file: !399, line: 4561, baseType: !403, size: 32, offset: 256)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_SET", scope: !444, file: !399, line: 4562, baseType: !403, size: 32, offset: 288)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_CLR", scope: !444, file: !399, line: 4563, baseType: !403, size: 32, offset: 320)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_TOG", scope: !444, file: !399, line: 4564, baseType: !403, size: 32, offset: 352)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "PRE", scope: !444, file: !399, line: 4565, baseType: !403, size: 32, offset: 384)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_SET", scope: !444, file: !399, line: 4566, baseType: !403, size: 32, offset: 416)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_CLR", scope: !444, file: !399, line: 4567, baseType: !403, size: 32, offset: 448)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_TOG", scope: !444, file: !399, line: 4568, baseType: !403, size: 32, offset: 480)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !444, file: !399, line: 4569, baseType: !463, size: 384, offset: 512)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 384, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 48)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL", scope: !444, file: !399, line: 4570, baseType: !403, size: 32, offset: 896)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_SET", scope: !444, file: !399, line: 4571, baseType: !403, size: 32, offset: 928)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_CLR", scope: !444, file: !399, line: 4572, baseType: !403, size: 32, offset: 960)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !444, file: !399, line: 4573, baseType: !403, size: 32, offset: 992)
!470 = !{!471}
!471 = !DISubrange(count: 125)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDC_Type", file: !399, line: 38320, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 38303, size: 23040, elements: !475)
!475 = !{!476, !478, !482, !483, !484, !485, !489, !493, !497, !501, !505}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "VIR", scope: !474, file: !399, line: 38304, baseType: !477, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !403)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !474, file: !399, line: 38305, baseType: !479, size: 256, offset: 32)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 256, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "STAT", scope: !474, file: !399, line: 38306, baseType: !403, size: 32, offset: 288)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "INTCTRL", scope: !474, file: !399, line: 38307, baseType: !403, size: 32, offset: 320)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "INTSTAT", scope: !474, file: !399, line: 38308, baseType: !403, size: 32, offset: 352)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !474, file: !399, line: 38309, baseType: !486, size: 3712, offset: 384)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 3712, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 464)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "MDA", scope: !474, file: !399, line: 38310, baseType: !490, size: 864, offset: 4096)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 864, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 27)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !474, file: !399, line: 38311, baseType: !494, size: 3232, offset: 4960)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 3232, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 404)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "PDAP", scope: !474, file: !399, line: 38312, baseType: !498, size: 3776, offset: 8192)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 3776, elements: !499)
!499 = !{!500}
!500 = !DISubrange(count: 118)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_3", scope: !474, file: !399, line: 38313, baseType: !502, size: 4416, offset: 11968)
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 4416, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 552)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "MR", scope: !474, file: !399, line: 38319, baseType: !506, size: 6656, offset: 16384)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 6656, elements: !513)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !474, file: !399, line: 38314, size: 128, elements: !508)
!508 = !{!509, !510, !511, !512}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "MRSA", scope: !507, file: !399, line: 38315, baseType: !403, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "MREA", scope: !507, file: !399, line: 38316, baseType: !403, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "MRC", scope: !507, file: !399, line: 38317, baseType: !403, size: 32, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "MRVS", scope: !507, file: !399, line: 38318, baseType: !403, size: 32, offset: 96)
!513 = !{!514}
!514 = !DISubrange(count: 52)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "WDOG_Type", file: !399, line: 43319, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 43313, size: 80, elements: !518)
!518 = !{!519, !523, !524, !526, !527}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "WCR", scope: !517, file: !399, line: 43314, baseType: !520, size: 16)
!520 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !522)
!522 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "WSR", scope: !517, file: !399, line: 43315, baseType: !520, size: 16, offset: 16)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "WRSR", scope: !517, file: !399, line: 43316, baseType: !525, size: 16, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !520)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "WICR", scope: !517, file: !399, line: 43317, baseType: !520, size: 16, offset: 48)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "WMCR", scope: !517, file: !399, line: 43318, baseType: !520, size: 16, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 32)
!529 = !{!109}
!530 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !533, line: 51, size: 64, elements: !534)
!533 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!534 = !{!535, !542}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !532, file: !533, line: 60, baseType: !536, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 32)
!537 = !DISubroutineType(types: !538)
!538 = !{!103, !539}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !541)
!541 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !533, line: 48, flags: DIFlagFwdDecl)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !532, file: !533, line: 65, baseType: !539, size: 32, offset: 32)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !545, file: !552, line: 21, type: !106, isLocal: true, isDefinition: true)
!545 = distinct !DICompileUnit(language: DW_LANG_C99, file: !546, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !547, globals: !551, splitDebugInlining: false, nameTableKind: None)
!546 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/minimal")
!547 = !{!548, !103, !102}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !550, line: 22, baseType: !103)
!550 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!551 = !{!543}
!552 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !555, file: !656, line: 603, type: !658, isLocal: true, isDefinition: true, align: 32)
!555 = distinct !DICompileUnit(language: DW_LANG_C99, file: !556, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !557, globals: !653, splitDebugInlining: false, nameTableKind: None)
!556 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/minimal")
!557 = !{!102, !103, !558}
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !561, line: 336, size: 608, elements: !562)
!561 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!562 = !{!563, !593, !597, !601, !614, !619, !625, !631, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !560, file: !561, line: 365, baseType: !564, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!565 = !DISubroutineType(types: !566)
!566 = !{!103, !567, !592}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !569)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !570, line: 378, size: 192, elements: !571)
!570 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!571 = !{!572, !576, !577, !578, !585, !586}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !569, file: !570, line: 380, baseType: !573, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!575 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !569, file: !570, line: 382, baseType: !13, size: 32, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !569, file: !570, line: 384, baseType: !13, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !569, file: !570, line: 386, baseType: !579, size: 32, offset: 96)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 32)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !570, line: 351, size: 16, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !580, file: !570, line: 359, baseType: !410, size: 8)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !580, file: !570, line: 364, baseType: !584, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!584 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !569, file: !570, line: 388, baseType: !102, size: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !569, file: !570, line: 396, baseType: !587, size: 32, offset: 160)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !589)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !570, line: 43, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !591)
!591 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !560, file: !561, line: 366, baseType: !594, size: 32, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !567, !411}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !560, file: !561, line: 374, baseType: !598, size: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 32)
!599 = !DISubroutineType(types: !600)
!600 = !{!103, !567}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !560, file: !561, line: 377, baseType: !602, size: 32, offset: 96)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DISubroutineType(types: !604)
!604 = !{!103, !567, !605}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !561, line: 122, size: 64, elements: !608)
!608 = !{!609, !610, !611, !612, !613}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !607, file: !561, line: 123, baseType: !404, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !607, file: !561, line: 124, baseType: !410, size: 8, offset: 32)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !607, file: !561, line: 125, baseType: !410, size: 8, offset: 40)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !607, file: !561, line: 126, baseType: !410, size: 8, offset: 48)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !607, file: !561, line: 127, baseType: !410, size: 8, offset: 56)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !560, file: !561, line: 379, baseType: !615, size: 32, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 32)
!616 = !DISubroutineType(types: !617)
!617 = !{!103, !567, !618}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !560, file: !561, line: 384, baseType: !620, size: 32, offset: 160)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!621 = !DISubroutineType(types: !622)
!622 = !{!103, !567, !623, !103}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !560, file: !561, line: 393, baseType: !626, size: 32, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 32)
!627 = !DISubroutineType(types: !628)
!628 = !{!103, !567, !629, !630}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !560, file: !561, line: 402, baseType: !632, size: 32, offset: 224)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = !DISubroutineType(types: !634)
!634 = !{null, !567}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !560, file: !561, line: 405, baseType: !632, size: 32, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !560, file: !561, line: 408, baseType: !598, size: 32, offset: 288)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !560, file: !561, line: 411, baseType: !632, size: 32, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !560, file: !561, line: 414, baseType: !632, size: 32, offset: 352)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !560, file: !561, line: 417, baseType: !598, size: 32, offset: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !560, file: !561, line: 420, baseType: !598, size: 32, offset: 416)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !560, file: !561, line: 423, baseType: !632, size: 32, offset: 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !560, file: !561, line: 426, baseType: !632, size: 32, offset: 480)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !560, file: !561, line: 429, baseType: !598, size: 32, offset: 512)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !560, file: !561, line: 432, baseType: !598, size: 32, offset: 544)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !560, file: !561, line: 435, baseType: !646, size: 32, offset: 576)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 32)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !567, !649, !102}
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !561, line: 142, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !567, !102}
!653 = !{!553, !654}
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !555, file: !656, line: 38, type: !657, isLocal: true, isDefinition: true)
!656 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !567)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !533, line: 51, size: 64, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !659, file: !533, line: 60, baseType: !598, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !659, file: !533, line: 65, baseType: !567, size: 32, offset: 32)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "mcux_igpio_pinmux_0", scope: !665, file: !770, line: 318, type: !847, isLocal: false, isDefinition: true)
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !667, retainedTypes: !684, globals: !767, splitDebugInlining: false, nameTableKind: None)
!666 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/minimal")
!667 = !{!668, !674, !679}
!668 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !669, line: 506, baseType: !32, size: 32, elements: !670)
!669 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!670 = !{!671, !672, !673}
!671 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!672 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!673 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!674 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !669, line: 512, baseType: !32, size: 32, elements: !675)
!675 = !{!676, !677, !678}
!676 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!677 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!678 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!679 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_gpio_pin_action", file: !680, line: 66, baseType: !32, size: 32, elements: !681)
!680 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./gpio_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!681 = !{!682, !683}
!682 = !DIEnumerator(name: "gpioPinClear", value: 0)
!683 = !DIEnumerator(name: "gpioPinSet", value: 1)
!684 = !{!685, !755, !760, !720, !674, !668, !765, !102, !528, !735, !766}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !669, line: 523, size: 288, elements: !688)
!688 = !{!689, !710, !716, !721, !725, !726, !727, !731, !751}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !687, file: !669, line: 524, baseType: !690, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DISubroutineType(types: !692)
!692 = !{!103, !693, !708, !709}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !570, line: 378, size: 192, elements: !696)
!696 = !{!697, !698, !699, !700, !706, !707}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !695, file: !570, line: 380, baseType: !573, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !695, file: !570, line: 382, baseType: !13, size: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !695, file: !570, line: 384, baseType: !13, size: 32, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !695, file: !570, line: 386, baseType: !701, size: 32, offset: 96)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !570, line: 351, size: 16, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !702, file: !570, line: 359, baseType: !410, size: 8)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !702, file: !570, line: 364, baseType: !584, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !695, file: !570, line: 388, baseType: !102, size: 32, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !695, file: !570, line: 396, baseType: !587, size: 32, offset: 160)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !669, line: 237, baseType: !410)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !669, line: 257, baseType: !404)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !687, file: !669, line: 530, baseType: !711, size: 32, offset: 32)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = !DISubroutineType(types: !713)
!713 = !{!103, !693, !714}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !669, line: 229, baseType: !404)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !687, file: !669, line: 532, baseType: !717, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 32)
!718 = !DISubroutineType(types: !719)
!719 = !{!103, !693, !720, !715}
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !669, line: 216, baseType: !404)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !687, file: !669, line: 535, baseType: !722, size: 32, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 32)
!723 = !DISubroutineType(types: !724)
!724 = !{!103, !693, !720}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !687, file: !669, line: 537, baseType: !722, size: 32, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !687, file: !669, line: 539, baseType: !722, size: 32, offset: 160)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !687, file: !669, line: 541, baseType: !728, size: 32, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 32)
!729 = !DISubroutineType(types: !730)
!730 = !{!103, !693, !708, !668, !674}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !687, file: !669, line: 544, baseType: !732, size: 32, offset: 224)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!733 = !DISubroutineType(types: !734)
!734 = !{!103, !693, !735, !584}
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 32)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !669, line: 478, size: 96, elements: !737)
!737 = !{!738, !745, !750}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !736, file: !669, line: 482, baseType: !739, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !740, line: 33, baseType: !741)
!740 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !740, line: 29, size: 32, elements: !742)
!742 = !{!743}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !741, file: !740, line: 30, baseType: !744, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !736, file: !669, line: 485, baseType: !746, size: 32, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !669, line: 464, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DISubroutineType(types: !749)
!749 = !{null, !693, !735, !720}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !736, file: !669, line: 493, baseType: !720, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !687, file: !669, line: 547, baseType: !752, size: 32, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = !DISubroutineType(types: !754)
!754 = !{!404, !693}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !669, line: 428, size: 32, elements: !758)
!758 = !{!759}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !757, file: !669, line: 434, baseType: !720, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !669, line: 441, size: 32, elements: !763)
!763 = !{!764}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !762, file: !669, line: 447, baseType: !720, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!767 = !{!663, !768, !774, !776, !786, !798, !800, !831, !833, !845}
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !665, file: !770, line: 318, type: !771, isLocal: false, isDefinition: true, align: 16)
!770 = !DIFile(filename: "zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 400, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 25)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "__device_dts_ord_25", scope: !665, file: !770, line: 318, type: !694, isLocal: false, isDefinition: true, align: 32)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_25", scope: !665, file: !770, line: 318, type: !778, isLocal: true, isDefinition: true, align: 32)
!778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !533, line: 51, size: 64, elements: !780)
!780 = !{!781, !785}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !779, file: !533, line: 60, baseType: !782, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 32)
!783 = !DISubroutineType(types: !784)
!784 = !{!103, !693}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !779, file: !533, line: 65, baseType: !693, size: 32, offset: 32)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "imx_gpio_0_data", scope: !665, file: !770, line: 318, type: !788, isLocal: true, isDefinition: true)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_data", file: !770, line: 33, size: 96, elements: !789)
!789 = !{!790, !791}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !788, file: !770, line: 35, baseType: !762, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !788, file: !770, line: 37, baseType: !792, size: 64, offset: 32)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !740, line: 40, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !740, line: 35, size: 64, elements: !794)
!794 = !{!795, !797}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !793, file: !740, line: 36, baseType: !796, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !793, file: !740, line: 37, baseType: !796, size: 32, offset: 32)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_25", scope: !665, file: !770, line: 318, type: !702, isLocal: true, isDefinition: true, align: 8)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "imx_gpio_0_config", scope: !665, file: !770, line: 318, type: !802, isLocal: true, isDefinition: true)
!802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_config", file: !770, line: 23, size: 128, elements: !804)
!804 = !{!805, !806, !819, !830}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !803, file: !770, line: 25, baseType: !757, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !803, file: !770, line: 26, baseType: !807, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_Type", file: !399, line: 19729, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 19720, size: 256, elements: !810)
!810 = !{!811, !812, !813, !814, !815, !816, !817, !818}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !809, file: !399, line: 19721, baseType: !403, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "GDIR", scope: !809, file: !399, line: 19722, baseType: !403, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "PSR", scope: !809, file: !399, line: 19723, baseType: !477, size: 32, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ICR1", scope: !809, file: !399, line: 19724, baseType: !403, size: 32, offset: 96)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "ICR2", scope: !809, file: !399, line: 19725, baseType: !403, size: 32, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !809, file: !399, line: 19726, baseType: !403, size: 32, offset: 160)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "ISR", scope: !809, file: !399, line: 19727, baseType: !403, size: 32, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "EDGE_SEL", scope: !809, file: !399, line: 19728, baseType: !403, size: 32, offset: 224)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "pin_muxes", scope: !803, file: !770, line: 28, baseType: !820, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_soc_pinmux", file: !823, line: 51, size: 128, elements: !824)
!823 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/pinctrl_soc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!824 = !{!825, !826, !827, !828, !829}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "mux_register", scope: !822, file: !823, line: 52, baseType: !404, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "config_register", scope: !822, file: !823, line: 53, baseType: !404, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "input_register", scope: !822, file: !823, line: 54, baseType: !404, size: 32, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "mux_mode", scope: !822, file: !823, line: 55, baseType: !410, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "input_daisy", scope: !822, file: !823, line: 56, baseType: !404, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "mux_count", scope: !803, file: !770, line: 29, baseType: !410, size: 8, offset: 96)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "imx_gpio_driver_api", scope: !665, file: !770, line: 249, type: !686, isLocal: true, isDefinition: true)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "__isr_imx_gpio_port_isr_irq_0", scope: !835, file: !770, line: 318, type: !838, isLocal: true, isDefinition: true, align: 32)
!835 = distinct !DISubprogram(name: "imx_gpio_0_init", scope: !770, file: !770, line: 318, type: !783, scopeLine: 318, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !665, retainedNodes: !836)
!836 = !{!837}
!837 = !DILocalVariable(name: "port", arg: 1, scope: !835, file: !770, line: 318, type: !693)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !839)
!839 = !{!840, !842, !843, !844}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !838, file: !10, line: 55, baseType: !841, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !838, file: !10, line: 57, baseType: !841, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !838, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !838, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "__isr_imx_gpio_port_isr_irq_1", scope: !835, file: !770, line: 318, type: !838, isLocal: true, isDefinition: true, align: 32)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !821, size: 2048, elements: !848)
!848 = !{!849}
!849 = !DISubrange(count: 16)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !852, file: !857, line: 7, type: !858, isLocal: false, isDefinition: true, align: 16)
!852 = distinct !DICompileUnit(language: DW_LANG_C99, file: !853, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !854, splitDebugInlining: false, nameTableKind: None)
!853 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/minimal/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/minimal")
!854 = !{!850, !855}
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_198", scope: !852, file: !857, line: 12, type: !858, isLocal: false, isDefinition: true, align: 16)
!857 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/minimal")
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 48, elements: !859)
!859 = !{!860}
!860 = !DISubrange(count: 3)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "imx_uart_0_config", scope: !863, file: !1060, line: 339, type: !1058, isLocal: true, isDefinition: true)
!863 = distinct !DICompileUnit(language: DW_LANG_C99, file: !864, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !865, retainedTypes: !951, globals: !1096, splitDebugInlining: false, nameTableKind: None)
!864 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/minimal")
!865 = !{!30, !866, !904, !932, !936, !940, !945}
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_status_flag", file: !867, line: 122, baseType: !32, size: 32, elements: !868)
!867 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./uart_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!868 = !{!869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903}
!869 = !DIEnumerator(name: "uartStatusRxCharReady", value: 15)
!870 = !DIEnumerator(name: "uartStatusRxError", value: 14)
!871 = !DIEnumerator(name: "uartStatusRxOverrunError", value: 13)
!872 = !DIEnumerator(name: "uartStatusRxFrameError", value: 12)
!873 = !DIEnumerator(name: "uartStatusRxBreakDetect", value: 11)
!874 = !DIEnumerator(name: "uartStatusRxParityError", value: 10)
!875 = !DIEnumerator(name: "uartStatusParityError", value: 9699343)
!876 = !DIEnumerator(name: "uartStatusRtsStatus", value: 9699342)
!877 = !DIEnumerator(name: "uartStatusTxReady", value: 9699341)
!878 = !DIEnumerator(name: "uartStatusRtsDelta", value: 9699340)
!879 = !DIEnumerator(name: "uartStatusEscape", value: 9699339)
!880 = !DIEnumerator(name: "uartStatusFrameError", value: 9699338)
!881 = !DIEnumerator(name: "uartStatusRxReady", value: 9699337)
!882 = !DIEnumerator(name: "uartStatusAgingTimer", value: 9699336)
!883 = !DIEnumerator(name: "uartStatusDtrDelta", value: 9699335)
!884 = !DIEnumerator(name: "uartStatusRxDs", value: 9699334)
!885 = !DIEnumerator(name: "uartStatustAirWake", value: 9699333)
!886 = !DIEnumerator(name: "uartStatusAwake", value: 9699332)
!887 = !DIEnumerator(name: "uartStatusRs485SlaveAddrMatch", value: 9699331)
!888 = !DIEnumerator(name: "uartStatusAutoBaud", value: 9961487)
!889 = !DIEnumerator(name: "uartStatusTxEmpty", value: 9961486)
!890 = !DIEnumerator(name: "uartStatusDtr", value: 9961485)
!891 = !DIEnumerator(name: "uartStatusIdle", value: 9961484)
!892 = !DIEnumerator(name: "uartStatusAutoBaudCntStop", value: 9961483)
!893 = !DIEnumerator(name: "uartStatusRiDelta", value: 9961482)
!894 = !DIEnumerator(name: "uartStatusRi", value: 9961481)
!895 = !DIEnumerator(name: "uartStatusIr", value: 9961480)
!896 = !DIEnumerator(name: "uartStatusWake", value: 9961479)
!897 = !DIEnumerator(name: "uartStatusDcdDelta", value: 9961478)
!898 = !DIEnumerator(name: "uartStatusDcd", value: 9961477)
!899 = !DIEnumerator(name: "uartStatusRts", value: 9961476)
!900 = !DIEnumerator(name: "uartStatusTxComplete", value: 9961475)
!901 = !DIEnumerator(name: "uartStatusBreakDetect", value: 9961474)
!902 = !DIEnumerator(name: "uartStatusRxOverrun", value: 9961473)
!903 = !DIEnumerator(name: "uartStatusRxDataReady", value: 9961472)
!904 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_interrupt", file: !867, line: 91, baseType: !32, size: 32, elements: !905)
!905 = !{!906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931}
!906 = !DIEnumerator(name: "uartIntAutoBaud", value: 8388623)
!907 = !DIEnumerator(name: "uartIntTxReady", value: 8388621)
!908 = !DIEnumerator(name: "uartIntIdle", value: 8388620)
!909 = !DIEnumerator(name: "uartIntRxReady", value: 8388617)
!910 = !DIEnumerator(name: "uartIntTxEmpty", value: 8388614)
!911 = !DIEnumerator(name: "uartIntRtsDelta", value: 8388613)
!912 = !DIEnumerator(name: "uartIntEscape", value: 8650767)
!913 = !DIEnumerator(name: "uartIntRts", value: 8650756)
!914 = !DIEnumerator(name: "uartIntAgingTimer", value: 8650755)
!915 = !DIEnumerator(name: "uartIntDtr", value: 8912909)
!916 = !DIEnumerator(name: "uartIntParityError", value: 8912908)
!917 = !DIEnumerator(name: "uartIntFrameError", value: 8912907)
!918 = !DIEnumerator(name: "uartIntDcd", value: 8912905)
!919 = !DIEnumerator(name: "uartIntRi", value: 8912904)
!920 = !DIEnumerator(name: "uartIntRxDs", value: 8912902)
!921 = !DIEnumerator(name: "uartInttAirWake", value: 8912901)
!922 = !DIEnumerator(name: "uartIntAwake", value: 8912900)
!923 = !DIEnumerator(name: "uartIntDtrDelta", value: 8912899)
!924 = !DIEnumerator(name: "uartIntAutoBaudCnt", value: 8912896)
!925 = !DIEnumerator(name: "uartIntIr", value: 9175048)
!926 = !DIEnumerator(name: "uartIntWake", value: 9175047)
!927 = !DIEnumerator(name: "uartIntTxComplete", value: 9175043)
!928 = !DIEnumerator(name: "uartIntBreakDetect", value: 9175042)
!929 = !DIEnumerator(name: "uartIntRxOverrun", value: 9175041)
!930 = !DIEnumerator(name: "uartIntRxDataReady", value: 9175040)
!931 = !DIEnumerator(name: "uartIntRs485SlaveAddrMatch", value: 12058627)
!932 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_word_length", file: !867, line: 60, baseType: !32, size: 32, elements: !933)
!933 = !{!934, !935}
!934 = !DIEnumerator(name: "uartWordLength7Bits", value: 0)
!935 = !DIEnumerator(name: "uartWordLength8Bits", value: 32)
!936 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_stop_bit_num", file: !867, line: 67, baseType: !32, size: 32, elements: !937)
!937 = !{!938, !939}
!938 = !DIEnumerator(name: "uartStopBitNumOne", value: 0)
!939 = !DIEnumerator(name: "uartStopBitNumTwo", value: 64)
!940 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_partity_mode", file: !867, line: 74, baseType: !32, size: 32, elements: !941)
!941 = !{!942, !943, !944}
!942 = !DIEnumerator(name: "uartParityDisable", value: 0)
!943 = !DIEnumerator(name: "uartParityEven", value: 256)
!944 = !DIEnumerator(name: "uartParityOdd", value: 384)
!945 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_direction_mode", file: !867, line: 82, baseType: !32, size: 32, elements: !946)
!946 = !{!947, !948, !949, !950}
!947 = !DIEnumerator(name: "uartDirectionDisable", value: 0)
!948 = !DIEnumerator(name: "uartDirectionTx", value: 4)
!949 = !DIEnumerator(name: "uartDirectionRx", value: 2)
!950 = !DIEnumerator(name: "uartDirectionTxRx", value: 6)
!951 = !{!102, !103, !952, !1031, !1057, !1095, !404, !584, !410}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !561, line: 336, size: 608, elements: !955)
!955 = !{!956, !975, !979, !983, !996, !1001, !1005, !1009, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !954, file: !561, line: 365, baseType: !957, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!958 = !DISubroutineType(types: !959)
!959 = !{!103, !960, !592}
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !570, line: 378, size: 192, elements: !963)
!963 = !{!964, !965, !966, !967, !973, !974}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !962, file: !570, line: 380, baseType: !573, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !962, file: !570, line: 382, baseType: !13, size: 32, offset: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !962, file: !570, line: 384, baseType: !13, size: 32, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !962, file: !570, line: 386, baseType: !968, size: 32, offset: 96)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !570, line: 351, size: 16, elements: !970)
!970 = !{!971, !972}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !969, file: !570, line: 359, baseType: !410, size: 8)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !969, file: !570, line: 364, baseType: !584, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !962, file: !570, line: 388, baseType: !102, size: 32, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !962, file: !570, line: 396, baseType: !587, size: 32, offset: 160)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !954, file: !561, line: 366, baseType: !976, size: 32, offset: 32)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!977 = !DISubroutineType(types: !978)
!978 = !{null, !960, !411}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !954, file: !561, line: 374, baseType: !980, size: 32, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 32)
!981 = !DISubroutineType(types: !982)
!982 = !{!103, !960}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !954, file: !561, line: 377, baseType: !984, size: 32, offset: 96)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DISubroutineType(types: !986)
!986 = !{!103, !960, !987}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !561, line: 122, size: 64, elements: !990)
!990 = !{!991, !992, !993, !994, !995}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !989, file: !561, line: 123, baseType: !404, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !989, file: !561, line: 124, baseType: !410, size: 8, offset: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !989, file: !561, line: 125, baseType: !410, size: 8, offset: 40)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !989, file: !561, line: 126, baseType: !410, size: 8, offset: 48)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !989, file: !561, line: 127, baseType: !410, size: 8, offset: 56)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !954, file: !561, line: 379, baseType: !997, size: 32, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 32)
!998 = !DISubroutineType(types: !999)
!999 = !{!103, !960, !1000}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !954, file: !561, line: 384, baseType: !1002, size: 32, offset: 160)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 32)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!103, !960, !623, !103}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !954, file: !561, line: 393, baseType: !1006, size: 32, offset: 192)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 32)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{!103, !960, !629, !630}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !954, file: !561, line: 402, baseType: !1010, size: 32, offset: 224)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 32)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{null, !960}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !954, file: !561, line: 405, baseType: !1010, size: 32, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !954, file: !561, line: 408, baseType: !980, size: 32, offset: 288)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !954, file: !561, line: 411, baseType: !1010, size: 32, offset: 320)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !954, file: !561, line: 414, baseType: !1010, size: 32, offset: 352)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !954, file: !561, line: 417, baseType: !980, size: 32, offset: 384)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !954, file: !561, line: 420, baseType: !980, size: 32, offset: 416)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !954, file: !561, line: 423, baseType: !1010, size: 32, offset: 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !954, file: !561, line: 426, baseType: !1010, size: 32, offset: 480)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !954, file: !561, line: 429, baseType: !980, size: 32, offset: 512)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !954, file: !561, line: 432, baseType: !980, size: 32, offset: 544)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !954, file: !561, line: 435, baseType: !1024, size: 32, offset: 576)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 32)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{null, !960, !1027, !102}
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !561, line: 142, baseType: !1028)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 32)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{null, !960, !102}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_Type", file: !399, line: 41342, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 41322, size: 1504, elements: !1034)
!1034 = !{!1035, !1036, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "URXD", scope: !1033, file: !399, line: 41323, baseType: !477, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !1033, file: !399, line: 41324, baseType: !1037, size: 480, offset: 32)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 480, elements: !1038)
!1038 = !{!1039}
!1039 = !DISubrange(count: 60)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "UTXD", scope: !1033, file: !399, line: 41325, baseType: !403, size: 32, offset: 512)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !1033, file: !399, line: 41326, baseType: !1037, size: 480, offset: 544)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "UCR1", scope: !1033, file: !399, line: 41327, baseType: !403, size: 32, offset: 1024)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "UCR2", scope: !1033, file: !399, line: 41328, baseType: !403, size: 32, offset: 1056)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "UCR3", scope: !1033, file: !399, line: 41329, baseType: !403, size: 32, offset: 1088)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "UCR4", scope: !1033, file: !399, line: 41330, baseType: !403, size: 32, offset: 1120)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "UFCR", scope: !1033, file: !399, line: 41331, baseType: !403, size: 32, offset: 1152)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "USR1", scope: !1033, file: !399, line: 41332, baseType: !403, size: 32, offset: 1184)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "USR2", scope: !1033, file: !399, line: 41333, baseType: !403, size: 32, offset: 1216)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "UESC", scope: !1033, file: !399, line: 41334, baseType: !403, size: 32, offset: 1248)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "UTIM", scope: !1033, file: !399, line: 41335, baseType: !403, size: 32, offset: 1280)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "UBIR", scope: !1033, file: !399, line: 41336, baseType: !403, size: 32, offset: 1312)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "UBMR", scope: !1033, file: !399, line: 41337, baseType: !403, size: 32, offset: 1344)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "UBRC", scope: !1033, file: !399, line: 41338, baseType: !477, size: 32, offset: 1376)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "ONEMS", scope: !1033, file: !399, line: 41339, baseType: !403, size: 32, offset: 1408)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "UTS", scope: !1033, file: !399, line: 41340, baseType: !403, size: 32, offset: 1440)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "UMCR", scope: !1033, file: !399, line: 41341, baseType: !403, size: 32, offset: 1472)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 32)
!1058 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_uart_config", file: !1060, line: 29, size: 160, elements: !1061)
!1060 = !DIFile(filename: "zephyr/drivers/serial/uart_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1061 = !{!1062, !1063, !1064, !1065, !1094}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1059, file: !1060, line: 30, baseType: !1031, size: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "baud_rate", scope: !1059, file: !1060, line: 31, baseType: !404, size: 32, offset: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "modem_mode", scope: !1059, file: !1060, line: 32, baseType: !410, size: 8, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "pincfg", scope: !1059, file: !1060, line: 33, baseType: !1066, size: 32, offset: 96)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 32)
!1067 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_dev_config", file: !1069, line: 60, size: 64, elements: !1070)
!1069 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1070 = !{!1071, !1093}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !1068, file: !1069, line: 69, baseType: !1072, size: 32)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 32)
!1073 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_state", file: !1069, line: 50, size: 64, elements: !1075)
!1075 = !{!1076, !1091, !1092}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "pins", scope: !1074, file: !1069, line: 52, baseType: !1077, size: 32)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 32)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1079)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "pinctrl_soc_pin_t", file: !823, line: 64, baseType: !1080)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_soc_pin", file: !823, line: 59, size: 160, elements: !1081)
!1081 = !{!1082, !1090}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "pinmux", scope: !1080, file: !823, line: 60, baseType: !1083, size: 128)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_soc_pinmux", file: !823, line: 51, size: 128, elements: !1084)
!1084 = !{!1085, !1086, !1087, !1088, !1089}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "mux_register", scope: !1083, file: !823, line: 52, baseType: !404, size: 32)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "config_register", scope: !1083, file: !823, line: 53, baseType: !404, size: 32, offset: 32)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "input_register", scope: !1083, file: !823, line: 54, baseType: !404, size: 32, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "mux_mode", scope: !1083, file: !823, line: 55, baseType: !410, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "input_daisy", scope: !1083, file: !823, line: 56, baseType: !404, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "pin_ctrl_flags", scope: !1080, file: !823, line: 61, baseType: !404, size: 32, offset: 128)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "pin_cnt", scope: !1074, file: !1069, line: 54, baseType: !410, size: 8, offset: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1074, file: !1069, line: 56, baseType: !410, size: 8, offset: 40)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "state_cnt", scope: !1068, file: !1069, line: 71, baseType: !410, size: 8, offset: 32)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "irq_config_func", scope: !1059, file: !1060, line: 35, baseType: !1010, size: 32, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!1096 = !{!1097, !1102, !1104, !1111, !1117, !1119, !861, !1121, !1123, !1128, !1133}
!1097 = !DIGlobalVariableExpression(var: !1098, expr: !DIExpression())
!1098 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_198", scope: !863, file: !1060, line: 339, type: !1099, isLocal: false, isDefinition: true, align: 16)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 96, elements: !1100)
!1100 = !{!1101}
!1101 = !DISubrange(count: 6)
!1102 = !DIGlobalVariableExpression(var: !1103, expr: !DIExpression())
!1103 = distinct !DIGlobalVariable(name: "__device_dts_ord_198", scope: !863, file: !1060, line: 339, type: !961, isLocal: false, isDefinition: true, align: 32)
!1104 = !DIGlobalVariableExpression(var: !1105, expr: !DIExpression())
!1105 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_198", scope: !863, file: !1060, line: 339, type: !1106, isLocal: true, isDefinition: true, align: 32)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !533, line: 51, size: 64, elements: !1108)
!1108 = !{!1109, !1110}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1107, file: !533, line: 60, baseType: !980, size: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1107, file: !533, line: 65, baseType: !960, size: 32, offset: 32)
!1111 = !DIGlobalVariableExpression(var: !1112, expr: !DIExpression())
!1112 = distinct !DIGlobalVariable(name: "imx_uart_0_data", scope: !863, file: !1060, line: 339, type: !1113, isLocal: true, isDefinition: true)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_uart_data", file: !1060, line: 39, size: 64, elements: !1114)
!1114 = !{!1115, !1116}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1113, file: !1060, line: 41, baseType: !1027, size: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "cb_data", scope: !1113, file: !1060, line: 42, baseType: !102, size: 32, offset: 32)
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_198", scope: !863, file: !1060, line: 339, type: !969, isLocal: true, isDefinition: true, align: 8)
!1119 = !DIGlobalVariableExpression(var: !1120, expr: !DIExpression())
!1120 = distinct !DIGlobalVariable(name: "uart_imx_driver_api", scope: !863, file: !1060, line: 270, type: !953, isLocal: true, isDefinition: true)
!1121 = !DIGlobalVariableExpression(var: !1122, expr: !DIExpression())
!1122 = distinct !DIGlobalVariable(name: "__pinctrl_dev_config__device_dts_ord_198", scope: !863, file: !1060, line: 339, type: !1067, isLocal: true, isDefinition: true)
!1123 = !DIGlobalVariableExpression(var: !1124, expr: !DIExpression())
!1124 = distinct !DIGlobalVariable(name: "__pinctrl_states__device_dts_ord_198", scope: !863, file: !1060, line: 339, type: !1125, isLocal: true, isDefinition: true)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1073, size: 64, elements: !1126)
!1126 = !{!1127}
!1127 = !DISubrange(count: 1)
!1128 = !DIGlobalVariableExpression(var: !1129, expr: !DIExpression())
!1129 = distinct !DIGlobalVariable(name: "__pinctrl_state_pins_0__device_dts_ord_198", scope: !863, file: !1060, line: 339, type: !1130, isLocal: true, isDefinition: true)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1078, size: 320, elements: !1131)
!1131 = !{!1132}
!1132 = !DISubrange(count: 2)
!1133 = !DIGlobalVariableExpression(var: !1134, expr: !DIExpression())
!1134 = distinct !DIGlobalVariable(name: "__isr_uart_imx_isr_irq_0", scope: !1135, file: !1060, line: 339, type: !1138, isLocal: true, isDefinition: true, align: 32)
!1135 = distinct !DISubprogram(name: "irq_config_func_0", scope: !1060, file: !1060, line: 339, type: !1011, scopeLine: 339, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !863, retainedNodes: !1136)
!1136 = !{!1137}
!1137 = !DILocalVariable(name: "dev", arg: 1, scope: !1135, file: !1060, line: 339, type: !960)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !1139)
!1139 = !{!1140, !1141, !1142, !1143}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !1138, file: !10, line: 55, baseType: !841, size: 32)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1138, file: !10, line: 57, baseType: !841, size: 32, offset: 32)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1138, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !1138, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!1144 = !DIGlobalVariableExpression(var: !1145, expr: !DIExpression())
!1145 = distinct !DIGlobalVariable(name: "overflow_cyc", scope: !1146, file: !1375, line: 65, type: !403, isLocal: true, isDefinition: true)
!1146 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1147, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1148, retainedTypes: !1289, globals: !1372, splitDebugInlining: false, nameTableKind: None)
!1147 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/timer/cortex_m_systick.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/minimal")
!1148 = !{!1149}
!1149 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !399, line: 103, baseType: !103, size: 32, elements: !1150)
