; ModuleID = './build/dac_output_data_repeatedly.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.GPT_REGISTER_T = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.GPT_REGISTER_GLOABL_T = type { i32, i32, i32 }
%struct.gpt_context_t = type { i32, %struct.gpt_callback_context_t, i8, i8 }
%struct.gpt_callback_context_t = type { void (i8*)*, i8* }
%struct.gpt_sw_context_t = type { [32 x %struct.gpt_sw_timer_t], i32, i32, i32, i32, i8, i8, i8 }
%struct.gpt_sw_timer_t = type { %struct.gpt_callback_context_t, i32, i8, i8 }
%struct.GPIO_REGISTER_T = type { [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIN_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [4 x %struct.GPIO_DIR_REGISTER_T], [192 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [2 x %struct.GPIO_DIR_REGISTER_T], [192 x i8], [7 x %struct.GPIO_DIR_REGISTER_T], [144 x i8], [4 x %struct.GPIO_DIR_REGISTER_T], [192 x i8], [6 x %struct.GPIO_DIN_REGISTER_T] }
%struct.GPIO_DIN_REGISTER_T = type { i32, [12 x i8] }

!28 = !DIFile(filename: "../../../../../driver/chip/inc/hal_clock.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!29 = !{!30, !31, !32, !33}
!30 = !DIEnumerator(name: "HAL_CLOCK_STATUS_UNINITIALIZED", value: -3)
!31 = !DIEnumerator(name: "HAL_CLOCK_STATUS_INVALID_PARAMETER", value: -2)
!32 = !DIEnumerator(name: "HAL_CLOCK_STATUS_ERROR", value: -1)
!33 = !DIEnumerator(name: "HAL_CLOCK_STATUS_OK", value: 0)
!34 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 1170, baseType: !15, size: 32, elements: !36)
!35 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93}
!37 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_26M", value: 9)
!38 = !DIEnumerator(name: "HAL_CLOCK_CG_CAMINF48M", value: 10)
!39 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_BUSCK", value: 13)
!40 = !DIEnumerator(name: "HAL_CLOCK_CG_BT_N9", value: 15)
!41 = !DIEnumerator(name: "HAL_CLOCK_CG_BUS", value: 20)
!42 = !DIEnumerator(name: "HAL_CLOCK_CG_CM", value: 21)
!43 = !DIEnumerator(name: "HAL_CLOCK_CG_BSI", value: 23)
!44 = !DIEnumerator(name: "HAL_CLOCK_CG_SEJ", value: 32)
!45 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA", value: 33)
!46 = !DIEnumerator(name: "HAL_CLOCK_CG_USB48M", value: 34)
!47 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC0", value: 35)
!48 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C_D2D", value: 38)
!49 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C2", value: 39)
!50 = !DIEnumerator(name: "HAL_CLOCK_CG_CM4_OSTIMER", value: 42)
!51 = !DIEnumerator(name: "HAL_CLOCK_CG_DMA_AO", value: 44)
!52 = !DIEnumerator(name: "HAL_CLOCK_CG_UART0", value: 45)
!53 = !DIEnumerator(name: "HAL_CLOCK_CG_UART1", value: 46)
!54 = !DIEnumerator(name: "HAL_CLOCK_CG_UART2", value: 47)
!55 = !DIEnumerator(name: "HAL_CLOCK_CG_UART3", value: 48)
!56 = !DIEnumerator(name: "HAL_CLOCK_CG_SPISLV", value: 51)
!57 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI0", value: 52)
!58 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI1", value: 53)
!59 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI2", value: 54)
!60 = !DIEnumerator(name: "HAL_CLOCK_CG_SPI3", value: 55)
!61 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM0", value: 64)
!62 = !DIEnumerator(name: "HAL_CLOCK_CG_BTIF", value: 65)
!63 = !DIEnumerator(name: "HAL_CLOCK_CG_GPTIMER", value: 66)
!64 = !DIEnumerator(name: "HAL_CLOCK_CG_GPCOUNTER", value: 67)
!65 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM1", value: 68)
!66 = !DIEnumerator(name: "HAL_CLOCK_CG_EFUSE", value: 70)
!67 = !DIEnumerator(name: "HAL_CLOCK_CG_LPM", value: 71)
!68 = !DIEnumerator(name: "HAL_CLOCK_CG_CM_SYSROM", value: 72)
!69 = !DIEnumerator(name: "HAL_CLOCK_CG_SFC", value: 73)
!70 = !DIEnumerator(name: "HAL_CLOCK_CG_MSDC1", value: 74)
!71 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_DMA", value: 76)
!72 = !DIEnumerator(name: "HAL_CLOCK_CG_USB_BUS", value: 77)
!73 = !DIEnumerator(name: "HAL_CLOCK_CG_DISP_PWM", value: 78)
!74 = !DIEnumerator(name: "HAL_CLOCK_CG_TRNG", value: 80)
!75 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM2", value: 83)
!76 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM3", value: 84)
!77 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM4", value: 85)
!78 = !DIEnumerator(name: "HAL_CLOCK_CG_PWM5", value: 86)
!79 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD", value: 96)
!80 = !DIEnumerator(name: "HAL_CLOCK_CG_RESEIZER", value: 97)
!81 = !DIEnumerator(name: "HAL_CLOCK_CG_ROTDMA", value: 98)
!82 = !DIEnumerator(name: "HAL_CLOCK_CG_CAM_BCLK", value: 99)
!83 = !DIEnumerator(name: "HAL_CLOCK_CG_PAD2CAM", value: 100)
!84 = !DIEnumerator(name: "HAL_CLOCK_CG_G2D", value: 101)
!85 = !DIEnumerator(name: "HAL_CLOCK_CG_MM_COLOR", value: 102)
!86 = !DIEnumerator(name: "HAL_CLOCK_CG_AAL", value: 103)
!87 = !DIEnumerator(name: "HAL_CLOCK_CG_DSI0", value: 104)
!88 = !DIEnumerator(name: "HAL_CLOCK_CG_LCD_APB", value: 105)
!89 = !DIEnumerator(name: "HAL_CLOCK_CG_AUXADC", value: 130)
!90 = !DIEnumerator(name: "HAL_CLOCK_CG_GPDAC", value: 134)
!91 = !DIEnumerator(name: "HAL_CLOCK_CG_SENSOR_DMA", value: 136)
!92 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C1", value: 137)
!93 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C0", value: 138)
!94 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 118, baseType: !15, size: 32, elements: !95)
!95 = !{!96}
!96 = !DIEnumerator(name: "HAL_DAC_REPEAT_MODE", value: 0)
!97 = !{!98, !124}
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "DAC_REGISTER_T", file: !100, line: 403, baseType: !101)
!100 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt2523/Include/mt2523.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 389, size: 704, elements: !102)
!102 = !{!103, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !122, !123}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "GPDAC_TGSEL", scope: !101, file: !100, line: 390, baseType: !104, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !105)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !106, line: 48, baseType: !107)
!106 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !108, line: 79, baseType: !15)
!108 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!109 = !DIDerivedType(tag: DW_TAG_member, name: "GPDAC_TEST", scope: !101, file: !100, line: 391, baseType: !104, size: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "GPDACLDO_CAL", scope: !101, file: !100, line: 392, baseType: !104, size: 32, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "GPDACLDO_TRIM", scope: !101, file: !100, line: 393, baseType: !104, size: 32, offset: 96)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "GPDAC_CAL", scope: !101, file: !100, line: 394, baseType: !104, size: 32, offset: 128)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "GPDAC_PDN", scope: !101, file: !100, line: 395, baseType: !104, size: 32, offset: 160)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !101, file: !100, line: 396, baseType: !104, size: 32, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "OUTPUT_COMMAND", scope: !101, file: !100, line: 397, baseType: !104, size: 32, offset: 224)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "OUTPUT_REGION", scope: !101, file: !100, line: 398, baseType: !104, size: 32, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "WRITE_COMMAND", scope: !101, file: !100, line: 399, baseType: !104, size: 32, offset: 288)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !101, file: !100, line: 400, baseType: !119, size: 320, offset: 320)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 320, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 10)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "GPDAC_SRAM_PWR", scope: !101, file: !100, line: 401, baseType: !104, size: 32, offset: 640)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "GPDAC_DEBUG", scope: !101, file: !100, line: 402, baseType: !104, size: 32, offset: 672)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!125 = !{!0}
!126 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !127)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !106, line: 24, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !108, line: 43, baseType: !129)
!129 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "gpt_lock_sleep_name", scope: !132, file: !133, line: 46, type: !198, isLocal: true, isDefinition: true)
!132 = distinct !DICompileUnit(language: DW_LANG_C99, file: !133, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !134, retainedTypes: !187, globals: !192, splitDebugInlining: false, nameTableKind: None)
!133 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!134 = !{!135, !143, !152, !156, !160, !179, !183}
!135 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !136, line: 387, baseType: !7, size: 32, elements: !137)
!136 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!137 = !{!138, !139, !140, !141, !142}
!138 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT_USED", value: -4)
!139 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR", value: -3)
!140 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT", value: -2)
!141 = !DIEnumerator(name: "HAL_GPT_STATUS_INVALID_PARAMETER", value: -1)
!142 = !DIEnumerator(name: "HAL_GPT_STATUS_OK", value: 0)
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 846, baseType: !15, size: 32, elements: !144)
!144 = !{!145, !146, !147, !148, !149, !150, !151}
!145 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!146 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!147 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!148 = !DIEnumerator(name: "HAL_GPT_3", value: 3)
!149 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!150 = !DIEnumerator(name: "HAL_GPT_5", value: 5)
!151 = !DIEnumerator(name: "HAL_GPT_MAX_PORT", value: 6)
!152 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !136, line: 397, baseType: !15, size: 32, elements: !153)
!153 = !{!154, !155}
!154 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!155 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 857, baseType: !15, size: 32, elements: !157)
!157 = !{!158, !159}
!158 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_32K", value: 0)
!159 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_1M", value: 1)
!160 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !161, line: 87, baseType: !15, size: 32, elements: !162)
!161 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_gpt_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!162 = !{!163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178}
!163 = !DIEnumerator(name: "GPT_DIVIDE_1", value: 0)
!164 = !DIEnumerator(name: "GPT_DIVIDE_2", value: 1)
!165 = !DIEnumerator(name: "GPT_DIVIDE_3", value: 2)
!166 = !DIEnumerator(name: "GPT_DIVIDE_4", value: 3)
!167 = !DIEnumerator(name: "GPT_DIVIDE_5", value: 4)
!168 = !DIEnumerator(name: "GPT_DIVIDE_6", value: 5)
!169 = !DIEnumerator(name: "GPT_DIVIDE_7", value: 6)
!170 = !DIEnumerator(name: "GPT_DIVIDE_8", value: 7)
!171 = !DIEnumerator(name: "GPT_DIVIDE_9", value: 8)
!172 = !DIEnumerator(name: "GPT_DIVIDE_10", value: 9)
!173 = !DIEnumerator(name: "GPT_DIVIDE_11", value: 10)
!174 = !DIEnumerator(name: "GPT_DIVIDE_12", value: 11)
!175 = !DIEnumerator(name: "GPT_DIVIDE_13", value: 12)
!176 = !DIEnumerator(name: "GPT_DIVIDE_16", value: 13)
!177 = !DIEnumerator(name: "GPT_DIVIDE_32", value: 14)
!178 = !DIEnumerator(name: "GPT_DIVIDE_64", value: 15)
!179 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !136, line: 380, baseType: !15, size: 32, elements: !180)
!180 = !{!181, !182}
!181 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!182 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!183 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !161, line: 82, baseType: !15, size: 32, elements: !184)
!184 = !{!185, !186}
!185 = !DIEnumerator(name: "GPT_CLOCK_UNGATE", value: 0)
!186 = !DIEnumerator(name: "GPT_CLOCK_GATE", value: 64)
!187 = !{!105, !124, !188}
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !136, line: 371, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = !DISubroutineType(types: !191)
!191 = !{null, !124}
!192 = !{!193, !130}
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "gpt_lock_sleep_handle", scope: !132, file: !133, line: 47, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 48, elements: !196)
!196 = !{!197}
!197 = !DISubrange(count: 6)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !199, size: 192, elements: !196)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !201)
!201 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "gp_gpt", scope: !204, file: !205, line: 48, type: !363, isLocal: false, isDefinition: true)
!204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !205, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !290, globals: !305, splitDebugInlining: false, nameTableKind: None)
!205 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpt_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!206 = !{!34, !183, !207, !213, !143, !179, !152}
!207 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !161, line: 75, baseType: !15, size: 32, elements: !208)
!208 = !{!209, !210, !211, !212}
!209 = !DIEnumerator(name: "GPT_MODE_ONE_SHOT", value: 0)
!210 = !DIEnumerator(name: "GPT_MODE_REPEAT", value: 16)
!211 = !DIEnumerator(name: "GPT_MODE_KEEP_GO", value: 32)
!212 = !DIEnumerator(name: "GPT_MODE_FREE_RUN", value: 48)
!213 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !100, line: 44, baseType: !7, size: 32, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289}
!215 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!216 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!217 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!218 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!219 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!220 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!221 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!222 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!223 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!224 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!225 = !DIEnumerator(name: "OSTimer_IRQn", value: 0)
!226 = !DIEnumerator(name: "Reserved1_IRQn", value: 1)
!227 = !DIEnumerator(name: "MD_TOPSM_IRQn", value: 2)
!228 = !DIEnumerator(name: "CM4_TOPSM_IRQn", value: 3)
!229 = !DIEnumerator(name: "Reserved2_IRQn", value: 4)
!230 = !DIEnumerator(name: "Reserved3_IRQn", value: 5)
!231 = !DIEnumerator(name: "Reserved4_IRQn", value: 6)
!232 = !DIEnumerator(name: "Reserved5_IRQn", value: 7)
!233 = !DIEnumerator(name: "ACCDET_IRQn", value: 8)
!234 = !DIEnumerator(name: "RTC_IRQn", value: 9)
!235 = !DIEnumerator(name: "KP_IRQn", value: 10)
!236 = !DIEnumerator(name: "GPTimer_IRQn", value: 11)
!237 = !DIEnumerator(name: "EINT_IRQn", value: 12)
!238 = !DIEnumerator(name: "LCD_IRQn", value: 13)
!239 = !DIEnumerator(name: "LCD_AAL_IRQn", value: 14)
!240 = !DIEnumerator(name: "DSI_IRQn", value: 15)
!241 = !DIEnumerator(name: "RESIZE_IRQn", value: 16)
!242 = !DIEnumerator(name: "G2D_IRQn", value: 17)
!243 = !DIEnumerator(name: "CAM_IRQn", value: 18)
!244 = !DIEnumerator(name: "ROT_DMA_IRQn", value: 19)
!245 = !DIEnumerator(name: "SCAM_IRQn", value: 20)
!246 = !DIEnumerator(name: "DMA_IRQn", value: 21)
!247 = !DIEnumerator(name: "DMA_AO_IRQn", value: 22)
!248 = !DIEnumerator(name: "I2C_DUAL_IRQn", value: 23)
!249 = !DIEnumerator(name: "I2C0_IRQn", value: 24)
!250 = !DIEnumerator(name: "I2C1_IRQn", value: 25)
!251 = !DIEnumerator(name: "I2C2_IRQn", value: 26)
!252 = !DIEnumerator(name: "Reserved6_IRQn", value: 27)
!253 = !DIEnumerator(name: "GPCounter_IRQn", value: 28)
!254 = !DIEnumerator(name: "UART0_IRQn", value: 29)
!255 = !DIEnumerator(name: "UART1_IRQn", value: 30)
!256 = !DIEnumerator(name: "UART2_IRQn", value: 31)
!257 = !DIEnumerator(name: "UART3_IRQn", value: 32)
!258 = !DIEnumerator(name: "USB20_IRQn", value: 33)
!259 = !DIEnumerator(name: "MSDC0_IRQn", value: 34)
!260 = !DIEnumerator(name: "MSDC1_IRQn", value: 35)
!261 = !DIEnumerator(name: "Reserved7_IRQn", value: 36)
!262 = !DIEnumerator(name: "Reserved8_IRQn", value: 37)
!263 = !DIEnumerator(name: "SF_IRQn", value: 38)
!264 = !DIEnumerator(name: "DSP22CPU_IRQn", value: 39)
!265 = !DIEnumerator(name: "SensorDMA_IRQn", value: 40)
!266 = !DIEnumerator(name: "RGU_IRQn", value: 41)
!267 = !DIEnumerator(name: "SPI_SLV_IRQn", value: 42)
!268 = !DIEnumerator(name: "SPI_MST0_IRQn", value: 43)
!269 = !DIEnumerator(name: "SPI_MST1_IRQn", value: 44)
!270 = !DIEnumerator(name: "SPI_MST2_IRQn", value: 45)
!271 = !DIEnumerator(name: "SPI_MST3_IRQn", value: 46)
!272 = !DIEnumerator(name: "TRNG_IRQn", value: 47)
!273 = !DIEnumerator(name: "BT_TIMCON_IRQn", value: 48)
!274 = !DIEnumerator(name: "BTIF_IRQn", value: 49)
!275 = !DIEnumerator(name: "Reserved9_IRQn", value: 50)
!276 = !DIEnumerator(name: "Reserved10_IRQn", value: 51)
!277 = !DIEnumerator(name: "LISR0_IRQn", value: 52)
!278 = !DIEnumerator(name: "LISR1_IRQn", value: 53)
!279 = !DIEnumerator(name: "LISR2_IRQn", value: 54)
!280 = !DIEnumerator(name: "LISR3_IRQn", value: 55)
!281 = !DIEnumerator(name: "PSI_RISE_IRQn", value: 56)
!282 = !DIEnumerator(name: "PSI_FALL_IRQn", value: 57)
!283 = !DIEnumerator(name: "Reserved11_IRQn", value: 58)
!284 = !DIEnumerator(name: "Reserved12_IRQn", value: 59)
!285 = !DIEnumerator(name: "Reserved13_IRQn", value: 60)
!286 = !DIEnumerator(name: "Reserved14_IRQn", value: 61)
!287 = !DIEnumerator(name: "Reserved15_IRQn", value: 62)
!288 = !DIEnumerator(name: "Reserved16_IRQn", value: 63)
!289 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 64)
!290 = !{!105, !291, !124}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_T", file: !100, line: 1272, baseType: !293)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1262, size: 288, elements: !294)
!294 = !{!295, !296, !297, !298, !300, !301, !302, !303, !304}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CON", scope: !293, file: !100, line: 1263, baseType: !104, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CLK", scope: !293, file: !100, line: 1264, baseType: !104, size: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_EN", scope: !293, file: !100, line: 1265, baseType: !104, size: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_STA", scope: !293, file: !100, line: 1266, baseType: !299, size: 32, offset: 96)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_ACK", scope: !293, file: !100, line: 1267, baseType: !104, size: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNT", scope: !293, file: !100, line: 1268, baseType: !104, size: 32, offset: 160)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPARE", scope: !293, file: !100, line: 1269, baseType: !104, size: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNTH", scope: !293, file: !100, line: 1270, baseType: !104, size: 32, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPAREH", scope: !293, file: !100, line: 1271, baseType: !104, size: 32, offset: 256)
!305 = !{!202, !306, !315, !322, !338, !361}
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "gp_gpt_glb", scope: !204, file: !205, line: 49, type: !308, isLocal: false, isDefinition: true)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_GLOABL_T", file: !100, line: 1260, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1256, size: 96, elements: !311)
!311 = !{!312, !313, !314}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQSTA", scope: !310, file: !100, line: 1257, baseType: !299, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK0", scope: !310, file: !100, line: 1258, baseType: !104, size: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK1", scope: !310, file: !100, line: 1259, baseType: !104, size: 32, offset: 64)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "flag", scope: !317, file: !205, line: 88, type: !321, isLocal: true, isDefinition: true)
!317 = distinct !DISubprogram(name: "gpt_get_lfosc_clock", scope: !205, file: !205, line: 86, type: !318, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !204, retainedNodes: !320)
!318 = !DISubroutineType(types: !319)
!319 = !{null}
!320 = !{}
!321 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !204, file: !205, line: 51, type: !324, isLocal: false, isDefinition: true)
!324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 768, elements: !196)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_context_t", file: !161, line: 116, baseType: !326)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !161, line: 111, size: 128, elements: !327)
!327 = !{!328, !330, !336, !337}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !326, file: !161, line: 112, baseType: !329, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !136, line: 400, baseType: !152)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !326, file: !161, line: 113, baseType: !331, size: 64, offset: 32)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_callback_context_t", file: !161, line: 109, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !161, line: 106, size: 64, elements: !333)
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !332, file: !161, line: 107, baseType: !188, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !332, file: !161, line: 108, baseType: !124, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "has_initilized", scope: !326, file: !161, line: 114, baseType: !321, size: 8, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "is_gpt_locked_sleep", scope: !326, file: !161, line: 115, baseType: !321, size: 8, offset: 104)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "gpt_sw_context", scope: !204, file: !205, line: 52, type: !340, isLocal: false, isDefinition: true)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_context_t", file: !161, line: 134, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !161, line: 125, size: 4256, elements: !342)
!342 = !{!343, !354, !355, !356, !357, !358, !359, !360}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !341, file: !161, line: 126, baseType: !344, size: 4096)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 4096, elements: !352)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_timer_t", file: !161, line: 123, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !161, line: 118, size: 128, elements: !347)
!347 = !{!348, !349, !350, !351}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !346, file: !161, line: 119, baseType: !331, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "time_out_ms", scope: !346, file: !161, line: 120, baseType: !105, size: 32, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !346, file: !161, line: 121, baseType: !321, size: 8, offset: 96)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "is_running", scope: !346, file: !161, line: 122, baseType: !321, size: 8, offset: 104)
!352 = !{!353}
!353 = !DISubrange(count: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_time", scope: !341, file: !161, line: 127, baseType: !105, size: 32, offset: 4096)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "last_absolute_time", scope: !341, file: !161, line: 128, baseType: !105, size: 32, offset: 4128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "used_timer_count", scope: !341, file: !161, line: 129, baseType: !105, size: 32, offset: 4160)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "running_timer_count", scope: !341, file: !161, line: 130, baseType: !105, size: 32, offset: 4192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_init", scope: !341, file: !161, line: 131, baseType: !321, size: 8, offset: 4224)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "is_start_from_isr", scope: !341, file: !161, line: 132, baseType: !321, size: 8, offset: 4232)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "is_sw_gpt", scope: !341, file: !161, line: 133, baseType: !321, size: 8, offset: 4240)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "gpt_clock_source", scope: !204, file: !205, line: 53, type: !105, isLocal: false, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !291, size: 192, elements: !196)
!364 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "gpio_register_base", scope: !367, file: !368, line: 64, type: !468, isLocal: false, isDefinition: true)
!367 = distinct !DICompileUnit(language: DW_LANG_C99, file: !368, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !369, retainedTypes: !463, globals: !467, splitDebugInlining: false, nameTableKind: None)
!368 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!369 = !{!370, !422, !429, !433, !439, !443, !452, !457}
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 339, baseType: !15, size: 32, elements: !371)
!371 = !{!372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421}
!372 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!373 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!374 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!375 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!376 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!377 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!378 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!379 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!380 = !DIEnumerator(name: "HAL_GPIO_8", value: 8)
!381 = !DIEnumerator(name: "HAL_GPIO_9", value: 9)
!382 = !DIEnumerator(name: "HAL_GPIO_10", value: 10)
!383 = !DIEnumerator(name: "HAL_GPIO_11", value: 11)
!384 = !DIEnumerator(name: "HAL_GPIO_12", value: 12)
!385 = !DIEnumerator(name: "HAL_GPIO_13", value: 13)
!386 = !DIEnumerator(name: "HAL_GPIO_14", value: 14)
!387 = !DIEnumerator(name: "HAL_GPIO_15", value: 15)
!388 = !DIEnumerator(name: "HAL_GPIO_16", value: 16)
!389 = !DIEnumerator(name: "HAL_GPIO_17", value: 17)
!390 = !DIEnumerator(name: "HAL_GPIO_18", value: 18)
!391 = !DIEnumerator(name: "HAL_GPIO_19", value: 19)
!392 = !DIEnumerator(name: "HAL_GPIO_20", value: 20)
!393 = !DIEnumerator(name: "HAL_GPIO_21", value: 21)
!394 = !DIEnumerator(name: "HAL_GPIO_22", value: 22)
!395 = !DIEnumerator(name: "HAL_GPIO_23", value: 23)
!396 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!397 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!398 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!399 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!400 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!401 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!402 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!403 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!404 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!405 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!406 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!407 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!408 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!409 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!410 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!411 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!412 = !DIEnumerator(name: "HAL_GPIO_40", value: 40)
!413 = !DIEnumerator(name: "HAL_GPIO_41", value: 41)
!414 = !DIEnumerator(name: "HAL_GPIO_42", value: 42)
!415 = !DIEnumerator(name: "HAL_GPIO_43", value: 43)
!416 = !DIEnumerator(name: "HAL_GPIO_44", value: 44)
!417 = !DIEnumerator(name: "HAL_GPIO_45", value: 45)
!418 = !DIEnumerator(name: "HAL_GPIO_46", value: 46)
!419 = !DIEnumerator(name: "HAL_GPIO_47", value: 47)
!420 = !DIEnumerator(name: "HAL_GPIO_48", value: 48)
!421 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 49)
!422 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !423, line: 224, baseType: !7, size: 32, elements: !424)
!423 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!424 = !{!425, !426, !427, !428}
!425 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!426 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!427 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!428 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!429 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !423, line: 210, baseType: !15, size: 32, elements: !430)
!430 = !{!431, !432}
!431 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!432 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!433 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !423, line: 233, baseType: !7, size: 32, elements: !434)
!434 = !{!435, !436, !437, !438}
!435 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!436 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!437 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!438 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!439 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !423, line: 217, baseType: !15, size: 32, elements: !440)
!440 = !{!441, !442}
!441 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!442 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!443 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 415, baseType: !15, size: 32, elements: !444)
!444 = !{!445, !446, !447, !448, !449, !450, !451}
!445 = !DIEnumerator(name: "HAL_GPIO_CLOCK_0", value: 0)
!446 = !DIEnumerator(name: "HAL_GPIO_CLOCK_1", value: 1)
!447 = !DIEnumerator(name: "HAL_GPIO_CLOCK_2", value: 2)
!448 = !DIEnumerator(name: "HAL_GPIO_CLOCK_3", value: 3)
!449 = !DIEnumerator(name: "HAL_GPIO_CLOCK_4", value: 4)
!450 = !DIEnumerator(name: "HAL_GPIO_CLOCK_5", value: 5)
!451 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MAX", value: 6)
!452 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 427, baseType: !15, size: 32, elements: !453)
!453 = !{!454, !455, !456}
!454 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_26M", value: 1)
!455 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_32K", value: 4)
!456 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_MAX", value: 5)
!457 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !423, line: 242, baseType: !15, size: 32, elements: !458)
!458 = !{!459, !460, !461, !462}
!459 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!460 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!461 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!462 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!463 = !{!124, !464, !465, !466}
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_direction_t", file: !423, line: 213, baseType: !429)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !423, line: 220, baseType: !439)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !423, line: 247, baseType: !457)
!467 = !{!365}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_REGISTER_T", file: !100, line: 1554, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1522, size: 29440, elements: !471)
!471 = !{!472, !486, !490, !499, !500, !509, !510, !519, !520, !530, !531, !540, !541, !550, !551, !560, !561, !570, !574, !583, !584, !593, !594, !603, !612, !613, !624, !628, !637, !638}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_REGISTER", scope: !470, file: !100, line: 1523, baseType: !473, size: 256)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 256, elements: !484)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIR_REGISTER_T", file: !100, line: 1400, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1395, size: 128, elements: !476)
!476 = !{!477, !478, !479, !480}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR", scope: !475, file: !100, line: 1396, baseType: !104, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_SET", scope: !475, file: !100, line: 1397, baseType: !104, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_CLR", scope: !475, file: !100, line: 1398, baseType: !104, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !475, file: !100, line: 1399, baseType: !481, size: 32, offset: 96)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 32, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 4)
!484 = !{!485}
!485 = !DISubrange(count: 2)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET1", scope: !470, file: !100, line: 1524, baseType: !487, size: 1792, offset: 256)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 1792, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 224)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_REGISTER", scope: !470, file: !100, line: 1525, baseType: !491, size: 256, offset: 2048)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 256, elements: !484)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLEN_REGISTER_T", file: !100, line: 1409, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1404, size: 128, elements: !494)
!494 = !{!495, !496, !497, !498}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN", scope: !493, file: !100, line: 1405, baseType: !104, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_SET", scope: !493, file: !100, line: 1406, baseType: !104, size: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_CLR", scope: !493, file: !100, line: 1407, baseType: !104, size: 32, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !493, file: !100, line: 1408, baseType: !481, size: 32, offset: 96)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET2", scope: !470, file: !100, line: 1526, baseType: !487, size: 1792, offset: 2304)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_REGISTER", scope: !470, file: !100, line: 1527, baseType: !501, size: 256, offset: 4096)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 256, elements: !484)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DINV_REGISTER_T", file: !100, line: 1417, baseType: !503)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1412, size: 128, elements: !504)
!504 = !{!505, !506, !507, !508}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV", scope: !503, file: !100, line: 1413, baseType: !104, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_SET", scope: !503, file: !100, line: 1414, baseType: !104, size: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_CLR", scope: !503, file: !100, line: 1415, baseType: !104, size: 32, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !503, file: !100, line: 1416, baseType: !481, size: 32, offset: 96)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET3", scope: !470, file: !100, line: 1528, baseType: !487, size: 1792, offset: 4352)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_REGISTER", scope: !470, file: !100, line: 1529, baseType: !511, size: 256, offset: 6144)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 256, elements: !484)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DOUT_REGISTER_T", file: !100, line: 1426, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1421, size: 128, elements: !514)
!514 = !{!515, !516, !517, !518}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT", scope: !513, file: !100, line: 1422, baseType: !104, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_SET", scope: !513, file: !100, line: 1423, baseType: !104, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_CLR", scope: !513, file: !100, line: 1424, baseType: !104, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !513, file: !100, line: 1425, baseType: !481, size: 32, offset: 96)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET4", scope: !470, file: !100, line: 1530, baseType: !487, size: 1792, offset: 6400)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN_REGISTER", scope: !470, file: !100, line: 1531, baseType: !521, size: 256, offset: 8192)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !522, size: 256, elements: !484)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIN_REGISTER_T", file: !100, line: 1432, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1429, size: 128, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN", scope: !523, file: !100, line: 1430, baseType: !104, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !523, file: !100, line: 1431, baseType: !527, size: 96, offset: 32)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 96, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 12)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET5", scope: !470, file: !100, line: 1532, baseType: !487, size: 1792, offset: 8448)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_REGISTER", scope: !470, file: !100, line: 1533, baseType: !532, size: 256, offset: 10240)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 256, elements: !484)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLSEL_REGISTER_T", file: !100, line: 1440, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1435, size: 128, elements: !535)
!535 = !{!536, !537, !538, !539}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL", scope: !534, file: !100, line: 1436, baseType: !104, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_SET", scope: !534, file: !100, line: 1437, baseType: !104, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_CLR", scope: !534, file: !100, line: 1438, baseType: !104, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !534, file: !100, line: 1439, baseType: !481, size: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET6", scope: !470, file: !100, line: 1534, baseType: !487, size: 1792, offset: 10496)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_REGISTER", scope: !470, file: !100, line: 1535, baseType: !542, size: 256, offset: 12288)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 256, elements: !484)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SMT_REGISTER_T", file: !100, line: 1448, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1443, size: 128, elements: !545)
!545 = !{!546, !547, !548, !549}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT", scope: !544, file: !100, line: 1444, baseType: !104, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_SET", scope: !544, file: !100, line: 1445, baseType: !104, size: 32, offset: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_CLR", scope: !544, file: !100, line: 1446, baseType: !104, size: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !544, file: !100, line: 1447, baseType: !481, size: 32, offset: 96)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET7", scope: !470, file: !100, line: 1536, baseType: !487, size: 1792, offset: 12544)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_REGISTER", scope: !470, file: !100, line: 1537, baseType: !552, size: 256, offset: 14336)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 256, elements: !484)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SR_REGISTER_T", file: !100, line: 1455, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1450, size: 128, elements: !555)
!555 = !{!556, !557, !558, !559}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR", scope: !554, file: !100, line: 1451, baseType: !104, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_SET", scope: !554, file: !100, line: 1452, baseType: !104, size: 32, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_CLR", scope: !554, file: !100, line: 1453, baseType: !104, size: 32, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !554, file: !100, line: 1454, baseType: !481, size: 32, offset: 96)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET8", scope: !470, file: !100, line: 1538, baseType: !487, size: 1792, offset: 14592)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_REGISTER", scope: !470, file: !100, line: 1539, baseType: !562, size: 512, offset: 16384)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 512, elements: !482)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DRV_REGISTER_T", file: !100, line: 1463, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1458, size: 128, elements: !565)
!565 = !{!566, !567, !568, !569}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV", scope: !564, file: !100, line: 1459, baseType: !104, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_SET", scope: !564, file: !100, line: 1460, baseType: !104, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_CLR", scope: !564, file: !100, line: 1461, baseType: !104, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !564, file: !100, line: 1462, baseType: !481, size: 32, offset: 96)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET9", scope: !470, file: !100, line: 1540, baseType: !571, size: 1536, offset: 16896)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 1536, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_REGISTER", scope: !470, file: !100, line: 1541, baseType: !575, size: 256, offset: 18432)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 256, elements: !484)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_IES_REGISTER_T", file: !100, line: 1471, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1466, size: 128, elements: !578)
!578 = !{!579, !580, !581, !582}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES", scope: !577, file: !100, line: 1467, baseType: !104, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_SET", scope: !577, file: !100, line: 1468, baseType: !104, size: 32, offset: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_CLR", scope: !577, file: !100, line: 1469, baseType: !104, size: 32, offset: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !577, file: !100, line: 1470, baseType: !481, size: 32, offset: 96)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET10", scope: !470, file: !100, line: 1542, baseType: !487, size: 1792, offset: 18688)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_REGISTER", scope: !470, file: !100, line: 1543, baseType: !585, size: 256, offset: 20480)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 256, elements: !484)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PUPD_REGISTER_T", file: !100, line: 1480, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1475, size: 128, elements: !588)
!588 = !{!589, !590, !591, !592}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD", scope: !587, file: !100, line: 1476, baseType: !104, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_SET", scope: !587, file: !100, line: 1477, baseType: !104, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_CLR", scope: !587, file: !100, line: 1478, baseType: !104, size: 32, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !587, file: !100, line: 1479, baseType: !481, size: 32, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET11", scope: !470, file: !100, line: 1544, baseType: !487, size: 1792, offset: 20736)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_REGISTER", scope: !470, file: !100, line: 1545, baseType: !595, size: 256, offset: 22528)
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 256, elements: !484)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN0_REGISTER_T", file: !100, line: 1489, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1484, size: 128, elements: !598)
!598 = !{!599, !600, !601, !602}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0", scope: !597, file: !100, line: 1485, baseType: !104, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_SET", scope: !597, file: !100, line: 1486, baseType: !104, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_CLR", scope: !597, file: !100, line: 1487, baseType: !104, size: 32, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !597, file: !100, line: 1488, baseType: !481, size: 32, offset: 96)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_REGISTER", scope: !470, file: !100, line: 1546, baseType: !604, size: 256, offset: 22784)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 256, elements: !484)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN1_REGISTER_T", file: !100, line: 1497, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1492, size: 128, elements: !607)
!607 = !{!608, !609, !610, !611}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1", scope: !606, file: !100, line: 1493, baseType: !104, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_SET", scope: !606, file: !100, line: 1494, baseType: !104, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_CLR", scope: !606, file: !100, line: 1495, baseType: !104, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !606, file: !100, line: 1496, baseType: !481, size: 32, offset: 96)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET12", scope: !470, file: !100, line: 1547, baseType: !571, size: 1536, offset: 23040)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_REGISTER", scope: !470, file: !100, line: 1548, baseType: !614, size: 896, offset: 24576)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 896, elements: !622)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_MODE_REGISTER_T", file: !100, line: 1505, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1500, size: 128, elements: !617)
!617 = !{!618, !619, !620, !621}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE", scope: !616, file: !100, line: 1501, baseType: !104, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_SET", scope: !616, file: !100, line: 1502, baseType: !104, size: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_CLR", scope: !616, file: !100, line: 1503, baseType: !104, size: 32, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !616, file: !100, line: 1504, baseType: !481, size: 32, offset: 96)
!622 = !{!623}
!623 = !DISubrange(count: 7)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET13", scope: !470, file: !100, line: 1549, baseType: !625, size: 1152, offset: 25472)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 1152, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 144)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_REGISTER", scope: !470, file: !100, line: 1550, baseType: !629, size: 512, offset: 26624)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 512, elements: !482)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TDSEL_REGISTER_T", file: !100, line: 1513, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1508, size: 128, elements: !632)
!632 = !{!633, !634, !635, !636}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL", scope: !631, file: !100, line: 1509, baseType: !104, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_SET", scope: !631, file: !100, line: 1510, baseType: !104, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_CLR", scope: !631, file: !100, line: 1511, baseType: !104, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !631, file: !100, line: 1512, baseType: !481, size: 32, offset: 96)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET14", scope: !470, file: !100, line: 1551, baseType: !571, size: 1536, offset: 27136)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT_REGISTER", scope: !470, file: !100, line: 1552, baseType: !639, size: 768, offset: 28672)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 768, elements: !196)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_CLKOUT_REGISTER_T", file: !100, line: 1519, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1516, size: 128, elements: !642)
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT", scope: !641, file: !100, line: 1517, baseType: !104, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !641, file: !100, line: 1518, baseType: !527, size: 96, offset: 32)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "g_uart_hwstatus", scope: !647, file: !648, line: 101, type: !833, isLocal: true, isDefinition: true)
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !649, retainedTypes: !744, globals: !754, splitDebugInlining: false, nameTableKind: None)
!648 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!649 = !{!650, !657, !672, !678, !684, !689, !694, !701, !717, !723, !727, !27, !732, !740}
!650 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !35, line: 180, baseType: !15, size: 32, elements: !651)
!651 = !{!652, !653, !654, !655, !656}
!652 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!653 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!654 = !DIEnumerator(name: "HAL_UART_2", value: 2)
!655 = !DIEnumerator(name: "HAL_UART_3", value: 3)
!656 = !DIEnumerator(name: "HAL_UART_MAX", value: 4)
!657 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !658, line: 189, baseType: !15, size: 32, elements: !659)
!658 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_pdma_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!660 = !DIEnumerator(name: "VDMA_START_CHANNEL", value: 8)
!661 = !DIEnumerator(name: "VDMA_UART1TX", value: 8)
!662 = !DIEnumerator(name: "VDMA_UART1RX", value: 9)
!663 = !DIEnumerator(name: "VDMA_UART2TX", value: 10)
!664 = !DIEnumerator(name: "VDMA_UART2RX", value: 11)
!665 = !DIEnumerator(name: "VDMA_UART3TX", value: 12)
!666 = !DIEnumerator(name: "VDMA_UART3RX", value: 13)
!667 = !DIEnumerator(name: "VDMA_UART0TX", value: 14)
!668 = !DIEnumerator(name: "VDMA_UART0RX", value: 15)
!669 = !DIEnumerator(name: "VDMA_BTIFTX", value: 16)
!670 = !DIEnumerator(name: "VDMA_BTIFRX", value: 17)
!671 = !DIEnumerator(name: "VDMA_END_CHANNEL", value: 18)
!672 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !673, line: 355, baseType: !7, size: 32, elements: !674)
!673 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!674 = !{!675, !676, !677}
!675 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!676 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!677 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!678 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !658, line: 206, baseType: !7, size: 32, elements: !679)
!679 = !{!680, !681, !682, !683}
!680 = !DIEnumerator(name: "VDMA_ERROR", value: -3)
!681 = !DIEnumerator(name: "VDMA_ERROR_CHANNEL", value: -2)
!682 = !DIEnumerator(name: "VDMA_INVALID_PARAMETER", value: -1)
!683 = !DIEnumerator(name: "VDMA_OK", value: 0)
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !648, line: 65, baseType: !15, size: 32, elements: !685)
!685 = !{!686, !687, !688}
!686 = !DIEnumerator(name: "UART_HWSTATUS_UNINITIALIZED", value: 0)
!687 = !DIEnumerator(name: "UART_HWSTATUS_POLL_INITIALIZED", value: 1)
!688 = !DIEnumerator(name: "UART_HWSTATUS_DMA_INITIALIZED", value: 2)
!689 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !648, line: 77, baseType: !15, size: 32, elements: !690)
!690 = !{!691, !692, !693}
!691 = !DIEnumerator(name: "UART_FLOWCONTROL_NONE", value: 0)
!692 = !DIEnumerator(name: "UART_FLOWCONTROL_SOFTWARE", value: 1)
!693 = !DIEnumerator(name: "UART_FLOWCONTROL_HARDWARE", value: 2)
!694 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !673, line: 345, baseType: !7, size: 32, elements: !695)
!695 = !{!696, !697, !698, !699, !700}
!696 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!697 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!698 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!699 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!700 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!701 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !673, line: 302, baseType: !15, size: 32, elements: !702)
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716}
!703 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!704 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!705 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!706 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!707 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!708 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!709 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!710 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!711 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!712 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!713 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!714 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!715 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!716 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!717 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !673, line: 321, baseType: !15, size: 32, elements: !718)
!718 = !{!719, !720, !721, !722}
!719 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!720 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!721 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!722 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!723 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !673, line: 330, baseType: !15, size: 32, elements: !724)
!724 = !{!725, !726}
!725 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!726 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!727 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !673, line: 337, baseType: !15, size: 32, elements: !728)
!728 = !{!729, !730, !731}
!729 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!730 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!731 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!732 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !733, line: 152, baseType: !7, size: 32, elements: !734)
!733 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!734 = !{!735, !736, !737, !738, !739}
!735 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!736 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!737 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!738 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!739 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!740 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !658, line: 222, baseType: !7, size: 32, elements: !741)
!741 = !{!742, !743}
!742 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_ERROR", value: -1)
!743 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_SUCCESS", value: 0)
!744 = !{!124, !745, !105, !746}
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_dma_callback_data_t", file: !748, line: 96, baseType: !749)
!748 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_uart_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !748, line: 93, size: 64, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "is_rx", scope: !749, file: !748, line: 94, baseType: !321, size: 8)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "uart_port", scope: !749, file: !748, line: 95, baseType: !753, size: 32, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !35, line: 186, baseType: !650)
!754 = !{!755, !758, !760, !762, !764, !768, !777, !791, !645, !793, !806, !811, !825, !831}
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "g_uart_frist_send_complete_interrupt", scope: !647, file: !648, line: 92, type: !757, isLocal: true, isDefinition: true)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 32, elements: !482)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "g_uart_restore_init", scope: !647, file: !648, line: 93, type: !321, isLocal: true, isDefinition: true)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "g_uart_send_lock_status", scope: !647, file: !648, line: 94, type: !757, isLocal: true, isDefinition: true)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler", scope: !647, file: !648, line: 95, type: !481, isLocal: true, isDefinition: true)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "g_uart_flowcontrol_status", scope: !647, file: !648, line: 96, type: !766, isLocal: true, isDefinition: true)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 128, elements: !482)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_flowcontrol_t", file: !648, line: 81, baseType: !689)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "g_uart_sw_flowcontrol_config", scope: !647, file: !648, line: 97, type: !770, isLocal: true, isDefinition: true)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 96, elements: !482)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_sw_flowcontrol_config_t", file: !648, line: 87, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !648, line: 83, size: 24, elements: !773)
!773 = !{!774, !775, !776}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "xon", scope: !772, file: !648, line: 84, baseType: !127, size: 8)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !772, file: !648, line: 85, baseType: !127, size: 8, offset: 8)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "escape_character", scope: !772, file: !648, line: 86, baseType: !127, size: 8, offset: 16)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "g_uart_config", scope: !647, file: !648, line: 98, type: !779, isLocal: true, isDefinition: true)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 512, elements: !482)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !673, line: 378, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !673, line: 373, size: 128, elements: !782)
!782 = !{!783, !785, !787, !789}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !781, file: !673, line: 374, baseType: !784, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !673, line: 317, baseType: !701)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !781, file: !673, line: 375, baseType: !786, size: 32, offset: 32)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !673, line: 326, baseType: !717)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !781, file: !673, line: 376, baseType: !788, size: 32, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !673, line: 333, baseType: !723)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !781, file: !673, line: 377, baseType: !790, size: 32, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !673, line: 341, baseType: !727)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "g_uart_irq_pending_status", scope: !647, file: !648, line: 99, type: !757, isLocal: true, isDefinition: true)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "g_uart_callback", scope: !647, file: !648, line: 102, type: !795, isLocal: true, isDefinition: true)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 256, elements: !482)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_callback_t", file: !648, line: 74, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !648, line: 71, size: 64, elements: !798)
!798 = !{!799, !805}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !797, file: !648, line: 72, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !673, line: 410, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !804, !124}
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !673, line: 359, baseType: !672)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !797, file: !648, line: 73, baseType: !124, size: 32, offset: 32)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "g_uart_dma_callback_data", scope: !647, file: !648, line: 103, type: !808, isLocal: true, isDefinition: true)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !747, size: 512, elements: !809)
!809 = !{!810}
!810 = !DISubrange(count: 8)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "g_uart_dma_config", scope: !647, file: !648, line: 104, type: !813, isLocal: true, isDefinition: true)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !814, size: 896, elements: !482)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !673, line: 390, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !673, line: 382, size: 224, elements: !816)
!816 = !{!817, !819, !820, !821, !822, !823, !824}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !815, file: !673, line: 383, baseType: !818, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !815, file: !673, line: 384, baseType: !105, size: 32, offset: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !815, file: !673, line: 385, baseType: !105, size: 32, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !815, file: !673, line: 386, baseType: !818, size: 32, offset: 96)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !815, file: !673, line: 387, baseType: !105, size: 32, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !815, file: !673, line: 388, baseType: !105, size: 32, offset: 160)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !815, file: !673, line: 389, baseType: !105, size: 32, offset: 192)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "g_uart_baudrate_map", scope: !647, file: !648, line: 105, type: !827, isLocal: true, isDefinition: true)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 416, elements: !829)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !105)
!829 = !{!830}
!830 = !DISubrange(count: 13)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "g_uart_global_data_initialized", scope: !647, file: !648, line: 90, type: !321, isLocal: true, isDefinition: true)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !834, size: 128, elements: !482)
!834 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_hwstatus_t", file: !648, line: 69, baseType: !684)
!836 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!837 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "g_uart_regbase", scope: !840, file: !841, line: 53, type: !925, isLocal: false, isDefinition: true)
!840 = distinct !DICompileUnit(language: DW_LANG_C99, file: !841, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !842, retainedTypes: !853, globals: !909, splitDebugInlining: false, nameTableKind: None)
!841 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart_internal_platform.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!842 = !{!34, !213, !657, !650, !843}
!843 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !748, line: 46, baseType: !15, size: 32, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852}
!845 = !DIEnumerator(name: "UART_INTERRUPT_NONE", value: 0)
!846 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_ERROR", value: 1)
!847 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_TIMEOUT", value: 2)
!848 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_BREAK", value: 3)
!849 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_AVAILABLE", value: 4)
!850 = !DIEnumerator(name: "UART_INTERRUPT_SEND_AVAILABLE", value: 5)
!851 = !DIEnumerator(name: "UART_INTERRUPT_SOFTWARE_FLOWCONTROL", value: 6)
!852 = !DIEnumerator(name: "UART_INTERRUPT_HARDWARE_FLOWCONTROL", value: 7)
!853 = !{!854}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_REGISTER_T", file: !100, line: 588, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 542, size: 800, elements: !857)
!857 = !{!858, !864, !869, !875, !876, !881, !886, !887, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "RBR_THR_DLL", scope: !856, file: !100, line: 547, baseType: !859, size: 32)
!859 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !856, file: !100, line: 543, size: 32, elements: !860)
!860 = !{!861, !862, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "RBR", scope: !859, file: !100, line: 544, baseType: !299, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "THR", scope: !859, file: !100, line: 545, baseType: !104, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "DLL", scope: !859, file: !100, line: 546, baseType: !104, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "IER_DLM", scope: !856, file: !100, line: 551, baseType: !865, size: 32, offset: 32)
!865 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !856, file: !100, line: 548, size: 32, elements: !866)
!866 = !{!867, !868}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "IER", scope: !865, file: !100, line: 549, baseType: !104, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "DLM", scope: !865, file: !100, line: 550, baseType: !104, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "IIR_FCR_EFR", scope: !856, file: !100, line: 556, baseType: !870, size: 32, offset: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !856, file: !100, line: 552, size: 32, elements: !871)
!871 = !{!872, !873, !874}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "IIR", scope: !870, file: !100, line: 553, baseType: !299, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "FCR", scope: !870, file: !100, line: 554, baseType: !104, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "EFR", scope: !870, file: !100, line: 555, baseType: !104, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "LCR", scope: !856, file: !100, line: 557, baseType: !104, size: 32, offset: 96)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "MCR_XON1", scope: !856, file: !100, line: 561, baseType: !877, size: 32, offset: 128)
!877 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !856, file: !100, line: 558, size: 32, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "MCR", scope: !877, file: !100, line: 559, baseType: !104, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "XON1", scope: !877, file: !100, line: 560, baseType: !104, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "LSR_XON2", scope: !856, file: !100, line: 565, baseType: !882, size: 32, offset: 160)
!882 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !856, file: !100, line: 562, size: 32, elements: !883)
!883 = !{!884, !885}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "LSR", scope: !882, file: !100, line: 563, baseType: !299, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "XON2", scope: !882, file: !100, line: 564, baseType: !104, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF1", scope: !856, file: !100, line: 566, baseType: !104, size: 32, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "SCR_XOFF2", scope: !856, file: !100, line: 570, baseType: !888, size: 32, offset: 224)
!888 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !856, file: !100, line: 567, size: 32, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !888, file: !100, line: 568, baseType: !104, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF2", scope: !888, file: !100, line: 569, baseType: !104, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_EN", scope: !856, file: !100, line: 571, baseType: !104, size: 32, offset: 256)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "HIGHSPEED", scope: !856, file: !100, line: 572, baseType: !104, size: 32, offset: 288)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_COUNT", scope: !856, file: !100, line: 573, baseType: !104, size: 32, offset: 320)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_POINT", scope: !856, file: !100, line: 574, baseType: !104, size: 32, offset: 352)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_REG", scope: !856, file: !100, line: 575, baseType: !299, size: 32, offset: 384)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "RATEFIX_AD", scope: !856, file: !100, line: 576, baseType: !104, size: 32, offset: 416)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUDSAMPLE", scope: !856, file: !100, line: 577, baseType: !104, size: 32, offset: 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "GUARD", scope: !856, file: !100, line: 578, baseType: !104, size: 32, offset: 480)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_DAT", scope: !856, file: !100, line: 579, baseType: !104, size: 32, offset: 512)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_EN", scope: !856, file: !100, line: 580, baseType: !104, size: 32, offset: 544)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP_EN", scope: !856, file: !100, line: 581, baseType: !104, size: 32, offset: 576)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "DMA_EN", scope: !856, file: !100, line: 582, baseType: !104, size: 32, offset: 608)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "RXTRI_AD", scope: !856, file: !100, line: 583, baseType: !104, size: 32, offset: 640)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_L", scope: !856, file: !100, line: 584, baseType: !104, size: 32, offset: 672)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_M", scope: !856, file: !100, line: 585, baseType: !104, size: 32, offset: 704)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "FCR_RD", scope: !856, file: !100, line: 586, baseType: !299, size: 32, offset: 736)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "TX_ACTIVE_EN", scope: !856, file: !100, line: 587, baseType: !104, size: 32, offset: 768)
!909 = !{!838, !910, !915, !921}
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(name: "g_uart_port_to_pdn", scope: !840, file: !841, line: 54, type: !912, isLocal: false, isDefinition: true)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !913, size: 128, elements: !482)
!913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_clock_cg_id", file: !35, line: 1237, baseType: !34)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "g_uart_port_to_irq_num", scope: !840, file: !841, line: 55, type: !917, isLocal: false, isDefinition: true)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !918, size: 128, elements: !482)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !100, line: 125, baseType: !920)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !100, line: 123, baseType: !213)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler_name", scope: !840, file: !841, line: 57, type: !923, isLocal: false, isDefinition: true)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !924, size: 128, elements: !482)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 128, elements: !482)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !854)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "g_i2c_tx_dma_channel", scope: !929, file: !930, line: 47, type: !1043, isLocal: false, isDefinition: true)
!929 = distinct !DICompileUnit(language: DW_LANG_C99, file: !930, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !931, globals: !976, splitDebugInlining: false, nameTableKind: None)
!930 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_i2c_master_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!931 = !{!932, !34, !942, !952, !969}
!932 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !658, line: 137, baseType: !15, size: 32, elements: !933)
!933 = !{!934, !935, !936, !937, !938, !939, !940, !941}
!934 = !DIEnumerator(name: "PDMA_START_CHANNEL", value: 1)
!935 = !DIEnumerator(name: "PDMA_MSDC1", value: 1)
!936 = !DIEnumerator(name: "PDMA_MSDC2", value: 2)
!937 = !DIEnumerator(name: "PDMA_I2C0_TX", value: 3)
!938 = !DIEnumerator(name: "PDMA_I2C0_RX", value: 4)
!939 = !DIEnumerator(name: "PDMA_I2C1_TX", value: 5)
!940 = !DIEnumerator(name: "PDMA_I2C1_RX", value: 6)
!941 = !DIEnumerator(name: "PDMA_END_CHANNEL", value: 7)
!942 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !943, line: 132, baseType: !15, size: 32, elements: !944)
!943 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_i2c_master_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!944 = !{!945, !946, !947, !948, !949, !950, !951}
!945 = !DIEnumerator(name: "I2C_FREQUENCY_50K", value: 50)
!946 = !DIEnumerator(name: "I2C_FREQUENCY_100K", value: 100)
!947 = !DIEnumerator(name: "I2C_FREQUENCY_200K", value: 200)
!948 = !DIEnumerator(name: "I2C_FREQUENCY_300K", value: 300)
!949 = !DIEnumerator(name: "I2C_FREQUENCY_400K", value: 400)
!950 = !DIEnumerator(name: "I2C_FREQUENCY_1M", value: 1000)
!951 = !DIEnumerator(name: "I2C_FREQUENCY_MAX", value: 1001)
!952 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !943, line: 142, baseType: !15, size: 32, elements: !953)
!953 = !{!954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968}
!954 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_POLLING", value: 0)
!955 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_DMA", value: 1)
!956 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_RECEIVE_POLLING", value: 2)
!957 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_RECEIVE_DMA", value: 3)
!958 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_TO_RECEIVE_POLLING", value: 4)
!959 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_TO_RECEIVE_DMA", value: 5)
!960 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_POLLING", value: 6)
!961 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_DMA", value: 7)
!962 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_RECEIVE_POLLING", value: 8)
!963 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_RECEIVE_DMA", value: 9)
!964 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_TO_RECEIVE_POLLING", value: 10)
!965 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_TO_RECEIVE_DMA", value: 11)
!966 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_DMA_EXTEND", value: 12)
!967 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_RECEIVE_DMA_EXTEND", value: 13)
!968 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_TO_RECEIVE_DMA_EXTEND", value: 14)
!969 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !943, line: 162, baseType: !7, size: 32, elements: !970)
!970 = !{!971, !972, !973, !974, !975}
!971 = !DIEnumerator(name: "I2C_TRANSACTION_UNKNOWN_ERROR", value: -4)
!972 = !DIEnumerator(name: "I2C_TRANSACTION_ACK_ERROR", value: -3)
!973 = !DIEnumerator(name: "I2C_TRANSACTION_NACK_ERROR", value: -2)
!974 = !DIEnumerator(name: "I2C_TRANSACTION_TIMEOUT_ERROR", value: -1)
!975 = !DIEnumerator(name: "I2C_TRANSACTION_SUCCESS", value: 0)
!976 = !{!977, !927, !1041, !1046, !1048}
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "i2c_master_register", scope: !929, file: !930, line: 46, type: !979, isLocal: false, isDefinition: true)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 128, elements: !482)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2C_REGISTER_T", file: !100, line: 1885, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !100, line: 1833, size: 960, elements: !984)
!984 = !{!985, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "DATA_PORT", scope: !983, file: !100, line: 1834, baseType: !986, size: 16)
!986 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !106, line: 36, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !108, line: 57, baseType: !989)
!989 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !983, file: !100, line: 1835, baseType: !986, size: 16, offset: 16)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "SLAVE_ADDR", scope: !983, file: !100, line: 1836, baseType: !986, size: 16, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !983, file: !100, line: 1837, baseType: !986, size: 16, offset: 48)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "INTR_MASK", scope: !983, file: !100, line: 1838, baseType: !986, size: 16, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !983, file: !100, line: 1839, baseType: !986, size: 16, offset: 80)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "INTR_STAT", scope: !983, file: !100, line: 1840, baseType: !986, size: 16, offset: 96)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !983, file: !100, line: 1841, baseType: !986, size: 16, offset: 112)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "CONTROL", scope: !983, file: !100, line: 1842, baseType: !986, size: 16, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !983, file: !100, line: 1843, baseType: !986, size: 16, offset: 144)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "TRANSFER_LEN", scope: !983, file: !100, line: 1844, baseType: !986, size: 16, offset: 160)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !983, file: !100, line: 1845, baseType: !986, size: 16, offset: 176)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "TRANSAC_LEN", scope: !983, file: !100, line: 1846, baseType: !986, size: 16, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !983, file: !100, line: 1847, baseType: !986, size: 16, offset: 208)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "DELAY_LEN", scope: !983, file: !100, line: 1848, baseType: !986, size: 16, offset: 224)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !983, file: !100, line: 1849, baseType: !986, size: 16, offset: 240)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "TIMING", scope: !983, file: !100, line: 1850, baseType: !986, size: 16, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !983, file: !100, line: 1851, baseType: !986, size: 16, offset: 272)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "START", scope: !983, file: !100, line: 1852, baseType: !986, size: 16, offset: 288)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !983, file: !100, line: 1853, baseType: !986, size: 16, offset: 304)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !983, file: !100, line: 1854, baseType: !1010, size: 32, offset: 320)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 32, elements: !484)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "CLOCK_DIV", scope: !983, file: !100, line: 1855, baseType: !986, size: 16, offset: 352)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !983, file: !100, line: 1856, baseType: !986, size: 16, offset: 368)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "FIFO_STAT", scope: !983, file: !100, line: 1857, baseType: !986, size: 16, offset: 384)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !983, file: !100, line: 1858, baseType: !986, size: 16, offset: 400)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "FIFO_THRESH", scope: !983, file: !100, line: 1859, baseType: !986, size: 16, offset: 416)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED14", scope: !983, file: !100, line: 1860, baseType: !986, size: 16, offset: 432)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "FIFO_ADDR_CLR", scope: !983, file: !100, line: 1861, baseType: !986, size: 16, offset: 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED15", scope: !983, file: !100, line: 1862, baseType: !986, size: 16, offset: 464)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED16", scope: !983, file: !100, line: 1863, baseType: !1010, size: 32, offset: 480)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "IO_CONFIG", scope: !983, file: !100, line: 1864, baseType: !986, size: 16, offset: 512)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED17", scope: !983, file: !100, line: 1865, baseType: !986, size: 16, offset: 528)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED18", scope: !983, file: !100, line: 1866, baseType: !1010, size: 32, offset: 544)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "HS", scope: !983, file: !100, line: 1867, baseType: !986, size: 16, offset: 576)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED19", scope: !983, file: !100, line: 1868, baseType: !986, size: 16, offset: 592)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED20", scope: !983, file: !100, line: 1869, baseType: !1010, size: 32, offset: 608)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "SOFTRESET", scope: !983, file: !100, line: 1870, baseType: !986, size: 16, offset: 640)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED21", scope: !983, file: !100, line: 1871, baseType: !986, size: 16, offset: 656)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED22", scope: !983, file: !100, line: 1872, baseType: !1029, size: 96, offset: 672)
!1029 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 96, elements: !196)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "SPARE", scope: !983, file: !100, line: 1873, baseType: !986, size: 16, offset: 768)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED23", scope: !983, file: !100, line: 1874, baseType: !986, size: 16, offset: 784)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "DEBUGSTAT", scope: !983, file: !100, line: 1875, baseType: !986, size: 16, offset: 800)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED24", scope: !983, file: !100, line: 1876, baseType: !986, size: 16, offset: 816)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "DEBUGCTRL", scope: !983, file: !100, line: 1877, baseType: !986, size: 16, offset: 832)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED25", scope: !983, file: !100, line: 1878, baseType: !986, size: 16, offset: 848)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "TRANSFER_LEN_AUX", scope: !983, file: !100, line: 1879, baseType: !986, size: 16, offset: 864)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED26", scope: !983, file: !100, line: 1880, baseType: !986, size: 16, offset: 880)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED27", scope: !983, file: !100, line: 1881, baseType: !1010, size: 32, offset: 896)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "TIMEOUT", scope: !983, file: !100, line: 1882, baseType: !986, size: 16, offset: 928)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED28", scope: !983, file: !100, line: 1883, baseType: !986, size: 16, offset: 944)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(name: "g_i2c_rx_dma_channel", scope: !929, file: !930, line: 48, type: !1043, isLocal: false, isDefinition: true)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1044, size: 128, elements: !482)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "pdma_channel_t", file: !658, line: 147, baseType: !932)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(name: "g_i2c_pdn_table", scope: !929, file: !930, line: 49, type: !912, isLocal: false, isDefinition: true)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(name: "g_i2c_source_clock_table", scope: !929, file: !930, line: 52, type: !1050, isLocal: false, isDefinition: true)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 128, elements: !482)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1052 = distinct !DIGlobalVariable(name: "priority_set", scope: !1053, file: !1054, line: 128, type: !105, isLocal: true, isDefinition: true)
!1053 = distinct !DISubprogram(name: "hal_nvic_init", scope: !1054, file: !1054, line: 126, type: !1055, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1058, retainedNodes: !1144)
!1054 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!1055 = !DISubroutineType(types: !1056)
!1056 = !{!1057}
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_status_t", file: !733, line: 158, baseType: !732)
!1058 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1054, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1059, retainedTypes: !1060, globals: !1126, splitDebugInlining: false, nameTableKind: None)
!1059 = !{!732, !213}
!1060 = !{!919, !1061, !105, !1094, !1124}
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 32)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !1063, line: 418, baseType: !1064)
!1063 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/dac_output_data_repeatedly/GCC")
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1063, line: 395, size: 1120, elements: !1065)
!1065 = !{!1066, !1067, !1068, !1069, !1070, !1071, !1072, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1083, !1084, !1085, !1087, !1091, !1093}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !1064, file: !1063, line: 397, baseType: !299, size: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !1064, file: !1063, line: 398, baseType: !104, size: 32, offset: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !1064, file: !1063, line: 399, baseType: !104, size: 32, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !1064, file: !1063, line: 400, baseType: !104, size: 32, offset: 96)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !1064, file: !1063, line: 401, baseType: !104, size: 32, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !1064, file: !1063, line: 402, baseType: !104, size: 32, offset: 160)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !1064, file: !1063, line: 403, baseType: !1073, size: 96, offset: 192)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 96, elements: !528)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !1064, file: !1063, line: 404, baseType: !104, size: 32, offset: 288)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !1064, file: !1063, line: 405, baseType: !104, size: 32, offset: 320)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !1064, file: !1063, line: 406, baseType: !104, size: 32, offset: 352)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !1064, file: !1063, line: 407, baseType: !104, size: 32, offset: 384)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !1064, file: !1063, line: 408, baseType: !104, size: 32, offset: 416)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !1064, file: !1063, line: 409, baseType: !104, size: 32, offset: 448)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !1064, file: !1063, line: 410, baseType: !104, size: 32, offset: 480)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !1064, file: !1063, line: 411, baseType: !1082, size: 64, offset: 512)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 64, elements: !484)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !1064, file: !1063, line: 412, baseType: !299, size: 32, offset: 576)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !1064, file: !1063, line: 413, baseType: !299, size: 32, offset: 608)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !1064, file: !1063, line: 414, baseType: !1086, size: 128, offset: 640)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 128, elements: !482)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !1064, file: !1063, line: 415, baseType: !1088, size: 160, offset: 768)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 160, elements: !1089)
!1089 = !{!1090}
