; ModuleID = 'build/adafruit_feather_m0_basic_proto/subsys/settings/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.settings_handler = type { i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i32, i32 (i8*, i8*, i32)*, i8*)*, i32 ()*, i32 (i32 (i8*, i8*, i32)*)*, %struct._snode }
%struct._snode = type { %struct._snode* }
%struct.settings_handler_static = type { i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i32, i32 (i8*, i8*, i32)*, i8*)*, i32 ()*, i32 (i32 (i8*, i8*, i32)*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.settings_store = type { %struct._snode, %struct.settings_store_itf* }
%struct.settings_store_itf = type { i32 (%struct.settings_store*, %struct.settings_load_arg*)*, i32 (%struct.settings_store*)*, i32 (%struct.settings_store*, i8*, i8*, i32)*, i32 (%struct.settings_store*)*, i8* (%struct.settings_store*)* }
%struct.settings_load_arg = type { i8*, i32 (i8*, i32, i32 (i8*, i8*, i32)*, i8*, i8*)*, i8* }
%struct.k_mutex = type { %union.anon, %struct.k_thread*, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/settings/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/settings")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/settings")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "length_val", scope: !27, file: !33, line: 31, type: !47, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !29, globals: !54, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/settings/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/settings")
!29 = !{!30, !31, !13, !43}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "direct_immediate_value", file: !33, line: 332, size: 96, elements: !34)
!33 = !DIFile(filename: "zephyr/samples/subsys/settings/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!34 = !{!35, !39, !40}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !32, file: !33, line: 333, baseType: !36, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !37, line: 214, baseType: !38)
!37 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !32, file: !33, line: 334, baseType: !30, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "fetched", scope: !32, file: !33, line: 335, baseType: !41, size: 8, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !42)
!42 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "direct_length_data", file: !33, line: 264, size: 128, elements: !45)
!45 = !{!46, !49, !52}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !44, file: !33, line: 265, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !48)
!48 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "length_1", scope: !44, file: !33, line: 266, baseType: !50, size: 16, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !51)
!51 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "length_2", scope: !44, file: !33, line: 267, baseType: !53, size: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !38)
!54 = !{!25, !55, !57, !59, !63, !69, !110, !120}
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "length_1_val", scope: !27, file: !33, line: 32, type: !50, isLocal: false, isDefinition: true)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "length_2_val", scope: !27, file: !33, line: 33, type: !53, isLocal: false, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "voltage_val", scope: !27, file: !33, line: 34, type: !61, isLocal: false, isDefinition: true)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !62)
!62 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "source_name_val", scope: !27, file: !33, line: 35, type: !65, isLocal: false, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 48, elements: !67)
!66 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!67 = !{!68}
!68 = !DISubrange(count: 6)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "alph_handler", scope: !27, file: !33, line: 51, type: !71, isLocal: false, isDefinition: true)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings_handler", file: !72, line: 64, size: 192, elements: !73)
!72 = !DIFile(filename: "zephyr/include/zephyr/settings/settings.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!73 = !{!74, !77, !82, !92, !96, !103}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !71, file: !72, line: 66, baseType: !75, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "h_get", scope: !71, file: !72, line: 69, baseType: !78, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DISubroutineType(types: !80)
!80 = !{!62, !75, !81, !62}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "h_set", scope: !71, file: !72, line: 81, baseType: !83, size: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 32)
!84 = !DISubroutineType(types: !85)
!85 = !{!62, !75, !36, !86, !30}
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "settings_read_cb", file: !72, line: 57, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !30, !30, !36}
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !91, line: 28, baseType: !62)
!91 = !DIFile(filename: "zephyr/lib/libc/minimal/include/sys/types.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!92 = !DIDerivedType(tag: DW_TAG_member, name: "h_commit", scope: !71, file: !72, line: 96, baseType: !93, size: 32, offset: 96)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!94 = !DISubroutineType(types: !95)
!95 = !{!62}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "h_export", scope: !71, file: !72, line: 103, baseType: !97, size: 32, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DISubroutineType(types: !99)
!99 = !{!62, !100}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = !DISubroutineType(types: !102)
!102 = !{!62, !75, !13, !36}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !71, file: !72, line: 121, baseType: !104, size: 32, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !105, line: 33, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !105, line: 29, size: 32, elements: !107)
!107 = !{!108}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !106, file: !105, line: 30, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "settings_handler_beta", scope: !27, file: !33, line: 60, type: !112, isLocal: false, isDefinition: true, align: 32)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings_handler_static", file: !72, line: 130, size: 160, elements: !114)
!114 = !{!115, !116, !117, !118, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !72, line: 132, baseType: !75, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "h_get", scope: !113, file: !72, line: 135, baseType: !78, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "h_set", scope: !113, file: !72, line: 147, baseType: !83, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "h_commit", scope: !113, file: !72, line: 162, baseType: !93, size: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "h_export", scope: !113, file: !72, line: 167, baseType: !97, size: 32, offset: 128)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "angle_val", scope: !27, file: !33, line: 30, type: !41, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "_char_out", scope: !124, file: !199, line: 54, type: !200, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, retainedTypes: !197, globals: !198, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/settings")
!126 = !{!127}
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !128, line: 27, baseType: !38, size: 32, elements: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196}
!130 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!131 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!132 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!133 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!134 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!135 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!136 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!137 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!138 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!139 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!140 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!141 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!142 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!143 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!144 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!145 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!146 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!147 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!148 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!149 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!150 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!151 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!152 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!153 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!154 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!155 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!156 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!157 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!158 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!159 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!160 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!161 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!162 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!163 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!164 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!165 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!166 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!167 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!168 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!169 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!170 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!171 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!172 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!173 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!174 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!175 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!176 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!177 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!178 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!179 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!180 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!181 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!182 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!183 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!184 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!185 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!186 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!187 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!188 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!189 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!190 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!191 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!192 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!193 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!194 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!195 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!196 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!197 = !{!30, !62}
!198 = !{!122}
!199 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DISubroutineType(types: !202)
!202 = !{!62, !62}
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !205, file: !939, line: 202, type: !940, isLocal: true, isDefinition: true, align: 32)
!205 = distinct !DICompileUnit(language: DW_LANG_C99, file: !206, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, retainedTypes: !207, globals: !938, splitDebugInlining: false, nameTableKind: None)
!206 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/settings")
!207 = !{!30, !62, !208, !332, !671, !672, !739}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !210, line: 335, baseType: !211)
!210 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 320, size: 288, elements: !212)
!212 = !{!213, !224, !232, !246, !257, !268, !272, !283, !284, !295, !296, !311, !312, !322}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !211, file: !210, line: 321, baseType: !214, size: 16)
!214 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !210, line: 50, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !210, line: 43, size: 16, elements: !217)
!217 = !{!218, !223}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !216, file: !210, line: 48, baseType: !219, size: 16)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !216, file: !210, line: 44, size: 16, elements: !220)
!220 = !{!221, !222}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !219, file: !210, line: 45, baseType: !50, size: 7, flags: DIFlagBitField, extraData: i64 0)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !219, file: !210, line: 47, baseType: !50, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !216, file: !210, line: 49, baseType: !50, size: 16)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !211, file: !210, line: 322, baseType: !225, size: 16, offset: 16)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 16, elements: !230)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !227, line: 52, baseType: !228)
!227 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !41)
!230 = !{!231}
!231 = !DISubrange(count: 2)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !211, file: !210, line: 323, baseType: !233, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !210, line: 107, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !210, line: 94, size: 32, elements: !236)
!236 = !{!237, !245}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !235, file: !210, line: 105, baseType: !238, size: 32)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !235, file: !210, line: 95, size: 32, elements: !239)
!239 = !{!240, !241, !242, !243, !244}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !238, file: !210, line: 97, baseType: !53, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !238, file: !210, line: 99, baseType: !53, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !238, file: !210, line: 100, baseType: !53, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !238, file: !210, line: 102, baseType: !53, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !238, file: !210, line: 103, baseType: !53, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !235, file: !210, line: 106, baseType: !53, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !211, file: !210, line: 324, baseType: !247, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !210, line: 155, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !210, line: 148, size: 32, elements: !250)
!250 = !{!251, !256}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !249, file: !210, line: 153, baseType: !252, size: 32)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !249, file: !210, line: 149, size: 32, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !252, file: !210, line: 150, baseType: !53, size: 16, flags: DIFlagBitField, extraData: i64 0)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !252, file: !210, line: 151, baseType: !53, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !249, file: !210, line: 154, baseType: !53, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !211, file: !210, line: 325, baseType: !258, size: 8, offset: 96)
!258 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !259)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !210, line: 194, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !210, line: 187, size: 8, elements: !261)
!261 = !{!262, !267}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !260, file: !210, line: 192, baseType: !263, size: 8)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !260, file: !210, line: 188, size: 8, elements: !264)
!264 = !{!265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !263, file: !210, line: 189, baseType: !41, size: 1, flags: DIFlagBitField, extraData: i64 0)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !263, file: !210, line: 190, baseType: !41, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !260, file: !210, line: 193, baseType: !41, size: 8)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !211, file: !210, line: 326, baseType: !269, size: 24, offset: 104)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 24, elements: !270)
!270 = !{!271}
!271 = !DISubrange(count: 3)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !211, file: !210, line: 327, baseType: !273, size: 8, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !210, line: 215, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !210, line: 208, size: 8, elements: !276)
!276 = !{!277, !282}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !275, file: !210, line: 213, baseType: !278, size: 8)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !275, file: !210, line: 209, size: 8, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !278, file: !210, line: 210, baseType: !41, size: 1, flags: DIFlagBitField, extraData: i64 0)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !278, file: !210, line: 211, baseType: !41, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !275, file: !210, line: 214, baseType: !41, size: 8)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !211, file: !210, line: 328, baseType: !269, size: 24, offset: 136)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !211, file: !210, line: 329, baseType: !285, size: 8, offset: 160)
!285 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !210, line: 236, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !210, line: 229, size: 8, elements: !288)
!288 = !{!289, !294}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !287, file: !210, line: 234, baseType: !290, size: 8)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !287, file: !210, line: 230, size: 8, elements: !291)
!291 = !{!292, !293}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !290, file: !210, line: 231, baseType: !228, size: 1, flags: DIFlagBitField, extraData: i64 0)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !290, file: !210, line: 232, baseType: !228, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !287, file: !210, line: 235, baseType: !41, size: 8)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !211, file: !210, line: 330, baseType: !269, size: 24, offset: 168)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !211, file: !210, line: 331, baseType: !297, size: 16, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !210, line: 262, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !210, line: 250, size: 16, elements: !300)
!300 = !{!301, !310}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !299, file: !210, line: 260, baseType: !302, size: 16)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !299, file: !210, line: 251, size: 16, elements: !303)
!303 = !{!304, !305, !306, !307, !308, !309}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !302, file: !210, line: 252, baseType: !50, size: 1, flags: DIFlagBitField, extraData: i64 0)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !302, file: !210, line: 253, baseType: !50, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !302, file: !210, line: 254, baseType: !50, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !302, file: !210, line: 255, baseType: !50, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !302, file: !210, line: 256, baseType: !50, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !302, file: !210, line: 258, baseType: !50, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !299, file: !210, line: 261, baseType: !50, size: 16)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !211, file: !210, line: 332, baseType: !225, size: 16, offset: 208)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !211, file: !210, line: 333, baseType: !313, size: 32, offset: 224)
!313 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !210, line: 290, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !210, line: 284, size: 32, elements: !316)
!316 = !{!317, !321}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !315, file: !210, line: 288, baseType: !318, size: 32)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !315, file: !210, line: 285, size: 32, elements: !319)
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !318, file: !210, line: 286, baseType: !53, size: 22, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !315, file: !210, line: 289, baseType: !53, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !211, file: !210, line: 334, baseType: !323, size: 16, offset: 256)
!323 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !210, line: 308, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !210, line: 303, size: 16, elements: !326)
!326 = !{!327, !331}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !325, file: !210, line: 306, baseType: !328, size: 16)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !325, file: !210, line: 304, size: 16, elements: !329)
!329 = !{!330}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !328, file: !210, line: 305, baseType: !50, size: 16, flags: DIFlagBitField, extraData: i64 0)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !325, file: !210, line: 307, baseType: !50, size: 16)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !334, line: 928, baseType: !335)
!334 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !334, line: 899, size: 672, elements: !336)
!336 = !{!337, !361, !385, !411, !436, !452, !453, !471, !472, !489, !500, !501, !516, !536, !537, !549, !561, !571, !572, !589, !593, !604, !605, !617, !629, !630, !641, !657}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !335, file: !334, line: 900, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !334, line: 64, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 43, size: 32, elements: !341)
!341 = !{!342, !360}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !340, file: !334, line: 62, baseType: !343, size: 32)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !340, file: !334, line: 44, size: 32, elements: !344)
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !343, file: !334, line: 45, baseType: !53, size: 1, flags: DIFlagBitField, extraData: i64 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !343, file: !334, line: 46, baseType: !53, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !343, file: !334, line: 47, baseType: !53, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !343, file: !334, line: 48, baseType: !53, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !343, file: !334, line: 49, baseType: !53, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !343, file: !334, line: 50, baseType: !53, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !343, file: !334, line: 51, baseType: !53, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !343, file: !334, line: 52, baseType: !53, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !343, file: !334, line: 53, baseType: !53, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !343, file: !334, line: 54, baseType: !53, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !343, file: !334, line: 55, baseType: !53, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !343, file: !334, line: 56, baseType: !53, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !343, file: !334, line: 58, baseType: !53, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !343, file: !334, line: 59, baseType: !53, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !343, file: !334, line: 60, baseType: !53, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !340, file: !334, line: 63, baseType: !53, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !335, file: !334, line: 901, baseType: !362, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !363)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !334, line: 125, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 104, size: 32, elements: !365)
!365 = !{!366, !384}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !364, file: !334, line: 123, baseType: !367, size: 32)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !364, file: !334, line: 105, size: 32, elements: !368)
!368 = !{!369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !367, file: !334, line: 106, baseType: !53, size: 1, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !367, file: !334, line: 107, baseType: !53, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !367, file: !334, line: 108, baseType: !53, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !367, file: !334, line: 109, baseType: !53, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !367, file: !334, line: 110, baseType: !53, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !367, file: !334, line: 111, baseType: !53, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !367, file: !334, line: 112, baseType: !53, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !367, file: !334, line: 113, baseType: !53, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !367, file: !334, line: 114, baseType: !53, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !367, file: !334, line: 115, baseType: !53, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !367, file: !334, line: 116, baseType: !53, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !367, file: !334, line: 117, baseType: !53, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !367, file: !334, line: 119, baseType: !53, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !367, file: !334, line: 120, baseType: !53, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !367, file: !334, line: 121, baseType: !53, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !364, file: !334, line: 124, baseType: !53, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !335, file: !334, line: 902, baseType: !386, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !334, line: 186, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 165, size: 32, elements: !389)
!389 = !{!390, !410}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !388, file: !334, line: 184, baseType: !391, size: 32)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !388, file: !334, line: 166, size: 32, elements: !392)
!392 = !{!393, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !391, file: !334, line: 167, baseType: !394, size: 1, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !391, file: !334, line: 168, baseType: !394, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !391, file: !334, line: 169, baseType: !394, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !391, file: !334, line: 170, baseType: !394, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !391, file: !334, line: 171, baseType: !394, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !391, file: !334, line: 172, baseType: !394, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !391, file: !334, line: 173, baseType: !394, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !391, file: !334, line: 174, baseType: !394, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !391, file: !334, line: 175, baseType: !394, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !391, file: !334, line: 176, baseType: !394, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !391, file: !334, line: 177, baseType: !394, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !391, file: !334, line: 178, baseType: !394, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !391, file: !334, line: 180, baseType: !394, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !391, file: !334, line: 181, baseType: !394, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !391, file: !334, line: 182, baseType: !394, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !388, file: !334, line: 185, baseType: !53, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !335, file: !334, line: 903, baseType: !412, size: 32, offset: 96)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !334, line: 247, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 226, size: 32, elements: !416)
!416 = !{!417, !435}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !415, file: !334, line: 245, baseType: !418, size: 32)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !415, file: !334, line: 227, size: 32, elements: !419)
!419 = !{!420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !418, file: !334, line: 228, baseType: !53, size: 1, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !418, file: !334, line: 229, baseType: !53, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !418, file: !334, line: 230, baseType: !53, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !418, file: !334, line: 231, baseType: !53, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !418, file: !334, line: 232, baseType: !53, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !418, file: !334, line: 233, baseType: !53, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !418, file: !334, line: 234, baseType: !53, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !418, file: !334, line: 235, baseType: !53, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !418, file: !334, line: 236, baseType: !53, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !418, file: !334, line: 237, baseType: !53, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !418, file: !334, line: 238, baseType: !53, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !418, file: !334, line: 239, baseType: !53, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !418, file: !334, line: 241, baseType: !53, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !418, file: !334, line: 242, baseType: !53, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !418, file: !334, line: 243, baseType: !53, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !415, file: !334, line: 246, baseType: !53, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !335, file: !334, line: 904, baseType: !437, size: 16, offset: 128)
!437 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !334, line: 300, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 287, size: 16, elements: !440)
!440 = !{!441, !451}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !439, file: !334, line: 298, baseType: !442, size: 16)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !334, line: 288, size: 16, elements: !443)
!443 = !{!444, !445, !446, !447, !448, !449, !450}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !442, file: !334, line: 290, baseType: !50, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !442, file: !334, line: 291, baseType: !50, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !442, file: !334, line: 293, baseType: !50, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !442, file: !334, line: 294, baseType: !50, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !442, file: !334, line: 295, baseType: !50, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !442, file: !334, line: 296, baseType: !50, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !442, file: !334, line: 297, baseType: !50, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !439, file: !334, line: 299, baseType: !50, size: 16)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !335, file: !334, line: 905, baseType: !225, size: 16, offset: 144)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !335, file: !334, line: 906, baseType: !454, size: 16, offset: 160)
!454 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !334, line: 352, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 336, size: 16, elements: !457)
!457 = !{!458, !470}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !456, file: !334, line: 350, baseType: !459, size: 16)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !456, file: !334, line: 337, size: 16, elements: !460)
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !459, file: !334, line: 339, baseType: !50, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !459, file: !334, line: 340, baseType: !50, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !459, file: !334, line: 341, baseType: !50, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !459, file: !334, line: 342, baseType: !50, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !459, file: !334, line: 343, baseType: !50, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !459, file: !334, line: 344, baseType: !50, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !459, file: !334, line: 345, baseType: !50, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !459, file: !334, line: 346, baseType: !50, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !459, file: !334, line: 348, baseType: !50, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !456, file: !334, line: 351, baseType: !50, size: 16)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !335, file: !334, line: 907, baseType: !225, size: 16, offset: 176)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !335, file: !334, line: 908, baseType: !473, size: 32, offset: 192)
!473 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !334, line: 398, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 381, size: 32, elements: !476)
!476 = !{!477, !488}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !475, file: !334, line: 396, baseType: !478, size: 32)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !475, file: !334, line: 382, size: 32, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !478, file: !334, line: 384, baseType: !53, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !478, file: !334, line: 385, baseType: !53, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !478, file: !334, line: 386, baseType: !53, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !478, file: !334, line: 388, baseType: !53, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !478, file: !334, line: 389, baseType: !53, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !478, file: !334, line: 390, baseType: !53, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !478, file: !334, line: 392, baseType: !53, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !478, file: !334, line: 394, baseType: !53, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !475, file: !334, line: 397, baseType: !53, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !335, file: !334, line: 909, baseType: !490, size: 8, offset: 224)
!490 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !334, line: 433, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 426, size: 8, elements: !493)
!493 = !{!494, !499}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !492, file: !334, line: 431, baseType: !495, size: 8)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !492, file: !334, line: 427, size: 8, elements: !496)
!496 = !{!497, !498}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !495, file: !334, line: 428, baseType: !41, size: 5, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !495, file: !334, line: 430, baseType: !41, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !492, file: !334, line: 432, baseType: !41, size: 8)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !335, file: !334, line: 910, baseType: !269, size: 24, offset: 232)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !335, file: !334, line: 911, baseType: !502, size: 32, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !334, line: 462, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 448, size: 32, elements: !505)
!505 = !{!506, !515}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !504, file: !334, line: 460, baseType: !507, size: 32)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !504, file: !334, line: 449, size: 32, elements: !508)
!508 = !{!509, !510, !511, !512, !513, !514}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !507, file: !334, line: 451, baseType: !53, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !507, file: !334, line: 453, baseType: !53, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !507, file: !334, line: 454, baseType: !53, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !507, file: !334, line: 455, baseType: !53, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !507, file: !334, line: 457, baseType: !53, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !507, file: !334, line: 459, baseType: !53, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !504, file: !334, line: 461, baseType: !53, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !335, file: !334, line: 912, baseType: !517, size: 16, offset: 288)
!517 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !518)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !334, line: 520, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 503, size: 16, elements: !520)
!520 = !{!521, !535}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !519, file: !334, line: 518, baseType: !522, size: 16)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !519, file: !334, line: 504, size: 16, elements: !523)
!523 = !{!524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !522, file: !334, line: 506, baseType: !50, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !522, file: !334, line: 507, baseType: !50, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !522, file: !334, line: 508, baseType: !50, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !522, file: !334, line: 509, baseType: !50, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !522, file: !334, line: 510, baseType: !50, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !522, file: !334, line: 511, baseType: !50, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !522, file: !334, line: 512, baseType: !50, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !522, file: !334, line: 513, baseType: !50, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !522, file: !334, line: 514, baseType: !50, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !522, file: !334, line: 515, baseType: !50, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !522, file: !334, line: 516, baseType: !50, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !519, file: !334, line: 519, baseType: !50, size: 16)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !335, file: !334, line: 913, baseType: !225, size: 16, offset: 304)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !335, file: !334, line: 914, baseType: !538, size: 32, offset: 320)
!538 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !334, line: 559, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 552, size: 32, elements: !541)
!541 = !{!542, !548}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !540, file: !334, line: 557, baseType: !543, size: 32)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !540, file: !334, line: 553, size: 32, elements: !544)
!544 = !{!545, !546, !547}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !543, file: !334, line: 554, baseType: !53, size: 10, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !543, file: !334, line: 555, baseType: !53, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !543, file: !334, line: 556, baseType: !53, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !540, file: !334, line: 558, baseType: !53, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !335, file: !334, line: 915, baseType: !550, size: 32, offset: 352)
!550 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !551)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !334, line: 585, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 578, size: 32, elements: !553)
!553 = !{!554, !560}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !552, file: !334, line: 583, baseType: !555, size: 32)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !552, file: !334, line: 579, size: 32, elements: !556)
!556 = !{!557, !558, !559}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !555, file: !334, line: 580, baseType: !53, size: 16, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !555, file: !334, line: 581, baseType: !53, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !555, file: !334, line: 582, baseType: !53, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !552, file: !334, line: 584, baseType: !53, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !335, file: !334, line: 916, baseType: !562, size: 8, offset: 384)
!562 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !334, line: 610, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 604, size: 8, elements: !565)
!565 = !{!566, !570}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !564, file: !334, line: 608, baseType: !567, size: 8)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !564, file: !334, line: 605, size: 8, elements: !568)
!568 = !{!569}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !567, file: !334, line: 607, baseType: !41, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !564, file: !334, line: 609, baseType: !41, size: 8)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !335, file: !334, line: 917, baseType: !269, size: 24, offset: 392)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !335, file: !334, line: 918, baseType: !573, size: 32, offset: 416)
!573 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !574)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !334, line: 639, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 622, size: 32, elements: !576)
!576 = !{!577, !588}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !575, file: !334, line: 637, baseType: !578, size: 32)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !575, file: !334, line: 623, size: 32, elements: !579)
!579 = !{!580, !581, !582, !583, !584, !585, !586, !587}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !578, file: !334, line: 625, baseType: !53, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !578, file: !334, line: 626, baseType: !53, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !578, file: !334, line: 627, baseType: !53, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !578, file: !334, line: 629, baseType: !53, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !578, file: !334, line: 631, baseType: !53, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !578, file: !334, line: 632, baseType: !53, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !578, file: !334, line: 634, baseType: !53, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !578, file: !334, line: 635, baseType: !53, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !575, file: !334, line: 638, baseType: !53, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !335, file: !334, line: 919, baseType: !590, size: 32, offset: 448)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 32, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 4)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !335, file: !334, line: 920, baseType: !594, size: 16, offset: 480)
!594 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !334, line: 715, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 706, size: 16, elements: !597)
!597 = !{!598, !603}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !596, file: !334, line: 713, baseType: !599, size: 16)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !596, file: !334, line: 707, size: 16, elements: !600)
!600 = !{!601, !602}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !599, file: !334, line: 709, baseType: !50, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !599, file: !334, line: 711, baseType: !50, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !596, file: !334, line: 714, baseType: !50, size: 16)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !335, file: !334, line: 921, baseType: !225, size: 16, offset: 496)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !335, file: !334, line: 922, baseType: !606, size: 32, offset: 512)
!606 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !334, line: 739, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 729, size: 32, elements: !609)
!609 = !{!610, !616}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !608, file: !334, line: 737, baseType: !611, size: 32)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !608, file: !334, line: 730, size: 32, elements: !612)
!612 = !{!613, !614, !615}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !611, file: !334, line: 732, baseType: !53, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !611, file: !334, line: 733, baseType: !53, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !611, file: !334, line: 735, baseType: !53, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !608, file: !334, line: 738, baseType: !53, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !335, file: !334, line: 923, baseType: !618, size: 8, offset: 544)
!618 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !334, line: 765, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 756, size: 8, elements: !621)
!621 = !{!622, !628}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !620, file: !334, line: 763, baseType: !623, size: 8)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !620, file: !334, line: 757, size: 8, elements: !624)
!624 = !{!625, !626, !627}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !623, file: !334, line: 759, baseType: !41, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !623, file: !334, line: 761, baseType: !41, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !623, file: !334, line: 762, baseType: !41, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !620, file: !334, line: 764, baseType: !41, size: 8)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !335, file: !334, line: 924, baseType: !269, size: 24, offset: 552)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !335, file: !334, line: 925, baseType: !631, size: 32, offset: 576)
!631 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !334, line: 789, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 781, size: 32, elements: !634)
!634 = !{!635, !640}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !633, file: !334, line: 787, baseType: !636, size: 32)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !633, file: !334, line: 782, size: 32, elements: !637)
!637 = !{!638, !639}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !636, file: !334, line: 783, baseType: !53, size: 12, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !636, file: !334, line: 785, baseType: !53, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !633, file: !334, line: 788, baseType: !53, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !335, file: !334, line: 926, baseType: !642, size: 32, offset: 608)
!642 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !334, line: 820, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 805, size: 32, elements: !645)
!645 = !{!646, !656}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !644, file: !334, line: 818, baseType: !647, size: 32)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !644, file: !334, line: 806, size: 32, elements: !648)
!648 = !{!649, !650, !651, !652, !653, !654, !655}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !647, file: !334, line: 807, baseType: !53, size: 2, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !647, file: !334, line: 808, baseType: !53, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !647, file: !334, line: 809, baseType: !53, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !647, file: !334, line: 810, baseType: !53, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !647, file: !334, line: 812, baseType: !53, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !647, file: !334, line: 814, baseType: !53, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !647, file: !334, line: 816, baseType: !53, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !644, file: !334, line: 819, baseType: !53, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !335, file: !334, line: 927, baseType: !658, size: 8, offset: 640)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !334, line: 881, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !334, line: 872, size: 8, elements: !662)
!662 = !{!663, !670}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !661, file: !334, line: 879, baseType: !664, size: 8)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !661, file: !334, line: 873, size: 8, elements: !665)
!665 = !{!666, !667, !668, !669}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !664, file: !334, line: 874, baseType: !41, size: 1, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !664, file: !334, line: 875, baseType: !41, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !664, file: !334, line: 876, baseType: !41, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !664, file: !334, line: 877, baseType: !41, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !661, file: !334, line: 880, baseType: !41, size: 8)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !674, line: 290, baseType: !675)
!674 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !674, line: 284, size: 96, elements: !676)
!676 = !{!677, !687, !698, !711, !728}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !675, file: !674, line: 285, baseType: !678, size: 8)
!678 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !674, line: 49, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !674, line: 43, size: 8, elements: !681)
!681 = !{!682, !686}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !680, file: !674, line: 47, baseType: !683, size: 8)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !680, file: !674, line: 44, size: 8, elements: !684)
!684 = !{!685}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !683, file: !674, line: 45, baseType: !41, size: 1, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !680, file: !674, line: 48, baseType: !41, size: 8)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !675, file: !674, line: 286, baseType: !688, size: 8, offset: 8)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !674, line: 67, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !674, line: 61, size: 8, elements: !692)
!692 = !{!693, !697}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !691, file: !674, line: 65, baseType: !694, size: 8)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !691, file: !674, line: 62, size: 8, elements: !695)
!695 = !{!696}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !694, file: !674, line: 64, baseType: !41, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !691, file: !674, line: 66, baseType: !41, size: 8)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !675, file: !674, line: 287, baseType: !699, size: 16, offset: 16)
!699 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !674, line: 89, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !674, line: 79, size: 16, elements: !702)
!702 = !{!703, !710}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !701, file: !674, line: 87, baseType: !704, size: 16)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !701, file: !674, line: 80, size: 16, elements: !705)
!705 = !{!706, !707, !708, !709}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !704, file: !674, line: 81, baseType: !50, size: 6, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !704, file: !674, line: 83, baseType: !50, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !704, file: !674, line: 85, baseType: !50, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !704, file: !674, line: 86, baseType: !50, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !701, file: !674, line: 88, baseType: !50, size: 16)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !675, file: !674, line: 288, baseType: !712, size: 32, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !674, line: 214, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !674, line: 199, size: 32, elements: !715)
!715 = !{!716, !727}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !714, file: !674, line: 212, baseType: !717, size: 32)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !674, line: 200, size: 32, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724, !725, !726}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !717, file: !674, line: 201, baseType: !53, size: 4, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !717, file: !674, line: 203, baseType: !53, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !717, file: !674, line: 205, baseType: !53, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !717, file: !674, line: 206, baseType: !53, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !717, file: !674, line: 207, baseType: !53, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !717, file: !674, line: 208, baseType: !53, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !717, file: !674, line: 209, baseType: !53, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !717, file: !674, line: 210, baseType: !53, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !714, file: !674, line: 213, baseType: !53, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !675, file: !674, line: 289, baseType: !729, size: 32, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !674, line: 268, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !674, line: 260, size: 32, elements: !732)
!732 = !{!733, !738}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !731, file: !674, line: 266, baseType: !734, size: 32)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !731, file: !674, line: 261, size: 32, elements: !735)
!735 = !{!736, !737}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !734, file: !674, line: 262, baseType: !53, size: 4, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !734, file: !674, line: 264, baseType: !53, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !731, file: !674, line: 267, baseType: !53, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !741, line: 513, baseType: !742)
!741 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !741, line: 494, size: 480, elements: !743)
!743 = !{!744, !750, !760, !762, !772, !782, !792, !802, !806, !822, !838, !854, !884, !888, !898, !908, !918, !922}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !742, file: !741, line: 495, baseType: !745, size: 8)
!745 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !741, line: 45, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !741, line: 43, size: 8, elements: !748)
!748 = !{!749}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !747, file: !741, line: 44, baseType: !41, size: 8)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !742, file: !741, line: 496, baseType: !751, size: 8, offset: 8)
!751 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !741, line: 61, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !741, line: 55, size: 8, elements: !754)
!754 = !{!755, !759}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !753, file: !741, line: 59, baseType: !756, size: 8)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !753, file: !741, line: 56, size: 8, elements: !757)
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !756, file: !741, line: 57, baseType: !41, size: 2, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !753, file: !741, line: 60, baseType: !41, size: 8)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !742, file: !741, line: 497, baseType: !761, size: 48, offset: 16)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 48, elements: !67)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !742, file: !741, line: 498, baseType: !763, size: 8, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !741, line: 86, baseType: !765)
!765 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !741, line: 80, size: 8, elements: !766)
!766 = !{!767, !771}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !765, file: !741, line: 84, baseType: !768, size: 8)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !765, file: !741, line: 81, size: 8, elements: !769)
!769 = !{!770}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !768, file: !741, line: 82, baseType: !41, size: 3, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !765, file: !741, line: 85, baseType: !41, size: 8)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !742, file: !741, line: 499, baseType: !773, size: 8, offset: 72)
!773 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !741, line: 121, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !741, line: 115, size: 8, elements: !776)
!776 = !{!777, !781}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !775, file: !741, line: 119, baseType: !778, size: 8)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !775, file: !741, line: 116, size: 8, elements: !779)
!779 = !{!780}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !778, file: !741, line: 117, baseType: !41, size: 3, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !775, file: !741, line: 120, baseType: !41, size: 8)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !742, file: !741, line: 500, baseType: !783, size: 8, offset: 80)
!783 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !741, line: 156, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !741, line: 150, size: 8, elements: !786)
!786 = !{!787, !791}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !785, file: !741, line: 154, baseType: !788, size: 8)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !785, file: !741, line: 151, size: 8, elements: !789)
!789 = !{!790}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !788, file: !741, line: 152, baseType: !41, size: 3, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !785, file: !741, line: 155, baseType: !41, size: 8)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !742, file: !741, line: 501, baseType: !793, size: 8, offset: 88)
!793 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !794)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !741, line: 191, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !741, line: 185, size: 8, elements: !796)
!796 = !{!797, !801}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !795, file: !741, line: 189, baseType: !798, size: 8)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !795, file: !741, line: 186, size: 8, elements: !799)
!799 = !{!800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !798, file: !741, line: 187, baseType: !41, size: 3, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !795, file: !741, line: 190, baseType: !41, size: 8)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !742, file: !741, line: 502, baseType: !803, size: 64, offset: 96)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 64, elements: !804)
!804 = !{!805}
!805 = !DISubrange(count: 8)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !742, file: !741, line: 503, baseType: !807, size: 32, offset: 160)
!807 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !741, line: 232, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !741, line: 220, size: 32, elements: !810)
!810 = !{!811, !821}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !809, file: !741, line: 230, baseType: !812, size: 32)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !809, file: !741, line: 221, size: 32, elements: !813)
!813 = !{!814, !815, !816, !817, !818, !819, !820}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !812, file: !741, line: 222, baseType: !53, size: 1, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !812, file: !741, line: 223, baseType: !53, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !812, file: !741, line: 224, baseType: !53, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !812, file: !741, line: 225, baseType: !53, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !812, file: !741, line: 226, baseType: !53, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !812, file: !741, line: 227, baseType: !53, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !812, file: !741, line: 228, baseType: !53, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !809, file: !741, line: 231, baseType: !53, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !742, file: !741, line: 504, baseType: !823, size: 32, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !741, line: 268, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !741, line: 256, size: 32, elements: !826)
!826 = !{!827, !837}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !825, file: !741, line: 266, baseType: !828, size: 32)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !825, file: !741, line: 257, size: 32, elements: !829)
!829 = !{!830, !831, !832, !833, !834, !835, !836}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !828, file: !741, line: 258, baseType: !53, size: 1, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !828, file: !741, line: 259, baseType: !53, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !828, file: !741, line: 260, baseType: !53, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !828, file: !741, line: 261, baseType: !53, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !828, file: !741, line: 262, baseType: !53, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_", scope: !828, file: !741, line: 263, baseType: !53, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "EIC_", scope: !828, file: !741, line: 264, baseType: !53, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !825, file: !741, line: 267, baseType: !53, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "APBBMASK", scope: !742, file: !741, line: 505, baseType: !839, size: 32, offset: 224)
!839 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !840)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBMASK_Type", file: !741, line: 304, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !741, line: 292, size: 32, elements: !842)
!842 = !{!843, !853}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !841, file: !741, line: 302, baseType: !844, size: 32)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !841, file: !741, line: 293, size: 32, elements: !845)
!845 = !{!846, !847, !848, !849, !850, !851, !852}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "PAC1_", scope: !844, file: !741, line: 294, baseType: !53, size: 1, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !844, file: !741, line: 295, baseType: !53, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !844, file: !741, line: 296, baseType: !53, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "PORT_", scope: !844, file: !741, line: 297, baseType: !53, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !844, file: !741, line: 298, baseType: !53, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !844, file: !741, line: 299, baseType: !53, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "HMATRIX_", scope: !844, file: !741, line: 300, baseType: !53, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !841, file: !741, line: 303, baseType: !53, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "APBCMASK", scope: !742, file: !741, line: 506, baseType: !855, size: 32, offset: 256)
!855 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !856)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCMASK_Type", file: !741, line: 354, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !741, line: 328, size: 32, elements: !858)
!858 = !{!859, !883}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !857, file: !741, line: 352, baseType: !860, size: 32)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !857, file: !741, line: 329, size: 32, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "PAC2_", scope: !860, file: !741, line: 330, baseType: !53, size: 1, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "EVSYS_", scope: !860, file: !741, line: 331, baseType: !53, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM0_", scope: !860, file: !741, line: 332, baseType: !53, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM1_", scope: !860, file: !741, line: 333, baseType: !53, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM2_", scope: !860, file: !741, line: 334, baseType: !53, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM3_", scope: !860, file: !741, line: 335, baseType: !53, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM4_", scope: !860, file: !741, line: 336, baseType: !53, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM5_", scope: !860, file: !741, line: 337, baseType: !53, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "TCC0_", scope: !860, file: !741, line: 338, baseType: !53, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "TCC1_", scope: !860, file: !741, line: 339, baseType: !53, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "TCC2_", scope: !860, file: !741, line: 340, baseType: !53, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "TC3_", scope: !860, file: !741, line: 341, baseType: !53, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "TC4_", scope: !860, file: !741, line: 342, baseType: !53, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "TC5_", scope: !860, file: !741, line: 343, baseType: !53, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "TC6_", scope: !860, file: !741, line: 344, baseType: !53, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "TC7_", scope: !860, file: !741, line: 345, baseType: !53, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_", scope: !860, file: !741, line: 346, baseType: !53, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "AC_", scope: !860, file: !741, line: 347, baseType: !53, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "DAC_", scope: !860, file: !741, line: 348, baseType: !53, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "PTC_", scope: !860, file: !741, line: 349, baseType: !53, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "I2S_", scope: !860, file: !741, line: 350, baseType: !53, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !857, file: !741, line: 353, baseType: !53, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !742, file: !741, line: 507, baseType: !885, size: 128, offset: 288)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 128, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 16)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !742, file: !741, line: 508, baseType: !889, size: 8, offset: 416)
!889 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENCLR_Type", file: !741, line: 412, baseType: !891)
!891 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !741, line: 406, size: 8, elements: !892)
!892 = !{!893, !897}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !891, file: !741, line: 410, baseType: !894, size: 8)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !891, file: !741, line: 407, size: 8, elements: !895)
!895 = !{!896}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !894, file: !741, line: 408, baseType: !41, size: 1, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !891, file: !741, line: 411, baseType: !41, size: 8)
