; ModuleID = 'build/adafruit_feather_nrf52840/basic/sys_heap/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, i32, i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/sys_heap/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/sys_heap")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/sys_heap")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "heap", scope: !27, file: !107, line: 13, type: !112, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/sys_heap")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!105, !25}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "heap_mem", scope: !27, file: !107, line: 12, type: !108, isLocal: true, isDefinition: true)
!107 = !DIFile(filename: "zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 2048, elements: !110)
!109 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !{!111}
!111 = !DISubrange(count: 256)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !114)
!113 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!114 = !{!115, !118, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !112, file: !113, line: 57, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !113, line: 57, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !112, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !112, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !121, line: 214, baseType: !32)
!121 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "_char_out", scope: !124, file: !127, line: 54, type: !128, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !126, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/sys_heap")
!126 = !{!122}
!127 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{!103, !103}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "state", scope: !133, file: !134, line: 227, type: !163, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "rand32", scope: !134, file: !134, line: 225, type: !135, scopeLine: 226, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !138, retainedNodes: !162)
!134 = !DIFile(filename: "zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!135 = !DISubroutineType(types: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !148, globals: !161, splitDebugInlining: false, nameTableKind: None)
!139 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/sys_heap")
!140 = !{!30, !141}
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chunk_fields", file: !142, line: 54, baseType: !32, size: 32, elements: !143)
!142 = !DIFile(filename: "zephyr/lib/os/heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !145, !146, !147}
!144 = !DIEnumerator(name: "LEFT_SIZE", value: 0)
!145 = !DIEnumerator(name: "SIZE_AND_USED", value: 1)
!146 = !DIEnumerator(name: "FREE_PREV", value: 2)
!147 = !DIEnumerator(name: "FREE_NEXT", value: 3)
!148 = !{!102, !103, !149, !150, !137, !153}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !152)
!152 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk_unit_t", file: !142, line: 58, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 58, size: 64, elements: !156)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !155, file: !142, line: 58, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 64, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 8)
!161 = !{!131}
!162 = !{}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !164)
!164 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !167, file: !206, line: 27, type: !234, isLocal: true, isDefinition: true)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !169, retainedTypes: !181, globals: !203, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/sys_heap")
!169 = !{!170, !30}
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !171, line: 27, baseType: !32, size: 32, elements: !172)
!171 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !{!173, !174, !175, !176, !177, !178, !179, !180}
!173 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!174 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!175 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!176 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!177 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!178 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!179 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!180 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!181 = !{!102, !182, !103, !24, !186, !202, !137, !163}
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !183, line: 46, baseType: !184)
!183 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !185)
!185 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !188, line: 54, size: 96, elements: !189)
!188 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!189 = !{!190, !197, !201}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !187, file: !188, line: 55, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !192, line: 33, baseType: !193)
!192 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !192, line: 29, size: 32, elements: !194)
!194 = !{!195}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !193, file: !192, line: 30, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !187, file: !188, line: 60, baseType: !198, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !170}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !187, file: !188, line: 65, baseType: !198, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!203 = !{!165, !204, !209, !211, !224, !226}
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !167, file: !206, line: 44, type: !207, isLocal: true, isDefinition: true)
!206 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !208, line: 43, elements: !162)
!208 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !167, file: !206, line: 49, type: !207, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !167, file: !206, line: 36, type: !213, isLocal: true, isDefinition: true)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 128, elements: !222)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !171, line: 114, size: 128, elements: !215)
!215 = !{!216, !217, !220, !221}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !214, file: !171, line: 115, baseType: !170, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !214, file: !171, line: 141, baseType: !218, size: 8, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !219)
!219 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !214, file: !171, line: 149, baseType: !137, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !214, file: !171, line: 156, baseType: !137, size: 32, offset: 96)
!222 = !{!223}
!223 = !DISubrange(count: 1)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !167, file: !206, line: 40, type: !213, isLocal: true, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !167, file: !206, line: 28, type: !228, isLocal: true, isDefinition: true)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !192, line: 40, baseType: !229)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !192, line: 35, size: 64, elements: !230)
!230 = !{!231, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !229, file: !192, line: 36, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !229, file: !192, line: 37, baseType: !232, size: 32, offset: 32)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !235, size: 32, elements: !222)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !236, line: 22, baseType: !237)
!236 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!237 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!238 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!239 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !242, file: !271, line: 50, type: !258, isLocal: true, isDefinition: true)
!242 = distinct !DICompileUnit(language: DW_LANG_C99, file: !243, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !169, retainedTypes: !244, globals: !268, splitDebugInlining: false, nameTableKind: None)
!243 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/sys_heap")
!244 = !{!245, !182, !120, !103, !102, !137, !163, !247, !202, !258, !259}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !246)
!246 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !249, line: 45, size: 64, elements: !250)
!249 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!250 = !{!251, !257}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !248, file: !249, line: 46, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !192, line: 33, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !192, line: 29, size: 32, elements: !254)
!254 = !{!255}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !253, file: !192, line: 30, baseType: !256, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !248, file: !249, line: 48, baseType: !137, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !249, line: 38, size: 64, elements: !261)
!261 = !{!262, !263}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !260, file: !249, line: 39, baseType: !252, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !260, file: !249, line: 41, baseType: !264, size: 32, offset: 32)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !249, line: 35, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !258}
!268 = !{!269, !273, !281, !240, !283, !293}
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "latency_lock", scope: !242, file: !271, line: 44, type: !272, isLocal: true, isDefinition: true)
!271 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !208, line: 43, elements: !162)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !242, file: !271, line: 46, type: !275, isLocal: true, isDefinition: true)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !192, line: 40, baseType: !276)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !192, line: 35, size: 64, elements: !277)
!277 = !{!278, !280}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !276, file: !192, line: 36, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !276, file: !192, line: 37, baseType: !279, size: 32, offset: 32)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "latency_subs", scope: !242, file: !271, line: 52, type: !275, isLocal: true, isDefinition: true)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !242, file: !271, line: 39, type: !285, isLocal: true, isDefinition: true)
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, elements: !291)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !271, line: 35, size: 96, elements: !287)
!287 = !{!288, !289, !290}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !286, file: !271, line: 36, baseType: !170, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !286, file: !271, line: 37, baseType: !218, size: 8, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !286, file: !271, line: 38, baseType: !235, size: 32, offset: 64)
!291 = !{!292}
!292 = !DISubrange(count: 0)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !242, file: !271, line: 48, type: !258, isLocal: true, isDefinition: true)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !297, file: !304, line: 47, type: !318, isLocal: true, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !299, retainedTypes: !300, globals: !301, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/sys_heap")
!299 = !{!170}
!300 = !{!120, !103}
!301 = !{!302, !295, !314}
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "cpus_states", scope: !297, file: !304, line: 50, type: !305, isLocal: true, isDefinition: true)
!304 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !306, size: 32, elements: !222)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !171, line: 114, size: 128, elements: !309)
!309 = !{!310, !311, !312, !313}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !308, file: !171, line: 115, baseType: !170, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !308, file: !171, line: 141, baseType: !218, size: 8, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !308, file: !171, line: 149, baseType: !137, size: 32, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !308, file: !171, line: 156, baseType: !137, size: 32, offset: 96)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !297, file: !304, line: 55, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 8, elements: !222)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !307, elements: !291)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "static_regions", scope: !321, file: !328, line: 62, type: !456, isLocal: true, isDefinition: true)
!321 = distinct !DICompileUnit(language: DW_LANG_C99, file: !322, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !323, globals: !324, splitDebugInlining: false, nameTableKind: None)
!322 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/sys_heap")
!323 = !{!120, !103, !137, !102}
!324 = !{!325, !319}
!325 = !DIGlobalVariableExpression(var: !326, expr: !DIExpression())
!326 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !327, file: !328, line: 198, type: !444, isLocal: true, isDefinition: true)
!327 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !328, file: !328, line: 175, type: !329, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !321, retainedNodes: !441)
!328 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!329 = !DISubroutineType(types: !330)
!330 = !{null, !331}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !333, line: 245, size: 1024, elements: !334)
!333 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!334 = !{!335, !400, !413, !414, !415, !416, !422, !436}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !332, file: !333, line: 247, baseType: !336, size: 384)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !333, line: 57, size: 384, elements: !337)
!337 = !{!338, !366, !374, !375, !376, !387, !388, !389}
!338 = !DIDerivedType(tag: DW_TAG_member, scope: !336, file: !333, line: 60, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !336, file: !333, line: 60, size: 64, elements: !340)
!340 = !{!341, !357}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !339, file: !333, line: 61, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !343, line: 49, baseType: !344)
!343 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !343, line: 37, size: 64, elements: !345)
!345 = !{!346, !352}
!346 = !DIDerivedType(tag: DW_TAG_member, scope: !344, file: !343, line: 38, baseType: !347, size: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !344, file: !343, line: 38, size: 32, elements: !348)
!348 = !{!349, !351}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !347, file: !343, line: 39, baseType: !350, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !347, file: !343, line: 40, baseType: !350, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, scope: !344, file: !343, line: 42, baseType: !353, size: 32, offset: 32)
!353 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !344, file: !343, line: 42, size: 32, elements: !354)
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !353, file: !343, line: 43, baseType: !350, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !353, file: !343, line: 44, baseType: !350, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !339, file: !333, line: 62, baseType: !358, size: 64)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !359, line: 49, size: 64, elements: !360)
!359 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !358, file: !359, line: 50, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 64, elements: !364)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!364 = !{!365}
!365 = !DISubrange(count: 2)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !336, file: !333, line: 68, baseType: !367, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !369, line: 233, baseType: !370)
!369 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 231, size: 64, elements: !371)
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !370, file: !369, line: 232, baseType: !373, size: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !343, line: 48, baseType: !344)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !336, file: !333, line: 71, baseType: !218, size: 8, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !336, file: !333, line: 74, baseType: !218, size: 8, offset: 104)
!376 = !DIDerivedType(tag: DW_TAG_member, scope: !336, file: !333, line: 90, baseType: !377, size: 16, offset: 112)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !336, file: !333, line: 90, size: 16, elements: !378)
!378 = !{!379, !386}
!379 = !DIDerivedType(tag: DW_TAG_member, scope: !377, file: !333, line: 91, baseType: !380, size: 16)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !377, file: !333, line: 91, size: 16, elements: !381)
!381 = !{!382, !385}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !380, file: !333, line: 96, baseType: !383, size: 8)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !384)
!384 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !380, file: !333, line: 97, baseType: !218, size: 8, offset: 8)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !377, file: !333, line: 100, baseType: !151, size: 16)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !336, file: !333, line: 107, baseType: !137, size: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !336, file: !333, line: 127, baseType: !102, size: 32, offset: 160)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !336, file: !333, line: 131, baseType: !390, size: 192, offset: 192)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !369, line: 244, size: 192, elements: !391)
!391 = !{!392, !393, !399}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !390, file: !369, line: 245, baseType: !342, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !390, file: !369, line: 246, baseType: !394, size: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !369, line: 242, baseType: !395)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !390, file: !369, line: 249, baseType: !184, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !332, file: !333, line: 250, baseType: !401, size: 288, offset: 384)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !402, line: 25, size: 288, elements: !403)
!402 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !401, file: !402, line: 26, baseType: !137, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !401, file: !402, line: 27, baseType: !137, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !401, file: !402, line: 28, baseType: !137, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !401, file: !402, line: 29, baseType: !137, size: 32, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !401, file: !402, line: 30, baseType: !137, size: 32, offset: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !401, file: !402, line: 31, baseType: !137, size: 32, offset: 160)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !401, file: !402, line: 32, baseType: !137, size: 32, offset: 192)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !401, file: !402, line: 33, baseType: !137, size: 32, offset: 224)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !401, file: !402, line: 34, baseType: !137, size: 32, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !332, file: !333, line: 253, baseType: !102, size: 32, offset: 672)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !332, file: !333, line: 256, baseType: !368, size: 64, offset: 704)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !332, file: !333, line: 294, baseType: !103, size: 32, offset: 768)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !332, file: !333, line: 300, baseType: !417, size: 96, offset: 800)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !333, line: 149, size: 96, elements: !418)
!418 = !{!419, !420, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !417, file: !333, line: 153, baseType: !22, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !417, file: !333, line: 162, baseType: !120, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !417, file: !333, line: 168, baseType: !120, size: 32, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !332, file: !333, line: 325, baseType: !423, size: 32, offset: 896)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 32)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !425, line: 5073, size: 160, elements: !426)
!425 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!426 = !{!427, !433, !434}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !424, file: !425, line: 5074, baseType: !428, size: 96)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !429)
!429 = !{!430, !431, !432}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !428, file: !113, line: 57, baseType: !116, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !428, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !428, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !424, file: !425, line: 5075, baseType: !368, size: 64, offset: 96)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !424, file: !425, line: 5076, baseType: !435, offset: 160)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !208, line: 43, elements: !162)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !332, file: !333, line: 343, baseType: !437, size: 64, offset: 928)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !402, line: 60, size: 64, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !437, file: !402, line: 63, baseType: !137, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !437, file: !402, line: 66, baseType: !137, size: 32, offset: 32)
!441 = !{!442, !443}
!442 = !DILocalVariable(name: "thread", arg: 1, scope: !327, file: !328, line: 175, type: !331)
!443 = !DILocalVariable(name: "region_num", scope: !327, file: !328, line: 200, type: !218)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, elements: !291)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !446, line: 52, size: 96, elements: !447)
!446 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!447 = !{!448, !449, !450}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !445, file: !446, line: 53, baseType: !22, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !445, file: !446, line: 54, baseType: !120, size: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !445, file: !446, line: 55, baseType: !451, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !452, line: 151, baseType: !453)
!452 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !452, line: 149, size: 32, elements: !454)
!454 = !{!455}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !453, file: !452, line: 150, baseType: !137, size: 32)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 96, elements: !222)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !460, file: !496, line: 39, type: !218, isLocal: true, isDefinition: true)
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !461, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !462, globals: !495, splitDebugInlining: false, nameTableKind: None)
!461 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/sys_heap")
!462 = !{!463, !102, !103, !481, !218}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !465, line: 1226, baseType: !466)
!465 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !465, line: 1213, size: 352, elements: !467)
!467 = !{!468, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !466, file: !465, line: 1215, baseType: !469, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !137)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !466, file: !465, line: 1216, baseType: !470, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !466, file: !465, line: 1217, baseType: !470, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !466, file: !465, line: 1218, baseType: !470, size: 32, offset: 96)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !466, file: !465, line: 1219, baseType: !470, size: 32, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !466, file: !465, line: 1220, baseType: !470, size: 32, offset: 160)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !466, file: !465, line: 1221, baseType: !470, size: 32, offset: 192)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !466, file: !465, line: 1222, baseType: !470, size: 32, offset: 224)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !466, file: !465, line: 1223, baseType: !470, size: 32, offset: 256)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !466, file: !465, line: 1224, baseType: !470, size: 32, offset: 288)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !466, file: !465, line: 1225, baseType: !470, size: 32, offset: 320)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !484, line: 27, size: 96, elements: !485)
!484 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!485 = !{!486, !487, !490}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !483, file: !484, line: 29, baseType: !137, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !483, file: !484, line: 31, baseType: !488, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !483, file: !484, line: 37, baseType: !491, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !452, line: 146, baseType: !492)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !452, line: 141, size: 32, elements: !493)
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !492, file: !452, line: 143, baseType: !137, size: 32)
!495 = !{!458}
!496 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !499, file: !506, line: 21, type: !128, isLocal: true, isDefinition: true)
!499 = distinct !DICompileUnit(language: DW_LANG_C99, file: !500, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !501, globals: !505, splitDebugInlining: false, nameTableKind: None)
!500 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/sys_heap")
!501 = !{!502, !103, !102}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !504, line: 22, baseType: !103)
!504 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!505 = !{!497}
!506 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !509, file: !514, line: 13, type: !531, isLocal: true, isDefinition: true)
!509 = distinct !DICompileUnit(language: DW_LANG_C99, file: !510, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !511, splitDebugInlining: false, nameTableKind: None)
!510 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/sys_heap")
!511 = !{!512, !507}
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "mpu_config", scope: !509, file: !514, line: 37, type: !515, isLocal: false, isDefinition: true)
!514 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!515 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !484, line: 41, size: 64, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !516, file: !484, line: 43, baseType: !137, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !516, file: !484, line: 45, baseType: !520, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !484, line: 27, size: 96, elements: !523)
!523 = !{!524, !525, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !522, file: !484, line: 29, baseType: !137, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !522, file: !484, line: 31, baseType: !488, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !522, file: !484, line: 37, baseType: !527, size: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !452, line: 146, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !452, line: 141, size: 32, elements: !529)
!529 = !{!530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !528, file: !452, line: 143, baseType: !137, size: 32)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 192, elements: !364)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !534, file: !700, line: 93, type: !701, isLocal: true, isDefinition: true, align: 32)
!534 = distinct !DICompileUnit(language: DW_LANG_C99, file: !535, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !536, globals: !695, splitDebugInlining: false, nameTableKind: None)
!535 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/sys_heap")
!536 = !{!537, !218, !102, !103, !617, !137, !618, !654, !665}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !539, line: 1071, baseType: !540)
!539 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 1035, size: 19584, elements: !541)
!541 = !{!542, !546, !547, !548, !552, !553, !555, !556, !557, !558, !559, !560, !564, !565, !566, !570, !571, !575, !576, !580, !581, !585, !586, !587, !588, !589, !590, !591, !595, !596, !597, !598, !602, !603, !607}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !540, file: !539, line: 1036, baseType: !543, size: 960)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 960, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 30)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !540, file: !539, line: 1037, baseType: !470, size: 32, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !540, file: !539, line: 1038, baseType: !470, size: 32, offset: 992)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !540, file: !539, line: 1039, baseType: !549, size: 1088, offset: 1024)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 1088, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 34)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !540, file: !539, line: 1040, baseType: !470, size: 32, offset: 2112)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !540, file: !539, line: 1041, baseType: !554, size: 64, offset: 2144)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 64, elements: !364)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !540, file: !539, line: 1042, baseType: !470, size: 32, offset: 2208)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !540, file: !539, line: 1043, baseType: !470, size: 32, offset: 2240)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !540, file: !539, line: 1044, baseType: !470, size: 32, offset: 2272)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !540, file: !539, line: 1045, baseType: !470, size: 32, offset: 2304)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !540, file: !539, line: 1046, baseType: !470, size: 32, offset: 2336)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !540, file: !539, line: 1047, baseType: !561, size: 3808, offset: 2368)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 3808, elements: !562)
!562 = !{!563}
!563 = !DISubrange(count: 119)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !540, file: !539, line: 1048, baseType: !470, size: 32, offset: 6176)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !540, file: !539, line: 1049, baseType: !470, size: 32, offset: 6208)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !540, file: !539, line: 1050, baseType: !567, size: 1952, offset: 6240)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 1952, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 61)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !540, file: !539, line: 1051, baseType: !470, size: 32, offset: 8192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !540, file: !539, line: 1052, baseType: !572, size: 288, offset: 8224)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 288, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 9)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !540, file: !539, line: 1053, baseType: !469, size: 32, offset: 8512)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !540, file: !539, line: 1054, baseType: !577, size: 96, offset: 8544)
!577 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 96, elements: !578)
!578 = !{!579}
!579 = !DISubrange(count: 3)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !540, file: !539, line: 1055, baseType: !469, size: 32, offset: 8640)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !540, file: !539, line: 1056, baseType: !582, size: 1568, offset: 8672)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 1568, elements: !583)
!583 = !{!584}
!584 = !DISubrange(count: 49)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !540, file: !539, line: 1057, baseType: !470, size: 32, offset: 10240)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !540, file: !539, line: 1058, baseType: !577, size: 96, offset: 10272)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !540, file: !539, line: 1059, baseType: !470, size: 32, offset: 10368)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !540, file: !539, line: 1060, baseType: !554, size: 64, offset: 10400)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !540, file: !539, line: 1061, baseType: !470, size: 32, offset: 10464)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !540, file: !539, line: 1062, baseType: !470, size: 32, offset: 10496)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !540, file: !539, line: 1063, baseType: !592, size: 672, offset: 10528)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 672, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 21)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !540, file: !539, line: 1064, baseType: !470, size: 32, offset: 11200)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !540, file: !539, line: 1065, baseType: !469, size: 32, offset: 11232)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !540, file: !539, line: 1066, baseType: !470, size: 32, offset: 11264)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !540, file: !539, line: 1067, baseType: !599, size: 1504, offset: 11296)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 1504, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 47)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !540, file: !539, line: 1068, baseType: !469, size: 32, offset: 12800)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !540, file: !539, line: 1069, baseType: !604, size: 5600, offset: 12832)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 5600, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 175)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !540, file: !539, line: 1070, baseType: !608, size: 1152, offset: 18432)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 1152, elements: !573)
!609 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !539, line: 278, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 272, size: 128, elements: !612)
!612 = !{!613, !614, !615, !616}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !611, file: !539, line: 273, baseType: !470, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !611, file: !539, line: 274, baseType: !470, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !611, file: !539, line: 275, baseType: !470, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !611, file: !539, line: 277, baseType: !469, size: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !465, line: 468, baseType: !620)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !465, line: 445, size: 1120, elements: !621)
!621 = !{!622, !623, !624, !625, !626, !627, !628, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !647, !651, !653}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !620, file: !465, line: 447, baseType: !469, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !620, file: !465, line: 448, baseType: !470, size: 32, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !620, file: !465, line: 449, baseType: !470, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !620, file: !465, line: 450, baseType: !470, size: 32, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !620, file: !465, line: 451, baseType: !470, size: 32, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !620, file: !465, line: 452, baseType: !470, size: 32, offset: 160)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !620, file: !465, line: 453, baseType: !629, size: 96, offset: 192)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 96, elements: !631)
!630 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !218)
!631 = !{!632}
!632 = !DISubrange(count: 12)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !620, file: !465, line: 454, baseType: !470, size: 32, offset: 288)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !620, file: !465, line: 455, baseType: !470, size: 32, offset: 320)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !620, file: !465, line: 456, baseType: !470, size: 32, offset: 352)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !620, file: !465, line: 457, baseType: !470, size: 32, offset: 384)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !620, file: !465, line: 458, baseType: !470, size: 32, offset: 416)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !620, file: !465, line: 459, baseType: !470, size: 32, offset: 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !620, file: !465, line: 460, baseType: !470, size: 32, offset: 480)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !620, file: !465, line: 461, baseType: !554, size: 64, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !620, file: !465, line: 462, baseType: !469, size: 32, offset: 576)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !620, file: !465, line: 463, baseType: !469, size: 32, offset: 608)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !620, file: !465, line: 464, baseType: !644, size: 128, offset: 640)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 128, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 4)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !620, file: !465, line: 465, baseType: !648, size: 160, offset: 768)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 160, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 5)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !620, file: !465, line: 466, baseType: !652, size: 160, offset: 928)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 160, elements: !649)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !620, file: !465, line: 467, baseType: !470, size: 32, offset: 1088)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !656, file: !655, line: 167, baseType: !664)
!655 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!656 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !655, file: !655, line: 134, type: !657, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !534, retainedNodes: !659)
!657 = !DISubroutineType(types: !658)
!658 = !{null, !137}
!659 = !{!660, !661, !663}
!660 = !DILocalVariable(name: "time_us", arg: 1, scope: !656, file: !655, line: 134, type: !137)
!661 = !DILocalVariable(name: "delay_cycles", scope: !656, file: !655, line: 168, type: !662)
!662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !654)
!663 = !DILocalVariable(name: "cycles", scope: !656, file: !655, line: 171, type: !137)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !539, line: 2399, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 2373, size: 10880, elements: !668)
!668 = !{!669, !671, !672, !673, !674, !678, !679, !684, !685, !686, !687, !688, !689, !691, !692, !693, !694}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !667, file: !539, line: 2374, baseType: !670, size: 8192)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 8192, elements: !110)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !667, file: !539, line: 2375, baseType: !469, size: 32, offset: 8192)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !667, file: !539, line: 2376, baseType: !469, size: 32, offset: 8224)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !667, file: !539, line: 2377, baseType: !469, size: 32, offset: 8256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !667, file: !539, line: 2378, baseType: !675, size: 1984, offset: 8288)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 1984, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 62)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !667, file: !539, line: 2379, baseType: !470, size: 32, offset: 10272)
!679 = !DIDerivedType(tag: DW_TAG_member, scope: !667, file: !539, line: 2381, baseType: !680, size: 32, offset: 10304)
!680 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !667, file: !539, line: 2381, size: 32, elements: !681)
!681 = !{!682, !683}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !680, file: !539, line: 2382, baseType: !470, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !680, file: !539, line: 2383, baseType: !470, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !667, file: !539, line: 2386, baseType: !470, size: 32, offset: 10336)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !667, file: !539, line: 2387, baseType: !470, size: 32, offset: 10368)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !667, file: !539, line: 2389, baseType: !470, size: 32, offset: 10400)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !667, file: !539, line: 2391, baseType: !470, size: 32, offset: 10432)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !667, file: !539, line: 2393, baseType: !470, size: 32, offset: 10464)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !667, file: !539, line: 2394, baseType: !690, size: 256, offset: 10496)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 256, elements: !159)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !667, file: !539, line: 2395, baseType: !470, size: 32, offset: 10752)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !667, file: !539, line: 2396, baseType: !469, size: 32, offset: 10784)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !667, file: !539, line: 2397, baseType: !470, size: 32, offset: 10816)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !667, file: !539, line: 2398, baseType: !470, size: 32, offset: 10848)
!695 = !{!532, !696}
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !656, file: !655, line: 161, type: !698, isLocal: true, isDefinition: true, align: 128)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 48, elements: !578)
!699 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!700 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !703, line: 51, size: 64, elements: !704)
!703 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!704 = !{!705, !712}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !702, file: !703, line: 60, baseType: !706, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 32)
!707 = !DISubroutineType(types: !708)
!708 = !{!103, !709}
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !711)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !703, line: 48, flags: DIFlagFwdDecl)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !702, file: !703, line: 65, baseType: !709, size: 32, offset: 32)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "__device_dts_ord_38", scope: !715, file: !951, line: 733, type: !1055, isLocal: false, isDefinition: true, align: 32)
!715 = distinct !DICompileUnit(language: DW_LANG_C99, file: !716, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !717, retainedTypes: !860, globals: !947, splitDebugInlining: false, nameTableKind: None)
!716 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/basic/sys_heap")
!717 = !{!718, !724, !30, !729, !734, !741, !749, !757, !766, !770, !825, !832, !851}
!718 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !719, line: 23, baseType: !32, size: 32, elements: !720)
!719 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!720 = !{!721, !722, !723}
!721 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!722 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!723 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!724 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !719, line: 48, baseType: !32, size: 32, elements: !725)
!725 = !{!726, !727, !728}
!726 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!727 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!728 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!729 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !730, line: 167, baseType: !32, size: 32, elements: !731)
!730 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!731 = !{!732, !733}
!732 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!733 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!734 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !730, line: 107, baseType: !32, size: 32, elements: !735)
!735 = !{!736, !737, !738, !739, !740}
!736 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!737 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!738 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!739 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!740 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!741 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !730, line: 208, baseType: !32, size: 32, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !748}
!743 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!744 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!745 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!746 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!747 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!748 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!749 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !730, line: 261, baseType: !32, size: 32, elements: !750)
!750 = !{!751, !752, !753, !754, !755, !756}
!751 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!752 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!753 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!754 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!755 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!756 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!757 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !730, line: 237, baseType: !32, size: 32, elements: !758)
!758 = !{!759, !760, !761, !762, !763, !764, !765}
!759 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!760 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!761 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!762 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!763 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!764 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!765 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!766 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !730, line: 152, baseType: !32, size: 32, elements: !767)
!767 = !{!768, !769}
!768 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!769 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!770 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !539, line: 71, baseType: !103, size: 32, elements: !771)
!771 = !{!772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824}
!772 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!773 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!774 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!775 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!776 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!777 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!778 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!779 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!780 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!781 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!782 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!783 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!784 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!785 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!786 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!787 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!788 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!789 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!790 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!791 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!792 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!793 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!794 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!795 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!796 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!797 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!798 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!799 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!800 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!801 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!802 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!803 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!804 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!805 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!806 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!807 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!808 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!809 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!810 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!811 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!812 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!813 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!814 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!815 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!816 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!817 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!818 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!819 = !DIEnumerator(name: "USBD_IRQn", value: 39)
!820 = !DIEnumerator(name: "UARTE1_IRQn", value: 40)
!821 = !DIEnumerator(name: "QSPI_IRQn", value: 41)
!822 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 42)
!823 = !DIEnumerator(name: "PWM3_IRQn", value: 45)
!824 = !DIEnumerator(name: "SPIM3_IRQn", value: 47)
!825 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !826, line: 44, baseType: !32, size: 32, elements: !827)
!826 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!827 = !{!828, !829, !830, !831}
!828 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!829 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!830 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!831 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!832 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !833, line: 54, baseType: !32, size: 32, elements: !834)
!833 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!834 = !{!835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850}
!835 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!836 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!837 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!838 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!839 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!840 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!841 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!842 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!843 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!844 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!845 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!846 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!847 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!848 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!849 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!850 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!851 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !852, line: 53, baseType: !32, size: 32, elements: !853)
!852 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!853 = !{!854, !855, !856, !857, !858, !859}
!854 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!855 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!856 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!857 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!858 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!859 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!860 = !{!718, !102, !103, !861, !910, !911, !912, !913, !182, !137, !163, !914, !617, !915, !258, !916, !946, !120}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !539, line: 1022, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 979, size: 11712, elements: !864)
!864 = !{!865, !866, !867, !868, !869, !870, !871, !872, !876, !877, !878, !879, !880, !881, !882, !883, !884, !888, !889, !890, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !863, file: !539, line: 980, baseType: !470, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !863, file: !539, line: 981, baseType: !470, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !863, file: !539, line: 982, baseType: !470, size: 32, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !863, file: !539, line: 983, baseType: !470, size: 32, offset: 96)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !863, file: !539, line: 984, baseType: !470, size: 32, offset: 128)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !863, file: !539, line: 985, baseType: !470, size: 32, offset: 160)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !863, file: !539, line: 986, baseType: !470, size: 32, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !863, file: !539, line: 987, baseType: !873, size: 1824, offset: 224)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 1824, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 57)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !863, file: !539, line: 988, baseType: !470, size: 32, offset: 2048)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !863, file: !539, line: 989, baseType: !470, size: 32, offset: 2080)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !863, file: !539, line: 990, baseType: !469, size: 32, offset: 2112)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !863, file: !539, line: 991, baseType: !470, size: 32, offset: 2144)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !863, file: !539, line: 992, baseType: !470, size: 32, offset: 2176)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !863, file: !539, line: 993, baseType: !648, size: 160, offset: 2208)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTARTED", scope: !863, file: !539, line: 994, baseType: !470, size: 32, offset: 2368)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTOPPED", scope: !863, file: !539, line: 996, baseType: !470, size: 32, offset: 2400)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !863, file: !539, line: 998, baseType: !885, size: 3744, offset: 2432)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 3744, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 117)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !863, file: !539, line: 999, baseType: !470, size: 32, offset: 6176)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !863, file: !539, line: 1000, baseType: !470, size: 32, offset: 6208)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !863, file: !539, line: 1001, baseType: !891, size: 2016, offset: 6240)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 2016, elements: !892)
!892 = !{!893}
!893 = !DISubrange(count: 63)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !863, file: !539, line: 1002, baseType: !469, size: 32, offset: 8256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !863, file: !539, line: 1004, baseType: !469, size: 32, offset: 8288)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !863, file: !539, line: 1005, baseType: !469, size: 32, offset: 8320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !863, file: !539, line: 1006, baseType: !469, size: 32, offset: 8352)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !863, file: !539, line: 1008, baseType: !469, size: 32, offset: 8384)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !863, file: !539, line: 1009, baseType: !469, size: 32, offset: 8416)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !863, file: !539, line: 1011, baseType: !675, size: 1984, offset: 8448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !863, file: !539, line: 1012, baseType: !470, size: 32, offset: 10432)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !863, file: !539, line: 1013, baseType: !577, size: 96, offset: 10464)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "HFXODEBOUNCE", scope: !863, file: !539, line: 1014, baseType: !470, size: 32, offset: 10560)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !863, file: !539, line: 1016, baseType: !577, size: 96, offset: 10592)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !863, file: !539, line: 1017, baseType: !470, size: 32, offset: 10688)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !863, file: !539, line: 1018, baseType: !690, size: 256, offset: 10720)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !863, file: !539, line: 1019, baseType: !470, size: 32, offset: 10976)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !863, file: !539, line: 1020, baseType: !592, size: 672, offset: 11008)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "LFRCMODE", scope: !863, file: !539, line: 1021, baseType: !470, size: 32, offset: 11680)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !730, line: 146, baseType: !734)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !730, line: 164, baseType: !766)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!914 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !465, line: 426, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !465, line: 411, size: 28704, elements: !919)
!919 = !{!920, !922, !926, !927, !928, !929, !930, !931, !932, !933, !937, !941, !945}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !918, file: !465, line: 413, baseType: !921, size: 256)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 256, elements: !159)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !918, file: !465, line: 414, baseType: !923, size: 768, offset: 256)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 768, elements: !924)
!924 = !{!925}
!925 = !DISubrange(count: 24)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !918, file: !465, line: 415, baseType: !921, size: 256, offset: 1024)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !918, file: !465, line: 416, baseType: !923, size: 768, offset: 1280)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !918, file: !465, line: 417, baseType: !921, size: 256, offset: 2048)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !918, file: !465, line: 418, baseType: !923, size: 768, offset: 2304)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !918, file: !465, line: 419, baseType: !921, size: 256, offset: 3072)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !918, file: !465, line: 420, baseType: !923, size: 768, offset: 3328)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !918, file: !465, line: 421, baseType: !921, size: 256, offset: 4096)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !918, file: !465, line: 422, baseType: !934, size: 1792, offset: 4352)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 1792, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 56)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !918, file: !465, line: 423, baseType: !938, size: 1920, offset: 6144)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 1920, elements: !939)
!939 = !{!940}
!940 = !DISubrange(count: 240)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !918, file: !465, line: 424, baseType: !942, size: 20608, offset: 8064)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 20608, elements: !943)
!943 = !{!944}
!944 = !DISubrange(count: 644)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !918, file: !465, line: 425, baseType: !470, size: 32, offset: 28672)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !826, line: 56, baseType: !102)
!947 = !{!948, !998, !1039, !713, !1045, !1071, !1073, !1090, !1092, !1102, !1105, !1120, !1157, !1171}
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(name: "on", scope: !950, file: !951, line: 549, type: !235, isLocal: true, isDefinition: true)
!950 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !951, file: !951, line: 547, type: !952, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !715, retainedNodes: !954)
!951 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!952 = !DISubroutineType(types: !953)
!953 = !{null, !724}
!954 = !{!955, !956, !959}
!955 = !DILocalVariable(name: "start_mode", arg: 1, scope: !950, file: !951, line: 547, type: !724)
!956 = !DILocalVariable(name: "err", scope: !957, file: !951, line: 553, type: !103)
!957 = distinct !DILexicalBlock(scope: !958, file: !951, line: 552, column: 31)
!958 = distinct !DILexicalBlock(scope: !950, file: !951, line: 552, column: 6)
!959 = !DILocalVariable(name: "mgr", scope: !957, file: !951, line: 554, type: !960)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !962, line: 154, size: 224, elements: !963)
!962 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!963 = !{!964, !976, !977, !993, !995, !996, !997}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !961, file: !962, line: 158, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !192, line: 40, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !192, line: 35, size: 64, elements: !967)
!967 = !{!968, !975}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !966, file: !192, line: 36, baseType: !969, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !192, line: 33, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !192, line: 29, size: 32, elements: !972)
!972 = !{!973}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !971, file: !192, line: 30, baseType: !974, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !966, file: !192, line: 37, baseType: !969, size: 32, offset: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !961, file: !962, line: 163, baseType: !965, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !961, file: !962, line: 166, baseType: !978, size: 32, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !962, line: 133, size: 96, elements: !981)
!981 = !{!982, !991, !992}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !980, file: !962, line: 135, baseType: !983, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !962, line: 129, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DISubroutineType(types: !986)
!986 = !{null, !960, !987}
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !962, line: 101, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 32)
!989 = !DISubroutineType(types: !990)
!990 = !{null, !960, !103}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !980, file: !962, line: 138, baseType: !983, size: 32, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !980, file: !962, line: 143, baseType: !983, size: 32, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !961, file: !962, line: 169, baseType: !994, offset: 160)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !208, line: 43, elements: !162)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !961, file: !962, line: 172, baseType: !103, size: 32, offset: 160)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !961, file: !962, line: 175, baseType: !151, size: 16, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !961, file: !962, line: 178, baseType: !151, size: 16, offset: 208)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "cli", scope: !950, file: !951, line: 550, type: !1000, isLocal: true, isDefinition: true)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !962, line: 273, size: 128, elements: !1001)
!1001 = !{!1002, !1003}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1000, file: !962, line: 280, baseType: !970, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !1000, file: !962, line: 283, baseType: !1004, size: 96, offset: 32)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !1005, line: 138, size: 96, elements: !1006)
!1005 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1006 = !{!1007, !1036, !1037}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !1004, file: !1005, line: 149, baseType: !1008, size: 32)
!1008 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !1005, line: 139, size: 32, elements: !1009)
!1009 = !{!1010, !1031}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !1008, file: !1005, line: 145, baseType: !1011, size: 32)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 32)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !425, line: 5397, size: 128, elements: !1013)
!1013 = !{!1014, !1029, !1030}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !1012, file: !425, line: 5399, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !343, line: 48, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !343, line: 37, size: 64, elements: !1017)
!1017 = !{!1018, !1024}
!1018 = !DIDerivedType(tag: DW_TAG_member, scope: !1016, file: !343, line: 38, baseType: !1019, size: 32)
!1019 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1016, file: !343, line: 38, size: 32, elements: !1020)
!1020 = !{!1021, !1023}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1019, file: !343, line: 39, baseType: !1022, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1019, file: !343, line: 40, baseType: !1022, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, scope: !1016, file: !343, line: 42, baseType: !1025, size: 32, offset: 32)
!1025 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1016, file: !343, line: 42, size: 32, elements: !1026)
!1026 = !{!1027, !1028}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1025, file: !343, line: 43, baseType: !1022, size: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1025, file: !343, line: 44, baseType: !1022, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !1012, file: !425, line: 5405, baseType: !32, size: 32, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1012, file: !425, line: 5408, baseType: !103, size: 32, offset: 96)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1008, file: !1005, line: 148, baseType: !1032, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !1005, line: 98, baseType: !1033)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 32)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{null, null}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1004, file: !1005, line: 165, baseType: !470, size: 32, offset: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1004, file: !1005, line: 174, baseType: !1038, size: 32, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_38", scope: !715, file: !951, line: 733, type: !1041, isLocal: false, isDefinition: true, align: 16)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 80, elements: !649)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !1044, line: 43, baseType: !245)
