; ModuleID = './bin/main.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.A_BLOCK_LINK = type { %struct.A_BLOCK_LINK*, i32 }
%struct.tskTaskControlBlock = type { i32*, %struct.xLIST_ITEM, %struct.xLIST_ITEM, i32, i32*, [16 x i8], i32, i32, i32, i8 }
%struct.xLIST_ITEM = type { i32, %struct.xLIST_ITEM*, %struct.xLIST_ITEM*, i8*, %struct.xLIST* }
%struct.xLIST = type { i32, %struct.xLIST_ITEM*, %struct.xMINI_LIST_ITEM }
%struct.xMINI_LIST_ITEM = type { i32, %struct.xLIST_ITEM*, %struct.xLIST_ITEM* }
%struct.vector_table_t = type { i32*, void ()*, void ()*, void ()*, void ()*, void ()*, void ()*, [4 x void ()*], void ()*, void ()*, void ()*, void ()*, void ()*, [82 x void ()*] }
%struct.QueueDefinition = type { i8*, i8*, %union.anon, %struct.xLIST, %struct.xLIST, i32, i32, i32, i8, i8 }
%union.anon = type { %struct.QueuePointers }
%struct.QueuePointers = type { i8*, i8* }
%struct.xTIME_OUT = type { i32, i32 }
%struct.xMEMORY_REGION = type { i8*, i32, i32 }

@.str.1 = private unnamed_addr constant [6 x i8] c"TASK1\00", align 1
@str = private unnamed_addr constant [13 x i8] c"hello world!\00", align 1
@pxEnd = internal unnamed_addr global %struct.A_BLOCK_LINK* null, align 4, !dbg !0
@xBlockAllocatedBit = internal unnamed_addr global i1 false, align 4, !dbg !39
@xFreeBytesRemaining = internal unnamed_addr global i32 0, align 4, !dbg !30

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "pxEnd", scope: !2, file: !3, line: 98, type: !15, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !22, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "freertos/heap_4.c", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS", checksumkind: CSK_MD5, checksum: "81584d80c57b325831723cf0d032c090")
!4 = !{!5, !6, !12, !15}
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !8, line: 24, baseType: !9)
!8 = !DIFile(filename: "gcc-arm-none-eabi-8-2018-q4-major/bin/../lib/gcc/arm-none-eabi/8.2.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "ab914e287601b2385e57880e6599aa6b")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !10, line: 43, baseType: !11)
!10 = !DIFile(filename: "gcc-arm-none-eabi-8-2018-q4-major/bin/../lib/gcc/arm-none-eabi/8.2.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "f7024d0682a918b41f94e8be9cd90461")
!11 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 46, baseType: !14)
!13 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!14 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "BlockLink_t", file: !3, line: 73, baseType: !17)
!17 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "A_BLOCK_LINK", file: !3, line: 69, size: 64, elements: !18)
!18 = !{!19, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "pxNextFreeBlock", scope: !17, file: !3, line: 71, baseType: !20, size: 32)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "xBlockSize", scope: !17, file: !3, line: 72, baseType: !12, size: 32, offset: 32)
!22 = !{!23, !26, !0, !28, !30, !32, !34}
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression(DW_OP_constu, 8, DW_OP_stack_value))
!24 = distinct !DIGlobalVariable(name: "xHeapStructSize", scope: !2, file: !3, line: 95, type: !25, isLocal: true, isDefinition: true)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !12)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "xStart", scope: !2, file: !3, line: 98, type: !16, isLocal: true, isDefinition: true)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "xBlockAllocatedBit", scope: !2, file: !3, line: 109, type: !12, isLocal: true, isDefinition: true)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "xFreeBytesRemaining", scope: !2, file: !3, line: 102, type: !12, isLocal: true, isDefinition: true)
!32 = !DIGlobalVariableExpression(var: !33, expr: !DIExpression())
!33 = distinct !DIGlobalVariable(name: "xMinimumEverFreeBytesRemaining", scope: !2, file: !3, line: 103, type: !12, isLocal: true, isDefinition: true)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "ucHeap", scope: !2, file: !3, line: 64, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 24000, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 3000)
!39 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 2147483648, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "uxCriticalNesting", scope: !42, file: !43, line: 133, type: !56, isLocal: true, isDefinition: true)
!42 = distinct !DICompileUnit(language: DW_LANG_C99, file: !43, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !44, globals: !55, splitDebugInlining: false, nameTableKind: None)
!43 = !DIFile(filename: "freertos/port.c", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS", checksumkind: CSK_MD5, checksum: "e957820b51e55ac1b837c027a448cdb4")
!44 = !{!45, !47, !49, !51, !53, !54}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "StackType_t", file: !46, line: 55, baseType: !47)
!46 = !DIFile(filename: "./freertos/portmacro.h", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS", checksumkind: CSK_MD5, checksum: "e32ba059ae5f30a4aa44fcd0fe450ff5")
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 48, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !10, line: 79, baseType: !14)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !47)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "BaseType_t", file: !46, line: 56, baseType: !52)
!52 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!53 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "TickType_t", file: !46, line: 63, baseType: !47)
!55 = !{!40}
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "UBaseType_t", file: !46, line: 57, baseType: !53)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "pxCurrentTCB", scope: !59, file: !60, line: 334, type: !170, isLocal: false, isDefinition: true)
!59 = distinct !DICompileUnit(language: DW_LANG_C99, file: !60, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, retainedTypes: !70, globals: !121, splitDebugInlining: false, nameTableKind: None)
!60 = !DIFile(filename: "freertos/tasks.c", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS", checksumkind: CSK_MD5, checksum: "8da74e6ddcb3784976287053d77ea750")
!61 = !{!62}
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !63, line: 90, baseType: !14, size: 32, elements: !64)
!63 = !DIFile(filename: "./freertos/task.h", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS", checksumkind: CSK_MD5, checksum: "b75f9106043329ab6379c980a712a798")
!64 = !{!65, !66, !67, !68, !69}
!65 = !DIEnumerator(name: "eNoAction", value: 0)
!66 = !DIEnumerator(name: "eSetBits", value: 1)
!67 = !DIEnumerator(name: "eIncrement", value: 2)
!68 = !DIEnumerator(name: "eSetValueWithOverwrite", value: 3)
!69 = !DIEnumerator(name: "eSetValueWithoutOverwrite", value: 4)
!70 = !{!12, !5, !71, !47, !51, !56, !49, !54, !7, !118, !107, !110, !119}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCB_t", file: !60, line: 330, baseType: !73)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "tskTCB", file: !60, line: 326, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tskTaskControlBlock", file: !60, line: 252, size: 672, elements: !75)
!75 = !{!76, !79, !104, !105, !106, !108, !113, !114, !115, !116}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "pxTopOfStack", scope: !74, file: !60, line: 254, baseType: !77, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !45)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "xStateListItem", scope: !74, file: !60, line: 260, baseType: !80, size: 160, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem_t", file: !81, line: 150, baseType: !82)
!81 = !DIFile(filename: "./freertos/list.h", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS", checksumkind: CSK_MD5, checksum: "06f39e6ef0e1ad0589e249c877c218c0")
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST_ITEM", file: !81, line: 140, size: 160, elements: !83)
!83 = !{!84, !85, !87, !88, !89}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !82, file: !81, line: 143, baseType: !54, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !82, file: !81, line: 144, baseType: !86, size: 32, offset: 32)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !82, file: !81, line: 145, baseType: !86, size: 32, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "pvOwner", scope: !82, file: !81, line: 146, baseType: !5, size: 32, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "pvContainer", scope: !82, file: !81, line: 147, baseType: !90, size: 32, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 32)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST", file: !81, line: 164, size: 160, elements: !92)
!92 = !{!93, !95, !97}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "uxNumberOfItems", scope: !91, file: !81, line: 167, baseType: !94, size: 32)
!94 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !56)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "pxIndex", scope: !91, file: !81, line: 168, baseType: !96, size: 32, offset: 32)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "xListEnd", scope: !91, file: !81, line: 169, baseType: !98, size: 96, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "MiniListItem_t", file: !81, line: 159, baseType: !99)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xMINI_LIST_ITEM", file: !81, line: 152, size: 96, elements: !100)
!100 = !{!101, !102, !103}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !99, file: !81, line: 155, baseType: !54, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !99, file: !81, line: 156, baseType: !86, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !99, file: !81, line: 157, baseType: !86, size: 32, offset: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "xEventListItem", scope: !74, file: !60, line: 261, baseType: !80, size: 160, offset: 192)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "uxPriority", scope: !74, file: !60, line: 262, baseType: !56, size: 32, offset: 352)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pxStack", scope: !74, file: !60, line: 263, baseType: !107, size: 32, offset: 384)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pcTaskName", scope: !74, file: !60, line: 264, baseType: !109, size: 128, offset: 416)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 128, elements: !111)
!110 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!111 = !{!112}
!112 = !DISubrange(count: 16)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "uxBasePriority", scope: !74, file: !60, line: 280, baseType: !56, size: 32, offset: 544)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "uxMutexesHeld", scope: !74, file: !60, line: 281, baseType: !56, size: 32, offset: 576)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ulNotifiedValue", scope: !74, file: !60, line: 308, baseType: !50, size: 32, offset: 608)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ucNotifyState", scope: !74, file: !60, line: 309, baseType: !117, size: 8, offset: 640)
!117 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!118 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaskHandle_t", file: !63, line: 70, baseType: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 32)
!121 = !{!57, !122, !128, !132, !134, !136, !138, !140, !142, !144, !146, !148, !150, !152, !155, !158, !160, !162, !164, !166, !168}
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "pxReadyTasksLists", scope: !59, file: !60, line: 340, type: !124, isLocal: true, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 800, elements: !126)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "List_t", file: !81, line: 171, baseType: !91)
!126 = !{!127}
!127 = !DISubrange(count: 5)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "pxDelayedTaskList", scope: !59, file: !60, line: 343, type: !130, isLocal: true, isDefinition: true)
!130 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "pxOverflowDelayedTaskList", scope: !59, file: !60, line: 344, type: !130, isLocal: true, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "xPendingReadyList", scope: !59, file: !60, line: 345, type: !125, isLocal: true, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "xTasksWaitingTermination", scope: !59, file: !60, line: 349, type: !125, isLocal: true, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "xSuspendedTaskList", scope: !59, file: !60, line: 356, type: !125, isLocal: true, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "xDelayedTaskList1", scope: !59, file: !60, line: 341, type: !125, isLocal: true, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "xDelayedTaskList2", scope: !59, file: !60, line: 342, type: !125, isLocal: true, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "uxTopReadyPriority", scope: !59, file: !60, line: 369, type: !94, isLocal: true, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "uxTaskNumber", scope: !59, file: !60, line: 374, type: !56, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "uxDeletedTasksWaitingCleanUp", scope: !59, file: !60, line: 350, type: !94, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "uxCurrentNumberOfTasks", scope: !59, file: !60, line: 367, type: !94, isLocal: true, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "xSchedulerRunning", scope: !59, file: !60, line: 370, type: !154, isLocal: true, isDefinition: true)
!154 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !51)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "xTickCount", scope: !59, file: !60, line: 368, type: !157, isLocal: true, isDefinition: true)
!157 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !54)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "uxSchedulerSuspended", scope: !59, file: !60, line: 386, type: !94, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "xIdleTaskHandle", scope: !59, file: !60, line: 376, type: !119, isLocal: true, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "xNextTaskUnblockTime", scope: !59, file: !60, line: 375, type: !157, isLocal: true, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "xYieldPending", scope: !59, file: !60, line: 372, type: !154, isLocal: true, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "uxPendedTicks", scope: !59, file: !60, line: 371, type: !94, isLocal: true, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "xNumOfOverflows", scope: !59, file: !60, line: 373, type: !154, isLocal: true, isDefinition: true)
!170 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !71)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "rcc_ahb_frequency", scope: !173, file: !174, line: 42, type: !47, isLocal: false, isDefinition: true)
!173 = distinct !DICompileUnit(language: DW_LANG_C99, file: !174, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !175, retainedTypes: !186, globals: !187, splitDebugInlining: false, nameTableKind: None)
!174 = !DIFile(filename: "rcc.c", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS/libopencm3/lib/stm32/l4", checksumkind: CSK_MD5, checksum: "1f05854ffb509fe956a717ab78489f01")
!175 = !{!176}
!176 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rcc_osc", file: !177, line: 720, baseType: !14, size: 32, elements: !178)
!177 = !DIFile(filename: "../../../include/libopencm3/stm32/l4/rcc.h", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS/libopencm3/lib/stm32/l4", checksumkind: CSK_MD5, checksum: "0ed8d24b44f0fd4649f8c0b1e32a340a")
!178 = !{!179, !180, !181, !182, !183, !184, !185}
!179 = !DIEnumerator(name: "RCC_PLL", value: 0)
!180 = !DIEnumerator(name: "RCC_HSE", value: 1)
!181 = !DIEnumerator(name: "RCC_HSI16", value: 2)
!182 = !DIEnumerator(name: "RCC_MSI", value: 3)
!183 = !DIEnumerator(name: "RCC_LSE", value: 4)
!184 = !DIEnumerator(name: "RCC_LSI", value: 5)
!185 = !DIEnumerator(name: "RCC_HSI48", value: 6)
!186 = !{!49}
!187 = !{!171, !188, !190}
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "rcc_apb1_frequency", scope: !173, file: !174, line: 43, type: !47, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "rcc_apb2_frequency", scope: !173, file: !174, line: 44, type: !47, isLocal: false, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "vector_table", scope: !194, file: !195, line: 40, type: !197, isLocal: false, isDefinition: true)
!194 = distinct !DICompileUnit(language: DW_LANG_C99, file: !195, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !186, globals: !196, splitDebugInlining: false, nameTableKind: None)
!195 = !DIFile(filename: "../../cm3/vector.c", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS/libopencm3/lib/stm32/l4", checksumkind: CSK_MD5, checksum: "eea31a7465401bcdd77e618c87161348")
!196 = !{!192}
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_table_t", file: !198, line: 62, baseType: !199)
!198 = !DIFile(filename: "../../../include/libopencm3/cm3/vector.h", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS/libopencm3/lib/stm32/l4", checksumkind: CSK_MD5, checksum: "4f74511a3b8d4ce9602767ed6336f7cd")
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !198, line: 47, size: 3136, elements: !200)
!200 = !{!201, !203, !208, !209, !210, !211, !212, !213, !217, !218, !219, !220, !221, !222}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "initial_sp_value", scope: !199, file: !198, line: 48, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !199, file: !198, line: 49, baseType: !204, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "vector_table_entry_t", file: !198, line: 45, baseType: !205)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 32)
!206 = !DISubroutineType(types: !207)
!207 = !{null}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "nmi", scope: !199, file: !198, line: 50, baseType: !204, size: 32, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "hard_fault", scope: !199, file: !198, line: 51, baseType: !204, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "memory_manage_fault", scope: !199, file: !198, line: 52, baseType: !204, size: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "bus_fault", scope: !199, file: !198, line: 53, baseType: !204, size: 32, offset: 160)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "usage_fault", scope: !199, file: !198, line: 54, baseType: !204, size: 32, offset: 192)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_x001c", scope: !199, file: !198, line: 55, baseType: !214, size: 128, offset: 224)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 128, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 4)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sv_call", scope: !199, file: !198, line: 56, baseType: !204, size: 32, offset: 352)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "debug_monitor", scope: !199, file: !198, line: 57, baseType: !204, size: 32, offset: 384)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "reserved_x0034", scope: !199, file: !198, line: 58, baseType: !204, size: 32, offset: 416)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pend_sv", scope: !199, file: !198, line: 59, baseType: !204, size: 32, offset: 448)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "systick", scope: !199, file: !198, line: 60, baseType: !204, size: 32, offset: 480)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !199, file: !198, line: 61, baseType: !223, size: 2624, offset: 512)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 2624, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 82)
!226 = distinct !DICompileUnit(language: DW_LANG_C99, file: !227, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !228, retainedTypes: !351, splitDebugInlining: false, nameTableKind: None)
!227 = !DIFile(filename: "main.c", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS", checksumkind: CSK_MD5, checksum: "363f5a4e976ccef443ac59e7ea68bd70")
!228 = !{!229, !231}
!229 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rcc_osc", file: !230, line: 720, baseType: !14, size: 32, elements: !178)
!230 = !DIFile(filename: "./libopencm3/include/libopencm3/stm32/l4/rcc.h", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS", checksumkind: CSK_MD5, checksum: "0ed8d24b44f0fd4649f8c0b1e32a340a")
!231 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rcc_periph_clken", file: !230, line: 727, baseType: !14, size: 32, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350}
!233 = !DIEnumerator(name: "RCC_TSC", value: 2320)
!234 = !DIEnumerator(name: "RCC_CRC", value: 2316)
!235 = !DIEnumerator(name: "RCC_FLASH", value: 2312)
!236 = !DIEnumerator(name: "RCC_DMA2", value: 2305)
!237 = !DIEnumerator(name: "RCC_DMA1", value: 2304)
!238 = !DIEnumerator(name: "RCC_RNG", value: 2450)
!239 = !DIEnumerator(name: "RCC_AES", value: 2448)
!240 = !DIEnumerator(name: "RCC_ADC", value: 2445)
!241 = !DIEnumerator(name: "RCC_ADC1", value: 2445)
!242 = !DIEnumerator(name: "RCC_OTGFS", value: 2444)
!243 = !DIEnumerator(name: "RCC_GPIOH", value: 2439)
!244 = !DIEnumerator(name: "RCC_GPIOG", value: 2438)
!245 = !DIEnumerator(name: "RCC_GPIOF", value: 2437)
!246 = !DIEnumerator(name: "RCC_GPIOE", value: 2436)
!247 = !DIEnumerator(name: "RCC_GPIOD", value: 2435)
!248 = !DIEnumerator(name: "RCC_GPIOC", value: 2434)
!249 = !DIEnumerator(name: "RCC_GPIOB", value: 2433)
!250 = !DIEnumerator(name: "RCC_GPIOA", value: 2432)
!251 = !DIEnumerator(name: "RCC_QSPI", value: 2568)
!252 = !DIEnumerator(name: "RCC_FMC", value: 2560)
!253 = !DIEnumerator(name: "RCC_LPTIM1", value: 2847)
!254 = !DIEnumerator(name: "RCC_OPAMP", value: 2846)
!255 = !DIEnumerator(name: "RCC_DAC1", value: 2845)
!256 = !DIEnumerator(name: "RCC_PWR", value: 2844)
!257 = !DIEnumerator(name: "RCC_USB", value: 2842)
!258 = !DIEnumerator(name: "RCC_CAN1", value: 2841)
!259 = !DIEnumerator(name: "RCC_CRS", value: 2840)
!260 = !DIEnumerator(name: "RCC_I2C3", value: 2839)
!261 = !DIEnumerator(name: "RCC_I2C2", value: 2838)
!262 = !DIEnumerator(name: "RCC_I2C1", value: 2837)
!263 = !DIEnumerator(name: "RCC_UART5", value: 2836)
!264 = !DIEnumerator(name: "RCC_UART4", value: 2835)
!265 = !DIEnumerator(name: "RCC_USART3", value: 2834)
!266 = !DIEnumerator(name: "RCC_USART2", value: 2833)
!267 = !DIEnumerator(name: "RCC_SPI3", value: 2831)
!268 = !DIEnumerator(name: "RCC_SPI2", value: 2830)
!269 = !DIEnumerator(name: "RCC_LCD", value: 2825)
!270 = !DIEnumerator(name: "RCC_TIM7", value: 2821)
!271 = !DIEnumerator(name: "RCC_TIM6", value: 2820)
!272 = !DIEnumerator(name: "RCC_TIM5", value: 2819)
!273 = !DIEnumerator(name: "RCC_TIM4", value: 2818)
!274 = !DIEnumerator(name: "RCC_TIM3", value: 2817)
!275 = !DIEnumerator(name: "RCC_TIM2", value: 2816)
!276 = !DIEnumerator(name: "RCC_LPTIM2", value: 2949)
!277 = !DIEnumerator(name: "RCC_SWPMI1", value: 2946)
!278 = !DIEnumerator(name: "RCC_LPUART1", value: 2944)
!279 = !DIEnumerator(name: "RCC_DFSDM", value: 3096)
!280 = !DIEnumerator(name: "RCC_SAI2", value: 3094)
!281 = !DIEnumerator(name: "RCC_SAI1", value: 3093)
!282 = !DIEnumerator(name: "RCC_TIM17", value: 3090)
!283 = !DIEnumerator(name: "RCC_TIM16", value: 3089)
!284 = !DIEnumerator(name: "RCC_TIM15", value: 3088)
!285 = !DIEnumerator(name: "RCC_USART1", value: 3086)
!286 = !DIEnumerator(name: "RCC_TIM8", value: 3085)
!287 = !DIEnumerator(name: "RCC_SPI1", value: 3084)
!288 = !DIEnumerator(name: "RCC_TIM1", value: 3083)
!289 = !DIEnumerator(name: "RCC_SDMMC1", value: 3082)
!290 = !DIEnumerator(name: "RCC_FW", value: 3079)
!291 = !DIEnumerator(name: "RCC_SYSCFG", value: 3072)
!292 = !DIEnumerator(name: "SCC_TSC", value: 3344)
!293 = !DIEnumerator(name: "SCC_CRC", value: 3340)
!294 = !DIEnumerator(name: "SCC_SRAM1", value: 3337)
!295 = !DIEnumerator(name: "SCC_FLASH", value: 3336)
!296 = !DIEnumerator(name: "SCC_DMA2", value: 3329)
!297 = !DIEnumerator(name: "SCC_DMA1", value: 3328)
!298 = !DIEnumerator(name: "SCC_RNG", value: 3474)
!299 = !DIEnumerator(name: "SCC_AES", value: 3472)
!300 = !DIEnumerator(name: "SCC_ADC", value: 3469)
!301 = !DIEnumerator(name: "SCC_ADC1", value: 3469)
!302 = !DIEnumerator(name: "SCC_OTGFS", value: 3468)
!303 = !DIEnumerator(name: "SCC_SRAM2", value: 3465)
!304 = !DIEnumerator(name: "SCC_GPIOH", value: 3463)
!305 = !DIEnumerator(name: "SCC_GPIOG", value: 3462)
!306 = !DIEnumerator(name: "SCC_GPIOF", value: 3461)
!307 = !DIEnumerator(name: "SCC_GPIOE", value: 3460)
!308 = !DIEnumerator(name: "SCC_GPIOD", value: 3459)
!309 = !DIEnumerator(name: "SCC_GPIOC", value: 3458)
!310 = !DIEnumerator(name: "SCC_GPIOB", value: 3457)
!311 = !DIEnumerator(name: "SCC_GPIOA", value: 3456)
!312 = !DIEnumerator(name: "SCC_QSPI", value: 3592)
!313 = !DIEnumerator(name: "SCC_FMC", value: 3584)
!314 = !DIEnumerator(name: "SCC_LPTIM1", value: 2847)
!315 = !DIEnumerator(name: "SCC_OPAMP", value: 2846)
!316 = !DIEnumerator(name: "SCC_DAC1", value: 2845)
!317 = !DIEnumerator(name: "SCC_PWR", value: 2844)
!318 = !DIEnumerator(name: "SCC_CAN1", value: 2841)
!319 = !DIEnumerator(name: "SCC_I2C3", value: 2839)
!320 = !DIEnumerator(name: "SCC_I2C2", value: 2838)
!321 = !DIEnumerator(name: "SCC_I2C1", value: 2837)
!322 = !DIEnumerator(name: "SCC_UART5", value: 2836)
!323 = !DIEnumerator(name: "SCC_UART4", value: 2835)
!324 = !DIEnumerator(name: "SCC_USART3", value: 2834)
!325 = !DIEnumerator(name: "SCC_USART2", value: 2833)
!326 = !DIEnumerator(name: "SCC_SPI3", value: 2831)
!327 = !DIEnumerator(name: "SCC_SPI2", value: 2830)
!328 = !DIEnumerator(name: "SCC_WWDG", value: 2827)
!329 = !DIEnumerator(name: "SCC_LCD", value: 2825)
!330 = !DIEnumerator(name: "SCC_TIM7", value: 2821)
!331 = !DIEnumerator(name: "SCC_TIM6", value: 2820)
!332 = !DIEnumerator(name: "SCC_TIM5", value: 2819)
!333 = !DIEnumerator(name: "SCC_TIM4", value: 2818)
!334 = !DIEnumerator(name: "SCC_TIM3", value: 2817)
!335 = !DIEnumerator(name: "SCC_TIM2", value: 2816)
!336 = !DIEnumerator(name: "SCC_LPTIM2", value: 2949)
!337 = !DIEnumerator(name: "SCC_SWPMI1", value: 2946)
!338 = !DIEnumerator(name: "SCC_LPUART1", value: 2944)
!339 = !DIEnumerator(name: "SCC_DFSDM", value: 3096)
!340 = !DIEnumerator(name: "SCC_SAI2", value: 3094)
!341 = !DIEnumerator(name: "SCC_SAI1", value: 3093)
!342 = !DIEnumerator(name: "SCC_TIM17", value: 3090)
!343 = !DIEnumerator(name: "SCC_TIM16", value: 3089)
!344 = !DIEnumerator(name: "SCC_TIM15", value: 3088)
!345 = !DIEnumerator(name: "SCC_USART1", value: 3086)
!346 = !DIEnumerator(name: "SCC_TIM8", value: 3085)
!347 = !DIEnumerator(name: "SCC_SPI1", value: 3084)
!348 = !DIEnumerator(name: "SCC_TIM1", value: 3083)
!349 = !DIEnumerator(name: "SCC_SDMMC1", value: 3082)
!350 = !DIEnumerator(name: "SCC_SYSCFG", value: 3072)
!351 = !{!5}
!352 = distinct !DICompileUnit(language: DW_LANG_C99, file: !353, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !354, splitDebugInlining: false, nameTableKind: None)
!353 = !DIFile(filename: "freertos/list.c", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS", checksumkind: CSK_MD5, checksum: "b9c6d644997d7412c1f0f838c80e497c")
!354 = !{!355, !54, !56}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem_t", file: !81, line: 150, baseType: !357)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST_ITEM", file: !81, line: 140, size: 160, elements: !358)
!358 = !{!359, !360, !362, !363, !364}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !357, file: !81, line: 143, baseType: !54, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !357, file: !81, line: 144, baseType: !361, size: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !357, file: !81, line: 145, baseType: !361, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pvOwner", scope: !357, file: !81, line: 146, baseType: !5, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "pvContainer", scope: !357, file: !81, line: 147, baseType: !365, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST", file: !81, line: 164, size: 160, elements: !367)
!367 = !{!368, !369, !370}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "uxNumberOfItems", scope: !366, file: !81, line: 167, baseType: !94, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "pxIndex", scope: !366, file: !81, line: 168, baseType: !355, size: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "xListEnd", scope: !366, file: !81, line: 169, baseType: !371, size: 96, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "MiniListItem_t", file: !81, line: 159, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xMINI_LIST_ITEM", file: !81, line: 152, size: 96, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !372, file: !81, line: 155, baseType: !54, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !372, file: !81, line: 156, baseType: !361, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !372, file: !81, line: 157, baseType: !361, size: 32, offset: 64)
!377 = distinct !DICompileUnit(language: DW_LANG_C99, file: !378, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !379, splitDebugInlining: false, nameTableKind: None)
!378 = !DIFile(filename: "freertos/queue.c", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS", checksumkind: CSK_MD5, checksum: "2fad080d11525689e52236181332d08d")
!379 = !{!56, !380, !51, !49, !12, !383, !5, !6, !54, !389}
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !8, line: 20, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !10, line: 41, baseType: !382)
!382 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "Queue_t", file: !378, line: 135, baseType: !385)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "xQUEUE", file: !378, line: 131, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QueueDefinition", file: !378, line: 97, size: 576, elements: !387)
!387 = !{!388, !390, !391, !409, !433, !434, !435, !436, !437, !439}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "pcHead", scope: !386, file: !378, line: 99, baseType: !389, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "pcWriteTo", scope: !386, file: !378, line: 100, baseType: !389, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !386, file: !378, line: 106, baseType: !392, size: 64, offset: 64)
!392 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !386, file: !378, line: 102, size: 64, elements: !393)
!393 = !{!394, !400}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "xQueue", scope: !392, file: !378, line: 104, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "QueuePointers_t", file: !378, line: 71, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "QueuePointers", file: !378, line: 67, size: 64, elements: !397)
!397 = !{!398, !399}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "pcTail", scope: !396, file: !378, line: 69, baseType: !389, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "pcReadFrom", scope: !396, file: !378, line: 70, baseType: !389, size: 32, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "xSemaphore", scope: !392, file: !378, line: 105, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "SemaphoreData_t", file: !378, line: 77, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SemaphoreData", file: !378, line: 73, size: 64, elements: !403)
!403 = !{!404, !408}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "xMutexHolder", scope: !402, file: !378, line: 75, baseType: !405, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaskHandle_t", file: !63, line: 70, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "tskTaskControlBlock", file: !63, line: 69, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "uxRecursiveCallCount", scope: !402, file: !378, line: 76, baseType: !56, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "xTasksWaitingToSend", scope: !386, file: !378, line: 108, baseType: !410, size: 160, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "List_t", file: !81, line: 171, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST", file: !81, line: 164, size: 160, elements: !412)
!412 = !{!413, !414, !426}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "uxNumberOfItems", scope: !411, file: !81, line: 167, baseType: !94, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "pxIndex", scope: !411, file: !81, line: 168, baseType: !415, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "ListItem_t", file: !81, line: 150, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xLIST_ITEM", file: !81, line: 140, size: 160, elements: !418)
!418 = !{!419, !420, !422, !423, !424}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !417, file: !81, line: 143, baseType: !54, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !417, file: !81, line: 144, baseType: !421, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !417, file: !81, line: 145, baseType: !421, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "pvOwner", scope: !417, file: !81, line: 146, baseType: !5, size: 32, offset: 96)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "pvContainer", scope: !417, file: !81, line: 147, baseType: !425, size: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "xListEnd", scope: !411, file: !81, line: 169, baseType: !427, size: 96, offset: 64)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "MiniListItem_t", file: !81, line: 159, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xMINI_LIST_ITEM", file: !81, line: 152, size: 96, elements: !429)
!429 = !{!430, !431, !432}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "xItemValue", scope: !428, file: !81, line: 155, baseType: !54, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "pxNext", scope: !428, file: !81, line: 156, baseType: !421, size: 32, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "pxPrevious", scope: !428, file: !81, line: 157, baseType: !421, size: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "xTasksWaitingToReceive", scope: !386, file: !378, line: 109, baseType: !410, size: 160, offset: 288)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "uxMessagesWaiting", scope: !386, file: !378, line: 111, baseType: !94, size: 32, offset: 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "uxLength", scope: !386, file: !378, line: 112, baseType: !56, size: 32, offset: 480)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "uxItemSize", scope: !386, file: !378, line: 113, baseType: !56, size: 32, offset: 512)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "cRxLock", scope: !386, file: !378, line: 115, baseType: !438, size: 8, offset: 544)
!438 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !380)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "cTxLock", scope: !386, file: !378, line: 116, baseType: !438, size: 8, offset: 552)
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!441 = !DIFile(filename: "freertos/opencm3.c", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS", checksumkind: CSK_MD5, checksum: "4f6f3bd7637ad08f7c58f2cf0951d556")
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !444, retainedTypes: !186, splitDebugInlining: false, nameTableKind: None)
!443 = !DIFile(filename: "../common/rcc_common_all.c", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS/libopencm3/lib/stm32/l4", checksumkind: CSK_MD5, checksum: "8eb2525c9b24a53e0e9c6e50d73f742b")
!444 = !{!445, !446, !176}
!445 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rcc_periph_clken", file: !177, line: 727, baseType: !14, size: 32, elements: !232)
!446 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rcc_periph_rst", file: !177, line: 870, baseType: !14, size: 32, elements: !447)
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505}
!448 = !DIEnumerator(name: "RST_TSC", value: 1296)
!449 = !DIEnumerator(name: "RST_CRC", value: 1292)
!450 = !DIEnumerator(name: "RST_FLASH", value: 1288)
!451 = !DIEnumerator(name: "RST_DMA2", value: 1281)
!452 = !DIEnumerator(name: "RST_DMA1", value: 1280)
!453 = !DIEnumerator(name: "RST_RNG", value: 1426)
!454 = !DIEnumerator(name: "RST_AES", value: 1424)
!455 = !DIEnumerator(name: "RST_ADC", value: 1421)
!456 = !DIEnumerator(name: "RST_ADC1", value: 1421)
!457 = !DIEnumerator(name: "RST_OTGFS", value: 1420)
!458 = !DIEnumerator(name: "RST_GPIOH", value: 1415)
!459 = !DIEnumerator(name: "RST_GPIOG", value: 1414)
!460 = !DIEnumerator(name: "RST_GPIOF", value: 1413)
!461 = !DIEnumerator(name: "RST_GPIOE", value: 1412)
!462 = !DIEnumerator(name: "RST_GPIOD", value: 1411)
!463 = !DIEnumerator(name: "RST_GPIOC", value: 1410)
!464 = !DIEnumerator(name: "RST_GPIOB", value: 1409)
!465 = !DIEnumerator(name: "RST_GPIOA", value: 1408)
!466 = !DIEnumerator(name: "RST_QSPI", value: 1544)
!467 = !DIEnumerator(name: "RST_FMC", value: 1536)
!468 = !DIEnumerator(name: "RST_LPTIM1", value: 1823)
!469 = !DIEnumerator(name: "RST_OPAMP", value: 1822)
!470 = !DIEnumerator(name: "RST_DAC1", value: 1821)
!471 = !DIEnumerator(name: "RST_PWR", value: 1820)
!472 = !DIEnumerator(name: "RST_USB", value: 1818)
!473 = !DIEnumerator(name: "RST_CAN1", value: 1817)
!474 = !DIEnumerator(name: "RST_CRS", value: 1816)
!475 = !DIEnumerator(name: "RST_I2C3", value: 1815)
!476 = !DIEnumerator(name: "RST_I2C2", value: 1814)
!477 = !DIEnumerator(name: "RST_I2C1", value: 1813)
!478 = !DIEnumerator(name: "RST_UART5", value: 1812)
!479 = !DIEnumerator(name: "RST_UART4", value: 1811)
!480 = !DIEnumerator(name: "RST_USART3", value: 1810)
!481 = !DIEnumerator(name: "RST_USART2", value: 1809)
!482 = !DIEnumerator(name: "RST_SPI3", value: 1807)
!483 = !DIEnumerator(name: "RST_SPI2", value: 1806)
!484 = !DIEnumerator(name: "RST_LCD", value: 1801)
!485 = !DIEnumerator(name: "RST_TIM7", value: 1797)
!486 = !DIEnumerator(name: "RST_TIM6", value: 1796)
!487 = !DIEnumerator(name: "RST_TIM5", value: 1795)
!488 = !DIEnumerator(name: "RST_TIM4", value: 1794)
!489 = !DIEnumerator(name: "RST_TIM3", value: 1793)
!490 = !DIEnumerator(name: "RST_TIM2", value: 1792)
!491 = !DIEnumerator(name: "RST_LPTIM2", value: 1925)
!492 = !DIEnumerator(name: "RST_SWPMI1", value: 1922)
!493 = !DIEnumerator(name: "RST_LPUART1", value: 1920)
!494 = !DIEnumerator(name: "RST_DFSDM", value: 2072)
!495 = !DIEnumerator(name: "RST_SAI2", value: 2070)
!496 = !DIEnumerator(name: "RST_SAI1", value: 2069)
!497 = !DIEnumerator(name: "RST_TIM17", value: 2066)
!498 = !DIEnumerator(name: "RST_TIM16", value: 2065)
!499 = !DIEnumerator(name: "RST_TIM15", value: 2064)
!500 = !DIEnumerator(name: "RST_USART1", value: 2062)
!501 = !DIEnumerator(name: "RST_TIM8", value: 2061)
!502 = !DIEnumerator(name: "RST_SPI1", value: 2060)
!503 = !DIEnumerator(name: "RST_TIM1", value: 2059)
!504 = !DIEnumerator(name: "RST_SDMMC1", value: 2058)
!505 = !DIEnumerator(name: "RST_SYSCFG", value: 2048)
!506 = distinct !DICompileUnit(language: DW_LANG_C99, file: !507, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !186, splitDebugInlining: false, nameTableKind: None)
!507 = !DIFile(filename: "../common/gpio_common_f0234.c", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS/libopencm3/lib/stm32/l4", checksumkind: CSK_MD5, checksum: "e47eb8e09f3d639e16ebc3c51827bbdb")
!508 = distinct !DICompileUnit(language: DW_LANG_C99, file: !509, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !510, splitDebugInlining: false, nameTableKind: None)
!509 = !DIFile(filename: "../common/flash_common_all.c", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS/libopencm3/lib/stm32/l4", checksumkind: CSK_MD5, checksum: "5d90650cf13000d350672cc0cca4e34f")
!510 = !{!49, !47}
!511 = distinct !DICompileUnit(language: DW_LANG_C99, file: !512, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !186, splitDebugInlining: false, nameTableKind: None)
!512 = !DIFile(filename: "../common/flash_common_idcache.c", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS/libopencm3/lib/stm32/l4", checksumkind: CSK_MD5, checksum: "0f8e70f209bfbc813fb7063b529d26b7")
!513 = distinct !DICompileUnit(language: DW_LANG_C99, file: !514, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !186, splitDebugInlining: false, nameTableKind: None)
!514 = !DIFile(filename: "../common/usart_common_all.c", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS/libopencm3/lib/stm32/l4", checksumkind: CSK_MD5, checksum: "82557ef5174150e99f52d192cc0a99a6")
!515 = distinct !DICompileUnit(language: DW_LANG_C99, file: !516, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !186, splitDebugInlining: false, nameTableKind: None)
!516 = !DIFile(filename: "../common/usart_common_v2.c", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS/libopencm3/lib/stm32/l4", checksumkind: CSK_MD5, checksum: "0078de1778421e82130773a35e717e39")
!517 = !{!"Ubuntu clang version 14.0.6"}
!518 = !{i32 7, !"Dwarf Version", i32 5}
!519 = !{i32 2, !"Debug Info Version", i32 3}
!520 = !{i32 1, !"wchar_size", i32 4}
!521 = !{i32 1, !"min_enum_size", i32 4}
!522 = !{i32 1, !"branch-target-enforcement", i32 0}
!523 = !{i32 1, !"sign-return-address", i32 0}
!524 = !{i32 1, !"sign-return-address-all", i32 0}
!525 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!526 = !{i32 7, !"frame-pointer", i32 2}
!527 = distinct !DISubprogram(name: "vApplicationStackOverflowHook", scope: !227, file: !227, line: 18, type: !528, scopeLine: 19, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !226, retainedNodes: !532)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !530, !531}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!532 = !{!533, !534}
!533 = !DILocalVariable(name: "pxTask", arg: 1, scope: !527, file: !227, line: 18, type: !530)
!534 = !DILocalVariable(name: "pcTaskName", arg: 2, scope: !527, file: !227, line: 18, type: !531)
!535 = !DILocation(line: 0, scope: !527)
!536 = !DILocation(line: 22, column: 5, scope: !527)
!537 = !DILocation(line: 22, column: 5, scope: !538)
!538 = distinct !DILexicalBlock(scope: !539, file: !227, line: 22, column: 5)
!539 = distinct !DILexicalBlock(scope: !527, file: !227, line: 22, column: 5)
!540 = distinct !{!540, !541, !542}
!541 = !DILocation(line: 22, column: 5, scope: !539)
!542 = !DILocation(line: 22, column: 12, scope: !539)
!543 = distinct !DISubprogram(name: "_write", scope: !227, file: !227, line: 82, type: !544, scopeLine: 83, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !226, retainedNodes: !548)
!544 = !DISubroutineType(types: !545)
!545 = !{!546, !546, !547, !546}
!546 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!548 = !{!549, !550, !551, !552}
!549 = !DILocalVariable(name: "file", arg: 1, scope: !543, file: !227, line: 82, type: !546)
!550 = !DILocalVariable(name: "ptr", arg: 2, scope: !543, file: !227, line: 82, type: !547)
!551 = !DILocalVariable(name: "len", arg: 3, scope: !543, file: !227, line: 82, type: !546)
!552 = !DILocalVariable(name: "i", scope: !543, file: !227, line: 84, type: !546)
!553 = !DILocation(line: 0, scope: !543)
!554 = !DILocation(line: 86, column: 31, scope: !555)
!555 = distinct !DILexicalBlock(scope: !543, file: !227, line: 86, column: 9)
!556 = !DILocation(line: 87, column: 23, scope: !557)
!557 = distinct !DILexicalBlock(scope: !558, file: !227, line: 87, column: 9)
!558 = distinct !DILexicalBlock(scope: !559, file: !227, line: 87, column: 9)
!559 = distinct !DILexicalBlock(scope: !555, file: !227, line: 86, column: 57)
!560 = !DILocation(line: 87, column: 9, scope: !558)
!561 = !DILocation(line: 88, column: 17, scope: !562)
!562 = distinct !DILexicalBlock(scope: !563, file: !227, line: 88, column: 17)
!563 = distinct !DILexicalBlock(scope: !557, file: !227, line: 87, column: 35)
!564 = !{!565, !565, i64 0}
!565 = !{!"omnipotent char", !566, i64 0}
!566 = !{!"Simple C/C++ TBAA"}
!567 = !DILocation(line: 88, column: 24, scope: !562)
!568 = !DILocation(line: 88, column: 17, scope: !563)
!569 = !DILocation(line: 89, column: 17, scope: !570)
!570 = distinct !DILexicalBlock(scope: !562, file: !227, line: 88, column: 33)
!571 = !DILocation(line: 91, column: 41, scope: !563)
!572 = !DILocation(line: 90, column: 13, scope: !570)
!573 = !DILocation(line: 91, column: 13, scope: !563)
!574 = !DILocation(line: 87, column: 31, scope: !557)
!575 = distinct !{!575, !560, !576, !577}
!576 = !DILocation(line: 92, column: 9, scope: !558)
!577 = !{!"llvm.loop.mustprogress"}
!578 = !DILocation(line: 95, column: 5, scope: !543)
!579 = !DILocation(line: 95, column: 11, scope: !543)
!580 = !{!581, !581, i64 0}
!581 = !{!"int", !565, i64 0}
!582 = !DILocation(line: 96, column: 5, scope: !543)
!583 = !DILocation(line: 97, column: 1, scope: !543)
!584 = distinct !DISubprogram(name: "main", scope: !227, file: !227, line: 112, type: !585, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !226, retainedNodes: !587)
!585 = !DISubroutineType(types: !586)
!586 = !{!546}
!587 = !{}
!588 = !DILocation(line: 114, column: 5, scope: !584)
!589 = !DILocation(line: 115, column: 5, scope: !584)
!590 = !DILocation(line: 116, column: 5, scope: !584)
!591 = !DILocation(line: 117, column: 5, scope: !584)
!592 = !DILocation(line: 118, column: 5, scope: !584)
!593 = !DILocation(line: 119, column: 5, scope: !584)
!594 = !DILocation(line: 119, column: 5, scope: !595)
!595 = distinct !DILexicalBlock(scope: !596, file: !227, line: 119, column: 5)
!596 = distinct !DILexicalBlock(scope: !584, file: !227, line: 119, column: 5)
!597 = distinct !{!597, !598, !599}
!598 = !DILocation(line: 119, column: 5, scope: !596)
!599 = !DILocation(line: 119, column: 13, scope: !596)
!600 = distinct !DISubprogram(name: "clock_setup", scope: !227, file: !227, line: 25, type: !206, scopeLine: 26, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !226, retainedNodes: !587)
!601 = !DILocation(line: 28, column: 5, scope: !600)
!602 = !DILocation(line: 30, column: 5, scope: !600)
!603 = !DILocation(line: 31, column: 5, scope: !600)
!604 = !DILocation(line: 32, column: 5, scope: !600)
!605 = !DILocation(line: 33, column: 5, scope: !600)
!606 = !DILocation(line: 35, column: 5, scope: !600)
!607 = !DILocation(line: 37, column: 5, scope: !600)
!608 = !DILocation(line: 41, column: 5, scope: !600)
!609 = !DILocation(line: 44, column: 2, scope: !600)
!610 = !DILocation(line: 45, column: 5, scope: !600)
!611 = !DILocation(line: 47, column: 5, scope: !600)
!612 = !DILocation(line: 48, column: 5, scope: !600)
!613 = !DILocation(line: 50, column: 23, scope: !600)
!614 = !DILocation(line: 51, column: 24, scope: !600)
!615 = !DILocation(line: 52, column: 24, scope: !600)
!616 = !DILocation(line: 53, column: 1, scope: !600)
!617 = distinct !DISubprogram(name: "usart_setup", scope: !227, file: !227, line: 55, type: !206, scopeLine: 56, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !226, retainedNodes: !587)
!618 = !DILocation(line: 58, column: 5, scope: !617)
!619 = !DILocation(line: 61, column: 5, scope: !617)
!620 = !DILocation(line: 63, column: 5, scope: !617)
!621 = !DILocation(line: 64, column: 5, scope: !617)
!622 = !DILocation(line: 65, column: 5, scope: !617)
!623 = !DILocation(line: 66, column: 5, scope: !617)
!624 = !DILocation(line: 67, column: 5, scope: !617)
!625 = !DILocation(line: 68, column: 5, scope: !617)
!626 = !DILocation(line: 71, column: 5, scope: !617)
!627 = !DILocation(line: 72, column: 1, scope: !617)
!628 = distinct !DISubprogram(name: "task1", scope: !227, file: !227, line: 99, type: !629, scopeLine: 100, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !226, retainedNodes: !631)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !5}
!631 = !{!632, !633}
!632 = !DILocalVariable(name: "args", arg: 1, scope: !628, file: !227, line: 99, type: !5)
!633 = !DILocalVariable(name: "i", scope: !628, file: !227, line: 101, type: !546)
!634 = !DILocation(line: 105, column: 5, scope: !628)
!635 = distinct !DISubprogram(name: "pvPortMalloc", scope: !3, file: !3, line: 113, type: !636, scopeLine: 114, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !638)
!636 = !DISubroutineType(types: !637)
!637 = !{!5, !12}
!638 = !{!639, !640, !641, !642, !643}
!639 = !DILocalVariable(name: "xWantedSize", arg: 1, scope: !635, file: !3, line: 113, type: !12)
!640 = !DILocalVariable(name: "pxBlock", scope: !635, file: !3, line: 115, type: !15)
!641 = !DILocalVariable(name: "pxPreviousBlock", scope: !635, file: !3, line: 115, type: !15)
!642 = !DILocalVariable(name: "pxNewBlockLink", scope: !635, file: !3, line: 115, type: !15)
!643 = !DILocalVariable(name: "pvReturn", scope: !635, file: !3, line: 116, type: !5)
!644 = !DILocation(line: 0, scope: !635)
!645 = !DILocation(line: 118, column: 2, scope: !635)
!646 = !DILocation(line: 122, column: 7, scope: !647)
!647 = distinct !DILexicalBlock(scope: !648, file: !3, line: 122, column: 7)
!648 = distinct !DILexicalBlock(scope: !635, file: !3, line: 119, column: 2)
!649 = !{!650, !650, i64 0}
!650 = !{!"any pointer", !565, i64 0}
!651 = !DILocation(line: 122, column: 13, scope: !647)
!652 = !DILocation(line: 122, column: 7, scope: !648)
!653 = !DILocation(line: 124, column: 4, scope: !654)
!654 = distinct !DILexicalBlock(scope: !647, file: !3, line: 123, column: 3)
!655 = !DILocation(line: 125, column: 3, scope: !654)
!656 = !DILocation(line: 135, column: 23, scope: !657)
!657 = distinct !DILexicalBlock(scope: !648, file: !3, line: 135, column: 7)
!658 = !DILocation(line: 135, column: 21, scope: !657)
!659 = !DILocation(line: 135, column: 44, scope: !657)
!660 = !DILocation(line: 135, column: 7, scope: !648)
!661 = !DILocation(line: 141, column: 17, scope: !662)
!662 = distinct !DILexicalBlock(scope: !663, file: !3, line: 140, column: 4)
!663 = distinct !DILexicalBlock(scope: !664, file: !3, line: 139, column: 8)
!664 = distinct !DILexicalBlock(scope: !657, file: !3, line: 136, column: 3)
!665 = !DILocation(line: 145, column: 23, scope: !666)
!666 = distinct !DILexicalBlock(scope: !662, file: !3, line: 145, column: 9)
!667 = !DILocation(line: 145, column: 51, scope: !666)
!668 = !DILocation(line: 145, column: 9, scope: !662)
!669 = !DILocation(line: 161, column: 22, scope: !670)
!670 = distinct !DILexicalBlock(scope: !664, file: !3, line: 161, column: 8)
!671 = !DILocation(line: 161, column: 28, scope: !670)
!672 = !DILocation(line: 166, column: 22, scope: !673)
!673 = distinct !DILexicalBlock(scope: !670, file: !3, line: 162, column: 4)
!674 = !{!675, !650, i64 0}
!675 = !{!"A_BLOCK_LINK", !650, i64 0, !581, i64 4}
!676 = !DILocation(line: 167, column: 23, scope: !673)
!677 = !{!675, !581, i64 4}
!678 = !DILocation(line: 167, column: 34, scope: !673)
!679 = !DILocation(line: 167, column: 50, scope: !673)
!680 = !DILocation(line: 167, column: 64, scope: !673)
!681 = !DILocation(line: 167, column: 80, scope: !673)
!682 = !DILocation(line: 167, column: 5, scope: !673)
!683 = distinct !{!683, !682, !684, !577}
!684 = !DILocation(line: 171, column: 5, scope: !673)
!685 = !DILocation(line: 0, scope: !673)
!686 = !DILocation(line: 175, column: 20, scope: !687)
!687 = distinct !DILexicalBlock(scope: !673, file: !3, line: 175, column: 9)
!688 = !DILocation(line: 175, column: 17, scope: !687)
!689 = !DILocation(line: 175, column: 9, scope: !673)
!690 = !DILocation(line: 179, column: 63, scope: !691)
!691 = distinct !DILexicalBlock(scope: !687, file: !3, line: 176, column: 5)
!692 = !DILocation(line: 179, column: 81, scope: !691)
!693 = !DILocation(line: 183, column: 50, scope: !691)
!694 = !DILocation(line: 183, column: 39, scope: !691)
!695 = !DILocation(line: 187, column: 32, scope: !696)
!696 = distinct !DILexicalBlock(scope: !691, file: !3, line: 187, column: 10)
!697 = !DILocation(line: 187, column: 48, scope: !696)
!698 = !DILocation(line: 187, column: 10, scope: !691)
!699 = !DILocation(line: 193, column: 39, scope: !700)
!700 = distinct !DILexicalBlock(scope: !696, file: !3, line: 188, column: 6)
!701 = !DILocation(line: 193, column: 63, scope: !700)
!702 = !DILocation(line: 193, column: 24, scope: !700)
!703 = !DILocation(line: 198, column: 23, scope: !700)
!704 = !DILocation(line: 198, column: 34, scope: !700)
!705 = !DILocation(line: 199, column: 27, scope: !700)
!706 = !DILocation(line: 202, column: 7, scope: !700)
!707 = !DILocation(line: 203, column: 6, scope: !700)
!708 = !DILocation(line: 209, column: 38, scope: !691)
!709 = !DILocation(line: 209, column: 26, scope: !691)
!710 = !DILocation(line: 211, column: 32, scope: !711)
!711 = distinct !DILexicalBlock(scope: !691, file: !3, line: 211, column: 10)
!712 = !DILocation(line: 211, column: 30, scope: !711)
!713 = !DILocation(line: 211, column: 10, scope: !691)
!714 = !DILocation(line: 213, column: 38, scope: !715)
!715 = distinct !DILexicalBlock(scope: !711, file: !3, line: 212, column: 6)
!716 = !DILocation(line: 214, column: 6, scope: !715)
!717 = !DILocation(line: 222, column: 29, scope: !691)
!718 = !DILocation(line: 222, column: 26, scope: !691)
!719 = !DILocation(line: 223, column: 31, scope: !691)
!720 = !DILocation(line: 224, column: 5, scope: !691)
!721 = !DILocation(line: 242, column: 11, scope: !635)
!722 = !DILocation(line: 259, column: 2, scope: !635)
!723 = distinct !DISubprogram(name: "prvHeapInit", scope: !3, file: !3, line: 329, type: !206, scopeLine: 330, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !724)
!724 = !{!725, !726, !727, !728}
!725 = !DILocalVariable(name: "pxFirstFreeBlock", scope: !723, file: !3, line: 331, type: !15)
!726 = !DILocalVariable(name: "pucAlignedHeap", scope: !723, file: !3, line: 332, type: !6)
!727 = !DILocalVariable(name: "uxAddress", scope: !723, file: !3, line: 333, type: !12)
!728 = !DILocalVariable(name: "xTotalHeapSize", scope: !723, file: !3, line: 334, type: !12)
!729 = !DILocation(line: 0, scope: !723)
!730 = !DILocation(line: 350, column: 25, scope: !723)
!731 = !DILocation(line: 351, column: 20, scope: !723)
!732 = !DILocation(line: 358, column: 8, scope: !723)
!733 = !DILocation(line: 359, column: 20, scope: !723)
!734 = !DILocation(line: 360, column: 25, scope: !723)
!735 = !DILocation(line: 365, column: 31, scope: !723)
!736 = !DILocation(line: 366, column: 38, scope: !723)
!737 = !DILocation(line: 366, column: 36, scope: !723)
!738 = !DILocation(line: 369, column: 33, scope: !723)
!739 = !DILocation(line: 370, column: 22, scope: !723)
!740 = !DILocation(line: 373, column: 21, scope: !723)
!741 = !DILocation(line: 374, column: 1, scope: !723)
!742 = distinct !DISubprogram(name: "prvInsertBlockIntoFreeList", scope: !3, file: !3, line: 377, type: !743, scopeLine: 378, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !745)
!743 = !DISubroutineType(types: !744)
!744 = !{null, !15}
!745 = !{!746, !747, !748}
!746 = !DILocalVariable(name: "pxBlockToInsert", arg: 1, scope: !742, file: !3, line: 377, type: !15)
!747 = !DILocalVariable(name: "pxIterator", scope: !742, file: !3, line: 379, type: !15)
!748 = !DILocalVariable(name: "puc", scope: !742, file: !3, line: 380, type: !6)
!749 = !DILocation(line: 0, scope: !742)
!750 = !DILocation(line: 384, column: 7, scope: !751)
!751 = distinct !DILexicalBlock(scope: !742, file: !3, line: 384, column: 2)
!752 = !DILocation(line: 0, scope: !751)
!753 = !DILocation(line: 384, column: 41, scope: !754)
!754 = distinct !DILexicalBlock(scope: !751, file: !3, line: 384, column: 2)
!755 = !DILocation(line: 384, column: 57, scope: !754)
!756 = !DILocation(line: 384, column: 2, scope: !751)
!757 = distinct !{!757, !756, !758, !577}
!758 = !DILocation(line: 387, column: 2, scope: !751)
!759 = !DILocation(line: 391, column: 8, scope: !742)
!760 = !DILocation(line: 392, column: 26, scope: !761)
!761 = distinct !DILexicalBlock(scope: !742, file: !3, line: 392, column: 6)
!762 = !DILocation(line: 392, column: 12, scope: !761)
!763 = !DILocation(line: 392, column: 42, scope: !761)
!764 = !DILocation(line: 392, column: 39, scope: !761)
!765 = !DILocation(line: 392, column: 6, scope: !742)
!766 = !DILocation(line: 394, column: 26, scope: !767)
!767 = distinct !DILexicalBlock(scope: !761, file: !3, line: 393, column: 2)
!768 = !DILocation(line: 396, column: 2, scope: !767)
!769 = !DILocation(line: 404, column: 8, scope: !742)
!770 = !DILocation(line: 405, column: 31, scope: !771)
!771 = distinct !DILexicalBlock(scope: !742, file: !3, line: 405, column: 6)
!772 = !DILocation(line: 405, column: 12, scope: !771)
!773 = !DILocation(line: 405, column: 47, scope: !771)
!774 = !DILocation(line: 405, column: 44, scope: !771)
!775 = !DILocation(line: 405, column: 6, scope: !742)
!776 = !DILocation(line: 410, column: 64, scope: !777)
!777 = distinct !DILexicalBlock(scope: !778, file: !3, line: 408, column: 3)
!778 = distinct !DILexicalBlock(scope: !779, file: !3, line: 407, column: 7)
!779 = distinct !DILexicalBlock(scope: !771, file: !3, line: 406, column: 2)
!780 = !DILocation(line: 410, column: 32, scope: !777)
!781 = !DILocation(line: 411, column: 68, scope: !777)
!782 = !DILocation(line: 412, column: 3, scope: !777)
!783 = !DILocation(line: 0, scope: !771)
!784 = !DILocation(line: 427, column: 17, scope: !785)
!785 = distinct !DILexicalBlock(scope: !742, file: !3, line: 427, column: 6)
!786 = !DILocation(line: 427, column: 6, scope: !742)
!787 = !DILocation(line: 429, column: 31, scope: !788)
!788 = distinct !DILexicalBlock(scope: !785, file: !3, line: 428, column: 2)
!789 = !DILocation(line: 430, column: 2, scope: !788)
!790 = !DILocation(line: 435, column: 1, scope: !742)
!791 = distinct !DISubprogram(name: "vPortFree", scope: !3, file: !3, line: 263, type: !629, scopeLine: 264, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !792)
!792 = !{!793, !794, !795}
!793 = !DILocalVariable(name: "pv", arg: 1, scope: !791, file: !3, line: 263, type: !5)
!794 = !DILocalVariable(name: "puc", scope: !791, file: !3, line: 265, type: !6)
!795 = !DILocalVariable(name: "pxLink", scope: !791, file: !3, line: 266, type: !15)
!796 = !DILocation(line: 0, scope: !791)
!797 = !DILocation(line: 268, column: 9, scope: !798)
!798 = distinct !DILexicalBlock(scope: !791, file: !3, line: 268, column: 6)
!799 = !DILocation(line: 268, column: 6, scope: !791)
!800 = !DILocation(line: 272, column: 7, scope: !801)
!801 = distinct !DILexicalBlock(scope: !798, file: !3, line: 269, column: 2)
!802 = !DILocation(line: 275, column: 12, scope: !801)
!803 = !DILocation(line: 281, column: 17, scope: !804)
!804 = distinct !DILexicalBlock(scope: !801, file: !3, line: 281, column: 7)
!805 = !DILocation(line: 281, column: 30, scope: !804)
!806 = !DILocation(line: 281, column: 28, scope: !804)
!807 = !DILocation(line: 281, column: 51, scope: !804)
!808 = !DILocation(line: 281, column: 7, scope: !801)
!809 = !DILocation(line: 283, column: 16, scope: !810)
!810 = distinct !DILexicalBlock(scope: !811, file: !3, line: 283, column: 8)
!811 = distinct !DILexicalBlock(scope: !804, file: !3, line: 282, column: 3)
!812 = !DILocation(line: 283, column: 32, scope: !810)
!813 = !DILocation(line: 283, column: 8, scope: !811)
!814 = !DILocation(line: 287, column: 27, scope: !815)
!815 = distinct !DILexicalBlock(scope: !810, file: !3, line: 284, column: 4)
!816 = !DILocation(line: 287, column: 24, scope: !815)
!817 = !DILocation(line: 289, column: 5, scope: !815)
!818 = !DILocation(line: 292, column: 37, scope: !819)
!819 = distinct !DILexicalBlock(scope: !815, file: !3, line: 290, column: 5)
!820 = !DILocation(line: 292, column: 26, scope: !819)
!821 = !DILocation(line: 294, column: 6, scope: !819)
!822 = !DILocation(line: 296, column: 14, scope: !815)
!823 = !DILocation(line: 297, column: 4, scope: !815)
!824 = !DILocation(line: 308, column: 1, scope: !791)
!825 = distinct !DISubprogram(name: "xPortGetFreeHeapSize", scope: !3, file: !3, line: 311, type: !826, scopeLine: 312, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !587)
!826 = !DISubroutineType(types: !827)
!827 = !{!12}
!828 = !DILocation(line: 313, column: 9, scope: !825)
!829 = !DILocation(line: 313, column: 2, scope: !825)
!830 = distinct !DISubprogram(name: "xPortGetMinimumEverFreeHeapSize", scope: !3, file: !3, line: 317, type: !826, scopeLine: 318, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !587)
!831 = !DILocation(line: 319, column: 9, scope: !830)
!832 = !DILocation(line: 319, column: 2, scope: !830)
!833 = distinct !DISubprogram(name: "vPortInitialiseBlocks", scope: !3, file: !3, line: 323, type: !206, scopeLine: 324, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !587)
!834 = !DILocation(line: 326, column: 1, scope: !833)
!835 = distinct !DISubprogram(name: "vListInitialise", scope: !353, file: !353, line: 37, type: !836, scopeLine: 38, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !352, retainedNodes: !841)
!836 = !DISubroutineType(types: !837)
!837 = !{null, !838}
!838 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "List_t", file: !81, line: 171, baseType: !366)
!841 = !{!842}
!842 = !DILocalVariable(name: "pxList", arg: 1, scope: !835, file: !353, line: 37, type: !838)
!843 = !DILocation(line: 0, scope: !835)
!844 = !DILocation(line: 42, column: 48, scope: !835)
!845 = !DILocation(line: 42, column: 10, scope: !835)
!846 = !DILocation(line: 42, column: 18, scope: !835)
!847 = !{!848, !650, i64 4}
!848 = !{!"xLIST", !849, i64 0, !650, i64 4, !850, i64 8}
!849 = !{!"long", !565, i64 0}
!850 = !{!"xMINI_LIST_ITEM", !581, i64 0, !650, i64 4, !650, i64 8}
!851 = !DILocation(line: 46, column: 19, scope: !835)
!852 = !DILocation(line: 46, column: 30, scope: !835)
!853 = !{!848, !581, i64 8}
!854 = !DILocation(line: 50, column: 19, scope: !835)
!855 = !DILocation(line: 50, column: 26, scope: !835)
!856 = !{!848, !650, i64 12}
!857 = !DILocation(line: 51, column: 19, scope: !835)
!858 = !DILocation(line: 51, column: 30, scope: !835)
!859 = !{!848, !650, i64 16}
!860 = !DILocation(line: 53, column: 10, scope: !835)
!861 = !DILocation(line: 53, column: 26, scope: !835)
!862 = !{!848, !849, i64 0}
!863 = !DILocation(line: 59, column: 1, scope: !835)
!864 = distinct !DISubprogram(name: "vListInitialiseItem", scope: !353, file: !353, line: 62, type: !865, scopeLine: 63, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !352, retainedNodes: !868)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !867}
!867 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !355)
!868 = !{!869}
!869 = !DILocalVariable(name: "pxItem", arg: 1, scope: !864, file: !353, line: 62, type: !867)
!870 = !DILocation(line: 0, scope: !864)
!871 = !DILocation(line: 65, column: 10, scope: !864)
!872 = !DILocation(line: 65, column: 22, scope: !864)
!873 = !{!874, !650, i64 16}
!874 = !{!"xLIST_ITEM", !581, i64 0, !650, i64 4, !650, i64 8, !650, i64 12, !650, i64 16}
!875 = !DILocation(line: 71, column: 1, scope: !864)
!876 = distinct !DISubprogram(name: "vListInsertEnd", scope: !353, file: !353, line: 74, type: !877, scopeLine: 75, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !352, retainedNodes: !879)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !838, !867}
!879 = !{!880, !881, !882}
!880 = !DILocalVariable(name: "pxList", arg: 1, scope: !876, file: !353, line: 74, type: !838)
!881 = !DILocalVariable(name: "pxNewListItem", arg: 2, scope: !876, file: !353, line: 74, type: !867)
!882 = !DILocalVariable(name: "pxIndex", scope: !876, file: !353, line: 76, type: !867)
!883 = !DILocation(line: 0, scope: !876)
!884 = !DILocation(line: 76, column: 38, scope: !876)
!885 = !DILocation(line: 87, column: 17, scope: !876)
!886 = !DILocation(line: 87, column: 24, scope: !876)
!887 = !{!874, !650, i64 4}
!888 = !DILocation(line: 88, column: 39, scope: !876)
!889 = !{!874, !650, i64 8}
!890 = !DILocation(line: 88, column: 17, scope: !876)
!891 = !DILocation(line: 88, column: 28, scope: !876)
!892 = !DILocation(line: 93, column: 11, scope: !876)
!893 = !DILocation(line: 93, column: 23, scope: !876)
!894 = !DILocation(line: 93, column: 30, scope: !876)
!895 = !DILocation(line: 94, column: 22, scope: !876)
!896 = !DILocation(line: 97, column: 17, scope: !876)
!897 = !DILocation(line: 97, column: 29, scope: !876)
!898 = !DILocation(line: 99, column: 12, scope: !876)
!899 = !DILocation(line: 99, column: 29, scope: !876)
!900 = !DILocation(line: 100, column: 1, scope: !876)
!901 = distinct !DISubprogram(name: "vListInsert", scope: !353, file: !353, line: 103, type: !877, scopeLine: 104, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !352, retainedNodes: !902)
!902 = !{!903, !904, !905, !906}
!903 = !DILocalVariable(name: "pxList", arg: 1, scope: !901, file: !353, line: 103, type: !838)
!904 = !DILocalVariable(name: "pxNewListItem", arg: 2, scope: !901, file: !353, line: 103, type: !867)
!905 = !DILocalVariable(name: "pxIterator", scope: !901, file: !353, line: 105, type: !355)
!906 = !DILocalVariable(name: "xValueOfInsertion", scope: !901, file: !353, line: 106, type: !907)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !54)
!908 = !DILocation(line: 0, scope: !901)
!909 = !DILocation(line: 106, column: 53, scope: !901)
!910 = !{!874, !581, i64 0}
!911 = !DILocation(line: 122, column: 24, scope: !912)
!912 = distinct !DILexicalBlock(scope: !901, file: !353, line: 122, column: 6)
!913 = !DILocation(line: 122, column: 6, scope: !901)
!914 = !DILocation(line: 124, column: 33, scope: !915)
!915 = distinct !DILexicalBlock(scope: !912, file: !353, line: 123, column: 2)
!916 = !DILocation(line: 157, column: 38, scope: !901)
!917 = !DILocation(line: 125, column: 2, scope: !915)
!918 = !DILocation(line: 150, column: 49, scope: !919)
!919 = distinct !DILexicalBlock(scope: !920, file: !353, line: 150, column: 3)
!920 = distinct !DILexicalBlock(scope: !912, file: !353, line: 127, column: 2)
!921 = !DILocation(line: 150, column: 21, scope: !919)
!922 = !DILocation(line: 150, column: 8, scope: !919)
!923 = !DILocation(line: 0, scope: !919)
!924 = !DILocation(line: 150, column: 73, scope: !925)
!925 = distinct !DILexicalBlock(scope: !919, file: !353, line: 150, column: 3)
!926 = !DILocation(line: 150, column: 81, scope: !925)
!927 = !DILocation(line: 150, column: 92, scope: !925)
!928 = !DILocation(line: 150, column: 3, scope: !919)
!929 = distinct !{!929, !928, !930, !577}
!930 = !DILocation(line: 154, column: 3, scope: !919)
!931 = !DILocation(line: 0, scope: !912)
!932 = !DILocation(line: 157, column: 17, scope: !901)
!933 = !DILocation(line: 157, column: 24, scope: !901)
!934 = !DILocation(line: 158, column: 25, scope: !901)
!935 = !DILocation(line: 158, column: 36, scope: !901)
!936 = !DILocation(line: 159, column: 17, scope: !901)
!937 = !DILocation(line: 159, column: 28, scope: !901)
!938 = !DILocation(line: 160, column: 21, scope: !901)
!939 = !DILocation(line: 164, column: 17, scope: !901)
!940 = !DILocation(line: 164, column: 29, scope: !901)
!941 = !DILocation(line: 166, column: 12, scope: !901)
!942 = !DILocation(line: 166, column: 29, scope: !901)
!943 = !DILocation(line: 167, column: 1, scope: !901)
!944 = distinct !DISubprogram(name: "uxListRemove", scope: !353, file: !353, line: 170, type: !945, scopeLine: 171, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !352, retainedNodes: !947)
!945 = !DISubroutineType(types: !946)
!946 = !{!56, !867}
!947 = !{!948, !949}
!948 = !DILocalVariable(name: "pxItemToRemove", arg: 1, scope: !944, file: !353, line: 170, type: !867)
!949 = !DILocalVariable(name: "pxList", scope: !944, file: !353, line: 174, type: !838)
!950 = !DILocation(line: 0, scope: !944)
!951 = !DILocation(line: 174, column: 41, scope: !944)
!952 = !DILocation(line: 176, column: 55, scope: !944)
!953 = !DILocation(line: 176, column: 18, scope: !944)
!954 = !DILocation(line: 176, column: 26, scope: !944)
!955 = !DILocation(line: 176, column: 37, scope: !944)
!956 = !DILocation(line: 177, column: 18, scope: !944)
!957 = !DILocation(line: 177, column: 30, scope: !944)
!958 = !DILocation(line: 177, column: 37, scope: !944)
!959 = !DILocation(line: 183, column: 14, scope: !960)
!960 = distinct !DILexicalBlock(scope: !944, file: !353, line: 183, column: 6)
!961 = !DILocation(line: 183, column: 22, scope: !960)
!962 = !DILocation(line: 183, column: 6, scope: !944)
!963 = !DILocation(line: 185, column: 19, scope: !964)
!964 = distinct !DILexicalBlock(scope: !960, file: !353, line: 184, column: 2)
!965 = !DILocation(line: 186, column: 2, scope: !964)
!966 = !DILocation(line: 192, column: 30, scope: !944)
!967 = !DILocation(line: 193, column: 12, scope: !944)
!968 = !DILocation(line: 193, column: 29, scope: !944)
!969 = !DILocation(line: 195, column: 17, scope: !944)
!970 = !DILocation(line: 195, column: 2, scope: !944)
!971 = distinct !DISubprogram(name: "pxPortInitialiseStack", scope: !43, file: !43, line: 174, type: !972, scopeLine: 175, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !42, retainedNodes: !977)
!972 = !DISubroutineType(types: !973)
!973 = !{!107, !107, !974, !5}
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "TaskFunction_t", file: !975, line: 35, baseType: !976)
!975 = !DIFile(filename: "./freertos/projdefs.h", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS", checksumkind: CSK_MD5, checksum: "1280b022bdf0485e48a2512dab20ba0d")
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 32)
!977 = !{!978, !979, !980}
!978 = !DILocalVariable(name: "pxTopOfStack", arg: 1, scope: !971, file: !43, line: 174, type: !107)
!979 = !DILocalVariable(name: "pxCode", arg: 2, scope: !971, file: !43, line: 174, type: !974)
!980 = !DILocalVariable(name: "pvParameters", arg: 3, scope: !971, file: !43, line: 174, type: !5)
!981 = !DILocation(line: 0, scope: !971)
!982 = !DILocation(line: 178, column: 14, scope: !971)
!983 = !DILocation(line: 179, column: 16, scope: !971)
!984 = !DILocation(line: 180, column: 14, scope: !971)
!985 = !DILocation(line: 181, column: 20, scope: !971)
!986 = !DILocation(line: 181, column: 45, scope: !971)
!987 = !DILocation(line: 181, column: 16, scope: !971)
!988 = !DILocation(line: 182, column: 14, scope: !971)
!989 = !DILocation(line: 183, column: 16, scope: !971)
!990 = !DILocation(line: 184, column: 15, scope: !971)
!991 = !DILocation(line: 185, column: 18, scope: !971)
!992 = !DILocation(line: 185, column: 16, scope: !971)
!993 = !DILocation(line: 186, column: 15, scope: !971)
!994 = !DILocation(line: 188, column: 2, scope: !971)
!995 = distinct !DISubprogram(name: "prvTaskExitError", scope: !43, file: !43, line: 192, type: !206, scopeLine: 193, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !42, retainedNodes: !996)
!996 = !{!997}
!997 = !DILocalVariable(name: "ulDummy", scope: !995, file: !43, line: 194, type: !50)
!998 = !DILocation(line: 194, column: 1, scope: !995)
!999 = !DILocation(line: 194, column: 19, scope: !995)
!1000 = !DILocation(line: 195, column: 2, scope: !1001, inlinedAt: !1004)
!1001 = distinct !DISubprogram(name: "vPortRaiseBASEPRI", scope: !46, file: !46, line: 191, type: !206, scopeLine: 192, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !42, retainedNodes: !1002)
!1002 = !{!1003}
!1003 = !DILocalVariable(name: "ulNewBASEPRI", scope: !1001, file: !46, line: 193, type: !47)
!1004 = distinct !DILocation(line: 203, column: 2, scope: !995)
!1005 = !{i64 197166, i64 197200, i64 197237, i64 197265}
!1006 = !DILocation(line: 0, scope: !1001, inlinedAt: !1004)
!1007 = !DILocation(line: 204, column: 2, scope: !995)
!1008 = !DILocation(line: 204, column: 9, scope: !995)
!1009 = !DILocation(line: 204, column: 17, scope: !995)
!1010 = distinct !{!1010, !1007, !1011, !577}
!1011 = !DILocation(line: 213, column: 2, scope: !995)
!1012 = !DILocation(line: 214, column: 1, scope: !995)
!1013 = distinct !DISubprogram(name: "vPortSVCHandler", scope: !43, file: !43, line: 217, type: !206, scopeLine: 218, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !42, retainedNodes: !587)
!1014 = !DILocation(line: 219, column: 2, scope: !1013)
!1015 = !{i64 8905, i64 8973, i64 9063, i64 9155, i64 9298, i64 9365, i64 9388, i64 9417, i64 9449, i64 9479, i64 9504, i64 9524, i64 9550}
!1016 = !DILocation(line: 234, column: 1, scope: !1013)
!1017 = distinct !DISubprogram(name: "xPortStartScheduler", scope: !43, file: !43, line: 257, type: !1018, scopeLine: 258, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !42, retainedNodes: !587)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!51}
!1020 = !DILocation(line: 326, column: 23, scope: !1017)
!1021 = !DILocation(line: 327, column: 23, scope: !1017)
!1022 = !DILocation(line: 331, column: 2, scope: !1017)
!1023 = !DILocation(line: 334, column: 20, scope: !1017)
!1024 = !{!849, !849, i64 0}
!1025 = !DILocation(line: 337, column: 2, scope: !1017)
!1026 = !DILocation(line: 345, column: 2, scope: !1017)
!1027 = !DILocation(line: 346, column: 2, scope: !1017)
!1028 = !DILocation(line: 349, column: 2, scope: !1017)
!1029 = distinct !DISubprogram(name: "vPortSetupTimerInterrupt", scope: !43, file: !43, line: 617, type: !206, scopeLine: 618, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !42, retainedNodes: !587)
!1030 = !DILocation(line: 629, column: 28, scope: !1029)
!1031 = !DILocation(line: 630, column: 37, scope: !1029)
!1032 = !DILocation(line: 633, column: 28, scope: !1029)
!1033 = !DILocation(line: 634, column: 28, scope: !1029)
!1034 = !DILocation(line: 635, column: 1, scope: !1029)
!1035 = distinct !DISubprogram(name: "prvPortStartFirstTask", scope: !43, file: !43, line: 237, type: !206, scopeLine: 238, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !42, retainedNodes: !587)
!1036 = !DILocation(line: 239, column: 2, scope: !1035)
!1037 = !{i64 9744, i64 9834, i64 9862, i64 9890, i64 9966, i64 10023, i64 10046, i64 10066, i64 10086, i64 10147}
!1038 = !DILocation(line: 251, column: 1, scope: !1035)
!1039 = distinct !DISubprogram(name: "vPortEndScheduler", scope: !43, file: !43, line: 353, type: !206, scopeLine: 354, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !42, retainedNodes: !587)
!1040 = !DILocation(line: 358, column: 1, scope: !1039)
!1041 = distinct !DISubprogram(name: "vPortEnterCritical", scope: !43, file: !43, line: 361, type: !206, scopeLine: 362, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !42, retainedNodes: !587)
!1042 = !DILocation(line: 195, column: 2, scope: !1001, inlinedAt: !1043)
!1043 = distinct !DILocation(line: 363, column: 2, scope: !1041)
!1044 = !DILocation(line: 0, scope: !1001, inlinedAt: !1043)
!1045 = !DILocation(line: 364, column: 19, scope: !1041)
!1046 = !DILocation(line: 375, column: 1, scope: !1041)
!1047 = distinct !DISubprogram(name: "vPortExitCritical", scope: !43, file: !43, line: 378, type: !206, scopeLine: 379, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !42, retainedNodes: !587)
!1048 = !DILocation(line: 381, column: 19, scope: !1047)
!1049 = !DILocation(line: 382, column: 24, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1047, file: !43, line: 382, column: 6)
!1051 = !DILocation(line: 382, column: 6, scope: !1047)
!1052 = !DILocalVariable(name: "ulNewMaskValue", arg: 1, scope: !1053, file: !46, line: 227, type: !47)
!1053 = distinct !DISubprogram(name: "vPortSetBASEPRI", scope: !46, file: !46, line: 227, type: !1054, scopeLine: 228, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !42, retainedNodes: !1056)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{null, !47}
!1056 = !{!1052}
!1057 = !DILocation(line: 0, scope: !1053, inlinedAt: !1058)
!1058 = distinct !DILocation(line: 384, column: 3, scope: !1059)
!1059 = distinct !DILexicalBlock(scope: !1050, file: !43, line: 383, column: 2)
!1060 = !DILocation(line: 229, column: 2, scope: !1053, inlinedAt: !1058)
!1061 = !{i64 198143}
!1062 = !DILocation(line: 385, column: 2, scope: !1059)
!1063 = !DILocation(line: 386, column: 1, scope: !1047)
!1064 = distinct !DISubprogram(name: "xPortPendSVHandler", scope: !43, file: !43, line: 389, type: !206, scopeLine: 390, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !42, retainedNodes: !587)
!1065 = !DILocation(line: 393, column: 2, scope: !1064)
!1066 = !{i64 15069, i64 15096, i64 15116, i64 15133, i64 15212, i64 15238, i64 15255, i64 15323, i64 15415, i64 15432, i64 15464, i64 15489, i64 15518, i64 15551, i64 15576, i64 15605, i64 15637, i64 15719, i64 15745, i64 15834, i64 15891, i64 15917, i64 15937, i64 15959, i64 15976, i64 15999}
!1067 = !DILocation(line: 423, column: 1, scope: !1064)
!1068 = distinct !DISubprogram(name: "xPortSysTickHandler", scope: !43, file: !43, line: 426, type: !206, scopeLine: 427, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !42, retainedNodes: !587)
!1069 = !DILocation(line: 195, column: 2, scope: !1001, inlinedAt: !1070)
!1070 = distinct !DILocation(line: 432, column: 2, scope: !1068)
!1071 = !DILocation(line: 0, scope: !1001, inlinedAt: !1070)
!1072 = !DILocation(line: 435, column: 7, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1074, file: !43, line: 435, column: 7)
!1074 = distinct !DILexicalBlock(scope: !1068, file: !43, line: 433, column: 2)
!1075 = !DILocation(line: 435, column: 28, scope: !1073)
!1076 = !DILocation(line: 435, column: 7, scope: !1074)
!1077 = !DILocation(line: 439, column: 26, scope: !1078)
!1078 = distinct !DILexicalBlock(scope: !1073, file: !43, line: 436, column: 3)
!1079 = !DILocation(line: 440, column: 3, scope: !1078)
!1080 = !DILocation(line: 0, scope: !1053, inlinedAt: !1081)
!1081 = distinct !DILocation(line: 442, column: 2, scope: !1068)
!1082 = !DILocation(line: 229, column: 2, scope: !1053, inlinedAt: !1081)
!1083 = !DILocation(line: 443, column: 1, scope: !1068)
!1084 = distinct !DISubprogram(name: "xQueueGenericReset", scope: !378, file: !378, line: 255, type: !1085, scopeLine: 256, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !377, retainedNodes: !1090)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!51, !1087, !51}
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "QueueHandle_t", file: !1088, line: 48, baseType: !1089)
!1088 = !DIFile(filename: "./freertos/queue.h", directory: "/home/mjshen/RTOSExploration/Amazfitbip-FreeRTOS", checksumkind: CSK_MD5, checksum: "f83e2a840d59ac28c87e655abfa5e2e8")
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!1090 = !{!1091, !1092, !1093}
!1091 = !DILocalVariable(name: "xQueue", arg: 1, scope: !1084, file: !378, line: 255, type: !1087)
!1092 = !DILocalVariable(name: "xNewQueue", arg: 2, scope: !1084, file: !378, line: 255, type: !51)
!1093 = !DILocalVariable(name: "pxQueue", scope: !1084, file: !378, line: 257, type: !1094)
!1094 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!1095 = !DILocation(line: 0, scope: !1084)
!1096 = !DILocation(line: 261, column: 2, scope: !1084)
!1097 = !DILocation(line: 263, column: 39, scope: !1098)
!1098 = distinct !DILexicalBlock(scope: !1084, file: !378, line: 262, column: 2)
!1099 = !{!1100, !650, i64 0}
!1100 = !{!"QueueDefinition", !650, i64 0, !650, i64 4, !565, i64 8, !848, i64 16, !848, i64 36, !849, i64 56, !849, i64 60, !849, i64 64, !565, i64 68, !565, i64 69}
!1101 = !DILocation(line: 263, column: 59, scope: !1098)
!1102 = !{!1100, !849, i64 60}
!1103 = !DILocation(line: 263, column: 79, scope: !1098)
!1104 = !{!1100, !849, i64 64}
!1105 = !DILocation(line: 263, column: 68, scope: !1098)
!1106 = !DILocation(line: 263, column: 46, scope: !1098)
!1107 = !DILocation(line: 263, column: 21, scope: !1098)
!1108 = !DILocation(line: 263, column: 28, scope: !1098)
!1109 = !DILocation(line: 264, column: 12, scope: !1098)
!1110 = !DILocation(line: 264, column: 30, scope: !1098)
!1111 = !{!1100, !849, i64 56}
!1112 = !DILocation(line: 265, column: 12, scope: !1098)
!1113 = !DILocation(line: 265, column: 22, scope: !1098)
!1114 = !{!1100, !650, i64 4}
!1115 = !DILocation(line: 266, column: 74, scope: !1098)
!1116 = !DILocation(line: 266, column: 81, scope: !1098)
!1117 = !DILocation(line: 266, column: 50, scope: !1098)
!1118 = !DILocation(line: 266, column: 21, scope: !1098)
!1119 = !DILocation(line: 266, column: 32, scope: !1098)
!1120 = !DILocation(line: 267, column: 12, scope: !1098)
!1121 = !DILocation(line: 267, column: 20, scope: !1098)
!1122 = !{!1100, !565, i64 68}
!1123 = !DILocation(line: 268, column: 12, scope: !1098)
!1124 = !DILocation(line: 268, column: 20, scope: !1098)
!1125 = !{!1100, !565, i64 69}
!1126 = !DILocation(line: 270, column: 17, scope: !1127)
!1127 = distinct !DILexicalBlock(scope: !1098, file: !378, line: 270, column: 7)
!1128 = !DILocation(line: 0, scope: !1127)
!1129 = !DILocation(line: 270, column: 7, scope: !1098)
!1130 = !DILocation(line: 277, column: 8, scope: !1131)
!1131 = distinct !DILexicalBlock(scope: !1132, file: !378, line: 277, column: 8)
!1132 = distinct !DILexicalBlock(scope: !1127, file: !378, line: 271, column: 3)
!1133 = !{!1100, !849, i64 16}
!1134 = !DILocation(line: 277, column: 8, scope: !1132)
!1135 = !DILocation(line: 279, column: 9, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1137, file: !378, line: 279, column: 9)
!1137 = distinct !DILexicalBlock(scope: !1131, file: !378, line: 278, column: 4)
!1138 = !DILocation(line: 279, column: 71, scope: !1136)
!1139 = !DILocation(line: 279, column: 9, scope: !1137)
!1140 = !DILocation(line: 281, column: 6, scope: !1141)
!1141 = distinct !DILexicalBlock(scope: !1142, file: !378, line: 281, column: 6)
!1142 = distinct !DILexicalBlock(scope: !1136, file: !378, line: 280, column: 5)
!1143 = !{i64 2148075409}
!1144 = !{i64 2148075460}
!1145 = !DILocation(line: 282, column: 5, scope: !1142)
!1146 = !DILocation(line: 296, column: 4, scope: !1147)
!1147 = distinct !DILexicalBlock(scope: !1127, file: !378, line: 294, column: 3)
!1148 = !DILocation(line: 297, column: 33, scope: !1147)
!1149 = !DILocation(line: 297, column: 4, scope: !1147)
!1150 = !DILocation(line: 300, column: 2, scope: !1084)
!1151 = !DILocation(line: 304, column: 2, scope: !1084)
!1152 = distinct !DISubprogram(name: "xQueueGenericCreate", scope: !378, file: !378, line: 368, type: !1153, scopeLine: 369, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !377, retainedNodes: !1157)
!1153 = !DISubroutineType(types: !1154)
!1154 = !{!1087, !1155, !1155, !1156}
!1155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!1156 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!1157 = !{!1158, !1159, !1160, !1161, !1162, !1163}
!1158 = !DILocalVariable(name: "uxQueueLength", arg: 1, scope: !1152, file: !378, line: 368, type: !1155)
!1159 = !DILocalVariable(name: "uxItemSize", arg: 2, scope: !1152, file: !378, line: 368, type: !1155)
!1160 = !DILocalVariable(name: "ucQueueType", arg: 3, scope: !1152, file: !378, line: 368, type: !1156)
!1161 = !DILocalVariable(name: "pxNewQueue", scope: !1152, file: !378, line: 370, type: !383)
!1162 = !DILocalVariable(name: "xQueueSizeInBytes", scope: !1152, file: !378, line: 371, type: !12)
!1163 = !DILocalVariable(name: "pucQueueStorage", scope: !1152, file: !378, line: 372, type: !6)
!1164 = !DILocation(line: 0, scope: !1152)
!1165 = !DILocation(line: 376, column: 18, scope: !1166)
!1166 = distinct !DILexicalBlock(scope: !1152, file: !378, line: 376, column: 7)
!1167 = !DILocation(line: 376, column: 7, scope: !1152)
!1168 = !DILocation(line: 397, column: 30, scope: !1152)
!1169 = !DILocation(line: 397, column: 16, scope: !1152)
!1170 = !DILocation(line: 399, column: 18, scope: !1171)
!1171 = distinct !DILexicalBlock(scope: !1152, file: !378, line: 399, column: 7)
!1172 = !DILocation(line: 399, column: 7, scope: !1152)
!1173 = !DILocation(line: 404, column: 20, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1171, file: !378, line: 400, column: 3)
!1175 = !DILocation(line: 415, column: 4, scope: !1174)
!1176 = !DILocation(line: 416, column: 3, scope: !1174)
!1177 = !DILocation(line: 423, column: 3, scope: !1152)
!1178 = distinct !DISubprogram(name: "prvInitialiseNewQueue", scope: !378, file: !378, line: 429, type: !1179, scopeLine: 430, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !377, retainedNodes: !1181)
!1179 = !DISubroutineType(types: !1180)
!1180 = !{null, !1155, !1155, !6, !1156, !383}
!1181 = !{!1182, !1183, !1184, !1185, !1186}
!1182 = !DILocalVariable(name: "uxQueueLength", arg: 1, scope: !1178, file: !378, line: 429, type: !1155)
!1183 = !DILocalVariable(name: "uxItemSize", arg: 2, scope: !1178, file: !378, line: 429, type: !1155)
!1184 = !DILocalVariable(name: "pucQueueStorage", arg: 3, scope: !1178, file: !378, line: 429, type: !6)
!1185 = !DILocalVariable(name: "ucQueueType", arg: 4, scope: !1178, file: !378, line: 429, type: !1156)
!1186 = !DILocalVariable(name: "pxNewQueue", arg: 5, scope: !1178, file: !378, line: 429, type: !383)
!1187 = !DILocation(line: 0, scope: !1178)
!1188 = !DILocation(line: 435, column: 17, scope: !1189)
!1189 = distinct !DILexicalBlock(scope: !1178, file: !378, line: 435, column: 6)
!1190 = !DILocation(line: 435, column: 6, scope: !1178)
!1191 = !DILocation(line: 441, column: 22, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1189, file: !378, line: 436, column: 2)
!1193 = !DILocation(line: 442, column: 2, scope: !1192)
!1194 = !DILocation(line: 446, column: 15, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1189, file: !378, line: 444, column: 2)
!1196 = !DILocation(line: 446, column: 22, scope: !1195)
!1197 = !DILocation(line: 451, column: 14, scope: !1178)
!1198 = !DILocation(line: 451, column: 23, scope: !1178)
!1199 = !DILocation(line: 452, column: 14, scope: !1178)
!1200 = !DILocation(line: 452, column: 25, scope: !1178)
!1201 = !DILocation(line: 453, column: 11, scope: !1178)
!1202 = !DILocation(line: 468, column: 1, scope: !1178)
!1203 = distinct !DISubprogram(name: "xQueueCreateMutex", scope: !378, file: !378, line: 503, type: !1204, scopeLine: 504, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !377, retainedNodes: !1206)
!1204 = !DISubroutineType(types: !1205)
!1205 = !{!1087, !1156}
!1206 = !{!1207, !1208, !1209, !1210}
!1207 = !DILocalVariable(name: "ucQueueType", arg: 1, scope: !1203, file: !378, line: 503, type: !1156)
!1208 = !DILocalVariable(name: "xNewQueue", scope: !1203, file: !378, line: 505, type: !1087)
!1209 = !DILocalVariable(name: "uxMutexLength", scope: !1203, file: !378, line: 506, type: !1155)
!1210 = !DILocalVariable(name: "uxMutexSize", scope: !1203, file: !378, line: 506, type: !1155)
!1211 = !DILocation(line: 0, scope: !1203)
!1212 = !DILocation(line: 508, column: 15, scope: !1203)
!1213 = !DILocation(line: 509, column: 3, scope: !1203)
!1214 = !DILocation(line: 511, column: 3, scope: !1203)
!1215 = distinct !DISubprogram(name: "prvInitialiseMutex", scope: !378, file: !378, line: 473, type: !1216, scopeLine: 474, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !377, retainedNodes: !1218)
!1216 = !DISubroutineType(types: !1217)
!1217 = !{null, !383}
!1218 = !{!1219}
!1219 = !DILocalVariable(name: "pxNewQueue", arg: 1, scope: !1215, file: !378, line: 473, type: !383)
!1220 = !DILocation(line: 0, scope: !1215)
!1221 = !DILocation(line: 475, column: 18, scope: !1222)
!1222 = distinct !DILexicalBlock(scope: !1215, file: !378, line: 475, column: 7)
!1223 = !DILocation(line: 475, column: 7, scope: !1215)
!1224 = !DILocation(line: 481, column: 16, scope: !1225)
!1225 = distinct !DILexicalBlock(scope: !1222, file: !378, line: 476, column: 3)
!1226 = !DILocation(line: 481, column: 29, scope: !1225)
!1227 = !DILocation(line: 481, column: 42, scope: !1225)
!1228 = !DILocation(line: 482, column: 16, scope: !1225)
!1229 = !DILocation(line: 482, column: 28, scope: !1225)
!1230 = !DILocation(line: 485, column: 29, scope: !1225)
!1231 = !DILocation(line: 485, column: 50, scope: !1225)
!1232 = !DILocation(line: 490, column: 13, scope: !1225)
!1233 = !DILocation(line: 491, column: 3, scope: !1225)
!1234 = !DILocation(line: 496, column: 2, scope: !1215)
!1235 = distinct !DISubprogram(name: "xQueueGenericSend", scope: !378, file: !378, line: 747, type: !1236, scopeLine: 748, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !377, retainedNodes: !1242)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!51, !1087, !1238, !54, !1241}
!1238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1239)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 32)
!1240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !51)
!1242 = !{!1243, !1244, !1245, !1246, !1247, !1248, !1249, !1255}
!1243 = !DILocalVariable(name: "xQueue", arg: 1, scope: !1235, file: !378, line: 747, type: !1087)
!1244 = !DILocalVariable(name: "pvItemToQueue", arg: 2, scope: !1235, file: !378, line: 747, type: !1238)
!1245 = !DILocalVariable(name: "xTicksToWait", arg: 3, scope: !1235, file: !378, line: 747, type: !54)
!1246 = !DILocalVariable(name: "xCopyPosition", arg: 4, scope: !1235, file: !378, line: 747, type: !1241)
!1247 = !DILocalVariable(name: "xEntryTimeSet", scope: !1235, file: !378, line: 749, type: !51)
!1248 = !DILocalVariable(name: "xYieldRequired", scope: !1235, file: !378, line: 749, type: !51)
!1249 = !DILocalVariable(name: "xTimeOut", scope: !1235, file: !378, line: 750, type: !1250)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "TimeOut_t", file: !63, line: 106, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xTIME_OUT", file: !63, line: 102, size: 64, elements: !1252)
!1252 = !{!1253, !1254}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "xOverflowCount", scope: !1251, file: !63, line: 104, baseType: !51, size: 32)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "xTimeOnEntering", scope: !1251, file: !63, line: 105, baseType: !54, size: 32, offset: 32)
