; ModuleID = 'build/adafruit_feather_m0_basic_proto/subsys/portability/cmsis_rtos_v2/timer_synchronization/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.osTimerAttr_t = type { i8*, i32, i8*, i32 }
%struct.osMessageQueueAttr_t = type { i8*, i32, i8*, i32, i8*, i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.z_poller*, i8*, i16* }
%struct.z_poller = type { i8, i8 }
%struct.k_mem_slab = type { %union.anon, %struct.k_spinlock, i32, i32, i8*, i8*, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type { i32 }
%struct.sam0_eic_data = type { [2 x %struct.sam0_eic_port_data], [16 x %struct.anon.10] }
%struct.sam0_eic_port_data = type { void (i32, i8*)*, i8* }
%struct.anon.10 = type { i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.uart_sam0_dev_cfg = type { %struct.SercomUsart*, i32, i32, i8, i32, i16, void (%struct.device*)*, %struct.pinctrl_dev_config* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/portability/cmsis_rtos_v2/timer_synchronization/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "timer_attr", scope: !27, file: !122, line: 20, type: !147, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !117, globals: !119, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/portability/cmsis_rtos_v2/timer_synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!29 = !{!30, !42, !47}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 195, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/portability/cmsis_os2.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41}
!34 = !DIEnumerator(name: "osOK", value: 0)
!35 = !DIEnumerator(name: "osError", value: -1)
!36 = !DIEnumerator(name: "osErrorTimeout", value: -2)
!37 = !DIEnumerator(name: "osErrorResource", value: -3)
!38 = !DIEnumerator(name: "osErrorParameter", value: -4)
!39 = !DIEnumerator(name: "osErrorNoMemory", value: -5)
!40 = !DIEnumerator(name: "osErrorISR", value: -6)
!41 = !DIEnumerator(name: "osStatusReserved", value: 2147483647)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 164, baseType: !43, size: 32, elements: !44)
!43 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!44 = !{!45, !46}
!45 = !DIEnumerator(name: "osTimerOnce", value: 0)
!46 = !DIEnumerator(name: "osTimerPeriodic", value: 1)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !48, line: 27, baseType: !43, size: 32, elements: !49)
!48 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116}
!50 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!51 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!52 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!53 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!54 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!55 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!56 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!57 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!58 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!59 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!60 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!61 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!62 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!63 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!64 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!65 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!66 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!115 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!116 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!117 = !{!118, !32}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!119 = !{!25, !120, !124, !127, !142}
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "message_id", scope: !27, file: !122, line: 24, type: !123, isLocal: false, isDefinition: true)
!122 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v2/timer_synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "osMessageQueueId_t", file: !31, line: 226, baseType: !118)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "data", scope: !27, file: !122, line: 26, type: !126, isLocal: false, isDefinition: true)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !43)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "mem_attrs", scope: !27, file: !122, line: 30, type: !129, isLocal: true, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "osMessageQueueAttr_t", file: !31, line: 299, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 292, size: 192, elements: !132)
!132 = !{!133, !137, !138, !139, !140, !141}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !31, line: 293, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !131, file: !31, line: 294, baseType: !126, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !131, file: !31, line: 295, baseType: !118, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !131, file: !31, line: 296, baseType: !126, size: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mq_mem", scope: !131, file: !31, line: 297, baseType: !118, size: 32, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mq_size", scope: !131, file: !31, line: 298, baseType: !126, size: 32, offset: 160)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "sample_mem", scope: !27, file: !122, line: 28, type: !144, isLocal: true, isDefinition: true, align: 32)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 32, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 4)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "osTimerAttr_t", file: !31, line: 255, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 250, size: 128, elements: !150)
!150 = !{!151, !152, !153, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !149, file: !31, line: 251, baseType: !134, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !149, file: !31, line: 252, baseType: !126, size: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !149, file: !31, line: 253, baseType: !118, size: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !149, file: !31, line: 254, baseType: !126, size: 32, offset: 96)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "_char_out", scope: !157, file: !161, line: 54, type: !162, isLocal: false, isDefinition: true)
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !117, globals: !160, splitDebugInlining: false, nameTableKind: None)
!158 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!159 = !{!47}
!160 = !{!155}
!161 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DISubroutineType(types: !164)
!164 = !{!32, !32}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !167, file: !905, line: 202, type: !906, isLocal: true, isDefinition: true, align: 32)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !169, globals: !904, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/portability/cmsis_rtos_v2/timer_synchronization")
!169 = !{!118, !32, !170, !298, !635, !636, !703}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !172, line: 335, baseType: !173)
!172 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 320, size: 288, elements: !174)
!174 = !{!175, !188, !198, !212, !223, !234, !238, !249, !250, !261, !262, !277, !278, !288}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !173, file: !172, line: 321, baseType: !176, size: 16)
!176 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !172, line: 50, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 43, size: 16, elements: !179)
!179 = !{!180, !187}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !178, file: !172, line: 48, baseType: !181, size: 16)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !178, file: !172, line: 44, size: 16, elements: !182)
!182 = !{!183, !186}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !181, file: !172, line: 45, baseType: !184, size: 7, flags: DIFlagBitField, extraData: i64 0)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !185)
!185 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !181, file: !172, line: 47, baseType: !184, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !178, file: !172, line: 49, baseType: !184, size: 16)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !173, file: !172, line: 322, baseType: !189, size: 16, offset: 16)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 16, elements: !196)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !191, line: 52, baseType: !192)
!191 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !195)
!195 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!196 = !{!197}
!197 = !DISubrange(count: 2)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !173, file: !172, line: 323, baseType: !199, size: 32, offset: 32)
!199 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !200)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !172, line: 107, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 94, size: 32, elements: !202)
!202 = !{!203, !211}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !201, file: !172, line: 105, baseType: !204, size: 32)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !201, file: !172, line: 95, size: 32, elements: !205)
!205 = !{!206, !207, !208, !209, !210}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !204, file: !172, line: 97, baseType: !126, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !204, file: !172, line: 99, baseType: !126, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !204, file: !172, line: 100, baseType: !126, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !204, file: !172, line: 102, baseType: !126, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !204, file: !172, line: 103, baseType: !126, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !201, file: !172, line: 106, baseType: !126, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !173, file: !172, line: 324, baseType: !213, size: 32, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !172, line: 155, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 148, size: 32, elements: !216)
!216 = !{!217, !222}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !215, file: !172, line: 153, baseType: !218, size: 32)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !215, file: !172, line: 149, size: 32, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !218, file: !172, line: 150, baseType: !126, size: 16, flags: DIFlagBitField, extraData: i64 0)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !218, file: !172, line: 151, baseType: !126, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !215, file: !172, line: 154, baseType: !126, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !173, file: !172, line: 325, baseType: !224, size: 8, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !172, line: 194, baseType: !226)
!226 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 187, size: 8, elements: !227)
!227 = !{!228, !233}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !226, file: !172, line: 192, baseType: !229, size: 8)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !226, file: !172, line: 188, size: 8, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !229, file: !172, line: 189, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !229, file: !172, line: 190, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !226, file: !172, line: 193, baseType: !194, size: 8)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !173, file: !172, line: 326, baseType: !235, size: 24, offset: 104)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 24, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: 3)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !173, file: !172, line: 327, baseType: !239, size: 8, offset: 128)
!239 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !240)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !172, line: 215, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 208, size: 8, elements: !242)
!242 = !{!243, !248}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !241, file: !172, line: 213, baseType: !244, size: 8)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !241, file: !172, line: 209, size: 8, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !244, file: !172, line: 210, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !244, file: !172, line: 211, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !241, file: !172, line: 214, baseType: !194, size: 8)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !173, file: !172, line: 328, baseType: !235, size: 24, offset: 136)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !173, file: !172, line: 329, baseType: !251, size: 8, offset: 160)
!251 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !252)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !172, line: 236, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 229, size: 8, elements: !254)
!254 = !{!255, !260}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !253, file: !172, line: 234, baseType: !256, size: 8)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !253, file: !172, line: 230, size: 8, elements: !257)
!257 = !{!258, !259}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !256, file: !172, line: 231, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !256, file: !172, line: 232, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !253, file: !172, line: 235, baseType: !194, size: 8)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !173, file: !172, line: 330, baseType: !235, size: 24, offset: 168)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !173, file: !172, line: 331, baseType: !263, size: 16, offset: 192)
!263 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !172, line: 262, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 250, size: 16, elements: !266)
!266 = !{!267, !276}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !265, file: !172, line: 260, baseType: !268, size: 16)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !265, file: !172, line: 251, size: 16, elements: !269)
!269 = !{!270, !271, !272, !273, !274, !275}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !268, file: !172, line: 252, baseType: !184, size: 1, flags: DIFlagBitField, extraData: i64 0)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !268, file: !172, line: 253, baseType: !184, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !268, file: !172, line: 254, baseType: !184, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !268, file: !172, line: 255, baseType: !184, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !268, file: !172, line: 256, baseType: !184, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !268, file: !172, line: 258, baseType: !184, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !265, file: !172, line: 261, baseType: !184, size: 16)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !173, file: !172, line: 332, baseType: !189, size: 16, offset: 208)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !173, file: !172, line: 333, baseType: !279, size: 32, offset: 224)
!279 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !172, line: 290, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 284, size: 32, elements: !282)
!282 = !{!283, !287}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !281, file: !172, line: 288, baseType: !284, size: 32)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !281, file: !172, line: 285, size: 32, elements: !285)
!285 = !{!286}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !284, file: !172, line: 286, baseType: !126, size: 22, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !281, file: !172, line: 289, baseType: !126, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !173, file: !172, line: 334, baseType: !289, size: 16, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !290)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !172, line: 308, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 303, size: 16, elements: !292)
!292 = !{!293, !297}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !291, file: !172, line: 306, baseType: !294, size: 16)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !291, file: !172, line: 304, size: 16, elements: !295)
!295 = !{!296}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !294, file: !172, line: 305, baseType: !184, size: 16, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !291, file: !172, line: 307, baseType: !184, size: 16)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !300, line: 928, baseType: !301)
!300 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !300, line: 899, size: 672, elements: !302)
!302 = !{!303, !327, !351, !377, !402, !418, !419, !437, !438, !455, !466, !467, !482, !502, !503, !515, !527, !537, !538, !555, !557, !568, !569, !581, !593, !594, !605, !621}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !301, file: !300, line: 900, baseType: !304, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !300, line: 64, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 43, size: 32, elements: !307)
!307 = !{!308, !326}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !306, file: !300, line: 62, baseType: !309, size: 32)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !306, file: !300, line: 44, size: 32, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !309, file: !300, line: 45, baseType: !126, size: 1, flags: DIFlagBitField, extraData: i64 0)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !309, file: !300, line: 46, baseType: !126, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !309, file: !300, line: 47, baseType: !126, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !309, file: !300, line: 48, baseType: !126, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !309, file: !300, line: 49, baseType: !126, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !309, file: !300, line: 50, baseType: !126, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !309, file: !300, line: 51, baseType: !126, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !309, file: !300, line: 52, baseType: !126, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !309, file: !300, line: 53, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !309, file: !300, line: 54, baseType: !126, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !309, file: !300, line: 55, baseType: !126, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !309, file: !300, line: 56, baseType: !126, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !309, file: !300, line: 58, baseType: !126, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !309, file: !300, line: 59, baseType: !126, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !309, file: !300, line: 60, baseType: !126, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !306, file: !300, line: 63, baseType: !126, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !301, file: !300, line: 901, baseType: !328, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !300, line: 125, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 104, size: 32, elements: !331)
!331 = !{!332, !350}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !330, file: !300, line: 123, baseType: !333, size: 32)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !330, file: !300, line: 105, size: 32, elements: !334)
!334 = !{!335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !333, file: !300, line: 106, baseType: !126, size: 1, flags: DIFlagBitField, extraData: i64 0)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !333, file: !300, line: 107, baseType: !126, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !333, file: !300, line: 108, baseType: !126, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !333, file: !300, line: 109, baseType: !126, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !333, file: !300, line: 110, baseType: !126, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !333, file: !300, line: 111, baseType: !126, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !333, file: !300, line: 112, baseType: !126, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !333, file: !300, line: 113, baseType: !126, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !333, file: !300, line: 114, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !333, file: !300, line: 115, baseType: !126, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !333, file: !300, line: 116, baseType: !126, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !333, file: !300, line: 117, baseType: !126, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !333, file: !300, line: 119, baseType: !126, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !333, file: !300, line: 120, baseType: !126, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !333, file: !300, line: 121, baseType: !126, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !330, file: !300, line: 124, baseType: !126, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !301, file: !300, line: 902, baseType: !352, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !300, line: 186, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 165, size: 32, elements: !355)
!355 = !{!356, !376}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !354, file: !300, line: 184, baseType: !357, size: 32)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !354, file: !300, line: 166, size: 32, elements: !358)
!358 = !{!359, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !357, file: !300, line: 167, baseType: !360, size: 1, flags: DIFlagBitField, extraData: i64 0)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !126)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !357, file: !300, line: 168, baseType: !360, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !357, file: !300, line: 169, baseType: !360, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !357, file: !300, line: 170, baseType: !360, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !357, file: !300, line: 171, baseType: !360, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !357, file: !300, line: 172, baseType: !360, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !357, file: !300, line: 173, baseType: !360, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !357, file: !300, line: 174, baseType: !360, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !357, file: !300, line: 175, baseType: !360, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !357, file: !300, line: 176, baseType: !360, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !357, file: !300, line: 177, baseType: !360, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !357, file: !300, line: 178, baseType: !360, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !357, file: !300, line: 180, baseType: !360, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !357, file: !300, line: 181, baseType: !360, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !357, file: !300, line: 182, baseType: !360, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !354, file: !300, line: 185, baseType: !126, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !301, file: !300, line: 903, baseType: !378, size: 32, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !300, line: 247, baseType: !381)
!381 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 226, size: 32, elements: !382)
!382 = !{!383, !401}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !381, file: !300, line: 245, baseType: !384, size: 32)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !381, file: !300, line: 227, size: 32, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !384, file: !300, line: 228, baseType: !126, size: 1, flags: DIFlagBitField, extraData: i64 0)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !384, file: !300, line: 229, baseType: !126, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !384, file: !300, line: 230, baseType: !126, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !384, file: !300, line: 231, baseType: !126, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !384, file: !300, line: 232, baseType: !126, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !384, file: !300, line: 233, baseType: !126, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !384, file: !300, line: 234, baseType: !126, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !384, file: !300, line: 235, baseType: !126, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !384, file: !300, line: 236, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !384, file: !300, line: 237, baseType: !126, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !384, file: !300, line: 238, baseType: !126, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !384, file: !300, line: 239, baseType: !126, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !384, file: !300, line: 241, baseType: !126, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !384, file: !300, line: 242, baseType: !126, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !384, file: !300, line: 243, baseType: !126, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !381, file: !300, line: 246, baseType: !126, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !301, file: !300, line: 904, baseType: !403, size: 16, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !300, line: 300, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 287, size: 16, elements: !406)
!406 = !{!407, !417}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !405, file: !300, line: 298, baseType: !408, size: 16)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !405, file: !300, line: 288, size: 16, elements: !409)
!409 = !{!410, !411, !412, !413, !414, !415, !416}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !408, file: !300, line: 290, baseType: !184, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !408, file: !300, line: 291, baseType: !184, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !408, file: !300, line: 293, baseType: !184, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !408, file: !300, line: 294, baseType: !184, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !408, file: !300, line: 295, baseType: !184, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !408, file: !300, line: 296, baseType: !184, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !408, file: !300, line: 297, baseType: !184, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !405, file: !300, line: 299, baseType: !184, size: 16)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !301, file: !300, line: 905, baseType: !189, size: 16, offset: 144)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !301, file: !300, line: 906, baseType: !420, size: 16, offset: 160)
!420 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !300, line: 352, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 336, size: 16, elements: !423)
!423 = !{!424, !436}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !422, file: !300, line: 350, baseType: !425, size: 16)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !422, file: !300, line: 337, size: 16, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434, !435}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !425, file: !300, line: 339, baseType: !184, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !425, file: !300, line: 340, baseType: !184, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !425, file: !300, line: 341, baseType: !184, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !425, file: !300, line: 342, baseType: !184, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !425, file: !300, line: 343, baseType: !184, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !425, file: !300, line: 344, baseType: !184, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !425, file: !300, line: 345, baseType: !184, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !425, file: !300, line: 346, baseType: !184, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !425, file: !300, line: 348, baseType: !184, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !422, file: !300, line: 351, baseType: !184, size: 16)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !301, file: !300, line: 907, baseType: !189, size: 16, offset: 176)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !301, file: !300, line: 908, baseType: !439, size: 32, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !300, line: 398, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 381, size: 32, elements: !442)
!442 = !{!443, !454}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !441, file: !300, line: 396, baseType: !444, size: 32)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !441, file: !300, line: 382, size: 32, elements: !445)
!445 = !{!446, !447, !448, !449, !450, !451, !452, !453}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !444, file: !300, line: 384, baseType: !126, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !444, file: !300, line: 385, baseType: !126, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !444, file: !300, line: 386, baseType: !126, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !444, file: !300, line: 388, baseType: !126, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !444, file: !300, line: 389, baseType: !126, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !444, file: !300, line: 390, baseType: !126, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !444, file: !300, line: 392, baseType: !126, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !444, file: !300, line: 394, baseType: !126, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !441, file: !300, line: 397, baseType: !126, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !301, file: !300, line: 909, baseType: !456, size: 8, offset: 224)
!456 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !300, line: 433, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 426, size: 8, elements: !459)
!459 = !{!460, !465}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !458, file: !300, line: 431, baseType: !461, size: 8)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !300, line: 427, size: 8, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !461, file: !300, line: 428, baseType: !194, size: 5, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !461, file: !300, line: 430, baseType: !194, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !458, file: !300, line: 432, baseType: !194, size: 8)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !301, file: !300, line: 910, baseType: !235, size: 24, offset: 232)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !301, file: !300, line: 911, baseType: !468, size: 32, offset: 256)
!468 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !300, line: 462, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 448, size: 32, elements: !471)
!471 = !{!472, !481}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !470, file: !300, line: 460, baseType: !473, size: 32)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !470, file: !300, line: 449, size: 32, elements: !474)
!474 = !{!475, !476, !477, !478, !479, !480}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !473, file: !300, line: 451, baseType: !126, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !473, file: !300, line: 453, baseType: !126, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !473, file: !300, line: 454, baseType: !126, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !473, file: !300, line: 455, baseType: !126, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !473, file: !300, line: 457, baseType: !126, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !473, file: !300, line: 459, baseType: !126, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !470, file: !300, line: 461, baseType: !126, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !301, file: !300, line: 912, baseType: !483, size: 16, offset: 288)
!483 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !300, line: 520, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 503, size: 16, elements: !486)
!486 = !{!487, !501}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !485, file: !300, line: 518, baseType: !488, size: 16)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !485, file: !300, line: 504, size: 16, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !488, file: !300, line: 506, baseType: !184, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !488, file: !300, line: 507, baseType: !184, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !488, file: !300, line: 508, baseType: !184, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !488, file: !300, line: 509, baseType: !184, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !488, file: !300, line: 510, baseType: !184, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !488, file: !300, line: 511, baseType: !184, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !488, file: !300, line: 512, baseType: !184, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !488, file: !300, line: 513, baseType: !184, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !488, file: !300, line: 514, baseType: !184, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !488, file: !300, line: 515, baseType: !184, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !488, file: !300, line: 516, baseType: !184, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !485, file: !300, line: 519, baseType: !184, size: 16)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !301, file: !300, line: 913, baseType: !189, size: 16, offset: 304)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !301, file: !300, line: 914, baseType: !504, size: 32, offset: 320)
!504 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !300, line: 559, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 552, size: 32, elements: !507)
!507 = !{!508, !514}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !506, file: !300, line: 557, baseType: !509, size: 32)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !506, file: !300, line: 553, size: 32, elements: !510)
!510 = !{!511, !512, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !509, file: !300, line: 554, baseType: !126, size: 10, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !509, file: !300, line: 555, baseType: !126, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !509, file: !300, line: 556, baseType: !126, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !506, file: !300, line: 558, baseType: !126, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !301, file: !300, line: 915, baseType: !516, size: 32, offset: 352)
!516 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !300, line: 585, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 578, size: 32, elements: !519)
!519 = !{!520, !526}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !518, file: !300, line: 583, baseType: !521, size: 32)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !518, file: !300, line: 579, size: 32, elements: !522)
!522 = !{!523, !524, !525}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !521, file: !300, line: 580, baseType: !126, size: 16, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !521, file: !300, line: 581, baseType: !126, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !521, file: !300, line: 582, baseType: !126, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !518, file: !300, line: 584, baseType: !126, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !301, file: !300, line: 916, baseType: !528, size: 8, offset: 384)
!528 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !529)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !300, line: 610, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 604, size: 8, elements: !531)
!531 = !{!532, !536}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !530, file: !300, line: 608, baseType: !533, size: 8)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !530, file: !300, line: 605, size: 8, elements: !534)
!534 = !{!535}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !533, file: !300, line: 607, baseType: !194, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !530, file: !300, line: 609, baseType: !194, size: 8)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !301, file: !300, line: 917, baseType: !235, size: 24, offset: 392)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !301, file: !300, line: 918, baseType: !539, size: 32, offset: 416)
!539 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !300, line: 639, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 622, size: 32, elements: !542)
!542 = !{!543, !554}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !541, file: !300, line: 637, baseType: !544, size: 32)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !541, file: !300, line: 623, size: 32, elements: !545)
!545 = !{!546, !547, !548, !549, !550, !551, !552, !553}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !544, file: !300, line: 625, baseType: !126, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !544, file: !300, line: 626, baseType: !126, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !544, file: !300, line: 627, baseType: !126, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !544, file: !300, line: 629, baseType: !126, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !544, file: !300, line: 631, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !544, file: !300, line: 632, baseType: !126, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !544, file: !300, line: 634, baseType: !126, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !544, file: !300, line: 635, baseType: !126, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !541, file: !300, line: 638, baseType: !126, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !301, file: !300, line: 919, baseType: !556, size: 32, offset: 448)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 32, elements: !145)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !301, file: !300, line: 920, baseType: !558, size: 16, offset: 480)
!558 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !300, line: 715, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 706, size: 16, elements: !561)
!561 = !{!562, !567}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !560, file: !300, line: 713, baseType: !563, size: 16)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !300, line: 707, size: 16, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !563, file: !300, line: 709, baseType: !184, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !563, file: !300, line: 711, baseType: !184, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !560, file: !300, line: 714, baseType: !184, size: 16)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !301, file: !300, line: 921, baseType: !189, size: 16, offset: 496)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !301, file: !300, line: 922, baseType: !570, size: 32, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !300, line: 739, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 729, size: 32, elements: !573)
!573 = !{!574, !580}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !572, file: !300, line: 737, baseType: !575, size: 32)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !572, file: !300, line: 730, size: 32, elements: !576)
!576 = !{!577, !578, !579}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !575, file: !300, line: 732, baseType: !126, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !575, file: !300, line: 733, baseType: !126, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !575, file: !300, line: 735, baseType: !126, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !572, file: !300, line: 738, baseType: !126, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !301, file: !300, line: 923, baseType: !582, size: 8, offset: 544)
!582 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !300, line: 765, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 756, size: 8, elements: !585)
!585 = !{!586, !592}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !584, file: !300, line: 763, baseType: !587, size: 8)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !584, file: !300, line: 757, size: 8, elements: !588)
!588 = !{!589, !590, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !587, file: !300, line: 759, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !587, file: !300, line: 761, baseType: !194, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !587, file: !300, line: 762, baseType: !194, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !584, file: !300, line: 764, baseType: !194, size: 8)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !301, file: !300, line: 924, baseType: !235, size: 24, offset: 552)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !301, file: !300, line: 925, baseType: !595, size: 32, offset: 576)
!595 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !300, line: 789, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 781, size: 32, elements: !598)
!598 = !{!599, !604}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !597, file: !300, line: 787, baseType: !600, size: 32)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !597, file: !300, line: 782, size: 32, elements: !601)
!601 = !{!602, !603}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !600, file: !300, line: 783, baseType: !126, size: 12, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !600, file: !300, line: 785, baseType: !126, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !597, file: !300, line: 788, baseType: !126, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !301, file: !300, line: 926, baseType: !606, size: 32, offset: 608)
!606 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !300, line: 820, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 805, size: 32, elements: !609)
!609 = !{!610, !620}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !608, file: !300, line: 818, baseType: !611, size: 32)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !608, file: !300, line: 806, size: 32, elements: !612)
!612 = !{!613, !614, !615, !616, !617, !618, !619}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !611, file: !300, line: 807, baseType: !126, size: 2, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !611, file: !300, line: 808, baseType: !126, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !611, file: !300, line: 809, baseType: !126, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !611, file: !300, line: 810, baseType: !126, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !611, file: !300, line: 812, baseType: !126, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !611, file: !300, line: 814, baseType: !126, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !611, file: !300, line: 816, baseType: !126, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !608, file: !300, line: 819, baseType: !126, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !301, file: !300, line: 927, baseType: !622, size: 8, offset: 640)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !300, line: 881, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !300, line: 872, size: 8, elements: !626)
!626 = !{!627, !634}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !625, file: !300, line: 879, baseType: !628, size: 8)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !625, file: !300, line: 873, size: 8, elements: !629)
!629 = !{!630, !631, !632, !633}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !628, file: !300, line: 874, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !628, file: !300, line: 875, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !628, file: !300, line: 876, baseType: !194, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !628, file: !300, line: 877, baseType: !194, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !625, file: !300, line: 880, baseType: !194, size: 8)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !638, line: 290, baseType: !639)
!638 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !638, line: 284, size: 96, elements: !640)
!640 = !{!641, !651, !662, !675, !692}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !639, file: !638, line: 285, baseType: !642, size: 8)
!642 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !638, line: 49, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !638, line: 43, size: 8, elements: !645)
!645 = !{!646, !650}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !644, file: !638, line: 47, baseType: !647, size: 8)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !644, file: !638, line: 44, size: 8, elements: !648)
!648 = !{!649}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !647, file: !638, line: 45, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !644, file: !638, line: 48, baseType: !194, size: 8)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !639, file: !638, line: 286, baseType: !652, size: 8, offset: 8)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !638, line: 67, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !638, line: 61, size: 8, elements: !656)
!656 = !{!657, !661}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !655, file: !638, line: 65, baseType: !658, size: 8)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !655, file: !638, line: 62, size: 8, elements: !659)
!659 = !{!660}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !658, file: !638, line: 64, baseType: !194, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !655, file: !638, line: 66, baseType: !194, size: 8)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !639, file: !638, line: 287, baseType: !663, size: 16, offset: 16)
!663 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !638, line: 89, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !638, line: 79, size: 16, elements: !666)
!666 = !{!667, !674}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !665, file: !638, line: 87, baseType: !668, size: 16)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !665, file: !638, line: 80, size: 16, elements: !669)
!669 = !{!670, !671, !672, !673}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !668, file: !638, line: 81, baseType: !184, size: 6, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !668, file: !638, line: 83, baseType: !184, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !668, file: !638, line: 85, baseType: !184, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !668, file: !638, line: 86, baseType: !184, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !665, file: !638, line: 88, baseType: !184, size: 16)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !639, file: !638, line: 288, baseType: !676, size: 32, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !638, line: 214, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !638, line: 199, size: 32, elements: !679)
!679 = !{!680, !691}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !678, file: !638, line: 212, baseType: !681, size: 32)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !678, file: !638, line: 200, size: 32, elements: !682)
!682 = !{!683, !684, !685, !686, !687, !688, !689, !690}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !681, file: !638, line: 201, baseType: !126, size: 4, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !681, file: !638, line: 203, baseType: !126, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !681, file: !638, line: 205, baseType: !126, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !681, file: !638, line: 206, baseType: !126, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !681, file: !638, line: 207, baseType: !126, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !681, file: !638, line: 208, baseType: !126, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !681, file: !638, line: 209, baseType: !126, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !681, file: !638, line: 210, baseType: !126, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !678, file: !638, line: 213, baseType: !126, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !639, file: !638, line: 289, baseType: !693, size: 32, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !638, line: 268, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !638, line: 260, size: 32, elements: !696)
!696 = !{!697, !702}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !695, file: !638, line: 266, baseType: !698, size: 32)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !695, file: !638, line: 261, size: 32, elements: !699)
!699 = !{!700, !701}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !698, file: !638, line: 262, baseType: !126, size: 4, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !698, file: !638, line: 264, baseType: !126, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !695, file: !638, line: 267, baseType: !126, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !705, line: 513, baseType: !706)
!705 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !705, line: 494, size: 480, elements: !707)
!707 = !{!708, !714, !724, !728, !738, !748, !758, !768, !772, !788, !804, !820, !850, !854, !864, !874, !884, !888}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !706, file: !705, line: 495, baseType: !709, size: 8)
!709 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !705, line: 45, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !705, line: 43, size: 8, elements: !712)
!712 = !{!713}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !711, file: !705, line: 44, baseType: !194, size: 8)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !706, file: !705, line: 496, baseType: !715, size: 8, offset: 8)
!715 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !705, line: 61, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !705, line: 55, size: 8, elements: !718)
!718 = !{!719, !723}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !717, file: !705, line: 59, baseType: !720, size: 8)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !717, file: !705, line: 56, size: 8, elements: !721)
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !720, file: !705, line: 57, baseType: !194, size: 2, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !717, file: !705, line: 60, baseType: !194, size: 8)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !706, file: !705, line: 497, baseType: !725, size: 48, offset: 16)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 48, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 6)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !706, file: !705, line: 498, baseType: !729, size: 8, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !705, line: 86, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !705, line: 80, size: 8, elements: !732)
!732 = !{!733, !737}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !731, file: !705, line: 84, baseType: !734, size: 8)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !731, file: !705, line: 81, size: 8, elements: !735)
!735 = !{!736}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !734, file: !705, line: 82, baseType: !194, size: 3, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !731, file: !705, line: 85, baseType: !194, size: 8)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !706, file: !705, line: 499, baseType: !739, size: 8, offset: 72)
!739 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !740)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !705, line: 121, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !705, line: 115, size: 8, elements: !742)
!742 = !{!743, !747}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !741, file: !705, line: 119, baseType: !744, size: 8)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !741, file: !705, line: 116, size: 8, elements: !745)
!745 = !{!746}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !744, file: !705, line: 117, baseType: !194, size: 3, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !741, file: !705, line: 120, baseType: !194, size: 8)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !706, file: !705, line: 500, baseType: !749, size: 8, offset: 80)
!749 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !750)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !705, line: 156, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !705, line: 150, size: 8, elements: !752)
!752 = !{!753, !757}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !751, file: !705, line: 154, baseType: !754, size: 8)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !751, file: !705, line: 151, size: 8, elements: !755)
!755 = !{!756}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !754, file: !705, line: 152, baseType: !194, size: 3, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !751, file: !705, line: 155, baseType: !194, size: 8)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !706, file: !705, line: 501, baseType: !759, size: 8, offset: 88)
!759 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !705, line: 191, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !705, line: 185, size: 8, elements: !762)
!762 = !{!763, !767}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !761, file: !705, line: 189, baseType: !764, size: 8)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !761, file: !705, line: 186, size: 8, elements: !765)
!765 = !{!766}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !764, file: !705, line: 187, baseType: !194, size: 3, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !761, file: !705, line: 190, baseType: !194, size: 8)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !706, file: !705, line: 502, baseType: !769, size: 64, offset: 96)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 64, elements: !770)
!770 = !{!771}
!771 = !DISubrange(count: 8)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !706, file: !705, line: 503, baseType: !773, size: 32, offset: 160)
!773 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !705, line: 232, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !705, line: 220, size: 32, elements: !776)
!776 = !{!777, !787}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !775, file: !705, line: 230, baseType: !778, size: 32)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !775, file: !705, line: 221, size: 32, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785, !786}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !778, file: !705, line: 222, baseType: !126, size: 1, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !778, file: !705, line: 223, baseType: !126, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !778, file: !705, line: 224, baseType: !126, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !778, file: !705, line: 225, baseType: !126, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !778, file: !705, line: 226, baseType: !126, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !778, file: !705, line: 227, baseType: !126, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !778, file: !705, line: 228, baseType: !126, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !775, file: !705, line: 231, baseType: !126, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !706, file: !705, line: 504, baseType: !789, size: 32, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !705, line: 268, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !705, line: 256, size: 32, elements: !792)
!792 = !{!793, !803}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !791, file: !705, line: 266, baseType: !794, size: 32)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !791, file: !705, line: 257, size: 32, elements: !795)
!795 = !{!796, !797, !798, !799, !800, !801, !802}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !794, file: !705, line: 258, baseType: !126, size: 1, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !794, file: !705, line: 259, baseType: !126, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !794, file: !705, line: 260, baseType: !126, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !794, file: !705, line: 261, baseType: !126, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !794, file: !705, line: 262, baseType: !126, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_", scope: !794, file: !705, line: 263, baseType: !126, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "EIC_", scope: !794, file: !705, line: 264, baseType: !126, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !791, file: !705, line: 267, baseType: !126, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "APBBMASK", scope: !706, file: !705, line: 505, baseType: !805, size: 32, offset: 224)
!805 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBMASK_Type", file: !705, line: 304, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !705, line: 292, size: 32, elements: !808)
!808 = !{!809, !819}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !807, file: !705, line: 302, baseType: !810, size: 32)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !807, file: !705, line: 293, size: 32, elements: !811)
!811 = !{!812, !813, !814, !815, !816, !817, !818}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "PAC1_", scope: !810, file: !705, line: 294, baseType: !126, size: 1, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !810, file: !705, line: 295, baseType: !126, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !810, file: !705, line: 296, baseType: !126, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "PORT_", scope: !810, file: !705, line: 297, baseType: !126, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !810, file: !705, line: 298, baseType: !126, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !810, file: !705, line: 299, baseType: !126, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "HMATRIX_", scope: !810, file: !705, line: 300, baseType: !126, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !807, file: !705, line: 303, baseType: !126, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "APBCMASK", scope: !706, file: !705, line: 506, baseType: !821, size: 32, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCMASK_Type", file: !705, line: 354, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !705, line: 328, size: 32, elements: !824)
!824 = !{!825, !849}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !823, file: !705, line: 352, baseType: !826, size: 32)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !823, file: !705, line: 329, size: 32, elements: !827)
!827 = !{!828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "PAC2_", scope: !826, file: !705, line: 330, baseType: !126, size: 1, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "EVSYS_", scope: !826, file: !705, line: 331, baseType: !126, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM0_", scope: !826, file: !705, line: 332, baseType: !126, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM1_", scope: !826, file: !705, line: 333, baseType: !126, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM2_", scope: !826, file: !705, line: 334, baseType: !126, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM3_", scope: !826, file: !705, line: 335, baseType: !126, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM4_", scope: !826, file: !705, line: 336, baseType: !126, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM5_", scope: !826, file: !705, line: 337, baseType: !126, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "TCC0_", scope: !826, file: !705, line: 338, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "TCC1_", scope: !826, file: !705, line: 339, baseType: !126, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "TCC2_", scope: !826, file: !705, line: 340, baseType: !126, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "TC3_", scope: !826, file: !705, line: 341, baseType: !126, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "TC4_", scope: !826, file: !705, line: 342, baseType: !126, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "TC5_", scope: !826, file: !705, line: 343, baseType: !126, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "TC6_", scope: !826, file: !705, line: 344, baseType: !126, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "TC7_", scope: !826, file: !705, line: 345, baseType: !126, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_", scope: !826, file: !705, line: 346, baseType: !126, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "AC_", scope: !826, file: !705, line: 347, baseType: !126, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "DAC_", scope: !826, file: !705, line: 348, baseType: !126, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "PTC_", scope: !826, file: !705, line: 349, baseType: !126, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "I2S_", scope: !826, file: !705, line: 350, baseType: !126, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !823, file: !705, line: 353, baseType: !126, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !706, file: !705, line: 507, baseType: !851, size: 128, offset: 288)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 128, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 16)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !706, file: !705, line: 508, baseType: !855, size: 8, offset: 416)
!855 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !856)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENCLR_Type", file: !705, line: 412, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !705, line: 406, size: 8, elements: !858)
!858 = !{!859, !863}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !857, file: !705, line: 410, baseType: !860, size: 8)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !857, file: !705, line: 407, size: 8, elements: !861)
!861 = !{!862}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !860, file: !705, line: 408, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !857, file: !705, line: 411, baseType: !194, size: 8)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !706, file: !705, line: 509, baseType: !865, size: 8, offset: 424)
!865 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENSET_Type", file: !705, line: 430, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !705, line: 424, size: 8, elements: !868)
!868 = !{!869, !873}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !867, file: !705, line: 428, baseType: !870, size: 8)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !867, file: !705, line: 425, size: 8, elements: !871)
!871 = !{!872}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !870, file: !705, line: 426, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !867, file: !705, line: 429, baseType: !194, size: 8)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !706, file: !705, line: 510, baseType: !875, size: 8, offset: 432)
!875 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTFLAG_Type", file: !705, line: 448, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !705, line: 442, size: 8, elements: !878)
!878 = !{!879, !883}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !877, file: !705, line: 446, baseType: !880, size: 8)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !877, file: !705, line: 443, size: 8, elements: !881)
!881 = !{!882}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !880, file: !705, line: 444, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !877, file: !705, line: 447, baseType: !194, size: 8)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !706, file: !705, line: 511, baseType: !885, size: 8, offset: 440)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 8, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 1)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "RCAUSE", scope: !706, file: !705, line: 512, baseType: !889, size: 8, offset: 448)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_RCAUSE_Type", file: !705, line: 472, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !705, line: 460, size: 8, elements: !893)
!893 = !{!894, !903}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !892, file: !705, line: 470, baseType: !895, size: 8)
