; ModuleID = 'build/arduino_mkrzero/subsys/cpp/cpp_synchronization/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.k_spinlock = type { i8 }
%struct._thread_arch = type { i32, i32 }
%class.cpp_semaphore = type { %class.semaphore, %struct.k_sem }
%class.semaphore = type { i32 (...)** }
%struct.k_sem = type { %union.anon, i32, i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/cpp/cpp_synchronization/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/cpp/cpp_synchronization")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/cpp/cpp_synchronization")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "coop_thread", scope: !27, file: !45, line: 40, type: !120, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_11, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !29, globals: !105, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/cpp/cpp_synchronization/src/main.cpp", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/cpp/cpp_synchronization")
!29 = !{!30, !34, !40, !42, !44, !48}
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !31, line: 46, baseType: !32)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !33)
!33 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !35, line: 46, baseType: !36)
!35 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 32)
!37 = !DISubroutineType(types: !38)
!38 = !{null, !39, !39, !39}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !41)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !43)
!43 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!44 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "cpp_semaphore", file: !45, line: 50, size: 160, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !46, vtableHolder: !48)
!45 = !DIFile(filename: "zephyr/samples/subsys/cpp/cpp_synchronization/src/main.cpp", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!46 = !{!47, !66, !93, !97, !98, !101, !104}
!47 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !44, baseType: !48, flags: DIFlagPublic, extraData: i32 0)
!48 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "semaphore", file: !45, line: 29, size: 32, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !49, vtableHolder: !48, identifier: "_ZTS9semaphore")
!49 = !{!50, !56, !60, !63}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_vptr$semaphore", scope: !45, file: !45, baseType: !51, size: 32, flags: DIFlagArtificial)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "__vtbl_ptr_type", baseType: !53, size: 32)
!53 = !DISubroutineType(types: !54)
!54 = !{!55}
!55 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!56 = !DISubprogram(name: "wait", linkageName: "_ZN9semaphore4waitEv", scope: !48, file: !45, line: 31, type: !57, scopeLine: 31, containingType: !48, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!57 = !DISubroutineType(types: !58)
!58 = !{!55, !59}
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!60 = !DISubprogram(name: "wait", linkageName: "_ZN9semaphore4waitEi", scope: !48, file: !45, line: 32, type: !61, scopeLine: 32, containingType: !48, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!61 = !DISubroutineType(types: !62)
!62 = !{!55, !59, !55}
!63 = !DISubprogram(name: "give", linkageName: "_ZN9semaphore4giveEv", scope: !48, file: !45, line: 33, type: !64, scopeLine: 33, containingType: !48, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagPureVirtual | DISPFlagOptimized)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !59}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_sema_internal", scope: !44, file: !45, line: 52, baseType: !67, size: 128, offset: 32, flags: DIFlagProtected)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !68, line: 2909, size: 128, flags: DIFlagTypePassByValue, elements: !69, identifier: "_ZTS5k_sem")
!68 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!69 = !{!70, !91, !92}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !67, file: !68, line: 2910, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !72, line: 233, baseType: !73)
!72 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !72, line: 231, size: 64, flags: DIFlagTypePassByValue, elements: !74, identifier: "_ZTS9_wait_q_t")
!74 = !{!75}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !73, file: !72, line: 232, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !77, line: 48, baseType: !78)
!77 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !77, line: 37, size: 64, flags: DIFlagTypePassByValue, elements: !79, identifier: "_ZTS6_dnode")
!79 = !{!80, !86}
!80 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !77, line: 38, baseType: !81, size: 32)
!81 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !77, line: 38, size: 32, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !82, identifier: "_ZTSN6_dnodeUt_E")
!82 = !{!83, !85}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !81, file: !77, line: 39, baseType: !84, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !81, file: !77, line: 40, baseType: !84, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, scope: !78, file: !77, line: 42, baseType: !87, size: 32, offset: 32)
!87 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !78, file: !77, line: 42, size: 32, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !88, identifier: "_ZTSN6_dnodeUt0_E")
!88 = !{!89, !90}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !87, file: !77, line: 43, baseType: !84, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !87, file: !77, line: 44, baseType: !84, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !67, file: !68, line: 2911, baseType: !41, size: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !67, file: !68, line: 2912, baseType: !41, size: 32, offset: 96)
!93 = !DISubprogram(name: "cpp_semaphore", scope: !44, file: !45, line: 54, type: !94, scopeLine: 54, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !96}
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32, flags: DIFlagArtificial | DIFlagObjectPointer)
!97 = !DISubprogram(name: "~cpp_semaphore", scope: !44, file: !45, line: 55, type: !94, scopeLine: 55, containingType: !44, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!98 = !DISubprogram(name: "wait", linkageName: "_ZN13cpp_semaphore4waitEv", scope: !44, file: !45, line: 56, type: !99, scopeLine: 56, containingType: !44, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!99 = !DISubroutineType(types: !100)
!100 = !{!55, !96}
!101 = !DISubprogram(name: "wait", linkageName: "_ZN13cpp_semaphore4waitEi", scope: !44, file: !45, line: 57, type: !102, scopeLine: 57, containingType: !44, virtualIndex: 1, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!102 = !DISubroutineType(types: !103)
!103 = !{!55, !96, !55}
!104 = !DISubprogram(name: "give", linkageName: "_ZN13cpp_semaphore4giveEv", scope: !44, file: !45, line: 58, type: !94, scopeLine: 58, containingType: !44, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagVirtual | DISPFlagOptimized)
!105 = !{!25, !106, !116, !118}
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "coop_stack", scope: !27, file: !45, line: 41, type: !108, isLocal: false, isDefinition: true, align: 64)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 16000, elements: !114)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !110, line: 47, size: 8, flags: DIFlagTypePassByValue, elements: !111, identifier: "_ZTS22z_thread_stack_element")
!110 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !110, line: 48, baseType: !113, size: 8)
!113 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!114 = !{!115}
!115 = !DISubrange(count: 2000)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "sem_main", scope: !27, file: !45, line: 110, type: !44, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "sem_coop", scope: !27, file: !45, line: 111, type: !44, isLocal: false, isDefinition: true)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !121, line: 245, size: 896, flags: DIFlagTypePassByValue, elements: !122, identifier: "_ZTS8k_thread")
!121 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !{!123, !172, !185, !186, !187, !188, !191}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !120, file: !121, line: 247, baseType: !124, size: 384)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !121, line: 57, size: 384, flags: DIFlagTypePassByValue, elements: !125, identifier: "_ZTS12_thread_base")
!125 = !{!126, !140, !142, !145, !146, !159, !160, !161}
!126 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !121, line: 60, baseType: !127, size: 64)
!127 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !121, line: 60, size: 64, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !128, identifier: "_ZTSN12_thread_baseUt_E")
!128 = !{!129, !131}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !127, file: !121, line: 61, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !77, line: 49, baseType: !78)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !127, file: !121, line: 62, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !133, line: 49, size: 64, flags: DIFlagTypePassByValue, elements: !134, identifier: "_ZTS6rbnode")
!133 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!134 = !{!135}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !132, file: !133, line: 50, baseType: !136, size: 64)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 64, elements: !138)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!138 = !{!139}
!139 = !DISubrange(count: 2)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !124, file: !121, line: 68, baseType: !141, size: 32, offset: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 32)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !124, file: !121, line: 71, baseType: !143, size: 8, offset: 96)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !144)
!144 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !124, file: !121, line: 74, baseType: !143, size: 8, offset: 104)
!146 = !DIDerivedType(tag: DW_TAG_member, scope: !124, file: !121, line: 90, baseType: !147, size: 16, offset: 112)
!147 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !124, file: !121, line: 90, size: 16, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !148, identifier: "_ZTSN12_thread_baseUt0_E")
!148 = !{!149, !156}
!149 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !121, line: 91, baseType: !150, size: 16)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !147, file: !121, line: 91, size: 16, flags: DIFlagExportSymbols | DIFlagTypePassByValue, elements: !151, identifier: "_ZTSN12_thread_baseUt0_Ut_E")
!151 = !{!152, !155}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !150, file: !121, line: 96, baseType: !153, size: 8)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !154)
!154 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !150, file: !121, line: 97, baseType: !143, size: 8, offset: 8)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !147, file: !121, line: 100, baseType: !157, size: 16)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !158)
!158 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !124, file: !121, line: 107, baseType: !40, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !124, file: !121, line: 127, baseType: !39, size: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !124, file: !121, line: 131, baseType: !162, size: 192, offset: 192)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !72, line: 244, size: 192, flags: DIFlagTypePassByValue, elements: !163, identifier: "_ZTS8_timeout")
!163 = !{!164, !165, !171}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !162, file: !72, line: 245, baseType: !130, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !162, file: !72, line: 246, baseType: !166, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !72, line: 242, baseType: !167)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DISubroutineType(types: !169)
!169 = !{null, !170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !162, file: !72, line: 249, baseType: !32, size: 64, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !120, file: !121, line: 250, baseType: !173, size: 288, offset: 384)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !174, line: 25, size: 288, flags: DIFlagTypePassByValue, elements: !175, identifier: "_ZTS13_callee_saved")
!174 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!175 = !{!176, !177, !178, !179, !180, !181, !182, !183, !184}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !173, file: !174, line: 26, baseType: !40, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !173, file: !174, line: 27, baseType: !40, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !173, file: !174, line: 28, baseType: !40, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !173, file: !174, line: 29, baseType: !40, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !173, file: !174, line: 30, baseType: !40, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !173, file: !174, line: 31, baseType: !40, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !173, file: !174, line: 32, baseType: !40, size: 32, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !173, file: !174, line: 33, baseType: !40, size: 32, offset: 224)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !173, file: !174, line: 34, baseType: !40, size: 32, offset: 256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !120, file: !121, line: 253, baseType: !39, size: 32, offset: 672)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !120, file: !121, line: 256, baseType: !71, size: 64, offset: 704)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !120, file: !121, line: 294, baseType: !55, size: 32, offset: 768)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !120, file: !121, line: 325, baseType: !189, size: 32, offset: 800)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !68, line: 5073, size: 192, flags: DIFlagFwdDecl, identifier: "_ZTS6k_heap")
!191 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !120, file: !121, line: 343, baseType: !192, size: 64, offset: 832)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !174, line: 60, size: 64, flags: DIFlagTypePassByValue, elements: !193, identifier: "_ZTS12_thread_arch")
!193 = !{!194, !195}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !192, file: !174, line: 63, baseType: !40, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !192, file: !174, line: 66, baseType: !40, size: 32, offset: 32)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "_char_out", scope: !198, file: !273, line: 54, type: !274, isLocal: false, isDefinition: true)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, retainedTypes: !271, globals: !272, splitDebugInlining: false, nameTableKind: None)
!199 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/cpp/cpp_synchronization")
!200 = !{!201}
!201 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !202, line: 27, baseType: !41, size: 32, elements: !203)
!202 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!203 = !{!204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270}
!204 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!205 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!206 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!207 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!208 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!209 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!210 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!211 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!212 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!213 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!214 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!215 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!216 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!217 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!218 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!219 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!220 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!221 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!222 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!223 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!224 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!225 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!226 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!227 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!228 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!229 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!230 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!231 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!232 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!233 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!234 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!235 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!236 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!237 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!238 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!239 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!240 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!241 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!242 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!243 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!244 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!245 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!246 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!247 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!248 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!249 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!250 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!251 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!252 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!253 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!254 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!255 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!256 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!257 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!258 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!259 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!260 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!261 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!262 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!263 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!264 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!265 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!266 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!267 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!268 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!269 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!270 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!271 = !{!39, !55}
!272 = !{!196}
!273 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DISubroutineType(types: !276)
!276 = !{!55, !55}
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !279, file: !1013, line: 202, type: !1014, isLocal: true, isDefinition: true, align: 32)
!279 = distinct !DICompileUnit(language: DW_LANG_C99, file: !280, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !200, retainedTypes: !281, globals: !1012, splitDebugInlining: false, nameTableKind: None)
!280 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/subsys/cpp/cpp_synchronization")
!281 = !{!39, !55, !282, !404, !743, !744, !811}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !284, line: 335, baseType: !285)
!284 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !284, line: 320, size: 288, elements: !286)
!286 = !{!287, !298, !304, !318, !329, !340, !344, !355, !356, !367, !368, !383, !384, !394}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !285, file: !284, line: 321, baseType: !288, size: 16)
!288 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !284, line: 50, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !284, line: 43, size: 16, elements: !291)
!291 = !{!292, !297}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !290, file: !284, line: 48, baseType: !293, size: 16)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !290, file: !284, line: 44, size: 16, elements: !294)
!294 = !{!295, !296}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !293, file: !284, line: 45, baseType: !157, size: 7, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !293, file: !284, line: 47, baseType: !157, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !290, file: !284, line: 49, baseType: !157, size: 16)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !285, file: !284, line: 322, baseType: !299, size: 16, offset: 16)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 16, elements: !138)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !301, line: 52, baseType: !302)
!301 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!302 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !143)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !285, file: !284, line: 323, baseType: !305, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !284, line: 107, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !284, line: 94, size: 32, elements: !308)
!308 = !{!309, !317}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !307, file: !284, line: 105, baseType: !310, size: 32)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !307, file: !284, line: 95, size: 32, elements: !311)
!311 = !{!312, !313, !314, !315, !316}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !310, file: !284, line: 97, baseType: !40, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !310, file: !284, line: 99, baseType: !40, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !310, file: !284, line: 100, baseType: !40, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !310, file: !284, line: 102, baseType: !40, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !310, file: !284, line: 103, baseType: !40, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !307, file: !284, line: 106, baseType: !40, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !285, file: !284, line: 324, baseType: !319, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !284, line: 155, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !284, line: 148, size: 32, elements: !322)
!322 = !{!323, !328}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !321, file: !284, line: 153, baseType: !324, size: 32)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !321, file: !284, line: 149, size: 32, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !324, file: !284, line: 150, baseType: !40, size: 16, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !324, file: !284, line: 151, baseType: !40, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !321, file: !284, line: 154, baseType: !40, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !285, file: !284, line: 325, baseType: !330, size: 8, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !284, line: 194, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !284, line: 187, size: 8, elements: !333)
!333 = !{!334, !339}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !332, file: !284, line: 192, baseType: !335, size: 8)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !332, file: !284, line: 188, size: 8, elements: !336)
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !335, file: !284, line: 189, baseType: !143, size: 1, flags: DIFlagBitField, extraData: i64 0)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !335, file: !284, line: 190, baseType: !143, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !332, file: !284, line: 193, baseType: !143, size: 8)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !285, file: !284, line: 326, baseType: !341, size: 24, offset: 104)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 24, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 3)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !285, file: !284, line: 327, baseType: !345, size: 8, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !284, line: 215, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !284, line: 208, size: 8, elements: !348)
!348 = !{!349, !354}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !347, file: !284, line: 213, baseType: !350, size: 8)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !347, file: !284, line: 209, size: 8, elements: !351)
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !350, file: !284, line: 210, baseType: !143, size: 1, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !350, file: !284, line: 211, baseType: !143, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !347, file: !284, line: 214, baseType: !143, size: 8)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !285, file: !284, line: 328, baseType: !341, size: 24, offset: 136)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !285, file: !284, line: 329, baseType: !357, size: 8, offset: 160)
!357 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !284, line: 236, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !284, line: 229, size: 8, elements: !360)
!360 = !{!361, !366}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !359, file: !284, line: 234, baseType: !362, size: 8)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !359, file: !284, line: 230, size: 8, elements: !363)
!363 = !{!364, !365}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !362, file: !284, line: 231, baseType: !302, size: 1, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !362, file: !284, line: 232, baseType: !302, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !359, file: !284, line: 235, baseType: !143, size: 8)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !285, file: !284, line: 330, baseType: !341, size: 24, offset: 168)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !285, file: !284, line: 331, baseType: !369, size: 16, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !284, line: 262, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !284, line: 250, size: 16, elements: !372)
!372 = !{!373, !382}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !371, file: !284, line: 260, baseType: !374, size: 16)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !371, file: !284, line: 251, size: 16, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !381}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !374, file: !284, line: 252, baseType: !157, size: 1, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !374, file: !284, line: 253, baseType: !157, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !374, file: !284, line: 254, baseType: !157, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !374, file: !284, line: 255, baseType: !157, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !374, file: !284, line: 256, baseType: !157, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !374, file: !284, line: 258, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !371, file: !284, line: 261, baseType: !157, size: 16)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !285, file: !284, line: 332, baseType: !299, size: 16, offset: 208)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !285, file: !284, line: 333, baseType: !385, size: 32, offset: 224)
!385 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !386)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !284, line: 290, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !284, line: 284, size: 32, elements: !388)
!388 = !{!389, !393}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !387, file: !284, line: 288, baseType: !390, size: 32)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !387, file: !284, line: 285, size: 32, elements: !391)
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !390, file: !284, line: 286, baseType: !40, size: 22, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !387, file: !284, line: 289, baseType: !40, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !285, file: !284, line: 334, baseType: !395, size: 16, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !284, line: 308, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !284, line: 303, size: 16, elements: !398)
!398 = !{!399, !403}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !397, file: !284, line: 306, baseType: !400, size: 16)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !397, file: !284, line: 304, size: 16, elements: !401)
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !400, file: !284, line: 305, baseType: !157, size: 16, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !397, file: !284, line: 307, baseType: !157, size: 16)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !406, line: 928, baseType: !407)
!406 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !406, line: 899, size: 672, elements: !408)
!408 = !{!409, !433, !457, !483, !508, !524, !525, !543, !544, !561, !572, !573, !588, !608, !609, !621, !633, !643, !644, !661, !665, !676, !677, !689, !701, !702, !713, !729}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !407, file: !406, line: 900, baseType: !410, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !411)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !406, line: 64, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 43, size: 32, elements: !413)
!413 = !{!414, !432}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !412, file: !406, line: 62, baseType: !415, size: 32)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !412, file: !406, line: 44, size: 32, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !415, file: !406, line: 45, baseType: !40, size: 1, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !415, file: !406, line: 46, baseType: !40, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !415, file: !406, line: 47, baseType: !40, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !415, file: !406, line: 48, baseType: !40, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !415, file: !406, line: 49, baseType: !40, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !415, file: !406, line: 50, baseType: !40, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !415, file: !406, line: 51, baseType: !40, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !415, file: !406, line: 52, baseType: !40, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !415, file: !406, line: 53, baseType: !40, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !415, file: !406, line: 54, baseType: !40, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !415, file: !406, line: 55, baseType: !40, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !415, file: !406, line: 56, baseType: !40, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !415, file: !406, line: 58, baseType: !40, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !415, file: !406, line: 59, baseType: !40, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !415, file: !406, line: 60, baseType: !40, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !412, file: !406, line: 63, baseType: !40, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !407, file: !406, line: 901, baseType: !434, size: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !406, line: 125, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 104, size: 32, elements: !437)
!437 = !{!438, !456}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !436, file: !406, line: 123, baseType: !439, size: 32)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !436, file: !406, line: 105, size: 32, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !439, file: !406, line: 106, baseType: !40, size: 1, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !439, file: !406, line: 107, baseType: !40, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !439, file: !406, line: 108, baseType: !40, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !439, file: !406, line: 109, baseType: !40, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !439, file: !406, line: 110, baseType: !40, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !439, file: !406, line: 111, baseType: !40, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !439, file: !406, line: 112, baseType: !40, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !439, file: !406, line: 113, baseType: !40, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !439, file: !406, line: 114, baseType: !40, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !439, file: !406, line: 115, baseType: !40, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !439, file: !406, line: 116, baseType: !40, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !439, file: !406, line: 117, baseType: !40, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !439, file: !406, line: 119, baseType: !40, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !439, file: !406, line: 120, baseType: !40, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !439, file: !406, line: 121, baseType: !40, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !436, file: !406, line: 124, baseType: !40, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !407, file: !406, line: 902, baseType: !458, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !406, line: 186, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 165, size: 32, elements: !461)
!461 = !{!462, !482}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !460, file: !406, line: 184, baseType: !463, size: 32)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !460, file: !406, line: 166, size: 32, elements: !464)
!464 = !{!465, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !463, file: !406, line: 167, baseType: !466, size: 1, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !40)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !463, file: !406, line: 168, baseType: !466, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !463, file: !406, line: 169, baseType: !466, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !463, file: !406, line: 170, baseType: !466, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !463, file: !406, line: 171, baseType: !466, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !463, file: !406, line: 172, baseType: !466, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !463, file: !406, line: 173, baseType: !466, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !463, file: !406, line: 174, baseType: !466, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !463, file: !406, line: 175, baseType: !466, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !463, file: !406, line: 176, baseType: !466, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !463, file: !406, line: 177, baseType: !466, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !463, file: !406, line: 178, baseType: !466, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !463, file: !406, line: 180, baseType: !466, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !463, file: !406, line: 181, baseType: !466, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !463, file: !406, line: 182, baseType: !466, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !460, file: !406, line: 185, baseType: !40, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !407, file: !406, line: 903, baseType: !484, size: 32, offset: 96)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !406, line: 247, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 226, size: 32, elements: !488)
!488 = !{!489, !507}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !487, file: !406, line: 245, baseType: !490, size: 32)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !487, file: !406, line: 227, size: 32, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !490, file: !406, line: 228, baseType: !40, size: 1, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !490, file: !406, line: 229, baseType: !40, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !490, file: !406, line: 230, baseType: !40, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !490, file: !406, line: 231, baseType: !40, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !490, file: !406, line: 232, baseType: !40, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !490, file: !406, line: 233, baseType: !40, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !490, file: !406, line: 234, baseType: !40, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !490, file: !406, line: 235, baseType: !40, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !490, file: !406, line: 236, baseType: !40, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !490, file: !406, line: 237, baseType: !40, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !490, file: !406, line: 238, baseType: !40, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !490, file: !406, line: 239, baseType: !40, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !490, file: !406, line: 241, baseType: !40, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !490, file: !406, line: 242, baseType: !40, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !490, file: !406, line: 243, baseType: !40, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !487, file: !406, line: 246, baseType: !40, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !407, file: !406, line: 904, baseType: !509, size: 16, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !406, line: 300, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 287, size: 16, elements: !512)
!512 = !{!513, !523}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !511, file: !406, line: 298, baseType: !514, size: 16)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !511, file: !406, line: 288, size: 16, elements: !515)
!515 = !{!516, !517, !518, !519, !520, !521, !522}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !514, file: !406, line: 290, baseType: !157, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !514, file: !406, line: 291, baseType: !157, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !514, file: !406, line: 293, baseType: !157, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !514, file: !406, line: 294, baseType: !157, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !514, file: !406, line: 295, baseType: !157, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !514, file: !406, line: 296, baseType: !157, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !514, file: !406, line: 297, baseType: !157, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !511, file: !406, line: 299, baseType: !157, size: 16)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !407, file: !406, line: 905, baseType: !299, size: 16, offset: 144)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !407, file: !406, line: 906, baseType: !526, size: 16, offset: 160)
!526 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !406, line: 352, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 336, size: 16, elements: !529)
!529 = !{!530, !542}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !528, file: !406, line: 350, baseType: !531, size: 16)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !528, file: !406, line: 337, size: 16, elements: !532)
!532 = !{!533, !534, !535, !536, !537, !538, !539, !540, !541}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !531, file: !406, line: 339, baseType: !157, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !531, file: !406, line: 340, baseType: !157, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !531, file: !406, line: 341, baseType: !157, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !531, file: !406, line: 342, baseType: !157, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !531, file: !406, line: 343, baseType: !157, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !531, file: !406, line: 344, baseType: !157, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !531, file: !406, line: 345, baseType: !157, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !531, file: !406, line: 346, baseType: !157, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !531, file: !406, line: 348, baseType: !157, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !528, file: !406, line: 351, baseType: !157, size: 16)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !407, file: !406, line: 907, baseType: !299, size: 16, offset: 176)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !407, file: !406, line: 908, baseType: !545, size: 32, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !406, line: 398, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 381, size: 32, elements: !548)
!548 = !{!549, !560}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !547, file: !406, line: 396, baseType: !550, size: 32)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !547, file: !406, line: 382, size: 32, elements: !551)
!551 = !{!552, !553, !554, !555, !556, !557, !558, !559}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !550, file: !406, line: 384, baseType: !40, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !550, file: !406, line: 385, baseType: !40, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !550, file: !406, line: 386, baseType: !40, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !550, file: !406, line: 388, baseType: !40, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !550, file: !406, line: 389, baseType: !40, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !550, file: !406, line: 390, baseType: !40, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !550, file: !406, line: 392, baseType: !40, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !550, file: !406, line: 394, baseType: !40, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !547, file: !406, line: 397, baseType: !40, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !407, file: !406, line: 909, baseType: !562, size: 8, offset: 224)
!562 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !406, line: 433, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 426, size: 8, elements: !565)
!565 = !{!566, !571}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !564, file: !406, line: 431, baseType: !567, size: 8)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !564, file: !406, line: 427, size: 8, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !567, file: !406, line: 428, baseType: !143, size: 5, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !567, file: !406, line: 430, baseType: !143, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !564, file: !406, line: 432, baseType: !143, size: 8)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !407, file: !406, line: 910, baseType: !341, size: 24, offset: 232)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !407, file: !406, line: 911, baseType: !574, size: 32, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !406, line: 462, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 448, size: 32, elements: !577)
!577 = !{!578, !587}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !576, file: !406, line: 460, baseType: !579, size: 32)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !576, file: !406, line: 449, size: 32, elements: !580)
!580 = !{!581, !582, !583, !584, !585, !586}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !579, file: !406, line: 451, baseType: !40, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !579, file: !406, line: 453, baseType: !40, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !579, file: !406, line: 454, baseType: !40, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !579, file: !406, line: 455, baseType: !40, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !579, file: !406, line: 457, baseType: !40, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !579, file: !406, line: 459, baseType: !40, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !576, file: !406, line: 461, baseType: !40, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !407, file: !406, line: 912, baseType: !589, size: 16, offset: 288)
!589 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !406, line: 520, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 503, size: 16, elements: !592)
!592 = !{!593, !607}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !591, file: !406, line: 518, baseType: !594, size: 16)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !591, file: !406, line: 504, size: 16, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !594, file: !406, line: 506, baseType: !157, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !594, file: !406, line: 507, baseType: !157, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !594, file: !406, line: 508, baseType: !157, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !594, file: !406, line: 509, baseType: !157, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !594, file: !406, line: 510, baseType: !157, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !594, file: !406, line: 511, baseType: !157, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !594, file: !406, line: 512, baseType: !157, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !594, file: !406, line: 513, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !594, file: !406, line: 514, baseType: !157, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !594, file: !406, line: 515, baseType: !157, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !594, file: !406, line: 516, baseType: !157, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !591, file: !406, line: 519, baseType: !157, size: 16)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !407, file: !406, line: 913, baseType: !299, size: 16, offset: 304)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !407, file: !406, line: 914, baseType: !610, size: 32, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !406, line: 559, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 552, size: 32, elements: !613)
!613 = !{!614, !620}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !612, file: !406, line: 557, baseType: !615, size: 32)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !612, file: !406, line: 553, size: 32, elements: !616)
!616 = !{!617, !618, !619}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !615, file: !406, line: 554, baseType: !40, size: 10, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !615, file: !406, line: 555, baseType: !40, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !615, file: !406, line: 556, baseType: !40, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !612, file: !406, line: 558, baseType: !40, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !407, file: !406, line: 915, baseType: !622, size: 32, offset: 352)
!622 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !406, line: 585, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 578, size: 32, elements: !625)
!625 = !{!626, !632}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !624, file: !406, line: 583, baseType: !627, size: 32)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !624, file: !406, line: 579, size: 32, elements: !628)
!628 = !{!629, !630, !631}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !627, file: !406, line: 580, baseType: !40, size: 16, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !627, file: !406, line: 581, baseType: !40, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !627, file: !406, line: 582, baseType: !40, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !624, file: !406, line: 584, baseType: !40, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !407, file: !406, line: 916, baseType: !634, size: 8, offset: 384)
!634 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !406, line: 610, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 604, size: 8, elements: !637)
!637 = !{!638, !642}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !636, file: !406, line: 608, baseType: !639, size: 8)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !636, file: !406, line: 605, size: 8, elements: !640)
!640 = !{!641}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !639, file: !406, line: 607, baseType: !143, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !636, file: !406, line: 609, baseType: !143, size: 8)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !407, file: !406, line: 917, baseType: !341, size: 24, offset: 392)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !407, file: !406, line: 918, baseType: !645, size: 32, offset: 416)
!645 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !406, line: 639, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 622, size: 32, elements: !648)
!648 = !{!649, !660}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !647, file: !406, line: 637, baseType: !650, size: 32)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !647, file: !406, line: 623, size: 32, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !657, !658, !659}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !650, file: !406, line: 625, baseType: !40, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !650, file: !406, line: 626, baseType: !40, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !650, file: !406, line: 627, baseType: !40, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !650, file: !406, line: 629, baseType: !40, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !650, file: !406, line: 631, baseType: !40, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !650, file: !406, line: 632, baseType: !40, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !650, file: !406, line: 634, baseType: !40, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !650, file: !406, line: 635, baseType: !40, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !647, file: !406, line: 638, baseType: !40, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !407, file: !406, line: 919, baseType: !662, size: 32, offset: 448)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 32, elements: !663)
!663 = !{!664}
!664 = !DISubrange(count: 4)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !407, file: !406, line: 920, baseType: !666, size: 16, offset: 480)
!666 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !406, line: 715, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 706, size: 16, elements: !669)
!669 = !{!670, !675}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !668, file: !406, line: 713, baseType: !671, size: 16)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !668, file: !406, line: 707, size: 16, elements: !672)
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !671, file: !406, line: 709, baseType: !157, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !671, file: !406, line: 711, baseType: !157, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !668, file: !406, line: 714, baseType: !157, size: 16)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !407, file: !406, line: 921, baseType: !299, size: 16, offset: 496)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !407, file: !406, line: 922, baseType: !678, size: 32, offset: 512)
!678 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !406, line: 739, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 729, size: 32, elements: !681)
!681 = !{!682, !688}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !680, file: !406, line: 737, baseType: !683, size: 32)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !680, file: !406, line: 730, size: 32, elements: !684)
!684 = !{!685, !686, !687}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !683, file: !406, line: 732, baseType: !40, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !683, file: !406, line: 733, baseType: !40, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !683, file: !406, line: 735, baseType: !40, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !680, file: !406, line: 738, baseType: !40, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !407, file: !406, line: 923, baseType: !690, size: 8, offset: 544)
!690 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !406, line: 765, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 756, size: 8, elements: !693)
!693 = !{!694, !700}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !692, file: !406, line: 763, baseType: !695, size: 8)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !692, file: !406, line: 757, size: 8, elements: !696)
!696 = !{!697, !698, !699}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !695, file: !406, line: 759, baseType: !143, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !695, file: !406, line: 761, baseType: !143, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !695, file: !406, line: 762, baseType: !143, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !692, file: !406, line: 764, baseType: !143, size: 8)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !407, file: !406, line: 924, baseType: !341, size: 24, offset: 552)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !407, file: !406, line: 925, baseType: !703, size: 32, offset: 576)
!703 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !406, line: 789, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 781, size: 32, elements: !706)
!706 = !{!707, !712}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !705, file: !406, line: 787, baseType: !708, size: 32)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !705, file: !406, line: 782, size: 32, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !708, file: !406, line: 783, baseType: !40, size: 12, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !708, file: !406, line: 785, baseType: !40, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !705, file: !406, line: 788, baseType: !40, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !407, file: !406, line: 926, baseType: !714, size: 32, offset: 608)
!714 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !715)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !406, line: 820, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 805, size: 32, elements: !717)
!717 = !{!718, !728}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !716, file: !406, line: 818, baseType: !719, size: 32)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !716, file: !406, line: 806, size: 32, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726, !727}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !719, file: !406, line: 807, baseType: !40, size: 2, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !719, file: !406, line: 808, baseType: !40, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !719, file: !406, line: 809, baseType: !40, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !719, file: !406, line: 810, baseType: !40, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !719, file: !406, line: 812, baseType: !40, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !719, file: !406, line: 814, baseType: !40, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !719, file: !406, line: 816, baseType: !40, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !716, file: !406, line: 819, baseType: !40, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !407, file: !406, line: 927, baseType: !730, size: 8, offset: 640)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !731)
!731 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !406, line: 881, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !406, line: 872, size: 8, elements: !734)
!734 = !{!735, !742}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !733, file: !406, line: 879, baseType: !736, size: 8)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !733, file: !406, line: 873, size: 8, elements: !737)
!737 = !{!738, !739, !740, !741}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !736, file: !406, line: 874, baseType: !143, size: 1, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !736, file: !406, line: 875, baseType: !143, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !736, file: !406, line: 876, baseType: !143, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !736, file: !406, line: 877, baseType: !143, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !733, file: !406, line: 880, baseType: !143, size: 8)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !746, line: 290, baseType: !747)
!746 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !746, line: 284, size: 96, elements: !748)
!748 = !{!749, !759, !770, !783, !800}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !747, file: !746, line: 285, baseType: !750, size: 8)
!750 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !746, line: 49, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !746, line: 43, size: 8, elements: !753)
!753 = !{!754, !758}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !752, file: !746, line: 47, baseType: !755, size: 8)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !752, file: !746, line: 44, size: 8, elements: !756)
!756 = !{!757}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !755, file: !746, line: 45, baseType: !143, size: 1, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !752, file: !746, line: 48, baseType: !143, size: 8)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !747, file: !746, line: 286, baseType: !760, size: 8, offset: 8)
!760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !746, line: 67, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !746, line: 61, size: 8, elements: !764)
!764 = !{!765, !769}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !763, file: !746, line: 65, baseType: !766, size: 8)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !763, file: !746, line: 62, size: 8, elements: !767)
!767 = !{!768}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !766, file: !746, line: 64, baseType: !143, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !763, file: !746, line: 66, baseType: !143, size: 8)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !747, file: !746, line: 287, baseType: !771, size: 16, offset: 16)
!771 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !746, line: 89, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !746, line: 79, size: 16, elements: !774)
!774 = !{!775, !782}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !773, file: !746, line: 87, baseType: !776, size: 16)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !773, file: !746, line: 80, size: 16, elements: !777)
!777 = !{!778, !779, !780, !781}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !776, file: !746, line: 81, baseType: !157, size: 6, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !776, file: !746, line: 83, baseType: !157, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !776, file: !746, line: 85, baseType: !157, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !776, file: !746, line: 86, baseType: !157, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !773, file: !746, line: 88, baseType: !157, size: 16)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !747, file: !746, line: 288, baseType: !784, size: 32, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !746, line: 214, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !746, line: 199, size: 32, elements: !787)
!787 = !{!788, !799}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !786, file: !746, line: 212, baseType: !789, size: 32)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !786, file: !746, line: 200, size: 32, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !789, file: !746, line: 201, baseType: !40, size: 4, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !789, file: !746, line: 203, baseType: !40, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !789, file: !746, line: 205, baseType: !40, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !789, file: !746, line: 206, baseType: !40, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !789, file: !746, line: 207, baseType: !40, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !789, file: !746, line: 208, baseType: !40, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !789, file: !746, line: 209, baseType: !40, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !789, file: !746, line: 210, baseType: !40, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !786, file: !746, line: 213, baseType: !40, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !747, file: !746, line: 289, baseType: !801, size: 32, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !746, line: 268, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !746, line: 260, size: 32, elements: !804)
!804 = !{!805, !810}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !803, file: !746, line: 266, baseType: !806, size: 32)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !803, file: !746, line: 261, size: 32, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !806, file: !746, line: 262, baseType: !40, size: 4, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !806, file: !746, line: 264, baseType: !40, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !803, file: !746, line: 267, baseType: !40, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !813, line: 513, baseType: !814)
!813 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !813, line: 494, size: 480, elements: !815)
!815 = !{!816, !822, !832, !836, !846, !856, !866, !876, !880, !896, !912, !928, !958, !962, !972, !982, !992, !996}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !814, file: !813, line: 495, baseType: !817, size: 8)
!817 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !813, line: 45, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !813, line: 43, size: 8, elements: !820)
!820 = !{!821}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !819, file: !813, line: 44, baseType: !143, size: 8)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !814, file: !813, line: 496, baseType: !823, size: 8, offset: 8)
!823 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !813, line: 61, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !813, line: 55, size: 8, elements: !826)
!826 = !{!827, !831}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !825, file: !813, line: 59, baseType: !828, size: 8)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !825, file: !813, line: 56, size: 8, elements: !829)
!829 = !{!830}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !828, file: !813, line: 57, baseType: !143, size: 2, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !825, file: !813, line: 60, baseType: !143, size: 8)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !814, file: !813, line: 497, baseType: !833, size: 48, offset: 16)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 48, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 6)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !814, file: !813, line: 498, baseType: !837, size: 8, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !813, line: 86, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !813, line: 80, size: 8, elements: !840)
!840 = !{!841, !845}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !839, file: !813, line: 84, baseType: !842, size: 8)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !839, file: !813, line: 81, size: 8, elements: !843)
!843 = !{!844}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !842, file: !813, line: 82, baseType: !143, size: 3, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !839, file: !813, line: 85, baseType: !143, size: 8)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !814, file: !813, line: 499, baseType: !847, size: 8, offset: 72)
!847 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !848)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !813, line: 121, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !813, line: 115, size: 8, elements: !850)
!850 = !{!851, !855}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !849, file: !813, line: 119, baseType: !852, size: 8)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !849, file: !813, line: 116, size: 8, elements: !853)
!853 = !{!854}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !852, file: !813, line: 117, baseType: !143, size: 3, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !849, file: !813, line: 120, baseType: !143, size: 8)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !814, file: !813, line: 500, baseType: !857, size: 8, offset: 80)
!857 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !813, line: 156, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !813, line: 150, size: 8, elements: !860)
!860 = !{!861, !865}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !859, file: !813, line: 154, baseType: !862, size: 8)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !859, file: !813, line: 151, size: 8, elements: !863)
!863 = !{!864}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !862, file: !813, line: 152, baseType: !143, size: 3, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !859, file: !813, line: 155, baseType: !143, size: 8)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !814, file: !813, line: 501, baseType: !867, size: 8, offset: 88)
!867 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !813, line: 191, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !813, line: 185, size: 8, elements: !870)
!870 = !{!871, !875}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !869, file: !813, line: 189, baseType: !872, size: 8)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !869, file: !813, line: 186, size: 8, elements: !873)
!873 = !{!874}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !872, file: !813, line: 187, baseType: !143, size: 3, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !869, file: !813, line: 190, baseType: !143, size: 8)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !814, file: !813, line: 502, baseType: !877, size: 64, offset: 96)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 64, elements: !878)
!878 = !{!879}
!879 = !DISubrange(count: 8)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !814, file: !813, line: 503, baseType: !881, size: 32, offset: 160)
!881 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !813, line: 232, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !813, line: 220, size: 32, elements: !884)
!884 = !{!885, !895}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !883, file: !813, line: 230, baseType: !886, size: 32)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !813, line: 221, size: 32, elements: !887)
!887 = !{!888, !889, !890, !891, !892, !893, !894}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !886, file: !813, line: 222, baseType: !40, size: 1, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !886, file: !813, line: 223, baseType: !40, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !886, file: !813, line: 224, baseType: !40, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !886, file: !813, line: 225, baseType: !40, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !886, file: !813, line: 226, baseType: !40, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !886, file: !813, line: 227, baseType: !40, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !886, file: !813, line: 228, baseType: !40, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !883, file: !813, line: 231, baseType: !40, size: 32)
