; ModuleID = 'build/adafruit_feather_stm32f405/boards/stm32/backup_sram/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.stm32_backup_sram_config = type { %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %union.anon.1, i32*, i32, %struct._thread_arch }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 94, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5248, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 82)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2624, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "backup_value", scope: !27, file: !105, line: 11, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/boards/stm32/backup_sram/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/samples/boards/stm32/backup_sram/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!107 = !DIGlobalVariableExpression(var: !108, expr: !DIExpression())
!108 = distinct !DIGlobalVariable(name: "_char_out", scope: !109, file: !112, line: 54, type: !113, isLocal: false, isDefinition: true)
!109 = distinct !DICompileUnit(language: DW_LANG_C99, file: !110, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!110 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram")
!111 = !{!107}
!112 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DISubroutineType(types: !115)
!115 = !{!103, !103}
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !118, file: !135, line: 56, type: !136, isLocal: true, isDefinition: true, align: 32)
!118 = distinct !DICompileUnit(language: DW_LANG_C99, file: !119, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !120, globals: !134, splitDebugInlining: false, nameTableKind: None)
!119 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram")
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !123, line: 369, baseType: !124)
!123 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f405xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 360, size: 224, elements: !125)
!125 = !{!126, !128, !129, !130, !131, !132, !133}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !124, file: !123, line: 362, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !106)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !124, file: !123, line: 363, baseType: !127, size: 32, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !124, file: !123, line: 364, baseType: !127, size: 32, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !124, file: !123, line: 365, baseType: !127, size: 32, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !124, file: !123, line: 366, baseType: !127, size: 32, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !124, file: !123, line: 367, baseType: !127, size: 32, offset: 160)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !124, file: !123, line: 368, baseType: !127, size: 32, offset: 192)
!134 = !{!116}
!135 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !138, line: 51, size: 64, elements: !139)
!138 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!139 = !{!140, !171}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !137, file: !138, line: 60, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!142 = !DISubroutineType(types: !143)
!143 = !{!103, !144}
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !147, line: 378, size: 192, elements: !148)
!147 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!148 = !{!149, !153, !154, !155, !164, !165}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !146, file: !147, line: 380, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !152)
!152 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !146, file: !147, line: 382, baseType: !13, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !146, file: !147, line: 384, baseType: !13, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !146, file: !147, line: 386, baseType: !156, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !147, line: 351, size: 16, elements: !158)
!158 = !{!159, !162}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !157, file: !147, line: 359, baseType: !160, size: 8)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !161)
!161 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !157, file: !147, line: 364, baseType: !163, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!163 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !147, line: 388, baseType: !102, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !146, file: !147, line: 396, baseType: !166, size: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !147, line: 43, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !170)
!170 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !137, file: !138, line: 65, baseType: !144, size: 32, offset: 32)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_38", scope: !174, file: !179, line: 101, type: !190, isLocal: false, isDefinition: true, align: 16)
!174 = distinct !DICompileUnit(language: DW_LANG_C99, file: !175, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !176, splitDebugInlining: false, nameTableKind: None)
!175 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram")
!176 = !{!177, !183, !188, !193, !195, !197, !199, !201, !203, !205, !207, !209, !172}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !174, file: !179, line: 19, type: !180, isLocal: false, isDefinition: true, align: 16)
!179 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram")
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 224, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 14)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_37", scope: !174, file: !179, line: 24, type: !185, isLocal: false, isDefinition: true, align: 16)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 48, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 3)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_73", scope: !174, file: !179, line: 31, type: !190, isLocal: false, isDefinition: true, align: 16)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 64, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 4)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_72", scope: !174, file: !179, line: 38, type: !190, isLocal: false, isDefinition: true, align: 16)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_71", scope: !174, file: !179, line: 45, type: !190, isLocal: false, isDefinition: true, align: 16)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_70", scope: !174, file: !179, line: 52, type: !190, isLocal: false, isDefinition: true, align: 16)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_69", scope: !174, file: !179, line: 59, type: !190, isLocal: false, isDefinition: true, align: 16)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_68", scope: !174, file: !179, line: 66, type: !190, isLocal: false, isDefinition: true, align: 16)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !174, file: !179, line: 73, type: !190, isLocal: false, isDefinition: true, align: 16)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_67", scope: !174, file: !179, line: 80, type: !190, isLocal: false, isDefinition: true, align: 16)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_74", scope: !174, file: !179, line: 87, type: !190, isLocal: false, isDefinition: true, align: 16)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_45", scope: !174, file: !179, line: 94, type: !190, isLocal: false, isDefinition: true, align: 16)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "config", scope: !213, file: !291, line: 56, type: !309, isLocal: true, isDefinition: true)
!213 = distinct !DICompileUnit(language: DW_LANG_C99, file: !214, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !215, retainedTypes: !223, globals: !288, splitDebugInlining: false, nameTableKind: None)
!214 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/stm32_backup_sram.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram")
!215 = !{!216}
!216 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !217, line: 44, baseType: !32, size: 32, elements: !218)
!217 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!218 = !{!219, !220, !221, !222}
!219 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!220 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!221 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!222 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!223 = !{!224, !226, !282}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !217, line: 56, baseType: !102)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !228)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !217, line: 100, size: 224, elements: !229)
!229 = !{!230, !250, !251, !260, !266, !271, !277}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !228, file: !217, line: 101, baseType: !231, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !217, line: 76, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DISubroutineType(types: !234)
!234 = !{!103, !235, !225}
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !147, line: 378, size: 192, elements: !238)
!238 = !{!239, !240, !241, !242, !248, !249}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !237, file: !147, line: 380, baseType: !150, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !237, file: !147, line: 382, baseType: !13, size: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !237, file: !147, line: 384, baseType: !13, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !237, file: !147, line: 386, baseType: !243, size: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !147, line: 351, size: 16, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !244, file: !147, line: 359, baseType: !160, size: 8)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !244, file: !147, line: 364, baseType: !163, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !237, file: !147, line: 388, baseType: !102, size: 32, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !237, file: !147, line: 396, baseType: !166, size: 32, offset: 160)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !228, file: !217, line: 102, baseType: !231, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !228, file: !217, line: 103, baseType: !252, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !217, line: 83, baseType: !253)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DISubroutineType(types: !255)
!255 = !{!103, !235, !225, !256, !102}
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !217, line: 72, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !235, !225, !102}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !228, file: !217, line: 104, baseType: !261, size: 32, offset: 96)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !217, line: 79, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DISubroutineType(types: !264)
!264 = !{!103, !235, !225, !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !228, file: !217, line: 105, baseType: !267, size: 32, offset: 128)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !217, line: 88, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DISubroutineType(types: !270)
!270 = !{!216, !235, !225}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !228, file: !217, line: 106, baseType: !272, size: 32, offset: 160)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !217, line: 92, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DISubroutineType(types: !275)
!275 = !{!103, !235, !225, !276}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !217, line: 64, baseType: !102)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !228, file: !217, line: 107, baseType: !278, size: 32, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !217, line: 96, baseType: !279)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DISubroutineType(types: !281)
!281 = !{!103, !235, !225, !102}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !123, line: 494, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 490, size: 64, elements: !285)
!285 = !{!286, !287}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !284, file: !123, line: 492, baseType: !127, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !284, file: !123, line: 493, baseType: !127, size: 32, offset: 32)
!288 = !{!289, !295, !297, !307, !211}
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_38", scope: !213, file: !291, line: 61, type: !292, isLocal: false, isDefinition: true, align: 16)
!291 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/stm32_backup_sram.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 80, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 5)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "__device_dts_ord_38", scope: !213, file: !291, line: 61, type: !236, isLocal: false, isDefinition: true, align: 32)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_38", scope: !213, file: !291, line: 61, type: !299, isLocal: true, isDefinition: true, align: 32)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !138, line: 51, size: 64, elements: !301)
!301 = !{!302, !306}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !300, file: !138, line: 60, baseType: !303, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!304 = !DISubroutineType(types: !305)
!305 = !{!103, !235}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !300, file: !138, line: 65, baseType: !235, size: 32, offset: 32)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_38", scope: !213, file: !291, line: 61, type: !244, isLocal: true, isDefinition: true, align: 8)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_backup_sram_config", file: !291, line: 17, size: 64, elements: !311)
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pclken", scope: !310, file: !291, line: 18, baseType: !313, size: 64)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !314, line: 343, size: 64, elements: !315)
!314 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!315 = !{!316, !317}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !313, file: !314, line: 344, baseType: !106, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !313, file: !314, line: 345, baseType: !106, size: 32, offset: 32)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !320, file: !323, line: 71, type: !324, isLocal: true, isDefinition: true, align: 32)
!320 = distinct !DICompileUnit(language: DW_LANG_C99, file: !321, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !322, splitDebugInlining: false, nameTableKind: None)
!321 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram")
!322 = !{!318}
!323 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !138, line: 51, size: 64, elements: !326)
!326 = !{!327, !346}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !325, file: !138, line: 60, baseType: !328, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!329 = !DISubroutineType(types: !330)
!330 = !{!103, !331}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !333)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !147, line: 378, size: 192, elements: !334)
!334 = !{!335, !336, !337, !338, !344, !345}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !333, file: !147, line: 380, baseType: !150, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !333, file: !147, line: 382, baseType: !13, size: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !333, file: !147, line: 384, baseType: !13, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !333, file: !147, line: 386, baseType: !339, size: 32, offset: 96)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !147, line: 351, size: 16, elements: !341)
!341 = !{!342, !343}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !340, file: !147, line: 359, baseType: !160, size: 8)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !340, file: !147, line: 364, baseType: !163, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !333, file: !147, line: 388, baseType: !102, size: 32, offset: 128)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !333, file: !147, line: 396, baseType: !166, size: 32, offset: 160)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !325, file: !138, line: 65, baseType: !331, size: 32, offset: 32)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "static_regions", scope: !349, file: !358, line: 62, type: !499, isLocal: true, isDefinition: true)
!349 = distinct !DICompileUnit(language: DW_LANG_C99, file: !350, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !351, globals: !354, splitDebugInlining: false, nameTableKind: None)
!350 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram")
!351 = !{!352, !103, !106, !102}
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !353, line: 214, baseType: !32)
!353 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!354 = !{!355, !347}
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !357, file: !358, line: 198, type: !485, isLocal: true, isDefinition: true)
!357 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !358, file: !358, line: 175, type: !359, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !349, retainedNodes: !480)
!358 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!359 = !DISubroutineType(types: !360)
!360 = !{null, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !363, line: 245, size: 1024, elements: !364)
!363 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = !{!365, !434, !447, !448, !449, !450, !456, !475}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !362, file: !363, line: 247, baseType: !366, size: 384)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !363, line: 57, size: 384, elements: !367)
!367 = !{!368, !396, !404, !405, !406, !419, !420, !421}
!368 = !DIDerivedType(tag: DW_TAG_member, scope: !366, file: !363, line: 60, baseType: !369, size: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !366, file: !363, line: 60, size: 64, elements: !370)
!370 = !{!371, !387}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !369, file: !363, line: 61, baseType: !372, size: 64)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !373, line: 49, baseType: !374)
!373 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !373, line: 37, size: 64, elements: !375)
!375 = !{!376, !382}
!376 = !DIDerivedType(tag: DW_TAG_member, scope: !374, file: !373, line: 38, baseType: !377, size: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !374, file: !373, line: 38, size: 32, elements: !378)
!378 = !{!379, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !377, file: !373, line: 39, baseType: !380, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !377, file: !373, line: 40, baseType: !380, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, scope: !374, file: !373, line: 42, baseType: !383, size: 32, offset: 32)
!383 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !374, file: !373, line: 42, size: 32, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !383, file: !373, line: 43, baseType: !380, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !383, file: !373, line: 44, baseType: !380, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !369, file: !363, line: 62, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !389, line: 49, size: 64, elements: !390)
!389 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!390 = !{!391}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !388, file: !389, line: 50, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 64, elements: !394)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!394 = !{!395}
!395 = !DISubrange(count: 2)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !366, file: !363, line: 68, baseType: !397, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !399, line: 233, baseType: !400)
!399 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !399, line: 231, size: 64, elements: !401)
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !400, file: !399, line: 232, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !373, line: 48, baseType: !374)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !366, file: !363, line: 71, baseType: !160, size: 8, offset: 96)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !366, file: !363, line: 74, baseType: !160, size: 8, offset: 104)
!406 = !DIDerivedType(tag: DW_TAG_member, scope: !366, file: !363, line: 90, baseType: !407, size: 16, offset: 112)
!407 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !366, file: !363, line: 90, size: 16, elements: !408)
!408 = !{!409, !416}
!409 = !DIDerivedType(tag: DW_TAG_member, scope: !407, file: !363, line: 91, baseType: !410, size: 16)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !407, file: !363, line: 91, size: 16, elements: !411)
!411 = !{!412, !415}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !410, file: !363, line: 96, baseType: !413, size: 8)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !414)
!414 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !410, file: !363, line: 97, baseType: !160, size: 8, offset: 8)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !407, file: !363, line: 100, baseType: !417, size: 16)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !418)
!418 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !366, file: !363, line: 107, baseType: !106, size: 32, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !366, file: !363, line: 127, baseType: !102, size: 32, offset: 160)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !366, file: !363, line: 131, baseType: !422, size: 192, offset: 192)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !399, line: 244, size: 192, elements: !423)
!423 = !{!424, !425, !431}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !422, file: !399, line: 245, baseType: !372, size: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !422, file: !399, line: 246, baseType: !426, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !399, line: 242, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !430}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !422, file: !399, line: 249, baseType: !432, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !433)
!433 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !362, file: !363, line: 250, baseType: !435, size: 288, offset: 384)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !436, line: 25, size: 288, elements: !437)
!436 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445, !446}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !435, file: !436, line: 26, baseType: !106, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !435, file: !436, line: 27, baseType: !106, size: 32, offset: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !435, file: !436, line: 28, baseType: !106, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !435, file: !436, line: 29, baseType: !106, size: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !435, file: !436, line: 30, baseType: !106, size: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !435, file: !436, line: 31, baseType: !106, size: 32, offset: 160)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !435, file: !436, line: 32, baseType: !106, size: 32, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !435, file: !436, line: 33, baseType: !106, size: 32, offset: 224)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !435, file: !436, line: 34, baseType: !106, size: 32, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !362, file: !363, line: 253, baseType: !102, size: 32, offset: 672)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !362, file: !363, line: 256, baseType: !398, size: 64, offset: 704)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !362, file: !363, line: 294, baseType: !103, size: 32, offset: 768)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !362, file: !363, line: 300, baseType: !451, size: 96, offset: 800)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !363, line: 149, size: 96, elements: !452)
!452 = !{!453, !454, !455}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !451, file: !363, line: 153, baseType: !22, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !451, file: !363, line: 162, baseType: !352, size: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !451, file: !363, line: 168, baseType: !352, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !362, file: !363, line: 325, baseType: !457, size: 32, offset: 896)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 32)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !459, line: 5073, size: 160, elements: !460)
!459 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!460 = !{!461, !470, !471}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !458, file: !459, line: 5074, baseType: !462, size: 96)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !463, line: 56, size: 96, elements: !464)
!463 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!464 = !{!465, !468, !469}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !462, file: !463, line: 57, baseType: !466, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !463, line: 57, flags: DIFlagFwdDecl)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !462, file: !463, line: 58, baseType: !102, size: 32, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !462, file: !463, line: 59, baseType: !352, size: 32, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !458, file: !459, line: 5075, baseType: !398, size: 64, offset: 96)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !458, file: !459, line: 5076, baseType: !472, offset: 160)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !473, line: 43, elements: !474)
!473 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!474 = !{}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !362, file: !363, line: 343, baseType: !476, size: 64, offset: 928)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !436, line: 60, size: 64, elements: !477)
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !476, file: !436, line: 63, baseType: !106, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !476, file: !436, line: 66, baseType: !106, size: 32, offset: 32)
!480 = !{!481, !482, !483, !484}
!481 = !DILocalVariable(name: "thread", arg: 1, scope: !357, file: !358, line: 175, type: !361)
!482 = !DILocalVariable(name: "region_num", scope: !357, file: !358, line: 200, type: !160)
!483 = !DILocalVariable(name: "guard_start", scope: !357, file: !358, line: 265, type: !22)
!484 = !DILocalVariable(name: "guard_size", scope: !357, file: !358, line: 266, type: !352)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 96, elements: !497)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !487, line: 52, size: 96, elements: !488)
!487 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!488 = !{!489, !490, !491}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !486, file: !487, line: 53, baseType: !22, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !486, file: !487, line: 54, baseType: !352, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !486, file: !487, line: 55, baseType: !492, size: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !493, line: 151, baseType: !494)
!493 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !493, line: 149, size: 32, elements: !495)
!495 = !{!496}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !494, file: !493, line: 150, baseType: !106, size: 32)
!497 = !{!498}
!498 = !DISubrange(count: 1)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 96, elements: !497)
!500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !503, file: !536, line: 39, type: !160, isLocal: true, isDefinition: true)
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !505, globals: !535, splitDebugInlining: false, nameTableKind: None)
!504 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram")
!505 = !{!506, !102, !103, !523, !160}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !508, line: 1226, baseType: !509)
!508 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !508, line: 1213, size: 352, elements: !510)
!510 = !{!511, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !509, file: !508, line: 1215, baseType: !512, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !127)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !509, file: !508, line: 1216, baseType: !127, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !509, file: !508, line: 1217, baseType: !127, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !509, file: !508, line: 1218, baseType: !127, size: 32, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !509, file: !508, line: 1219, baseType: !127, size: 32, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !509, file: !508, line: 1220, baseType: !127, size: 32, offset: 160)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !509, file: !508, line: 1221, baseType: !127, size: 32, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !509, file: !508, line: 1222, baseType: !127, size: 32, offset: 224)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !509, file: !508, line: 1223, baseType: !127, size: 32, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !509, file: !508, line: 1224, baseType: !127, size: 32, offset: 288)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !509, file: !508, line: 1225, baseType: !127, size: 32, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !526, line: 27, size: 96, elements: !527)
!526 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!527 = !{!528, !529, !530}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !525, file: !526, line: 29, baseType: !106, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !525, file: !526, line: 31, baseType: !150, size: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !525, file: !526, line: 37, baseType: !531, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !493, line: 146, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !493, line: 141, size: 32, elements: !533)
!533 = !{!534}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !532, file: !493, line: 143, baseType: !106, size: 32)
!535 = !{!501}
!536 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !539, file: !546, line: 21, type: !113, isLocal: true, isDefinition: true)
!539 = distinct !DICompileUnit(language: DW_LANG_C99, file: !540, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !541, globals: !545, splitDebugInlining: false, nameTableKind: None)
!540 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram")
!541 = !{!542, !103, !102}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !544, line: 22, baseType: !103)
!544 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!545 = !{!537}
!546 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !549, file: !554, line: 13, type: !571, isLocal: true, isDefinition: true)
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !551, splitDebugInlining: false, nameTableKind: None)
!550 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram")
!551 = !{!552, !547}
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "mpu_config", scope: !549, file: !554, line: 37, type: !555, isLocal: false, isDefinition: true)
!554 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !526, line: 41, size: 64, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !556, file: !526, line: 43, baseType: !106, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !556, file: !526, line: 45, baseType: !560, size: 32, offset: 32)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !526, line: 27, size: 96, elements: !563)
!563 = !{!564, !565, !566}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !562, file: !526, line: 29, baseType: !106, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !562, file: !526, line: 31, baseType: !150, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !562, file: !526, line: 37, baseType: !567, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !493, line: 146, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !493, line: 141, size: 32, elements: !569)
!569 = !{!570}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !568, file: !493, line: 143, baseType: !106, size: 32)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 192, elements: !394)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !574, file: !679, line: 72, type: !760, isLocal: true, isDefinition: true)
!574 = distinct !DICompileUnit(language: DW_LANG_C99, file: !575, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !576, retainedTypes: !665, globals: !676, splitDebugInlining: false, nameTableKind: None)
!575 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram")
!576 = !{!30, !577}
!577 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !123, line: 65, baseType: !103, size: 32, elements: !578)
!578 = !{!579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664}
!579 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!580 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!581 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!582 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!583 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!584 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!585 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!586 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!587 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!588 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!589 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!590 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!591 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!592 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!593 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!594 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!595 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!596 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!597 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!598 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!599 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!600 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!601 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!602 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!603 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!604 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!605 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!606 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!607 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!608 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!609 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!610 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!611 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!612 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!613 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!614 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!615 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!616 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!617 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!618 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!619 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!620 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!621 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!622 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!623 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!624 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!625 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!626 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!627 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!628 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!629 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!630 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!631 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!632 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!633 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!634 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!635 = !DIEnumerator(name: "FSMC_IRQn", value: 48)
!636 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!637 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!638 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!639 = !DIEnumerator(name: "UART4_IRQn", value: 52)
!640 = !DIEnumerator(name: "UART5_IRQn", value: 53)
!641 = !DIEnumerator(name: "TIM6_DAC_IRQn", value: 54)
!642 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!643 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!644 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!645 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!646 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!647 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!648 = !DIEnumerator(name: "CAN2_TX_IRQn", value: 63)
!649 = !DIEnumerator(name: "CAN2_RX0_IRQn", value: 64)
!650 = !DIEnumerator(name: "CAN2_RX1_IRQn", value: 65)
!651 = !DIEnumerator(name: "CAN2_SCE_IRQn", value: 66)
!652 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!653 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!654 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!655 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!656 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!657 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!658 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!659 = !DIEnumerator(name: "OTG_HS_EP1_OUT_IRQn", value: 74)
!660 = !DIEnumerator(name: "OTG_HS_EP1_IN_IRQn", value: 75)
!661 = !DIEnumerator(name: "OTG_HS_WKUP_IRQn", value: 76)
!662 = !DIEnumerator(name: "OTG_HS_IRQn", value: 77)
!663 = !DIEnumerator(name: "RNG_IRQn", value: 80)
!664 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!665 = !{!352, !103, !102, !666}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !123, line: 354, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 346, size: 192, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !668, file: !123, line: 348, baseType: !127, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !668, file: !123, line: 349, baseType: !127, size: 32, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !668, file: !123, line: 350, baseType: !127, size: 32, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !668, file: !123, line: 351, baseType: !127, size: 32, offset: 96)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !668, file: !123, line: 352, baseType: !127, size: 32, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !668, file: !123, line: 353, baseType: !127, size: 32, offset: 160)
!676 = !{!677, !680, !696, !707, !724, !572, !726, !740, !742, !744, !746, !748, !750, !752, !754, !756, !758}
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_37", scope: !574, file: !679, line: 424, type: !190, isLocal: false, isDefinition: true, align: 16)
!679 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "__device_dts_ord_37", scope: !574, file: !679, line: 424, type: !682, isLocal: false, isDefinition: true, align: 32)
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !147, line: 378, size: 192, elements: !684)
!684 = !{!685, !686, !687, !688, !694, !695}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !683, file: !147, line: 380, baseType: !150, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !683, file: !147, line: 382, baseType: !13, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !683, file: !147, line: 384, baseType: !13, size: 32, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !683, file: !147, line: 386, baseType: !689, size: 32, offset: 96)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 32)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !147, line: 351, size: 16, elements: !691)
!691 = !{!692, !693}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !690, file: !147, line: 359, baseType: !160, size: 8)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !690, file: !147, line: 364, baseType: !163, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !683, file: !147, line: 388, baseType: !102, size: 32, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !683, file: !147, line: 396, baseType: !166, size: 32, offset: 160)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_37", scope: !574, file: !679, line: 424, type: !698, isLocal: true, isDefinition: true, align: 32)
!698 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !138, line: 51, size: 64, elements: !700)
!700 = !{!701, !706}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !699, file: !138, line: 60, baseType: !702, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 32)
!703 = !DISubroutineType(types: !704)
!704 = !{!103, !705}
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !699, file: !138, line: 65, baseType: !705, size: 32, offset: 32)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "exti_data", scope: !574, file: !679, line: 423, type: !709, isLocal: true, isDefinition: true)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !679, line: 107, size: 1472, elements: !710)
!710 = !{!711}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !709, file: !679, line: 109, baseType: !712, size: 1472)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 1472, elements: !722)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !679, line: 101, size: 64, elements: !714)
!714 = !{!715, !721}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !713, file: !679, line: 102, baseType: !716, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !717, line: 63, baseType: !718)
!717 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 32)
!719 = !DISubroutineType(types: !720)
!720 = !{null, !103, !102}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !713, file: !679, line: 103, baseType: !102, size: 32, offset: 32)
!722 = !{!723}
!723 = !DISubrange(count: 23)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_37", scope: !574, file: !679, line: 424, type: !690, isLocal: true, isDefinition: true, align: 8)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !728, file: !679, line: 493, type: !733, isLocal: true, isDefinition: true, align: 32)
!728 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !679, file: !679, line: 460, type: !729, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !574, retainedNodes: !731)
!729 = !DISubroutineType(types: !730)
!730 = !{null, !705}
!731 = !{!732}
!732 = !DILocalVariable(name: "dev", arg: 1, scope: !728, file: !679, line: 460, type: !705)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !734)
!734 = !{!735, !737, !738, !739}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !733, file: !10, line: 55, baseType: !736, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !733, file: !10, line: 57, baseType: !736, size: 32, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !733, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !733, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !728, file: !679, line: 497, type: !733, isLocal: true, isDefinition: true, align: 32)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !728, file: !679, line: 507, type: !733, isLocal: true, isDefinition: true, align: 32)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !728, file: !679, line: 512, type: !733, isLocal: true, isDefinition: true, align: 32)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !728, file: !679, line: 516, type: !733, isLocal: true, isDefinition: true, align: 32)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !728, file: !679, line: 523, type: !733, isLocal: true, isDefinition: true, align: 32)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !728, file: !679, line: 527, type: !733, isLocal: true, isDefinition: true, align: 32)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !728, file: !679, line: 581, type: !733, isLocal: true, isDefinition: true, align: 32)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !728, file: !679, line: 586, type: !733, isLocal: true, isDefinition: true, align: 32)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !728, file: !679, line: 591, type: !733, isLocal: true, isDefinition: true, align: 32)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !728, file: !679, line: 595, type: !733, isLocal: true, isDefinition: true, align: 32)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 736, elements: !722)
!761 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !123, line: 155, baseType: !577)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !765, file: !817, line: 398, type: !850, isLocal: true, isDefinition: true)
!765 = distinct !DICompileUnit(language: DW_LANG_C99, file: !766, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !767, retainedTypes: !773, globals: !814, splitDebugInlining: false, nameTableKind: None)
!766 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram")
!767 = !{!768, !30, !216}
!768 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !769, line: 197, baseType: !32, size: 32, elements: !770)
!769 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!770 = !{!771, !772}
!771 = !DIEnumerator(name: "SUCCESS", value: 0)
!772 = !DIEnumerator(name: "ERROR", value: 1)
!773 = !{!102, !103, !106, !774, !809, !265}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !123, line: 532, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !123, line: 500, size: 1088, elements: !777)
!777 = !{!778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !776, file: !123, line: 502, baseType: !127, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !776, file: !123, line: 503, baseType: !127, size: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !776, file: !123, line: 504, baseType: !127, size: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !776, file: !123, line: 505, baseType: !127, size: 32, offset: 96)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !776, file: !123, line: 506, baseType: !127, size: 32, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !776, file: !123, line: 507, baseType: !127, size: 32, offset: 160)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !776, file: !123, line: 508, baseType: !127, size: 32, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !776, file: !123, line: 509, baseType: !106, size: 32, offset: 224)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !776, file: !123, line: 510, baseType: !127, size: 32, offset: 256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !776, file: !123, line: 511, baseType: !127, size: 32, offset: 288)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !776, file: !123, line: 512, baseType: !789, size: 64, offset: 320)
!789 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 64, elements: !394)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !776, file: !123, line: 513, baseType: !127, size: 32, offset: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !776, file: !123, line: 514, baseType: !127, size: 32, offset: 416)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !776, file: !123, line: 515, baseType: !127, size: 32, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !776, file: !123, line: 516, baseType: !106, size: 32, offset: 480)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !776, file: !123, line: 517, baseType: !127, size: 32, offset: 512)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !776, file: !123, line: 518, baseType: !127, size: 32, offset: 544)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !776, file: !123, line: 519, baseType: !789, size: 64, offset: 576)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !776, file: !123, line: 520, baseType: !127, size: 32, offset: 640)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !776, file: !123, line: 521, baseType: !127, size: 32, offset: 672)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !776, file: !123, line: 522, baseType: !127, size: 32, offset: 704)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !776, file: !123, line: 523, baseType: !106, size: 32, offset: 736)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !776, file: !123, line: 524, baseType: !127, size: 32, offset: 768)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !776, file: !123, line: 525, baseType: !127, size: 32, offset: 800)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !776, file: !123, line: 526, baseType: !789, size: 64, offset: 832)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !776, file: !123, line: 527, baseType: !127, size: 32, offset: 896)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !776, file: !123, line: 528, baseType: !127, size: 32, offset: 928)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !776, file: !123, line: 529, baseType: !789, size: 64, offset: 960)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !776, file: !123, line: 530, baseType: !127, size: 32, offset: 1024)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !776, file: !123, line: 531, baseType: !127, size: 32, offset: 1056)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !314, line: 343, size: 64, elements: !811)
!811 = !{!812, !813}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !810, file: !314, line: 344, baseType: !106, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !810, file: !314, line: 345, baseType: !106, size: 32, offset: 32)
!814 = !{!815, !821, !837, !848, !763}
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !765, file: !817, line: 752, type: !818, isLocal: false, isDefinition: true, align: 16)
!817 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 928, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 58)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !765, file: !817, line: 752, type: !823, isLocal: false, isDefinition: true, align: 32)
!823 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !147, line: 378, size: 192, elements: !825)
!825 = !{!826, !827, !828, !829, !835, !836}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !824, file: !147, line: 380, baseType: !150, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !824, file: !147, line: 382, baseType: !13, size: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !824, file: !147, line: 384, baseType: !13, size: 32, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !824, file: !147, line: 386, baseType: !830, size: 32, offset: 96)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !147, line: 351, size: 16, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !831, file: !147, line: 359, baseType: !160, size: 8)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !831, file: !147, line: 364, baseType: !163, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !824, file: !147, line: 388, baseType: !102, size: 32, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !824, file: !147, line: 396, baseType: !166, size: 32, offset: 160)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !765, file: !817, line: 752, type: !839, isLocal: true, isDefinition: true, align: 32)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !138, line: 51, size: 64, elements: !841)
!841 = !{!842, !847}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !840, file: !138, line: 60, baseType: !843, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DISubroutineType(types: !845)
!845 = !{!103, !846}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !840, file: !138, line: 65, baseType: !846, size: 32, offset: 32)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !765, file: !817, line: 752, type: !831, isLocal: true, isDefinition: true, align: 8)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !217, line: 100, size: 224, elements: !851)
!851 = !{!852, !857, !858, !867, !872, !877, !882}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !850, file: !217, line: 101, baseType: !853, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !217, line: 76, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!855 = !DISubroutineType(types: !856)
!856 = !{!103, !846, !225}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !850, file: !217, line: 102, baseType: !853, size: 32, offset: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !850, file: !217, line: 103, baseType: !859, size: 32, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !217, line: 83, baseType: !860)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DISubroutineType(types: !862)
!862 = !{!103, !846, !225, !863, !102}
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !217, line: 72, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !846, !225, !102}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !850, file: !217, line: 104, baseType: !868, size: 32, offset: 96)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !217, line: 79, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 32)
!870 = !DISubroutineType(types: !871)
!871 = !{!103, !846, !225, !265}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !850, file: !217, line: 105, baseType: !873, size: 32, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !217, line: 88, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 32)
!875 = !DISubroutineType(types: !876)
!876 = !{!216, !846, !225}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !850, file: !217, line: 106, baseType: !878, size: 32, offset: 160)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !217, line: 92, baseType: !879)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 32)
!880 = !DISubroutineType(types: !881)
!881 = !{!103, !846, !225, !276}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !850, file: !217, line: 107, baseType: !883, size: 32, offset: 192)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !217, line: 96, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = !DISubroutineType(types: !886)
!886 = !{!103, !846, !225, !102}
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !889, file: !946, line: 603, type: !948, isLocal: true, isDefinition: true, align: 32)
!889 = distinct !DICompileUnit(language: DW_LANG_C99, file: !890, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !891, globals: !943, splitDebugInlining: false, nameTableKind: None)
!890 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram")
!891 = !{!102, !103, !892}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !895, line: 336, size: 160, elements: !896)
!895 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!896 = !{!897, !917, !921, !925, !938}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !894, file: !895, line: 365, baseType: !898, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 32)
!899 = !DISubroutineType(types: !900)
!900 = !{!103, !901, !916}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !147, line: 378, size: 192, elements: !904)
!904 = !{!905, !906, !907, !908, !914, !915}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !903, file: !147, line: 380, baseType: !150, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !903, file: !147, line: 382, baseType: !13, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !903, file: !147, line: 384, baseType: !13, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !903, file: !147, line: 386, baseType: !909, size: 32, offset: 96)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !147, line: 351, size: 16, elements: !911)
!911 = !{!912, !913}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !910, file: !147, line: 359, baseType: !160, size: 8)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !910, file: !147, line: 364, baseType: !163, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !903, file: !147, line: 388, baseType: !102, size: 32, offset: 128)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !903, file: !147, line: 396, baseType: !166, size: 32, offset: 160)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !894, file: !895, line: 366, baseType: !918, size: 32, offset: 32)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 32)
!919 = !DISubroutineType(types: !920)
!920 = !{null, !901, !161}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !894, file: !895, line: 374, baseType: !922, size: 32, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!923 = !DISubroutineType(types: !924)
!924 = !{!103, !901}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !894, file: !895, line: 377, baseType: !926, size: 32, offset: 96)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DISubroutineType(types: !928)
!928 = !{!103, !901, !929}
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !895, line: 122, size: 64, elements: !932)
!932 = !{!933, !934, !935, !936, !937}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !931, file: !895, line: 123, baseType: !106, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !931, file: !895, line: 124, baseType: !160, size: 8, offset: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !931, file: !895, line: 125, baseType: !160, size: 8, offset: 40)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !931, file: !895, line: 126, baseType: !160, size: 8, offset: 48)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !931, file: !895, line: 127, baseType: !160, size: 8, offset: 56)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !894, file: !895, line: 379, baseType: !939, size: 32, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = !DISubroutineType(types: !941)
!941 = !{!103, !901, !942}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!943 = !{!887, !944}
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !889, file: !946, line: 38, type: !947, isLocal: true, isDefinition: true)
!946 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !138, line: 51, size: 64, elements: !950)
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !949, file: !138, line: 60, baseType: !922, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !949, file: !138, line: 65, baseType: !901, size: 32, offset: 32)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !955, file: !1124, line: 762, type: !1240, isLocal: true, isDefinition: true)
!955 = distinct !DICompileUnit(language: DW_LANG_C99, file: !956, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !957, retainedTypes: !975, globals: !1121, splitDebugInlining: false, nameTableKind: None)
!956 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/boards/stm32/backup_sram")
!957 = !{!30, !958, !964, !969, !216}
!958 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !959, line: 506, baseType: !32, size: 32, elements: !960)
!959 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!960 = !{!961, !962, !963}
!961 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!962 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!963 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!964 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !959, line: 512, baseType: !32, size: 32, elements: !965)
!965 = !{!966, !967, !968}
!966 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!967 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!968 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!969 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !717, line: 43, baseType: !32, size: 32, elements: !970)
!970 = !{!971, !972, !973, !974}
!971 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!972 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!973 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!974 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!975 = !{!102, !103, !976, !1046, !1051, !1011, !964, !958, !1056, !1057, !106, !1071, !1026, !1081, !224, !1082}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !959, line: 523, size: 288, elements: !979)
!979 = !{!980, !1001, !1007, !1012, !1016, !1017, !1018, !1022, !1042}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !978, file: !959, line: 524, baseType: !981, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 32)
!982 = !DISubroutineType(types: !983)
!983 = !{!103, !984, !999, !1000}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !147, line: 378, size: 192, elements: !987)
!987 = !{!988, !989, !990, !991, !997, !998}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !986, file: !147, line: 380, baseType: !150, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !986, file: !147, line: 382, baseType: !13, size: 32, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !986, file: !147, line: 384, baseType: !13, size: 32, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !986, file: !147, line: 386, baseType: !992, size: 32, offset: 96)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !147, line: 351, size: 16, elements: !994)
!994 = !{!995, !996}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !993, file: !147, line: 359, baseType: !160, size: 8)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !993, file: !147, line: 364, baseType: !163, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !986, file: !147, line: 388, baseType: !102, size: 32, offset: 128)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !986, file: !147, line: 396, baseType: !166, size: 32, offset: 160)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !959, line: 237, baseType: !160)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !959, line: 257, baseType: !106)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !978, file: !959, line: 530, baseType: !1002, size: 32, offset: 32)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 32)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!103, !984, !1005}
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !959, line: 229, baseType: !106)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !978, file: !959, line: 532, baseType: !1008, size: 32, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 32)
!1009 = !DISubroutineType(types: !1010)
!1010 = !{!103, !984, !1011, !1006}
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !959, line: 216, baseType: !106)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !978, file: !959, line: 535, baseType: !1013, size: 32, offset: 96)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!103, !984, !1011}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !978, file: !959, line: 537, baseType: !1013, size: 32, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !978, file: !959, line: 539, baseType: !1013, size: 32, offset: 160)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !978, file: !959, line: 541, baseType: !1019, size: 32, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 32)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{!103, !984, !999, !958, !964}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !978, file: !959, line: 544, baseType: !1023, size: 32, offset: 224)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!103, !984, !1026, !163}
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 32)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !959, line: 478, size: 96, elements: !1028)
!1028 = !{!1029, !1036, !1041}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1027, file: !959, line: 482, baseType: !1030, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !1031, line: 33, baseType: !1032)
!1031 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !1031, line: 29, size: 32, elements: !1033)
!1033 = !{!1034}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1032, file: !1031, line: 30, baseType: !1035, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1027, file: !959, line: 485, baseType: !1037, size: 32, offset: 32)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !959, line: 464, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 32)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{null, !984, !1026, !1011}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !1027, file: !959, line: 493, baseType: !1011, size: 32, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !978, file: !959, line: 547, baseType: !1043, size: 32, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 32)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!106, !984}
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 32)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1048)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !959, line: 428, size: 32, elements: !1049)
!1049 = !{!1050}
