; ModuleID = 'build/actinius_icarus/blinky_pwm/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %struct.z_spinlock_key, i8*, i32 }
%struct.z_spinlock_key = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %struct.z_spinlock_key }
%struct.mpsc_pbuf_buffer_config = type { i32*, i32, void (%struct.mpsc_pbuf_buffer*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/blinky_pwm/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/blinky_pwm")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/blinky_pwm")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !27, file: !65, line: 18, type: !67, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !37, globals: !62, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/blinky_pwm")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !{!22, !38, !24, !39, !41, !43, !47, !49, !50, !51, !53, !55, !56, !57, !60, !44}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!40 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!42 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 214, baseType: !32)
!48 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!49 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!54 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !59)
!59 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !61)
!61 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!62 = !{!25, !63}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !65, line: 18, type: !66, isLocal: true, isDefinition: true)
!65 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !69, line: 16, size: 64, elements: !70)
!69 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!70 = !{!71, !72}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !68, file: !69, line: 17, baseType: !44, size: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !68, file: !69, line: 18, baseType: !58, size: 8, offset: 32)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "_char_out", scope: !75, file: !150, line: 54, type: !151, isLocal: false, isDefinition: true)
!75 = distinct !DICompileUnit(language: DW_LANG_C99, file: !76, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, retainedTypes: !148, globals: !149, splitDebugInlining: false, nameTableKind: None)
!76 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/blinky_pwm")
!77 = !{!78}
!78 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !79, line: 27, baseType: !32, size: 32, elements: !80)
!79 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147}
!81 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!82 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!83 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!84 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!85 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!86 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!87 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!88 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!89 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!90 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!91 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!92 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!93 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!94 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!95 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!96 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!97 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!115 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!116 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!117 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!118 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!119 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!120 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!121 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!122 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!123 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!124 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!125 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!126 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!127 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!128 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!129 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!130 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!131 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!132 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!133 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!134 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!135 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!136 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!137 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!138 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!139 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!140 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!141 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!142 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!143 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!144 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!145 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!146 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!147 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!148 = !{!38, !49}
!149 = !{!73}
!150 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DISubroutineType(types: !153)
!153 = !{!49, !49}
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !156, file: !214, line: 35, type: !231, isLocal: false, isDefinition: true)
!156 = distinct !DICompileUnit(language: DW_LANG_C99, file: !157, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, retainedTypes: !158, globals: !211, splitDebugInlining: false, nameTableKind: None)
!157 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/blinky_pwm")
!158 = !{!38, !49, !159, !164, !171}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !161, file: !160, line: 167, baseType: !170)
!160 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!161 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !160, file: !160, line: 134, type: !162, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !156, retainedNodes: !165)
!162 = !DISubroutineType(types: !163)
!163 = !{null, !164}
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!165 = !{!166, !167, !169}
!166 = !DILocalVariable(name: "time_us", arg: 1, scope: !161, file: !160, line: 134, type: !164)
!167 = !DILocalVariable(name: "delay_cycles", scope: !161, file: !160, line: 168, type: !168)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!169 = !DILocalVariable(name: "cycles", scope: !161, file: !160, line: 171, type: !164)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !173, line: 1928, baseType: !174)
!173 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !173, line: 1909, size: 11360, elements: !175)
!175 = !{!176, !182, !183, !184, !185, !189, !190, !191, !192, !196, !197, !201, !202, !203, !204, !205, !209, !210}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !174, file: !173, line: 1910, baseType: !177, size: 8192)
!177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 8192, elements: !180)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !164)
!180 = !{!181}
!181 = !DISubrange(count: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !174, file: !173, line: 1911, baseType: !178, size: 32, offset: 8192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !174, file: !173, line: 1912, baseType: !178, size: 32, offset: 8224)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !174, file: !173, line: 1913, baseType: !178, size: 32, offset: 8256)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !174, file: !173, line: 1914, baseType: !186, size: 1984, offset: 8288)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 1984, elements: !187)
!187 = !{!188}
!188 = !DISubrange(count: 62)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !174, file: !173, line: 1915, baseType: !179, size: 32, offset: 10272)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !174, file: !173, line: 1916, baseType: !178, size: 32, offset: 10304)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !174, file: !173, line: 1917, baseType: !179, size: 32, offset: 10336)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !174, file: !173, line: 1918, baseType: !193, size: 96, offset: 10368)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 96, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 3)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !174, file: !173, line: 1919, baseType: !179, size: 32, offset: 10464)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !174, file: !173, line: 1920, baseType: !198, size: 256, offset: 10496)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 256, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 8)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !174, file: !173, line: 1921, baseType: !179, size: 32, offset: 10752)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !174, file: !173, line: 1922, baseType: !178, size: 32, offset: 10784)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !174, file: !173, line: 1923, baseType: !179, size: 32, offset: 10816)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !174, file: !173, line: 1924, baseType: !179, size: 32, offset: 10848)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !174, file: !173, line: 1925, baseType: !206, size: 416, offset: 10880)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !178, size: 416, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 13)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !174, file: !173, line: 1926, baseType: !179, size: 32, offset: 11296)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !174, file: !173, line: 1927, baseType: !179, size: 32, offset: 11328)
!211 = !{!154, !212, !227}
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !156, file: !214, line: 65, type: !215, isLocal: true, isDefinition: true, align: 32)
!214 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !217, line: 51, size: 64, elements: !218)
!217 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!218 = !{!219, !226}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !216, file: !217, line: 60, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32)
!221 = !DISubroutineType(types: !222)
!222 = !{!49, !223}
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!225 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !217, line: 48, flags: DIFlagFwdDecl)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !216, file: !217, line: 65, baseType: !223, size: 32, offset: 32)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !161, file: !160, line: 161, type: !229, isLocal: true, isDefinition: true, align: 128)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 48, elements: !194)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !69, line: 16, size: 64, elements: !233)
!233 = !{!234, !235}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !232, file: !69, line: 17, baseType: !44, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !232, file: !69, line: 18, baseType: !58, size: 8, offset: 32)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "log_const_log", scope: !238, file: !314, line: 25, type: !549, isLocal: false, isDefinition: true)
!238 = distinct !DICompileUnit(language: DW_LANG_C99, file: !239, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !240, retainedTypes: !246, globals: !311, splitDebugInlining: false, nameTableKind: None)
!239 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/blinky_pwm")
!240 = !{!241, !30, !78}
!241 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !242, line: 33, baseType: !32, size: 32, elements: !243)
!242 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!243 = !{!244, !245}
!244 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!245 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!246 = !{!47, !49, !38, !57, !247, !22, !301, !24, !164, !302, !304, !307, !309}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !249)
!249 = !{!250, !267, !273}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !248, file: !31, line: 112, baseType: !251, size: 32)
!251 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !252, line: 49, size: 32, elements: !253)
!252 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_packet.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!253 = !{!254, !260, !266}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !251, file: !252, line: 50, baseType: !255, size: 32)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !252, line: 37, size: 32, elements: !256)
!256 = !{!257, !258, !259}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !255, file: !252, line: 38, baseType: !164, size: 1, flags: DIFlagBitField, extraData: i64 0)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !255, file: !252, line: 38, baseType: !164, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !255, file: !252, line: 39, baseType: !164, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !251, file: !252, line: 51, baseType: !261, size: 32)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !252, line: 43, size: 32, elements: !262)
!262 = !{!263, !264, !265}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !261, file: !252, line: 44, baseType: !164, size: 1, flags: DIFlagBitField, extraData: i64 0)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !261, file: !252, line: 44, baseType: !164, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !261, file: !252, line: 45, baseType: !164, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !251, file: !252, line: 52, baseType: !164, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !248, file: !31, line: 113, baseType: !268, size: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !269)
!269 = !{!270, !271, !272}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !268, file: !31, line: 108, baseType: !164, size: 1, flags: DIFlagBitField, extraData: i64 0)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !268, file: !31, line: 108, baseType: !164, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !268, file: !31, line: 108, baseType: !164, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !248, file: !31, line: 114, baseType: !274, size: 128)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !275)
!275 = !{!276, !293, !297}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !274, file: !31, line: 89, baseType: !277, size: 96)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !278)
!278 = !{!279, !290, !291}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !277, file: !31, line: 67, baseType: !280, size: 32)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !281)
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !280, file: !31, line: 52, baseType: !164, size: 1, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !280, file: !31, line: 52, baseType: !164, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !280, file: !31, line: 52, baseType: !164, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !280, file: !31, line: 53, baseType: !164, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !280, file: !31, line: 54, baseType: !164, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !280, file: !31, line: 55, baseType: !164, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !280, file: !31, line: 56, baseType: !164, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !280, file: !31, line: 57, baseType: !164, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !277, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !277, file: !31, line: 76, baseType: !292, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !164)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !274, file: !31, line: 93, baseType: !294, size: 32, offset: 96)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 4)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !274, file: !31, line: 94, baseType: !298, offset: 128)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, elements: !299)
!299 = !{!300}
!300 = !DISubrange(count: -1)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !303)
!303 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !305, line: 46, baseType: !306)
!305 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !54)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!311 = !{!236, !312, !341, !348, !351, !353, !357, !359, !361, !363, !365, !371, !404, !407, !414, !506, !533, !540, !542, !546, !554, !564}
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "log_process_thread_sem", scope: !238, file: !314, line: 93, type: !315, isLocal: false, isDefinition: true, align: 32)
!314 = !DIFile(filename: "zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !316, line: 2909, size: 128, elements: !317)
!316 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = !{!318, !339, !340}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !315, file: !316, line: 2910, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !320, line: 233, baseType: !321)
!320 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 231, size: 64, elements: !322)
!322 = !{!323}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !321, file: !320, line: 232, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !325, line: 48, baseType: !326)
!325 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !325, line: 37, size: 64, elements: !327)
!327 = !{!328, !334}
!328 = !DIDerivedType(tag: DW_TAG_member, scope: !326, file: !325, line: 38, baseType: !329, size: 32)
!329 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !326, file: !325, line: 38, size: 32, elements: !330)
!330 = !{!331, !333}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !329, file: !325, line: 39, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !329, file: !325, line: 40, baseType: !332, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, scope: !326, file: !325, line: 42, baseType: !335, size: 32, offset: 32)
!335 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !326, file: !325, line: 42, size: 32, elements: !336)
!336 = !{!337, !338}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !335, file: !325, line: 43, baseType: !332, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !335, file: !325, line: 44, baseType: !332, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !315, file: !316, line: 2911, baseType: !32, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !315, file: !316, line: 2912, baseType: !32, size: 32, offset: 96)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "__init_enable_logger", scope: !238, file: !314, line: 910, type: !343, isLocal: true, isDefinition: true, align: 32)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !217, line: 51, size: 64, elements: !345)
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !344, file: !217, line: 60, baseType: !220, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !344, file: !217, line: 65, baseType: !223, size: 32, offset: 32)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "panic_mode", scope: !238, file: !314, line: 96, type: !350, isLocal: true, isDefinition: true)
!350 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "backend_attached", scope: !238, file: !314, line: 97, type: !350, isLocal: true, isDefinition: true)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "buffered_cnt", scope: !238, file: !314, line: 98, type: !355, isLocal: true, isDefinition: true)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !356, line: 22, baseType: !52)
!356 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "dropped_cnt", scope: !238, file: !314, line: 99, type: !355, isLocal: true, isDefinition: true)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "timestamp_freq", scope: !238, file: !314, line: 105, type: !164, isLocal: true, isDefinition: true)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "prev_timestamp", scope: !238, file: !314, line: 107, type: !292, isLocal: true, isDefinition: true)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "unordered_cnt", scope: !238, file: !314, line: 108, type: !355, isLocal: true, isDefinition: true)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "log_msg_ptr", scope: !238, file: !314, line: 111, type: !367, isLocal: true, isDefinition: true, align: 32)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_ptr", file: !368, line: 29, size: 32, elements: !369)
!368 = !DIFile(filename: "zephyr/include/zephyr/logging/log_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !367, file: !368, line: 30, baseType: !247, size: 32)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "log_buffer", scope: !238, file: !314, line: 112, type: !373, isLocal: true, isDefinition: true, align: 32)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !374, line: 87, size: 448, elements: !375)
!374 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_pbuf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!375 = !{!376, !377, !378, !379, !380, !381, !385, !394, !399, !401, !402, !403}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !373, file: !374, line: 89, baseType: !164, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !373, file: !374, line: 92, baseType: !164, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !373, file: !374, line: 95, baseType: !164, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !373, file: !374, line: 98, baseType: !164, size: 32, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !373, file: !374, line: 101, baseType: !164, size: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !373, file: !374, line: 104, baseType: !382, offset: 160)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !383, line: 43, elements: !384)
!383 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!384 = !{}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !373, file: !374, line: 110, baseType: !386, size: 32, offset: 160)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !374, line: 83, baseType: !387)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !390, !392}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !251)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !373, file: !374, line: 113, baseType: !395, size: 32, offset: 192)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !374, line: 75, baseType: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 32)
!397 = !DISubroutineType(types: !398)
!398 = !{!164, !392}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !373, file: !374, line: 116, baseType: !400, size: 32, offset: 224)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !373, file: !374, line: 119, baseType: !164, size: 32, offset: 256)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !373, file: !374, line: 122, baseType: !164, size: 32, offset: 288)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !373, file: !374, line: 124, baseType: !315, size: 128, offset: 320)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "curr_log_buffer", scope: !238, file: !314, line: 113, type: !406, isLocal: true, isDefinition: true)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 32)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "logging_stack", scope: !238, file: !314, line: 884, type: !409, isLocal: false, isDefinition: true, align: 64)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 64, elements: !199)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !411, line: 47, size: 8, elements: !412)
!411 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !410, file: !411, line: 48, baseType: !46, size: 8)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "logging_thread", scope: !238, file: !314, line: 885, type: !416, isLocal: false, isDefinition: true)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !417, line: 245, size: 1024, elements: !418)
!417 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!418 = !{!419, !464, !477, !478, !479, !480, !486, !501}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !416, file: !417, line: 247, baseType: !420, size: 384)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !417, line: 57, size: 384, elements: !421)
!421 = !{!422, !436, !438, !439, !440, !451, !452, !453}
!422 = !DIDerivedType(tag: DW_TAG_member, scope: !420, file: !417, line: 60, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !420, file: !417, line: 60, size: 64, elements: !424)
!424 = !{!425, !427}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !423, file: !417, line: 61, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !325, line: 49, baseType: !326)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !423, file: !417, line: 62, baseType: !428, size: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !429, line: 49, size: 64, elements: !430)
!429 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !428, file: !429, line: 50, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 64, elements: !434)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!434 = !{!435}
!435 = !DISubrange(count: 2)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !420, file: !417, line: 68, baseType: !437, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !420, file: !417, line: 71, baseType: !58, size: 8, offset: 96)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !420, file: !417, line: 74, baseType: !58, size: 8, offset: 104)
!440 = !DIDerivedType(tag: DW_TAG_member, scope: !420, file: !417, line: 90, baseType: !441, size: 16, offset: 112)
!441 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !420, file: !417, line: 90, size: 16, elements: !442)
!442 = !{!443, !450}
!443 = !DIDerivedType(tag: DW_TAG_member, scope: !441, file: !417, line: 91, baseType: !444, size: 16)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !441, file: !417, line: 91, size: 16, elements: !445)
!445 = !{!446, !449}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !444, file: !417, line: 96, baseType: !447, size: 8)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !448)
!448 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !444, file: !417, line: 97, baseType: !58, size: 8, offset: 8)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !441, file: !417, line: 100, baseType: !60, size: 16)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !420, file: !417, line: 107, baseType: !164, size: 32, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !420, file: !417, line: 127, baseType: !38, size: 32, offset: 160)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !420, file: !417, line: 131, baseType: !454, size: 192, offset: 192)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !320, line: 244, size: 192, elements: !455)
!455 = !{!456, !457, !463}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !454, file: !320, line: 245, baseType: !426, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !454, file: !320, line: 246, baseType: !458, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !320, line: 242, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !462}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !454, file: !320, line: 249, baseType: !306, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !416, file: !417, line: 250, baseType: !465, size: 288, offset: 384)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !466, line: 25, size: 288, elements: !467)
!466 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !465, file: !466, line: 26, baseType: !164, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !465, file: !466, line: 27, baseType: !164, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !465, file: !466, line: 28, baseType: !164, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !465, file: !466, line: 29, baseType: !164, size: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !465, file: !466, line: 30, baseType: !164, size: 32, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !465, file: !466, line: 31, baseType: !164, size: 32, offset: 160)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !465, file: !466, line: 32, baseType: !164, size: 32, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !465, file: !466, line: 33, baseType: !164, size: 32, offset: 224)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !465, file: !466, line: 34, baseType: !164, size: 32, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !416, file: !417, line: 253, baseType: !38, size: 32, offset: 672)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !416, file: !417, line: 256, baseType: !319, size: 64, offset: 704)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !416, file: !417, line: 294, baseType: !49, size: 32, offset: 768)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !416, file: !417, line: 300, baseType: !481, size: 96, offset: 800)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !417, line: 149, size: 96, elements: !482)
!482 = !{!483, !484, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !481, file: !417, line: 153, baseType: !22, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !481, file: !417, line: 162, baseType: !47, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !481, file: !417, line: 168, baseType: !47, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !416, file: !417, line: 325, baseType: !487, size: 32, offset: 896)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !316, line: 5073, size: 160, elements: !489)
!489 = !{!490, !499, !500}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !488, file: !316, line: 5074, baseType: !491, size: 96)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !492, line: 56, size: 96, elements: !493)
!492 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!493 = !{!494, !497, !498}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !491, file: !492, line: 57, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 32)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !492, line: 57, flags: DIFlagFwdDecl)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !491, file: !492, line: 58, baseType: !38, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !491, file: !492, line: 59, baseType: !47, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !488, file: !316, line: 5075, baseType: !319, size: 64, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !488, file: !316, line: 5076, baseType: !382, offset: 160)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !416, file: !417, line: 343, baseType: !502, size: 64, offset: 928)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !466, line: 60, size: 64, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !502, file: !466, line: 63, baseType: !164, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !502, file: !466, line: 66, baseType: !164, size: 32, offset: 32)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "format_table", scope: !238, file: !314, line: 72, type: !508, isLocal: true, isDefinition: true)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 128, elements: !295)
!509 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !510)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_format_func_t", file: !511, line: 105, baseType: !512)
!511 = !DIFile(filename: "zephyr/include/zephyr/logging/log_output.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 32)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !515, !301, !164}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !511, line: 89, size: 128, elements: !518)
!518 = !{!519, !524, !531, !532}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !517, file: !511, line: 90, baseType: !520, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_output_func_t", file: !511, line: 79, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 32)
!522 = !DISubroutineType(types: !523)
!523 = !{!49, !57, !47, !38}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !517, file: !511, line: 91, baseType: !525, size: 32, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !511, line: 82, size: 96, elements: !527)
!527 = !{!528, !529, !530}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !526, file: !511, line: 83, baseType: !355, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !526, file: !511, line: 84, baseType: !38, size: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !526, file: !511, line: 85, baseType: !44, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !517, file: !511, line: 92, baseType: !57, size: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !517, file: !511, line: 93, baseType: !47, size: 32, offset: 96)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "timestamp_func", scope: !238, file: !314, line: 104, type: !535, isLocal: true, isDefinition: true)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_get_t", file: !536, line: 33, baseType: !537)
!536 = !DIFile(filename: "zephyr/include/zephyr/logging/log_ctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = !DISubroutineType(types: !539)
!539 = !{!292}
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "initialized", scope: !238, file: !314, line: 95, type: !355, isLocal: true, isDefinition: true)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "proc_tid", scope: !238, file: !314, line: 100, type: !544, isLocal: true, isDefinition: true)
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !417, line: 347, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !238, file: !314, line: 25, type: !548, isLocal: true, isDefinition: true)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !69, line: 16, size: 64, elements: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !550, file: !69, line: 17, baseType: !44, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !550, file: !69, line: 18, baseType: !58, size: 8, offset: 32)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "mpsc_config", scope: !238, file: !314, line: 121, type: !556, isLocal: true, isDefinition: true)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !374, line: 128, size: 160, elements: !558)
!558 = !{!559, !560, !561, !562, !563}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !557, file: !374, line: 130, baseType: !400, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !557, file: !374, line: 133, baseType: !164, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !557, file: !374, line: 136, baseType: !386, size: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !557, file: !374, line: 137, baseType: !395, size: 32, offset: 96)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !557, file: !374, line: 140, baseType: !164, size: 32, offset: 128)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "buf32", scope: !238, file: !314, line: 116, type: !566, isLocal: true, isDefinition: true, align: 64)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 32, elements: !567)
!567 = !{!568}
!568 = !DISubrange(count: 1)
!569 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "log_const_log_mgmt", scope: !572, file: !581, line: 14, type: !814, isLocal: false, isDefinition: true)
!572 = distinct !DICompileUnit(language: DW_LANG_C99, file: !573, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !574, retainedTypes: !575, globals: !578, splitDebugInlining: false, nameTableKind: None)
!573 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/blinky_pwm")
!574 = !{!241, !78}
!575 = !{!38, !49, !576, !57, !44, !22}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!578 = !{!570, !579, !607, !789, !791, !805, !807, !812}
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "sname_cache", scope: !572, file: !581, line: 44, type: !582, isLocal: true, isDefinition: true)
!581 = !DIFile(filename: "zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache", file: !583, line: 30, size: 256, elements: !584)
!583 = !DIFile(filename: "zephyr/subsys/logging/log_cache.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!584 = !{!585, !598, !599, !604, !605, !606}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !582, file: !583, line: 31, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !587, line: 40, baseType: !588)
!587 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !587, line: 35, size: 64, elements: !589)
!589 = !{!590, !597}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !588, file: !587, line: 36, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !587, line: 33, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !587, line: 29, size: 32, elements: !594)
!594 = !{!595}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !593, file: !587, line: 30, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !588, file: !587, line: 37, baseType: !591, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !582, file: !583, line: 32, baseType: !586, size: 64, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !582, file: !583, line: 33, baseType: !600, size: 32, offset: 128)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_cache_cmp_func_t", file: !583, line: 21, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 32)
!602 = !DISubroutineType(types: !603)
!603 = !{!350, !22, !22}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !582, file: !583, line: 34, baseType: !164, size: 32, offset: 160)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "miss", scope: !582, file: !583, line: 35, baseType: !164, size: 32, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !582, file: !583, line: 36, baseType: !47, size: 32, offset: 224)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "invalid_domain", scope: !609, file: !581, line: 261, type: !44, isLocal: true, isDefinition: true)
!609 = distinct !DISubprogram(name: "link_domain_name_get", scope: !581, file: !581, line: 256, type: !610, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !572, retainedNodes: !612)
!610 = !DISubroutineType(types: !611)
!611 = !{!44, !58}
!612 = !{!613, !614, !615, !616, !617, !620, !788}
!613 = !DILocalVariable(name: "domain_id", arg: 1, scope: !609, file: !581, line: 256, type: !58)
!614 = !DILocalVariable(name: "cached", scope: !609, file: !581, line: 258, type: !57)
!615 = !DILocalVariable(name: "cache_size", scope: !609, file: !581, line: 259, type: !47)
!616 = !DILocalVariable(name: "id", scope: !609, file: !581, line: 260, type: !22)
!617 = !DILocalVariable(name: "rel_domain_id", scope: !618, file: !581, line: 265, type: !58)
!618 = distinct !DILexicalBlock(scope: !619, file: !581, line: 264, column: 49)
!619 = distinct !DILexicalBlock(scope: !609, file: !581, line: 264, column: 6)
!620 = !DILocalVariable(name: "link", scope: !618, file: !581, line: 266, type: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link", file: !624, line: 61, size: 192, elements: !625)
!624 = !DIFile(filename: "zephyr/include/zephyr/logging/log_link.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!625 = !{!626, !715, !716, !725, !726, !778}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !623, file: !624, line: 62, baseType: !627, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_api", file: !624, line: 38, size: 192, elements: !630)
!630 = !{!631, !694, !698, !703, !707, !711}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "initiate", scope: !629, file: !624, line: 39, baseType: !632, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = !DISubroutineType(types: !634)
!634 = !{!49, !621, !635}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_config", file: !624, line: 33, size: 64, elements: !637)
!637 = !{!638, !689}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "msg_cb", scope: !636, file: !624, line: 34, baseType: !639, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_callback_t", file: !624, line: 27, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 32)
!641 = !DISubroutineType(types: !642)
!642 = !{null, !621, !643}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 32)
!644 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !645)
!645 = !{!646, !662, !668}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !644, file: !31, line: 112, baseType: !647, size: 32)
!647 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !252, line: 49, size: 32, elements: !648)
!648 = !{!649, !655, !661}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !647, file: !252, line: 50, baseType: !650, size: 32)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !252, line: 37, size: 32, elements: !651)
!651 = !{!652, !653, !654}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !650, file: !252, line: 38, baseType: !164, size: 1, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !650, file: !252, line: 38, baseType: !164, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !650, file: !252, line: 39, baseType: !164, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !647, file: !252, line: 51, baseType: !656, size: 32)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !252, line: 43, size: 32, elements: !657)
!657 = !{!658, !659, !660}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !656, file: !252, line: 44, baseType: !164, size: 1, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !656, file: !252, line: 44, baseType: !164, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !656, file: !252, line: 45, baseType: !164, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !647, file: !252, line: 52, baseType: !164, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !644, file: !31, line: 113, baseType: !663, size: 32)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !664)
!664 = !{!665, !666, !667}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !663, file: !31, line: 108, baseType: !164, size: 1, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !663, file: !31, line: 108, baseType: !164, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !663, file: !31, line: 108, baseType: !164, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !644, file: !31, line: 114, baseType: !669, size: 128)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !670)
!670 = !{!671, !687, !688}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !669, file: !31, line: 89, baseType: !672, size: 96)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !673)
!673 = !{!674, !685, !686}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !672, file: !31, line: 67, baseType: !675, size: 32)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !682, !683, !684}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !675, file: !31, line: 52, baseType: !164, size: 1, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !675, file: !31, line: 52, baseType: !164, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !675, file: !31, line: 52, baseType: !164, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !675, file: !31, line: 53, baseType: !164, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !675, file: !31, line: 54, baseType: !164, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !675, file: !31, line: 55, baseType: !164, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !675, file: !31, line: 56, baseType: !164, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !675, file: !31, line: 57, baseType: !164, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !672, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !672, file: !31, line: 76, baseType: !292, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !669, file: !31, line: 93, baseType: !294, size: 32, offset: 96)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !669, file: !31, line: 94, baseType: !298, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "dropped_cb", scope: !636, file: !624, line: 35, baseType: !690, size: 32, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_dropped_cb_t", file: !624, line: 30, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !621, !164}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !629, file: !624, line: 40, baseType: !695, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!696 = !DISubroutineType(types: !697)
!697 = !{!49, !621}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "get_domain_name", scope: !629, file: !624, line: 41, baseType: !699, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!700 = !DISubroutineType(types: !701)
!701 = !{!49, !621, !164, !56, !702}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "get_source_name", scope: !629, file: !624, line: 43, baseType: !704, size: 32, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!705 = !DISubroutineType(types: !706)
!706 = !{!49, !621, !164, !60, !56, !702}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "get_levels", scope: !629, file: !624, line: 45, baseType: !708, size: 32, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 32)
!709 = !DISubroutineType(types: !710)
!710 = !{!49, !621, !164, !60, !57, !57}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "set_runtime_level", scope: !629, file: !624, line: 48, baseType: !712, size: 32, offset: 160)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!713 = !DISubroutineType(types: !714)
!714 = !{!49, !621, !164, !60, !58}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !623, file: !624, line: 63, baseType: !44, size: 32, offset: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl_blk", scope: !623, file: !624, line: 64, baseType: !717, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 32)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_ctrl_blk", file: !624, line: 52, size: 128, elements: !719)
!719 = !{!720, !721, !723, !724}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "domain_cnt", scope: !718, file: !624, line: 53, baseType: !164, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "source_cnt", scope: !718, file: !624, line: 54, baseType: !722, size: 16, offset: 32)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 16, elements: !567)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "domain_offset", scope: !718, file: !624, line: 57, baseType: !164, size: 32, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !718, file: !624, line: 58, baseType: !400, size: 32, offset: 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !623, file: !624, line: 65, baseType: !38, size: 32, offset: 96)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf", scope: !623, file: !624, line: 66, baseType: !727, size: 32, offset: 128)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !374, line: 87, size: 448, elements: !729)
!729 = !{!730, !731, !732, !733, !734, !735, !737, !746, !751, !752, !753, !754}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !728, file: !374, line: 89, baseType: !164, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !728, file: !374, line: 92, baseType: !164, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !728, file: !374, line: 95, baseType: !164, size: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !728, file: !374, line: 98, baseType: !164, size: 32, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !728, file: !374, line: 101, baseType: !164, size: 32, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !728, file: !374, line: 104, baseType: !736, offset: 160)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !383, line: 43, elements: !384)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !728, file: !374, line: 110, baseType: !738, size: 32, offset: 160)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !374, line: 83, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DISubroutineType(types: !741)
!741 = !{null, !742, !744}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !728)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !728, file: !374, line: 113, baseType: !747, size: 32, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !374, line: 75, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!749 = !DISubroutineType(types: !750)
!750 = !{!164, !744}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !728, file: !374, line: 116, baseType: !400, size: 32, offset: 224)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !728, file: !374, line: 119, baseType: !164, size: 32, offset: 256)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !728, file: !374, line: 122, baseType: !164, size: 32, offset: 288)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !728, file: !374, line: 124, baseType: !755, size: 128, offset: 320)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !316, line: 2909, size: 128, elements: !756)
!756 = !{!757, !776, !777}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !755, file: !316, line: 2910, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !320, line: 233, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 231, size: 64, elements: !760)
!760 = !{!761}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !759, file: !320, line: 232, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !325, line: 48, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !325, line: 37, size: 64, elements: !764)
!764 = !{!765, !771}
!765 = !DIDerivedType(tag: DW_TAG_member, scope: !763, file: !325, line: 38, baseType: !766, size: 32)
!766 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !763, file: !325, line: 38, size: 32, elements: !767)
!767 = !{!768, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !766, file: !325, line: 39, baseType: !769, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !766, file: !325, line: 40, baseType: !769, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, scope: !763, file: !325, line: 42, baseType: !772, size: 32, offset: 32)
!772 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !763, file: !325, line: 42, size: 32, elements: !773)
!773 = !{!774, !775}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !772, file: !325, line: 43, baseType: !769, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !772, file: !325, line: 44, baseType: !769, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !755, file: !316, line: 2911, baseType: !32, size: 32, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !755, file: !316, line: 2912, baseType: !32, size: 32, offset: 96)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf_config", scope: !623, file: !624, line: 67, baseType: !779, size: 32, offset: 160)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !374, line: 128, size: 160, elements: !782)
!782 = !{!783, !784, !785, !786, !787}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !781, file: !374, line: 130, baseType: !400, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !781, file: !374, line: 133, baseType: !164, size: 32, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !781, file: !374, line: 136, baseType: !738, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !781, file: !374, line: 137, baseType: !747, size: 32, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !781, file: !374, line: 140, baseType: !164, size: 32, offset: 128)
!788 = !DILocalVariable(name: "err", scope: !618, file: !581, line: 267, type: !49)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "dname_cache", scope: !572, file: !581, line: 43, type: !582, isLocal: true, isDefinition: true)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "dname_cache_config", scope: !793, file: !581, line: 152, type: !798, isLocal: true, isDefinition: true)
!793 = distinct !DISubprogram(name: "cache_init", scope: !581, file: !581, line: 149, type: !794, scopeLine: 150, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !572, retainedNodes: !796)
!794 = !DISubroutineType(types: !795)
!795 = !{null}
!796 = !{!797}
!797 = !DILocalVariable(name: "err", scope: !793, file: !581, line: 151, type: !49)
!798 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache_config", file: !583, line: 23, size: 128, elements: !800)
!800 = !{!801, !802, !803, !804}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !799, file: !583, line: 24, baseType: !38, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !799, file: !583, line: 25, baseType: !47, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !799, file: !583, line: 26, baseType: !47, size: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !799, file: !583, line: 27, baseType: !600, size: 32, offset: 96)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "sname_cache_config", scope: !793, file: !581, line: 158, type: !798, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "dname_cache_buffer", scope: !572, file: !581, line: 40, type: !809, isLocal: true, isDefinition: true, align: 32)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 72, elements: !810)
!810 = !{!811}
!811 = !DISubrange(count: 9)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "sname_cache_buffer", scope: !572, file: !581, line: 41, type: !809, isLocal: true, isDefinition: true, align: 32)
!814 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !69, line: 16, size: 64, elements: !816)
!816 = !{!817, !818}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !815, file: !69, line: 17, baseType: !44, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !815, file: !69, line: 18, baseType: !58, size: 8, offset: 32)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "prefix", scope: !821, file: !822, line: 562, type: !867, isLocal: true, isDefinition: true)
!821 = distinct !DISubprogram(name: "log_output_dropped_process", scope: !822, file: !822, line: 558, type: !823, scopeLine: 559, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !839, retainedNodes: !860)
!822 = !DIFile(filename: "zephyr/subsys/logging/log_output.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!823 = !DISubroutineType(types: !824)
!824 = !{null, !825, !164}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !511, line: 89, size: 128, elements: !828)
!828 = !{!829, !830, !837, !838}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !827, file: !511, line: 90, baseType: !520, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !827, file: !511, line: 91, baseType: !831, size: 32, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 32)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !511, line: 82, size: 96, elements: !833)
!833 = !{!834, !835, !836}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !832, file: !511, line: 83, baseType: !355, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !832, file: !511, line: 84, baseType: !38, size: 32, offset: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !832, file: !511, line: 85, baseType: !44, size: 32, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !827, file: !511, line: 92, baseType: !57, size: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !827, file: !511, line: 93, baseType: !47, size: 32, offset: 96)
!839 = distinct !DICompileUnit(language: DW_LANG_C99, file: !840, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !77, retainedTypes: !841, globals: !842, splitDebugInlining: false, nameTableKind: None)
!840 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_output.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/blinky_pwm")
!841 = !{!22, !38, !57, !302, !49, !164, !825, !46, !59, !32, !576}
!842 = !{!819, !843, !848, !850, !852, !858}
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "postfix", scope: !821, file: !822, line: 563, type: !845, isLocal: true, isDefinition: true)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 224, elements: !846)
!846 = !{!847}
!847 = !DISubrange(count: 28)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "freq", scope: !839, file: !822, line: 46, type: !164, isLocal: true, isDefinition: true)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "timestamp_div", scope: !839, file: !822, line: 47, type: !292, isLocal: true, isDefinition: true)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "colors", scope: !839, file: !822, line: 38, type: !854, isLocal: true, isDefinition: true)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !855, size: 160, elements: !856)
!855 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!856 = !{!857}
!857 = !DISubrange(count: 5)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "severity", scope: !839, file: !822, line: 30, type: !854, isLocal: true, isDefinition: true)
!860 = !{!861, !862, !863, !865, !866}
!861 = !DILocalVariable(name: "output", arg: 1, scope: !821, file: !822, line: 558, type: !825)
!862 = !DILocalVariable(name: "cnt", arg: 2, scope: !821, file: !822, line: 558, type: !164)
!863 = !DILocalVariable(name: "buf", scope: !821, file: !822, line: 560, type: !864)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 40, elements: !856)
!865 = !DILocalVariable(name: "len", scope: !821, file: !822, line: 561, type: !49)
!866 = !DILocalVariable(name: "outf", scope: !821, file: !822, line: 565, type: !520)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 96, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 12)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "log_const_log_uart", scope: !872, file: !935, line: 16, type: !1063, isLocal: false, isDefinition: true)
!872 = distinct !DICompileUnit(language: DW_LANG_C99, file: !873, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !574, retainedTypes: !874, globals: !932, splitDebugInlining: false, nameTableKind: None)
!873 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/backends/log_backend_uart.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/blinky_pwm")
!874 = !{!38, !49, !875}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !878, line: 336, size: 160, elements: !879)
!878 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!879 = !{!880, !906, !910, !914, !927}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !877, file: !878, line: 365, baseType: !881, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = !DISubroutineType(types: !883)
!883 = !{!49, !884, !905}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !887, line: 378, size: 192, elements: !888)
!887 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!888 = !{!889, !890, !891, !892, !898, !899}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !886, file: !887, line: 380, baseType: !44, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !886, file: !887, line: 382, baseType: !13, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !886, file: !887, line: 384, baseType: !13, size: 32, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !886, file: !887, line: 386, baseType: !893, size: 32, offset: 96)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !887, line: 351, size: 16, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !894, file: !887, line: 359, baseType: !58, size: 8)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !894, file: !887, line: 364, baseType: !350, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !886, file: !887, line: 388, baseType: !38, size: 32, offset: 128)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !886, file: !887, line: 396, baseType: !900, size: 32, offset: 160)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !887, line: 43, baseType: !903)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !904)
!904 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !877, file: !878, line: 366, baseType: !907, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 32)
!908 = !DISubroutineType(types: !909)
!909 = !{null, !884, !59}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !877, file: !878, line: 374, baseType: !911, size: 32, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!912 = !DISubroutineType(types: !913)
!913 = !{!49, !884}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !877, file: !878, line: 377, baseType: !915, size: 32, offset: 96)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 32)
!916 = !DISubroutineType(types: !917)
!917 = !{!49, !884, !918}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !878, line: 122, size: 64, elements: !921)
!921 = !{!922, !923, !924, !925, !926}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !920, file: !878, line: 123, baseType: !164, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !920, file: !878, line: 124, baseType: !58, size: 8, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !920, file: !878, line: 125, baseType: !58, size: 8, offset: 40)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !920, file: !878, line: 126, baseType: !58, size: 8, offset: 48)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !920, file: !878, line: 127, baseType: !58, size: 8, offset: 56)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !877, file: !878, line: 379, baseType: !928, size: 32, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 32)
!929 = !DISubroutineType(types: !930)
!930 = !{!49, !884, !931}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 32)
!932 = !{!870, !933, !1031, !1033, !1035, !1050, !1053, !1055, !1058, !1061}
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "log_backend_uart_api", scope: !872, file: !935, line: 156, type: !936, isLocal: false, isDefinition: true)
!935 = !DIFile(filename: "zephyr/subsys/logging/backends/log_backend_uart.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_backend_api", file: !242, line: 62, size: 224, elements: !938)
!938 = !{!939, !1006, !1010, !1014, !1015, !1019, !1023}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !937, file: !242, line: 63, baseType: !940, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DISubroutineType(types: !942)
!942 = !{null, !943, !960}
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_backend", file: !242, line: 93, size: 128, elements: !947)
!947 = !{!948, !950, !958, !959}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !946, file: !242, line: 94, baseType: !949, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !946, file: !242, line: 95, baseType: !951, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_backend_control_block", file: !242, line: 81, size: 64, elements: !953)
!953 = !{!954, !955, !956, !957}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !952, file: !242, line: 82, baseType: !38, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !952, file: !242, line: 83, baseType: !58, size: 8, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !952, file: !242, line: 84, baseType: !350, size: 8, offset: 40)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !952, file: !242, line: 87, baseType: !58, size: 8, offset: 48)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !946, file: !242, line: 96, baseType: !44, size: 32, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "autostart", scope: !946, file: !242, line: 97, baseType: !350, size: 8, offset: 96)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !962)
!962 = !{!963, !979, !985}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !961, file: !31, line: 112, baseType: !964, size: 32)
!964 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !252, line: 49, size: 32, elements: !965)
!965 = !{!966, !972, !978}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !964, file: !252, line: 50, baseType: !967, size: 32)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !252, line: 37, size: 32, elements: !968)
!968 = !{!969, !970, !971}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !967, file: !252, line: 38, baseType: !164, size: 1, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !967, file: !252, line: 38, baseType: !164, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !967, file: !252, line: 39, baseType: !164, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !964, file: !252, line: 51, baseType: !973, size: 32)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !252, line: 43, size: 32, elements: !974)
!974 = !{!975, !976, !977}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !973, file: !252, line: 44, baseType: !164, size: 1, flags: DIFlagBitField, extraData: i64 0)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !973, file: !252, line: 44, baseType: !164, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !973, file: !252, line: 45, baseType: !164, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !964, file: !252, line: 52, baseType: !164, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !961, file: !31, line: 113, baseType: !980, size: 32)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !981)
!981 = !{!982, !983, !984}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !980, file: !31, line: 108, baseType: !164, size: 1, flags: DIFlagBitField, extraData: i64 0)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !980, file: !31, line: 108, baseType: !164, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !980, file: !31, line: 108, baseType: !164, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !961, file: !31, line: 114, baseType: !986, size: 128)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !987)
!987 = !{!988, !1004, !1005}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !986, file: !31, line: 89, baseType: !989, size: 96)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !990)
!990 = !{!991, !1002, !1003}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !989, file: !31, line: 67, baseType: !992, size: 32)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !993)
!993 = !{!994, !995, !996, !997, !998, !999, !1000, !1001}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !992, file: !31, line: 52, baseType: !164, size: 1, flags: DIFlagBitField, extraData: i64 0)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !992, file: !31, line: 52, baseType: !164, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !992, file: !31, line: 52, baseType: !164, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !992, file: !31, line: 53, baseType: !164, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !992, file: !31, line: 54, baseType: !164, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !992, file: !31, line: 55, baseType: !164, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !992, file: !31, line: 56, baseType: !164, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !992, file: !31, line: 57, baseType: !164, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !989, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !989, file: !31, line: 76, baseType: !292, size: 32, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !986, file: !31, line: 93, baseType: !294, size: 32, offset: 96)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !986, file: !31, line: 94, baseType: !298, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "dropped", scope: !937, file: !242, line: 66, baseType: !1007, size: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 32)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{null, !943, !164}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "panic", scope: !937, file: !242, line: 67, baseType: !1011, size: 32, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 32)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{null, !943}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !937, file: !242, line: 68, baseType: !1011, size: 32, offset: 96)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "is_ready", scope: !937, file: !242, line: 69, baseType: !1016, size: 32, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 32)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!49, !943}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "format_set", scope: !937, file: !242, line: 70, baseType: !1020, size: 32, offset: 160)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 32)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!49, !943, !164}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !937, file: !242, line: 73, baseType: !1024, size: 32, offset: 192)
