; ModuleID = 'build/actinius_icarus/device_pm/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16*, %struct.pm_device* }
%struct.device_state = type { i8, i8 }
%struct.pm_device = type { %struct.device*, %struct.k_mutex, i32, %struct.k_work_delayable, %struct.k_condvar, %struct.device*, i32, i32, i32 (%struct.device*, i32)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/device_pm/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/device_pm")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/device_pm")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "parent", scope: !27, file: !344, line: 13, type: !126, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !114, globals: !341, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/pm/device_pm/src/dummy_driver.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/device_pm")
!29 = !{!30, !38, !44}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_state", file: !31, line: 53, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/pm/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "PM_DEVICE_STATE_ACTIVE", value: 0)
!35 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDED", value: 1)
!36 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDING", value: 2)
!37 = !DIEnumerator(name: "PM_DEVICE_STATE_OFF", value: 3)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_action", file: !31, line: 75, baseType: !32, size: 32, elements: !39)
!39 = !{!40, !41, !42, !43}
!40 = !DIEnumerator(name: "PM_DEVICE_ACTION_SUSPEND", value: 0)
!41 = !DIEnumerator(name: "PM_DEVICE_ACTION_RESUME", value: 1)
!42 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_OFF", value: 2)
!43 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_ON", value: 3)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !45, line: 27, baseType: !32, size: 32, elements: !46)
!45 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113}
!47 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!48 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!49 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!50 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!51 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!52 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!53 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!54 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!55 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!56 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!57 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!58 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!59 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!60 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!61 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!62 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!63 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!113 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!114 = !{!115, !116, !117}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!116 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dummy_parent_api", file: !119, line: 17, size: 32, elements: !120)
!119 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_parent.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "transfer", scope: !118, file: !119, line: 18, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_transfer_t", file: !119, line: 14, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DISubroutineType(types: !125)
!125 = !{!116, !126, !223, !340}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !129, line: 378, size: 224, elements: !130)
!129 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !{!131, !135, !136, !137, !146, !147, !153}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !129, line: 380, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !128, file: !129, line: 382, baseType: !13, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !128, file: !129, line: 384, baseType: !13, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !128, file: !129, line: 386, baseType: !138, size: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !129, line: 351, size: 16, elements: !140)
!140 = !{!141, !144}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !139, file: !129, line: 359, baseType: !142, size: 8)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !143)
!143 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !139, file: !129, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!145 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !128, file: !129, line: 388, baseType: !115, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !128, file: !129, line: 396, baseType: !148, size: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !129, line: 43, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !152)
!152 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !128, file: !129, line: 403, baseType: !154, size: 32, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_device", file: !31, line: 121, size: 832, elements: !156)
!156 = !{!157, !158, !287, !288, !325, !329, !330, !334, !335}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !155, file: !31, line: 124, baseType: !126, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !155, file: !31, line: 126, baseType: !159, size: 160, offset: 32)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !160, line: 2720, size: 160, elements: !161)
!160 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!161 = !{!162, !183, !285, !286}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !159, file: !160, line: 2722, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !164, line: 233, baseType: !165)
!164 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 231, size: 64, elements: !166)
!166 = !{!167}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !165, file: !164, line: 232, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !169, line: 48, baseType: !170)
!169 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !169, line: 37, size: 64, elements: !171)
!171 = !{!172, !178}
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !170, file: !169, line: 38, baseType: !173, size: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !170, file: !169, line: 38, size: 32, elements: !174)
!174 = !{!175, !177}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !173, file: !169, line: 39, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !169, line: 40, baseType: !176, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, scope: !170, file: !169, line: 42, baseType: !179, size: 32, offset: 32)
!179 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !170, file: !169, line: 42, size: 32, elements: !180)
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !179, file: !169, line: 43, baseType: !176, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !179, file: !169, line: 44, baseType: !176, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !159, file: !160, line: 2724, baseType: !184, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !186, line: 245, size: 1024, elements: !187)
!186 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!187 = !{!188, !238, !251, !252, !253, !254, !262, !280}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !185, file: !186, line: 247, baseType: !189, size: 384)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !186, line: 57, size: 384, elements: !190)
!190 = !{!191, !205, !207, !208, !209, !222, !224, !225}
!191 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !186, line: 60, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !186, line: 60, size: 64, elements: !193)
!193 = !{!194, !196}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !192, file: !186, line: 61, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !169, line: 49, baseType: !170)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !192, file: !186, line: 62, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !198, line: 49, size: 64, elements: !199)
!198 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !197, file: !198, line: 50, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 64, elements: !203)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!203 = !{!204}
!204 = !DISubrange(count: 2)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !189, file: !186, line: 68, baseType: !206, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !189, file: !186, line: 71, baseType: !142, size: 8, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !189, file: !186, line: 74, baseType: !142, size: 8, offset: 104)
!209 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !186, line: 90, baseType: !210, size: 16, offset: 112)
!210 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !186, line: 90, size: 16, elements: !211)
!211 = !{!212, !219}
!212 = !DIDerivedType(tag: DW_TAG_member, scope: !210, file: !186, line: 91, baseType: !213, size: 16)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !186, line: 91, size: 16, elements: !214)
!214 = !{!215, !218}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !213, file: !186, line: 96, baseType: !216, size: 8)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !217)
!217 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !213, file: !186, line: 97, baseType: !142, size: 8, offset: 8)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !210, file: !186, line: 100, baseType: !220, size: 16)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !221)
!221 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !189, file: !186, line: 107, baseType: !223, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !189, file: !186, line: 127, baseType: !115, size: 32, offset: 160)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !189, file: !186, line: 131, baseType: !226, size: 192, offset: 192)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !164, line: 244, size: 192, elements: !227)
!227 = !{!228, !229, !235}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !226, file: !164, line: 245, baseType: !195, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !226, file: !164, line: 246, baseType: !230, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !164, line: 242, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !226, file: !164, line: 249, baseType: !236, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !237)
!237 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !185, file: !186, line: 250, baseType: !239, size: 288, offset: 384)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !240, line: 25, size: 288, elements: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !239, file: !240, line: 26, baseType: !223, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !239, file: !240, line: 27, baseType: !223, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !239, file: !240, line: 28, baseType: !223, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !239, file: !240, line: 29, baseType: !223, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !239, file: !240, line: 30, baseType: !223, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !239, file: !240, line: 31, baseType: !223, size: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !239, file: !240, line: 32, baseType: !223, size: 32, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !239, file: !240, line: 33, baseType: !223, size: 32, offset: 224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !239, file: !240, line: 34, baseType: !223, size: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !185, file: !186, line: 253, baseType: !115, size: 32, offset: 672)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !185, file: !186, line: 256, baseType: !163, size: 64, offset: 704)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !185, file: !186, line: 294, baseType: !116, size: 32, offset: 768)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !185, file: !186, line: 300, baseType: !255, size: 96, offset: 800)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !186, line: 149, size: 96, elements: !256)
!256 = !{!257, !258, !261}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !255, file: !186, line: 153, baseType: !22, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !255, file: !186, line: 162, baseType: !259, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !260, line: 214, baseType: !32)
!260 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!261 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !255, file: !186, line: 168, baseType: !259, size: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !185, file: !186, line: 325, baseType: !263, size: 32, offset: 896)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !160, line: 5073, size: 160, elements: !265)
!265 = !{!266, !275, !276}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !264, file: !160, line: 5074, baseType: !267, size: 96)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !268, line: 56, size: 96, elements: !269)
!268 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !{!270, !273, !274}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !267, file: !268, line: 57, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !268, line: 57, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !267, file: !268, line: 58, baseType: !115, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !267, file: !268, line: 59, baseType: !259, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !264, file: !160, line: 5075, baseType: !163, size: 64, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !264, file: !160, line: 5076, baseType: !277, offset: 160)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !279)
!278 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!279 = !{}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !185, file: !186, line: 343, baseType: !281, size: 64, offset: 928)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !240, line: 60, size: 64, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !281, file: !240, line: 63, baseType: !223, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !281, file: !240, line: 66, baseType: !223, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !159, file: !160, line: 2727, baseType: !223, size: 32, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !159, file: !160, line: 2730, baseType: !116, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !155, file: !31, line: 128, baseType: !223, size: 32, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !155, file: !31, line: 130, baseType: !289, size: 384, offset: 256)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_delayable", file: !160, line: 3691, size: 384, elements: !290)
!290 = !{!291, !323, !324}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !289, file: !160, line: 3693, baseType: !292, size: 128)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work", file: !160, line: 3663, size: 128, elements: !293)
!293 = !{!294, !301, !307, !322}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !292, file: !160, line: 3669, baseType: !295, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !296, line: 33, baseType: !297)
!296 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !296, line: 29, size: 32, elements: !298)
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !296, line: 30, baseType: !300, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !292, file: !160, line: 3672, baseType: !302, size: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_work_handler_t", file: !160, line: 3071, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !306}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !292, file: !160, line: 3675, baseType: !308, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_q", file: !160, line: 3810, size: 1280, elements: !310)
!310 = !{!311, !312, !319, !320, !321}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !309, file: !160, line: 3812, baseType: !185, size: 1024)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !309, file: !160, line: 3819, baseType: !313, size: 64, offset: 1024)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !296, line: 40, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !296, line: 35, size: 64, elements: !315)
!315 = !{!316, !318}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !314, file: !296, line: 36, baseType: !317, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !314, file: !296, line: 37, baseType: !317, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "notifyq", scope: !309, file: !160, line: 3822, baseType: !163, size: 64, offset: 1088)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "drainq", scope: !309, file: !160, line: 3825, baseType: !163, size: 64, offset: 1152)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !309, file: !160, line: 3828, baseType: !223, size: 32, offset: 1216)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !292, file: !160, line: 3683, baseType: !223, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !289, file: !160, line: 3696, baseType: !226, size: 192, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !289, file: !160, line: 3699, baseType: !308, size: 32, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "condvar", scope: !155, file: !31, line: 132, baseType: !326, size: 64, offset: 640)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !160, line: 2828, size: 64, elements: !327)
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !326, file: !160, line: 2829, baseType: !163, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !155, file: !31, line: 136, baseType: !126, size: 32, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !155, file: !31, line: 139, baseType: !331, size: 32, offset: 736)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !332, line: 22, baseType: !333)
!332 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!333 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !155, file: !31, line: 141, baseType: !30, size: 32, offset: 768)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "action_cb", scope: !155, file: !31, line: 143, baseType: !336, size: 32, offset: 800)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_device_action_cb_t", file: !31, line: 104, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DISubroutineType(types: !339)
!339 = !{!116, !126, !38}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!341 = !{!342, !348, !350, !25, !361, !363, !365, !385}
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_driver", scope: !27, file: !344, line: 117, type: !345, isLocal: false, isDefinition: true, align: 16)
!344 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_driver.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 48, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 3)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "__device_dummy_driver", scope: !27, file: !344, line: 117, type: !127, isLocal: true, isDefinition: true, align: 32)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "__init___device_dummy_driver", scope: !27, file: !344, line: 117, type: !352, isLocal: true, isDefinition: true, align: 32)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !354, line: 51, size: 64, elements: !355)
!354 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!355 = !{!356, !360}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !353, file: !354, line: 60, baseType: !357, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!358 = !DISubroutineType(types: !359)
!359 = !{!116, !126}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !353, file: !354, line: 65, baseType: !126, size: 32, offset: 32)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "__pm_slot_dummy_driver", scope: !27, file: !344, line: 115, type: !126, isLocal: true, isDefinition: true, align: 32)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "__devstate_dummy_driver", scope: !27, file: !344, line: 117, type: !139, isLocal: true, isDefinition: true, align: 8)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "funcs", scope: !27, file: !344, line: 98, type: !367, isLocal: true, isDefinition: true)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dummy_driver_api", file: !369, line: 19, size: 128, elements: !370)
!369 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_driver.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!370 = !{!371, !373, !378, !383}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !368, file: !369, line: 20, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_open_t", file: !369, line: 11, baseType: !357)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !368, file: !369, line: 21, baseType: !374, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_read_t", file: !369, line: 13, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DISubroutineType(types: !377)
!377 = !{!116, !126, !340}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !368, file: !369, line: 22, baseType: !379, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_write_t", file: !369, line: 15, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DISubroutineType(types: !382)
!382 = !{!116, !126, !223}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !368, file: !369, line: 23, baseType: !384, size: 32, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_close_t", file: !369, line: 17, baseType: !357)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "__pm_device_dummy_driver", scope: !27, file: !344, line: 115, type: !155, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_driver", scope: !389, file: !394, line: 32, type: !345, isLocal: false, isDefinition: true, align: 16)
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !391, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/device_pm/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/device_pm")
!391 = !{!392, !395, !397, !399, !401, !387}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_65", scope: !389, file: !394, line: 7, type: !345, isLocal: false, isDefinition: true, align: 16)
!394 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/device_pm")
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_4", scope: !389, file: !394, line: 12, type: !345, isLocal: false, isDefinition: true, align: 16)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_94", scope: !389, file: !394, line: 17, type: !345, isLocal: false, isDefinition: true, align: 16)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_93", scope: !389, file: !394, line: 22, type: !345, isLocal: false, isDefinition: true, align: 16)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_parent", scope: !389, file: !394, line: 27, type: !345, isLocal: false, isDefinition: true, align: 16)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "funcs", scope: !405, file: !411, line: 43, type: !608, isLocal: true, isDefinition: true)
!405 = distinct !DICompileUnit(language: DW_LANG_C99, file: !406, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !407, globals: !408, splitDebugInlining: false, nameTableKind: None)
!406 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/pm/device_pm/src/dummy_parent.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/device_pm")
!407 = !{!115, !116}
!408 = !{!409, !412, !590, !600, !602, !403, !604, !606}
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_parent", scope: !405, file: !411, line: 54, type: !345, isLocal: false, isDefinition: true, align: 16)
!411 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_parent.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "__device_dummy_parent", scope: !405, file: !411, line: 54, type: !414, isLocal: true, isDefinition: true, align: 32)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !129, line: 378, size: 224, elements: !416)
!416 = !{!417, !418, !419, !420, !426, !427, !428}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !415, file: !129, line: 380, baseType: !132, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !415, file: !129, line: 382, baseType: !13, size: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !415, file: !129, line: 384, baseType: !13, size: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !415, file: !129, line: 386, baseType: !421, size: 32, offset: 96)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !129, line: 351, size: 16, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !422, file: !129, line: 359, baseType: !142, size: 8)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !422, file: !129, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !415, file: !129, line: 388, baseType: !115, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !415, file: !129, line: 396, baseType: !148, size: 32, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !415, file: !129, line: 403, baseType: !429, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 32)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_device", file: !31, line: 121, size: 832, elements: !431)
!431 = !{!432, !434, !541, !542, !578, !582, !583, !584, !585}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !430, file: !31, line: 124, baseType: !433, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !430, file: !31, line: 126, baseType: !435, size: 160, offset: 32)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !160, line: 2720, size: 160, elements: !436)
!436 = !{!437, !456, !539, !540}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !435, file: !160, line: 2722, baseType: !438, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !164, line: 233, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 231, size: 64, elements: !440)
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !439, file: !164, line: 232, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !169, line: 48, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !169, line: 37, size: 64, elements: !444)
!444 = !{!445, !451}
!445 = !DIDerivedType(tag: DW_TAG_member, scope: !443, file: !169, line: 38, baseType: !446, size: 32)
!446 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !443, file: !169, line: 38, size: 32, elements: !447)
!447 = !{!448, !450}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !446, file: !169, line: 39, baseType: !449, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !446, file: !169, line: 40, baseType: !449, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, scope: !443, file: !169, line: 42, baseType: !452, size: 32, offset: 32)
!452 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !443, file: !169, line: 42, size: 32, elements: !453)
!453 = !{!454, !455}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !452, file: !169, line: 43, baseType: !449, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !452, file: !169, line: 44, baseType: !449, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !435, file: !160, line: 2724, baseType: !457, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 32)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !186, line: 245, size: 1024, elements: !459)
!459 = !{!460, !500, !512, !513, !514, !515, !521, !534}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !458, file: !186, line: 247, baseType: !461, size: 384)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !186, line: 57, size: 384, elements: !462)
!462 = !{!463, !474, !476, !477, !478, !487, !488, !489}
!463 = !DIDerivedType(tag: DW_TAG_member, scope: !461, file: !186, line: 60, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !461, file: !186, line: 60, size: 64, elements: !465)
!465 = !{!466, !468}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !464, file: !186, line: 61, baseType: !467, size: 64)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !169, line: 49, baseType: !443)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !464, file: !186, line: 62, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !198, line: 49, size: 64, elements: !470)
!470 = !{!471}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !469, file: !198, line: 50, baseType: !472, size: 64)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 64, elements: !203)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !461, file: !186, line: 68, baseType: !475, size: 32, offset: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !461, file: !186, line: 71, baseType: !142, size: 8, offset: 96)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !461, file: !186, line: 74, baseType: !142, size: 8, offset: 104)
!478 = !DIDerivedType(tag: DW_TAG_member, scope: !461, file: !186, line: 90, baseType: !479, size: 16, offset: 112)
!479 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !461, file: !186, line: 90, size: 16, elements: !480)
!480 = !{!481, !486}
!481 = !DIDerivedType(tag: DW_TAG_member, scope: !479, file: !186, line: 91, baseType: !482, size: 16)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !479, file: !186, line: 91, size: 16, elements: !483)
!483 = !{!484, !485}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !482, file: !186, line: 96, baseType: !216, size: 8)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !482, file: !186, line: 97, baseType: !142, size: 8, offset: 8)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !479, file: !186, line: 100, baseType: !220, size: 16)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !461, file: !186, line: 107, baseType: !223, size: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !461, file: !186, line: 127, baseType: !115, size: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !461, file: !186, line: 131, baseType: !490, size: 192, offset: 192)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !164, line: 244, size: 192, elements: !491)
!491 = !{!492, !493, !499}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !490, file: !164, line: 245, baseType: !467, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !490, file: !164, line: 246, baseType: !494, size: 32, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !164, line: 242, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 32)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !498}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !490, file: !164, line: 249, baseType: !236, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !458, file: !186, line: 250, baseType: !501, size: 288, offset: 384)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !240, line: 25, size: 288, elements: !502)
!502 = !{!503, !504, !505, !506, !507, !508, !509, !510, !511}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !501, file: !240, line: 26, baseType: !223, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !501, file: !240, line: 27, baseType: !223, size: 32, offset: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !501, file: !240, line: 28, baseType: !223, size: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !501, file: !240, line: 29, baseType: !223, size: 32, offset: 96)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !501, file: !240, line: 30, baseType: !223, size: 32, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !501, file: !240, line: 31, baseType: !223, size: 32, offset: 160)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !501, file: !240, line: 32, baseType: !223, size: 32, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !501, file: !240, line: 33, baseType: !223, size: 32, offset: 224)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !501, file: !240, line: 34, baseType: !223, size: 32, offset: 256)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !458, file: !186, line: 253, baseType: !115, size: 32, offset: 672)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !458, file: !186, line: 256, baseType: !438, size: 64, offset: 704)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !458, file: !186, line: 294, baseType: !116, size: 32, offset: 768)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !458, file: !186, line: 300, baseType: !516, size: 96, offset: 800)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !186, line: 149, size: 96, elements: !517)
!517 = !{!518, !519, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !516, file: !186, line: 153, baseType: !22, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !516, file: !186, line: 162, baseType: !259, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !516, file: !186, line: 168, baseType: !259, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !458, file: !186, line: 325, baseType: !522, size: 32, offset: 896)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !160, line: 5073, size: 160, elements: !524)
!524 = !{!525, !531, !532}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !523, file: !160, line: 5074, baseType: !526, size: 96)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !268, line: 56, size: 96, elements: !527)
!527 = !{!528, !529, !530}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !526, file: !268, line: 57, baseType: !271, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !526, file: !268, line: 58, baseType: !115, size: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !526, file: !268, line: 59, baseType: !259, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !523, file: !160, line: 5075, baseType: !438, size: 64, offset: 96)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !523, file: !160, line: 5076, baseType: !533, offset: 160)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !279)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !458, file: !186, line: 343, baseType: !535, size: 64, offset: 928)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !240, line: 60, size: 64, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !535, file: !240, line: 63, baseType: !223, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !535, file: !240, line: 66, baseType: !223, size: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !435, file: !160, line: 2727, baseType: !223, size: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !435, file: !160, line: 2730, baseType: !116, size: 32, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !430, file: !31, line: 128, baseType: !223, size: 32, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !430, file: !31, line: 130, baseType: !543, size: 384, offset: 256)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_delayable", file: !160, line: 3691, size: 384, elements: !544)
!544 = !{!545, !576, !577}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !543, file: !160, line: 3693, baseType: !546, size: 128)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work", file: !160, line: 3663, size: 128, elements: !547)
!547 = !{!548, !554, !560, !575}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !546, file: !160, line: 3669, baseType: !549, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !296, line: 33, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !296, line: 29, size: 32, elements: !551)
!551 = !{!552}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !550, file: !296, line: 30, baseType: !553, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !546, file: !160, line: 3672, baseType: !555, size: 32, offset: 32)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_work_handler_t", file: !160, line: 3071, baseType: !556)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !546, file: !160, line: 3675, baseType: !561, size: 32, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_q", file: !160, line: 3810, size: 1280, elements: !563)
!563 = !{!564, !565, !572, !573, !574}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !562, file: !160, line: 3812, baseType: !458, size: 1024)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !562, file: !160, line: 3819, baseType: !566, size: 64, offset: 1024)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !296, line: 40, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !296, line: 35, size: 64, elements: !568)
!568 = !{!569, !571}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !567, file: !296, line: 36, baseType: !570, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !567, file: !296, line: 37, baseType: !570, size: 32, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "notifyq", scope: !562, file: !160, line: 3822, baseType: !438, size: 64, offset: 1088)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "drainq", scope: !562, file: !160, line: 3825, baseType: !438, size: 64, offset: 1152)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !562, file: !160, line: 3828, baseType: !223, size: 32, offset: 1216)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !546, file: !160, line: 3683, baseType: !223, size: 32, offset: 96)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !543, file: !160, line: 3696, baseType: !490, size: 192, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !543, file: !160, line: 3699, baseType: !561, size: 32, offset: 320)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "condvar", scope: !430, file: !31, line: 132, baseType: !579, size: 64, offset: 640)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !160, line: 2828, size: 64, elements: !580)
!580 = !{!581}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !579, file: !160, line: 2829, baseType: !438, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !430, file: !31, line: 136, baseType: !433, size: 32, offset: 704)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !430, file: !31, line: 139, baseType: !331, size: 32, offset: 736)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !430, file: !31, line: 141, baseType: !30, size: 32, offset: 768)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "action_cb", scope: !430, file: !31, line: 143, baseType: !586, size: 32, offset: 800)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_device_action_cb_t", file: !31, line: 104, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 32)
!588 = !DISubroutineType(types: !589)
!589 = !{!116, !433, !38}
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "__init___device_dummy_parent", scope: !405, file: !411, line: 54, type: !592, isLocal: true, isDefinition: true, align: 32)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !354, line: 51, size: 64, elements: !594)
!594 = !{!595, !599}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !593, file: !354, line: 60, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 32)
!597 = !DISubroutineType(types: !598)
!598 = !{!116, !433}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !593, file: !354, line: 65, baseType: !433, size: 32, offset: 32)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "__pm_slot_dummy_parent", scope: !405, file: !411, line: 52, type: !433, isLocal: true, isDefinition: true, align: 32)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "__devstate_dummy_parent", scope: !405, file: !411, line: 54, type: !422, isLocal: true, isDefinition: true, align: 8)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "store_value", scope: !405, file: !411, line: 12, type: !223, isLocal: true, isDefinition: true)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "__pm_device_dummy_parent", scope: !405, file: !411, line: 52, type: !430, isLocal: true, isDefinition: true)
!608 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dummy_parent_api", file: !119, line: 17, size: 32, elements: !610)
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "transfer", scope: !609, file: !119, line: 18, baseType: !612, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_transfer_t", file: !119, line: 14, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 32)
!614 = !DISubroutineType(types: !615)
!615 = !{!116, !433, !223, !340}
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "_char_out", scope: !618, file: !622, line: 54, type: !623, isLocal: false, isDefinition: true)
!618 = distinct !DICompileUnit(language: DW_LANG_C99, file: !619, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !620, retainedTypes: !407, globals: !621, splitDebugInlining: false, nameTableKind: None)
!619 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/device_pm")
!620 = !{!44}
!621 = !{!616}
!622 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!624 = !DISubroutineType(types: !625)
!625 = !{!116, !116}
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !628, file: !685, line: 65, type: !686, isLocal: true, isDefinition: true, align: 32)
!628 = distinct !DICompileUnit(language: DW_LANG_C99, file: !629, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !620, retainedTypes: !630, globals: !680, splitDebugInlining: false, nameTableKind: None)
!629 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/device_pm")
!630 = !{!115, !116, !631, !223, !642}
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !633, file: !632, line: 167, baseType: !641)
!632 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!633 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !632, file: !632, line: 134, type: !634, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !628, retainedNodes: !636)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !223}
!636 = !{!637, !638, !640}
!637 = !DILocalVariable(name: "time_us", arg: 1, scope: !633, file: !632, line: 134, type: !223)
!638 = !DILocalVariable(name: "delay_cycles", scope: !633, file: !632, line: 168, type: !639)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!640 = !DILocalVariable(name: "cycles", scope: !633, file: !632, line: 171, type: !223)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !644, line: 1928, baseType: !645)
!644 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !644, line: 1909, size: 11360, elements: !646)
!646 = !{!647, !653, !654, !655, !656, !660, !661, !662, !663, !665, !666, !670, !671, !672, !673, !674, !678, !679}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !645, file: !644, line: 1910, baseType: !648, size: 8192)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 8192, elements: !651)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !223)
!651 = !{!652}
!652 = !DISubrange(count: 256)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !645, file: !644, line: 1911, baseType: !649, size: 32, offset: 8192)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !645, file: !644, line: 1912, baseType: !649, size: 32, offset: 8224)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !645, file: !644, line: 1913, baseType: !649, size: 32, offset: 8256)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !645, file: !644, line: 1914, baseType: !657, size: 1984, offset: 8288)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 1984, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 62)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !645, file: !644, line: 1915, baseType: !650, size: 32, offset: 10272)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !645, file: !644, line: 1916, baseType: !649, size: 32, offset: 10304)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !645, file: !644, line: 1917, baseType: !650, size: 32, offset: 10336)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !645, file: !644, line: 1918, baseType: !664, size: 96, offset: 10368)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 96, elements: !346)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !645, file: !644, line: 1919, baseType: !650, size: 32, offset: 10464)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !645, file: !644, line: 1920, baseType: !667, size: 256, offset: 10496)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 256, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 8)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !645, file: !644, line: 1921, baseType: !650, size: 32, offset: 10752)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !645, file: !644, line: 1922, baseType: !649, size: 32, offset: 10784)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !645, file: !644, line: 1923, baseType: !650, size: 32, offset: 10816)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !645, file: !644, line: 1924, baseType: !650, size: 32, offset: 10848)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !645, file: !644, line: 1925, baseType: !675, size: 416, offset: 10880)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 416, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 13)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !645, file: !644, line: 1926, baseType: !650, size: 32, offset: 11296)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !645, file: !644, line: 1927, baseType: !650, size: 32, offset: 11328)
!680 = !{!626, !681}
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !633, file: !632, line: 161, type: !683, isLocal: true, isDefinition: true, align: 128)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 48, elements: !346)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!685 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !354, line: 51, size: 64, elements: !688)
!688 = !{!689, !696}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !687, file: !354, line: 60, baseType: !690, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DISubroutineType(types: !692)
!692 = !{!116, !693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !695)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !354, line: 48, flags: DIFlagFwdDecl)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !687, file: !354, line: 65, baseType: !693, size: 32, offset: 32)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !699, file: !737, line: 27, type: !762, isLocal: true, isDefinition: true)
!699 = distinct !DICompileUnit(language: DW_LANG_C99, file: !700, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !701, retainedTypes: !713, globals: !734, splitDebugInlining: false, nameTableKind: None)
!700 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/device_pm")
!701 = !{!702, !30, !38, !44}
!702 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !703, line: 27, baseType: !32, size: 32, elements: !704)
!703 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712}
!705 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!706 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!707 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!708 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!709 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!710 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!711 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!712 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!713 = !{!115, !714, !116, !24, !716, !731, !223, !732}
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !715, line: 46, baseType: !236)
!715 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !718, line: 54, size: 96, elements: !719)
!718 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!719 = !{!720, !726, !730}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !717, file: !718, line: 55, baseType: !721, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !296, line: 33, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !296, line: 29, size: 32, elements: !723)
!723 = !{!724}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !722, file: !296, line: 30, baseType: !725, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !717, file: !718, line: 60, baseType: !727, size: 32, offset: 32)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = !DISubroutineType(types: !729)
!729 = !{null, !702}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !717, file: !718, line: 65, baseType: !727, size: 32, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !733)
!733 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!734 = !{!697, !735, !739, !741, !752, !754}
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !699, file: !737, line: 44, type: !738, isLocal: true, isDefinition: true)
!737 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !279)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !699, file: !737, line: 49, type: !738, isLocal: true, isDefinition: true)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !699, file: !737, line: 36, type: !743, isLocal: true, isDefinition: true)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !744, size: 128, elements: !750)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !703, line: 114, size: 128, elements: !745)
!745 = !{!746, !747, !748, !749}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !744, file: !703, line: 115, baseType: !702, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !744, file: !703, line: 141, baseType: !142, size: 8, offset: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !744, file: !703, line: 149, baseType: !223, size: 32, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !744, file: !703, line: 156, baseType: !223, size: 32, offset: 96)
!750 = !{!751}
!751 = !DISubrange(count: 1)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !699, file: !737, line: 40, type: !743, isLocal: true, isDefinition: true)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !699, file: !737, line: 28, type: !756, isLocal: true, isDefinition: true)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !296, line: 40, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !296, line: 35, size: 64, elements: !758)
!758 = !{!759, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !757, file: !296, line: 36, baseType: !760, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !757, file: !296, line: 37, baseType: !760, size: 32, offset: 32)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 32, elements: !750)
!763 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!764 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !767, file: !795, line: 50, type: !782, isLocal: true, isDefinition: true)
!767 = distinct !DICompileUnit(language: DW_LANG_C99, file: !768, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !769, retainedTypes: !770, globals: !792, splitDebugInlining: false, nameTableKind: None)
!768 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/device_pm")
!769 = !{!702, !44}
!770 = !{!151, !714, !259, !116, !115, !223, !732, !771, !731, !782, !783}
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 32)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !773, line: 45, size: 64, elements: !774)
!773 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!774 = !{!775, !781}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !772, file: !773, line: 46, baseType: !776, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !296, line: 33, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !296, line: 29, size: 32, elements: !778)
!778 = !{!779}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !777, file: !296, line: 30, baseType: !780, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !772, file: !773, line: 48, baseType: !223, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !116)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 32)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !773, line: 38, size: 64, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !784, file: !773, line: 39, baseType: !776, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !784, file: !773, line: 41, baseType: !788, size: 32, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !773, line: 35, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 32)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !782}
!792 = !{!793, !797, !805, !765, !807, !817}
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "latency_lock", scope: !767, file: !795, line: 44, type: !796, isLocal: true, isDefinition: true)
!795 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !279)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !767, file: !795, line: 46, type: !799, isLocal: true, isDefinition: true)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !296, line: 40, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !296, line: 35, size: 64, elements: !801)
!801 = !{!802, !804}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !800, file: !296, line: 36, baseType: !803, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !800, file: !296, line: 37, baseType: !803, size: 32, offset: 32)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "latency_subs", scope: !767, file: !795, line: 52, type: !799, isLocal: true, isDefinition: true)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !767, file: !795, line: 39, type: !809, isLocal: true, isDefinition: true)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, elements: !815)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !795, line: 35, size: 96, elements: !811)
!811 = !{!812, !813, !814}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !810, file: !795, line: 36, baseType: !702, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !810, file: !795, line: 37, baseType: !142, size: 8, offset: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !810, file: !795, line: 38, baseType: !331, size: 32, offset: 64)
!815 = !{!816}
!816 = !DISubrange(count: 0)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !767, file: !795, line: 48, type: !782, isLocal: true, isDefinition: true)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !821, file: !828, line: 47, type: !842, isLocal: true, isDefinition: true)
!821 = distinct !DICompileUnit(language: DW_LANG_C99, file: !822, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !823, retainedTypes: !824, globals: !825, splitDebugInlining: false, nameTableKind: None)
!822 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/device_pm")
!823 = !{!702}
!824 = !{!259, !116}
!825 = !{!826, !819, !838}
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "cpus_states", scope: !821, file: !828, line: 50, type: !829, isLocal: true, isDefinition: true)
!828 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 32, elements: !750)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !703, line: 114, size: 128, elements: !833)
!833 = !{!834, !835, !836, !837}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !832, file: !703, line: 115, baseType: !702, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !832, file: !703, line: 141, baseType: !142, size: 8, offset: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !832, file: !703, line: 149, baseType: !223, size: 32, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !832, file: !703, line: 156, baseType: !223, size: 32, offset: 96)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !821, file: !828, line: 55, type: !840, isLocal: true, isDefinition: true)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !841, size: 8, elements: !750)
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!842 = !DICompositeType(tag: DW_TAG_array_type, baseType: !831, elements: !815)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "__init_pm_stats_init", scope: !845, file: !850, line: 53, type: !879, isLocal: true, isDefinition: true, align: 32)
!845 = distinct !DICompileUnit(language: DW_LANG_C99, file: !846, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !769, retainedTypes: !407, globals: !847, splitDebugInlining: false, nameTableKind: None)
!846 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm_stats.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/device_pm")
!847 = !{!843, !848, !869, !872, !874}
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "stats", scope: !845, file: !850, line: 27, type: !851, isLocal: true, isDefinition: true)
!850 = !DIFile(filename: "zephyr/subsys/pm/pm_stats.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !852, size: 1568, elements: !867)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stats_pm_stats", file: !850, line: 15, size: 224, elements: !853)
!853 = !{!854, !864, !865, !866}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "s_hdr", scope: !852, file: !850, line: 15, baseType: !855, size: 128)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stats_hdr", file: !856, line: 66, size: 128, elements: !857)
!856 = !DIFile(filename: "zephyr/include/zephyr/stats/stats.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!857 = !{!858, !859, !860, !861, !862}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "s_name", scope: !855, file: !856, line: 67, baseType: !132, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "s_size", scope: !855, file: !856, line: 68, baseType: !142, size: 8, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "s_cnt", scope: !855, file: !856, line: 69, baseType: !220, size: 16, offset: 48)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "s_pad1", scope: !855, file: !856, line: 70, baseType: !142, size: 8, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !855, file: !856, line: 75, baseType: !863, size: 32, offset: 96)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "state_count", scope: !852, file: !850, line: 16, baseType: !223, size: 32, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "state_last_cycles", scope: !852, file: !850, line: 17, baseType: !223, size: 32, offset: 160)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "state_total_cycles", scope: !852, file: !850, line: 18, baseType: !223, size: 32, offset: 192)
!867 = !{!751, !868}
!868 = !DISubrange(count: 7)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(name: "time_start", scope: !845, file: !850, line: 31, type: !871, isLocal: true, isDefinition: true)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 32, elements: !750)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "time_stop", scope: !845, file: !850, line: 32, type: !871, isLocal: true, isDefinition: true)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "names", scope: !845, file: !850, line: 30, type: !876, isLocal: true, isDefinition: true)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 1400, elements: !877)
!877 = !{!751, !868, !878}
!878 = !DISubrange(count: 25)
!879 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !354, line: 51, size: 64, elements: !881)
!881 = !{!882, !883}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !880, file: !354, line: 60, baseType: !690, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !880, file: !354, line: 65, baseType: !693, size: 32, offset: 32)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "action_target_state", scope: !886, file: !902, line: 14, type: !903, isLocal: true, isDefinition: true)
!886 = distinct !DICompileUnit(language: DW_LANG_C99, file: !887, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !888, retainedTypes: !898, globals: !899, splitDebugInlining: false, nameTableKind: None)
!887 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/device.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/device_pm")
!888 = !{!30, !38, !889, !44}
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_flag", file: !31, line: 30, baseType: !32, size: 32, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896, !897}
!891 = !DIEnumerator(name: "PM_DEVICE_FLAG_BUSY", value: 0)
!892 = !DIEnumerator(name: "PM_DEVICE_FLAG_TURN_ON_FAILED", value: 1)
!893 = !DIEnumerator(name: "PM_DEVICE_FLAG_WS_CAPABLE", value: 2)
!894 = !DIEnumerator(name: "PM_DEVICE_FLAG_WS_ENABLED", value: 3)
!895 = !DIEnumerator(name: "PM_DEVICE_FLAG_RUNTIME_ENABLED", value: 4)
!896 = !DIEnumerator(name: "PM_DEVICE_FLAG_STATE_LOCKED", value: 5)
!897 = !DIEnumerator(name: "PM_DEVICE_FLAG_PD", value: 6)
!898 = !{!115, !116, !24, !259}
!899 = !{!884, !900}
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "action_expected_state", scope: !886, file: !902, line: 20, type: !903, isLocal: true, isDefinition: true)
!902 = !DIFile(filename: "zephyr/subsys/pm/device.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 128, elements: !905)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!905 = !{!906}
!906 = !DISubrange(count: 4)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(name: "stats_list", scope: !909, file: !914, line: 16, type: !915, isLocal: true, isDefinition: true)
!909 = distinct !DICompileUnit(language: DW_LANG_C99, file: !910, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !911, globals: !913, splitDebugInlining: false, nameTableKind: None)
!910 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/stats/stats.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/device_pm")
!911 = !{!115, !912, !220, !116}
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!913 = !{!907}
!914 = !DIFile(filename: "zephyr/subsys/stats/stats.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 32)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stats_hdr", file: !856, line: 66, size: 128, elements: !917)
!917 = !{!918, !919, !920, !921, !922}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "s_name", scope: !916, file: !856, line: 67, baseType: !132, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "s_size", scope: !916, file: !856, line: 68, baseType: !142, size: 8, offset: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "s_cnt", scope: !916, file: !856, line: 69, baseType: !220, size: 16, offset: 48)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "s_pad1", scope: !916, file: !856, line: 70, baseType: !142, size: 8, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !916, file: !856, line: 75, baseType: !915, size: 32, offset: 96)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "static_regions", scope: !925, file: !932, line: 62, type: !1051, isLocal: true, isDefinition: true)
!925 = distinct !DICompileUnit(language: DW_LANG_C99, file: !926, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !620, retainedTypes: !927, globals: !928, splitDebugInlining: false, nameTableKind: None)
!926 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/device_pm")
!927 = !{!259, !116, !223, !115}
!928 = !{!929, !923}
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !931, file: !932, line: 198, type: !1038, isLocal: true, isDefinition: true)
!931 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !932, file: !932, line: 175, type: !933, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !925, retainedNodes: !1035)
!932 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!933 = !DISubroutineType(types: !934)
!934 = !{null, !935}
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !186, line: 245, size: 1024, elements: !937)
!937 = !{!938, !996, !1008, !1009, !1010, !1011, !1017, !1030}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !936, file: !186, line: 247, baseType: !939, size: 384)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !186, line: 57, size: 384, elements: !940)
!940 = !{!941, !965, !972, !973, !974, !983, !984, !985}
!941 = !DIDerivedType(tag: DW_TAG_member, scope: !939, file: !186, line: 60, baseType: !942, size: 64)
!942 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !939, file: !186, line: 60, size: 64, elements: !943)
!943 = !{!944, !959}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !942, file: !186, line: 61, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !169, line: 49, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !169, line: 37, size: 64, elements: !947)
!947 = !{!948, !954}
!948 = !DIDerivedType(tag: DW_TAG_member, scope: !946, file: !169, line: 38, baseType: !949, size: 32)
!949 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !946, file: !169, line: 38, size: 32, elements: !950)
!950 = !{!951, !953}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !949, file: !169, line: 39, baseType: !952, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !949, file: !169, line: 40, baseType: !952, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, scope: !946, file: !169, line: 42, baseType: !955, size: 32, offset: 32)
!955 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !946, file: !169, line: 42, size: 32, elements: !956)
!956 = !{!957, !958}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !955, file: !169, line: 43, baseType: !952, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !955, file: !169, line: 44, baseType: !952, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !942, file: !186, line: 62, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !198, line: 49, size: 64, elements: !961)
!961 = !{!962}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !960, file: !198, line: 50, baseType: !963, size: 64)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 64, elements: !203)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !939, file: !186, line: 68, baseType: !966, size: 32, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !164, line: 233, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 231, size: 64, elements: !969)
!969 = !{!970}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !968, file: !164, line: 232, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !169, line: 48, baseType: !946)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !939, file: !186, line: 71, baseType: !142, size: 8, offset: 96)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !939, file: !186, line: 74, baseType: !142, size: 8, offset: 104)
!974 = !DIDerivedType(tag: DW_TAG_member, scope: !939, file: !186, line: 90, baseType: !975, size: 16, offset: 112)
!975 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !939, file: !186, line: 90, size: 16, elements: !976)
!976 = !{!977, !982}
!977 = !DIDerivedType(tag: DW_TAG_member, scope: !975, file: !186, line: 91, baseType: !978, size: 16)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !975, file: !186, line: 91, size: 16, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !978, file: !186, line: 96, baseType: !216, size: 8)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !978, file: !186, line: 97, baseType: !142, size: 8, offset: 8)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !975, file: !186, line: 100, baseType: !220, size: 16)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !939, file: !186, line: 107, baseType: !223, size: 32, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !939, file: !186, line: 127, baseType: !115, size: 32, offset: 160)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !939, file: !186, line: 131, baseType: !986, size: 192, offset: 192)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !164, line: 244, size: 192, elements: !987)
!987 = !{!988, !989, !995}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !986, file: !164, line: 245, baseType: !945, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !986, file: !164, line: 246, baseType: !990, size: 32, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !164, line: 242, baseType: !991)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = !DISubroutineType(types: !993)
!993 = !{null, !994}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !986, file: !164, line: 249, baseType: !236, size: 64, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !936, file: !186, line: 250, baseType: !997, size: 288, offset: 384)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !240, line: 25, size: 288, elements: !998)
!998 = !{!999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !997, file: !240, line: 26, baseType: !223, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !997, file: !240, line: 27, baseType: !223, size: 32, offset: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !997, file: !240, line: 28, baseType: !223, size: 32, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !997, file: !240, line: 29, baseType: !223, size: 32, offset: 96)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !997, file: !240, line: 30, baseType: !223, size: 32, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !997, file: !240, line: 31, baseType: !223, size: 32, offset: 160)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !997, file: !240, line: 32, baseType: !223, size: 32, offset: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !997, file: !240, line: 33, baseType: !223, size: 32, offset: 224)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !997, file: !240, line: 34, baseType: !223, size: 32, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !936, file: !186, line: 253, baseType: !115, size: 32, offset: 672)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !936, file: !186, line: 256, baseType: !967, size: 64, offset: 704)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !936, file: !186, line: 294, baseType: !116, size: 32, offset: 768)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !936, file: !186, line: 300, baseType: !1012, size: 96, offset: 800)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !186, line: 149, size: 96, elements: !1013)
!1013 = !{!1014, !1015, !1016}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1012, file: !186, line: 153, baseType: !22, size: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1012, file: !186, line: 162, baseType: !259, size: 32, offset: 32)
