; ModuleID = 'build/arduino_due/drivers/ipm/ipm_mcux/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.wdt_sam_dev_cfg = type { %struct._thread_stack_info* }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.wdt_driver_api = type { i32 (%struct.device*, i8)*, i32 (%struct.device*)*, i32 (%struct.device*, %struct.wdt_timeout_cfg*)*, i32 (%struct.device*, i32)* }
%struct.wdt_timeout_cfg = type { %struct._thread_arch, void (%struct.device*, i32)*, i8 }
%struct._thread_arch = type { i32, i32 }
%struct.wdt_sam_dev_data = type { void (%struct.device*, i32)*, i32, i8, i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.uart_sam_dev_cfg = type { %struct.Uart*, i32, %struct.pinctrl_dev_config* }
%struct.Uart = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, [55 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.pinctrl_dev_config = type { %struct.pinctrl_state*, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "gcounter", scope: !27, file: !170, line: 12, type: !103, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !169, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/ipm/ipm_mcux/src/main_master.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !104, !103, !105}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipm_driver_api", file: !108, line: 98, size: 160, elements: !109)
!108 = !DIFile(filename: "zephyr/include/zephyr/drivers/ipm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !{!110, !143, !154, !159, !164}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !107, file: !108, line: 99, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_send_t", file: !108, line: 54, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!113 = !DISubroutineType(types: !114)
!114 = !{!103, !115, !103, !142, !13, !103}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120, !124, !125, !126, !135, !136}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !118, line: 380, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !117, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !117, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !117, file: !118, line: 386, baseType: !127, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !129)
!129 = !{!130, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !128, file: !118, line: 359, baseType: !131, size: 8)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !132)
!132 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !128, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!134 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !117, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !118, line: 43, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !141)
!141 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "register_callback", scope: !107, file: !108, line: 100, baseType: !144, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_register_callback_t", file: !108, line: 78, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !115, !148, !104}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_callback_t", file: !108, line: 45, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !115, !104, !142, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "max_data_size_get", scope: !107, file: !108, line: 101, baseType: !155, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_data_size_get_t", file: !108, line: 62, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DISubroutineType(types: !158)
!158 = !{!103, !115}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "max_id_val_get", scope: !107, file: !108, line: 102, baseType: !160, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_id_val_get_t", file: !108, line: 70, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{!142, !115}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "set_enabled", scope: !107, file: !108, line: 103, baseType: !165, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_set_enabled_t", file: !108, line: 88, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DISubroutineType(types: !168)
!168 = !{!103, !115, !103}
!169 = !{!25}
!170 = !DIFile(filename: "zephyr/samples/drivers/ipm/ipm_mcux/src/main_master.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "_char_out", scope: !173, file: !177, line: 54, type: !178, isLocal: false, isDefinition: true)
!173 = distinct !DICompileUnit(language: DW_LANG_C99, file: !174, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !175, globals: !176, splitDebugInlining: false, nameTableKind: None)
!174 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux")
!175 = !{!104, !103}
!176 = !{!171}
!177 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DISubroutineType(types: !180)
!180 = !{!103, !103}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !183, file: !248, line: 235, type: !249, isLocal: true, isDefinition: true, align: 32)
!183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !185, globals: !247, splitDebugInlining: false, nameTableKind: None)
!184 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux")
!185 = !{!104, !103, !186, !197}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !188, line: 46, baseType: !189)
!188 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 41, size: 128, elements: !190)
!190 = !{!191, !193, !194, !196}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !189, file: !188, line: 42, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !142)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !189, file: !188, line: 43, baseType: !192, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !189, file: !188, line: 44, baseType: !195, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !189, file: !188, line: 45, baseType: !195, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !199, line: 75, baseType: !200)
!199 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !199, line: 41, size: 2176, elements: !201)
!201 = !{!202, !203, !204, !205, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !225, !229, !230, !231, !232, !233, !234, !235, !236, !240, !241, !242, !243, !244, !245, !246}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !200, file: !199, line: 42, baseType: !192, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !200, file: !199, line: 43, baseType: !192, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !200, file: !199, line: 44, baseType: !195, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !200, file: !199, line: 45, baseType: !206, size: 32, offset: 96)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 32, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 1)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !200, file: !199, line: 46, baseType: !192, size: 32, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !200, file: !199, line: 47, baseType: !192, size: 32, offset: 160)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !200, file: !199, line: 48, baseType: !195, size: 32, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !200, file: !199, line: 49, baseType: !192, size: 32, offset: 224)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !200, file: !199, line: 50, baseType: !192, size: 32, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !200, file: !199, line: 51, baseType: !195, size: 32, offset: 288)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !200, file: !199, line: 52, baseType: !192, size: 32, offset: 320)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !200, file: !199, line: 53, baseType: !206, size: 32, offset: 352)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !200, file: !199, line: 54, baseType: !192, size: 32, offset: 384)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !200, file: !199, line: 55, baseType: !206, size: 32, offset: 416)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !200, file: !199, line: 56, baseType: !192, size: 32, offset: 448)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !200, file: !199, line: 57, baseType: !206, size: 32, offset: 480)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !200, file: !199, line: 58, baseType: !222, size: 96, offset: 512)
!222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 96, elements: !223)
!223 = !{!224}
!224 = !DISubrange(count: 3)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !200, file: !199, line: 59, baseType: !226, size: 160, offset: 608)
!226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 160, elements: !227)
!227 = !{!228}
!228 = !DISubrange(count: 5)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !200, file: !199, line: 60, baseType: !192, size: 32, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !200, file: !199, line: 61, baseType: !192, size: 32, offset: 800)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !200, file: !199, line: 62, baseType: !195, size: 32, offset: 832)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !200, file: !199, line: 63, baseType: !195, size: 32, offset: 864)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !200, file: !199, line: 64, baseType: !192, size: 32, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !200, file: !199, line: 65, baseType: !192, size: 32, offset: 928)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !200, file: !199, line: 66, baseType: !192, size: 32, offset: 960)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !200, file: !199, line: 67, baseType: !237, size: 832, offset: 992)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 832, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 26)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !200, file: !199, line: 68, baseType: !192, size: 32, offset: 1824)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !200, file: !199, line: 69, baseType: !195, size: 32, offset: 1856)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !200, file: !199, line: 70, baseType: !226, size: 160, offset: 1888)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !200, file: !199, line: 71, baseType: !192, size: 32, offset: 2048)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !200, file: !199, line: 72, baseType: !192, size: 32, offset: 2080)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !200, file: !199, line: 73, baseType: !195, size: 32, offset: 2112)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !200, file: !199, line: 74, baseType: !192, size: 32, offset: 2144)
!247 = !{!181}
!248 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !251, line: 51, size: 64, elements: !252)
!251 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!252 = !{!253, !272}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !250, file: !251, line: 60, baseType: !254, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DISubroutineType(types: !256)
!256 = !{!103, !257}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !260)
!260 = !{!261, !262, !263, !264, !270, !271}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !259, file: !118, line: 380, baseType: !121, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !259, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !259, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !259, file: !118, line: 386, baseType: !265, size: 32, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !266, file: !118, line: 359, baseType: !131, size: 8)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !266, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !259, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !259, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !250, file: !251, line: 65, baseType: !257, size: 32, offset: 32)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "static_regions", scope: !275, file: !284, line: 62, type: !423, isLocal: true, isDefinition: true)
!275 = distinct !DICompileUnit(language: DW_LANG_C99, file: !276, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !277, globals: !280, splitDebugInlining: false, nameTableKind: None)
!276 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux")
!277 = !{!278, !103, !142, !104}
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !279, line: 214, baseType: !32)
!279 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!280 = !{!281, !273}
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !283, file: !284, line: 198, type: !411, isLocal: true, isDefinition: true)
!283 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !284, file: !284, line: 175, type: !285, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !275, retainedNodes: !406)
!284 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !DISubroutineType(types: !286)
!286 = !{null, !287}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !289, line: 245, size: 1024, elements: !290)
!289 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!290 = !{!291, !360, !373, !374, !375, !376, !382, !401}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !288, file: !289, line: 247, baseType: !292, size: 384)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !289, line: 57, size: 384, elements: !293)
!293 = !{!294, !322, !330, !331, !332, !345, !346, !347}
!294 = !DIDerivedType(tag: DW_TAG_member, scope: !292, file: !289, line: 60, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !289, line: 60, size: 64, elements: !296)
!296 = !{!297, !313}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !295, file: !289, line: 61, baseType: !298, size: 64)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !299, line: 49, baseType: !300)
!299 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !299, line: 37, size: 64, elements: !301)
!301 = !{!302, !308}
!302 = !DIDerivedType(tag: DW_TAG_member, scope: !300, file: !299, line: 38, baseType: !303, size: 32)
!303 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !300, file: !299, line: 38, size: 32, elements: !304)
!304 = !{!305, !307}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !303, file: !299, line: 39, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !303, file: !299, line: 40, baseType: !306, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, scope: !300, file: !299, line: 42, baseType: !309, size: 32, offset: 32)
!309 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !300, file: !299, line: 42, size: 32, elements: !310)
!310 = !{!311, !312}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !309, file: !299, line: 43, baseType: !306, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !309, file: !299, line: 44, baseType: !306, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !295, file: !289, line: 62, baseType: !314, size: 64)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !315, line: 49, size: 64, elements: !316)
!315 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!316 = !{!317}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !314, file: !315, line: 50, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_array_type, baseType: !319, size: 64, elements: !320)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!320 = !{!321}
!321 = !DISubrange(count: 2)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !292, file: !289, line: 68, baseType: !323, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !325, line: 233, baseType: !326)
!325 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !325, line: 231, size: 64, elements: !327)
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !326, file: !325, line: 232, baseType: !329, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !299, line: 48, baseType: !300)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !292, file: !289, line: 71, baseType: !131, size: 8, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !292, file: !289, line: 74, baseType: !131, size: 8, offset: 104)
!332 = !DIDerivedType(tag: DW_TAG_member, scope: !292, file: !289, line: 90, baseType: !333, size: 16, offset: 112)
!333 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !292, file: !289, line: 90, size: 16, elements: !334)
!334 = !{!335, !342}
!335 = !DIDerivedType(tag: DW_TAG_member, scope: !333, file: !289, line: 91, baseType: !336, size: 16)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !333, file: !289, line: 91, size: 16, elements: !337)
!337 = !{!338, !341}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !336, file: !289, line: 96, baseType: !339, size: 8)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !340)
!340 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !336, file: !289, line: 97, baseType: !131, size: 8, offset: 8)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !333, file: !289, line: 100, baseType: !343, size: 16)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !344)
!344 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !292, file: !289, line: 107, baseType: !142, size: 32, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !292, file: !289, line: 127, baseType: !104, size: 32, offset: 160)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !292, file: !289, line: 131, baseType: !348, size: 192, offset: 192)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !325, line: 244, size: 192, elements: !349)
!349 = !{!350, !351, !357}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !348, file: !325, line: 245, baseType: !298, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !348, file: !325, line: 246, baseType: !352, size: 32, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !325, line: 242, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 32)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !356}
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !348, file: !325, line: 249, baseType: !358, size: 64, offset: 128)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !359)
!359 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !288, file: !289, line: 250, baseType: !361, size: 288, offset: 384)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !362, line: 25, size: 288, elements: !363)
!362 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!363 = !{!364, !365, !366, !367, !368, !369, !370, !371, !372}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !361, file: !362, line: 26, baseType: !142, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !361, file: !362, line: 27, baseType: !142, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !361, file: !362, line: 28, baseType: !142, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !361, file: !362, line: 29, baseType: !142, size: 32, offset: 96)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !361, file: !362, line: 30, baseType: !142, size: 32, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !361, file: !362, line: 31, baseType: !142, size: 32, offset: 160)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !361, file: !362, line: 32, baseType: !142, size: 32, offset: 192)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !361, file: !362, line: 33, baseType: !142, size: 32, offset: 224)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !361, file: !362, line: 34, baseType: !142, size: 32, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !288, file: !289, line: 253, baseType: !104, size: 32, offset: 672)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !288, file: !289, line: 256, baseType: !324, size: 64, offset: 704)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !288, file: !289, line: 294, baseType: !103, size: 32, offset: 768)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !288, file: !289, line: 300, baseType: !377, size: 96, offset: 800)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !289, line: 149, size: 96, elements: !378)
!378 = !{!379, !380, !381}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !377, file: !289, line: 153, baseType: !22, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !377, file: !289, line: 162, baseType: !278, size: 32, offset: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !377, file: !289, line: 168, baseType: !278, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !288, file: !289, line: 325, baseType: !383, size: 32, offset: 896)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !385, line: 5073, size: 160, elements: !386)
!385 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!386 = !{!387, !396, !397}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !384, file: !385, line: 5074, baseType: !388, size: 96)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !389, line: 56, size: 96, elements: !390)
!389 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!390 = !{!391, !394, !395}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !388, file: !389, line: 57, baseType: !392, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !389, line: 57, flags: DIFlagFwdDecl)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !388, file: !389, line: 58, baseType: !104, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !388, file: !389, line: 59, baseType: !278, size: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !384, file: !385, line: 5075, baseType: !324, size: 64, offset: 96)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !384, file: !385, line: 5076, baseType: !398, offset: 160)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !399, line: 43, elements: !400)
!399 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!400 = !{}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !288, file: !289, line: 343, baseType: !402, size: 64, offset: 928)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !362, line: 60, size: 64, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !402, file: !362, line: 63, baseType: !142, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !402, file: !362, line: 66, baseType: !142, size: 32, offset: 32)
!406 = !{!407, !408, !409, !410}
!407 = !DILocalVariable(name: "thread", arg: 1, scope: !283, file: !284, line: 175, type: !287)
!408 = !DILocalVariable(name: "region_num", scope: !283, file: !284, line: 200, type: !131)
!409 = !DILocalVariable(name: "guard_start", scope: !283, file: !284, line: 265, type: !22)
!410 = !DILocalVariable(name: "guard_size", scope: !283, file: !284, line: 266, type: !278)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 96, elements: !207)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !413, line: 52, size: 96, elements: !414)
!413 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!414 = !{!415, !416, !417}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !412, file: !413, line: 53, baseType: !22, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !412, file: !413, line: 54, baseType: !278, size: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !412, file: !413, line: 55, baseType: !418, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !419, line: 151, baseType: !420)
!419 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 149, size: 32, elements: !421)
!421 = !{!422}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !420, file: !419, line: 150, baseType: !142, size: 32)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 96, elements: !207)
!424 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !412)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !427, file: !459, line: 39, type: !131, isLocal: true, isDefinition: true)
!427 = distinct !DICompileUnit(language: DW_LANG_C99, file: !428, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !429, globals: !458, splitDebugInlining: false, nameTableKind: None)
!428 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux")
!429 = !{!430, !104, !103, !446, !131}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !432, line: 1168, baseType: !433)
!432 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !432, line: 1155, size: 352, elements: !434)
!434 = !{!435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !433, file: !432, line: 1157, baseType: !195, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !433, file: !432, line: 1158, baseType: !192, size: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !433, file: !432, line: 1159, baseType: !192, size: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !433, file: !432, line: 1160, baseType: !192, size: 32, offset: 96)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !433, file: !432, line: 1161, baseType: !192, size: 32, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !433, file: !432, line: 1162, baseType: !192, size: 32, offset: 160)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !433, file: !432, line: 1163, baseType: !192, size: 32, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !433, file: !432, line: 1164, baseType: !192, size: 32, offset: 224)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !433, file: !432, line: 1165, baseType: !192, size: 32, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !433, file: !432, line: 1166, baseType: !192, size: 32, offset: 288)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !433, file: !432, line: 1167, baseType: !192, size: 32, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !449, line: 27, size: 96, elements: !450)
!449 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!450 = !{!451, !452, !453}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !448, file: !449, line: 29, baseType: !142, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !448, file: !449, line: 31, baseType: !121, size: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !448, file: !449, line: 37, baseType: !454, size: 32, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !419, line: 146, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !419, line: 141, size: 32, elements: !456)
!456 = !{!457}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !455, file: !419, line: 143, baseType: !142, size: 32)
!458 = !{!425}
!459 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !462, file: !469, line: 21, type: !178, isLocal: true, isDefinition: true)
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !464, globals: !468, splitDebugInlining: false, nameTableKind: None)
!463 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux")
!464 = !{!465, !103, !104}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !467, line: 22, baseType: !103)
!467 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!468 = !{!460}
!469 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !472, file: !477, line: 13, type: !494, isLocal: true, isDefinition: true)
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !474, splitDebugInlining: false, nameTableKind: None)
!473 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux")
!474 = !{!475, !470}
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "mpu_config", scope: !472, file: !477, line: 37, type: !478, isLocal: false, isDefinition: true)
!477 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !449, line: 41, size: 64, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !479, file: !449, line: 43, baseType: !142, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !479, file: !449, line: 45, baseType: !483, size: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !449, line: 27, size: 96, elements: !486)
!486 = !{!487, !488, !489}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !485, file: !449, line: 29, baseType: !142, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !485, file: !449, line: 31, baseType: !121, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !485, file: !449, line: 37, baseType: !490, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !419, line: 146, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !419, line: 141, size: 32, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !491, file: !419, line: 143, baseType: !142, size: 32)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 192, elements: !320)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !497, file: !554, line: 603, type: !556, isLocal: true, isDefinition: true, align: 32)
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !499, globals: !551, splitDebugInlining: false, nameTableKind: None)
!498 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux")
!499 = !{!104, !103, !500}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !503, line: 336, size: 160, elements: !504)
!503 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!504 = !{!505, !525, !529, !533, !546}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !502, file: !503, line: 365, baseType: !506, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = !DISubroutineType(types: !508)
!508 = !{!103, !509, !524}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !512)
!512 = !{!513, !514, !515, !516, !522, !523}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !511, file: !118, line: 380, baseType: !121, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !511, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !511, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !511, file: !118, line: 386, baseType: !517, size: 32, offset: 96)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 32)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !518, file: !118, line: 359, baseType: !131, size: 8)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !518, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !511, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !511, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !502, file: !503, line: 366, baseType: !526, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !509, !132}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !502, file: !503, line: 374, baseType: !530, size: 32, offset: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 32)
!531 = !DISubroutineType(types: !532)
!532 = !{!103, !509}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !502, file: !503, line: 377, baseType: !534, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DISubroutineType(types: !536)
!536 = !{!103, !509, !537}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !503, line: 122, size: 64, elements: !540)
!540 = !{!541, !542, !543, !544, !545}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !539, file: !503, line: 123, baseType: !142, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !539, file: !503, line: 124, baseType: !131, size: 8, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !539, file: !503, line: 125, baseType: !131, size: 8, offset: 40)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !539, file: !503, line: 126, baseType: !131, size: 8, offset: 48)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !539, file: !503, line: 127, baseType: !131, size: 8, offset: 56)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !502, file: !503, line: 379, baseType: !547, size: 32, offset: 128)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DISubroutineType(types: !549)
!549 = !{!103, !509, !550}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 32)
!551 = !{!495, !552}
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !497, file: !554, line: 38, type: !555, isLocal: true, isDefinition: true)
!554 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!556 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !251, line: 51, size: 64, elements: !558)
!558 = !{!559, !560}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !557, file: !251, line: 60, baseType: !530, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !557, file: !251, line: 65, baseType: !509, size: 32, offset: 32)
!561 = !DIGlobalVariableExpression(var: !562, expr: !DIExpression())
!562 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !563, file: !568, line: 7, type: !569, isLocal: false, isDefinition: true, align: 16)
!563 = distinct !DICompileUnit(language: DW_LANG_C99, file: !564, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !565, splitDebugInlining: false, nameTableKind: None)
!564 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux")
!565 = !{!561, !566}
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !563, file: !568, line: 12, type: !569, isLocal: false, isDefinition: true, align: 16)
!568 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux")
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 48, elements: !223)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "wdt_sam_cfg", scope: !572, file: !633, line: 234, type: !668, isLocal: true, isDefinition: true)
!572 = distinct !DICompileUnit(language: DW_LANG_C99, file: !573, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !574, globals: !630, splitDebugInlining: false, nameTableKind: None)
!573 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux")
!574 = !{!575, !142}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !578, line: 134, size: 128, elements: !579)
!578 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!579 = !{!580, !600, !605, !625}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !577, file: !578, line: 135, baseType: !581, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !578, line: 113, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 32)
!583 = !DISubroutineType(types: !584)
!584 = !{!103, !585, !131}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !588)
!588 = !{!589, !590, !591, !592, !598, !599}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !587, file: !118, line: 380, baseType: !121, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !587, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !587, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !587, file: !118, line: 386, baseType: !593, size: 32, offset: 96)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !595)
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !594, file: !118, line: 359, baseType: !131, size: 8)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !594, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !587, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !587, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !577, file: !578, line: 136, baseType: !601, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_disable", file: !578, line: 119, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DISubroutineType(types: !604)
!604 = !{!103, !585}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "install_timeout", scope: !577, file: !578, line: 137, baseType: !606, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_install_timeout", file: !578, line: 125, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = !DISubroutineType(types: !609)
!609 = !{!103, !585, !610}
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_timeout_cfg", file: !578, line: 88, size: 128, elements: !613)
!613 = !{!614, !619, !624}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !612, file: !578, line: 90, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_window", file: !578, line: 72, size: 64, elements: !616)
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !615, file: !578, line: 74, baseType: !142, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !615, file: !578, line: 76, baseType: !142, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !612, file: !578, line: 92, baseType: !620, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_callback_t", file: !578, line: 85, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!622 = !DISubroutineType(types: !623)
!623 = !{null, !585, !103}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !612, file: !578, line: 104, baseType: !131, size: 8, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "feed", scope: !577, file: !578, line: 138, baseType: !626, size: 32, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_feed", file: !578, line: 132, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 32)
!628 = !DISubroutineType(types: !629)
!629 = !{!103, !585, !103}
!630 = !{!631, !635, !637, !644, !570, !646, !648, !656}
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !572, file: !633, line: 256, type: !634, isLocal: false, isDefinition: true, align: 16)
!633 = !DIFile(filename: "zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 80, elements: !227)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "__device_dts_ord_26", scope: !572, file: !633, line: 256, type: !586, isLocal: false, isDefinition: true, align: 32)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_26", scope: !572, file: !633, line: 256, type: !639, isLocal: true, isDefinition: true, align: 32)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !251, line: 51, size: 64, elements: !641)
!641 = !{!642, !643}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !640, file: !251, line: 60, baseType: !602, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !640, file: !251, line: 65, baseType: !585, size: 32, offset: 32)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_26", scope: !572, file: !633, line: 256, type: !594, isLocal: true, isDefinition: true, align: 8)
!646 = !DIGlobalVariableExpression(var: !647, expr: !DIExpression())
!647 = distinct !DIGlobalVariable(name: "wdt_sam_api", scope: !572, file: !633, line: 227, type: !576, isLocal: true, isDefinition: true)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "wdt_sam_data", scope: !572, file: !633, line: 45, type: !650, isLocal: true, isDefinition: true)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_data", file: !633, line: 38, size: 96, elements: !651)
!651 = !{!652, !653, !654, !655}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !650, file: !633, line: 39, baseType: !620, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !650, file: !633, line: 40, baseType: !142, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_valid", scope: !650, file: !633, line: 41, baseType: !134, size: 8, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "mode_set", scope: !650, file: !633, line: 42, baseType: !134, size: 8, offset: 72)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "__isr_wdt_sam_isr_irq_0", scope: !658, file: !633, line: 240, type: !661, isLocal: true, isDefinition: true, align: 32)
!658 = distinct !DISubprogram(name: "wdt_sam_irq_config", scope: !633, file: !633, line: 238, type: !659, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !572, retainedNodes: !400)
!659 = !DISubroutineType(types: !660)
!660 = !{null}
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !662)
!662 = !{!663, !665, !666, !667}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !661, file: !10, line: 55, baseType: !664, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !661, file: !10, line: 57, baseType: !664, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !661, file: !10, line: 59, baseType: !104, size: 32, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !661, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_cfg", file: !633, line: 34, size: 32, elements: !670)
!670 = !{!671}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !669, file: !633, line: 35, baseType: !672, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "Wdt", file: !674, line: 45, baseType: !675)
!674 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/wdt.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !674, line: 41, size: 96, elements: !676)
!676 = !{!677, !678, !679}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_CR", scope: !675, file: !674, line: 42, baseType: !192, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_MR", scope: !675, file: !674, line: 43, baseType: !192, size: 32, offset: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_SR", scope: !675, file: !674, line: 44, baseType: !195, size: 32, offset: 64)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "uart0_sam_config", scope: !682, file: !770, line: 494, type: !817, isLocal: true, isDefinition: true)
!682 = distinct !DICompileUnit(language: DW_LANG_C99, file: !683, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !684, retainedTypes: !717, globals: !767, splitDebugInlining: false, nameTableKind: None)
!683 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux")
!684 = !{!685, !692, !698, !705, !710}
!685 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_rx_stop_reason", file: !503, line: 47, baseType: !32, size: 32, elements: !686)
!686 = !{!687, !688, !689, !690, !691}
!687 = !DIEnumerator(name: "UART_ERROR_OVERRUN", value: 1)
!688 = !DIEnumerator(name: "UART_ERROR_PARITY", value: 2)
!689 = !DIEnumerator(name: "UART_ERROR_FRAMING", value: 4)
!690 = !DIEnumerator(name: "UART_BREAK", value: 8)
!691 = !DIEnumerator(name: "UART_ERROR_COLLISION", value: 16)
!692 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_stop_bits", file: !503, line: 84, baseType: !32, size: 32, elements: !693)
!693 = !{!694, !695, !696, !697}
!694 = !DIEnumerator(name: "UART_CFG_STOP_BITS_0_5", value: 0)
!695 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1", value: 1)
!696 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1_5", value: 2)
!697 = !DIEnumerator(name: "UART_CFG_STOP_BITS_2", value: 3)
!698 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_data_bits", file: !503, line: 92, baseType: !32, size: 32, elements: !699)
!699 = !{!700, !701, !702, !703, !704}
!700 = !DIEnumerator(name: "UART_CFG_DATA_BITS_5", value: 0)
!701 = !DIEnumerator(name: "UART_CFG_DATA_BITS_6", value: 1)
!702 = !DIEnumerator(name: "UART_CFG_DATA_BITS_7", value: 2)
!703 = !DIEnumerator(name: "UART_CFG_DATA_BITS_8", value: 3)
!704 = !DIEnumerator(name: "UART_CFG_DATA_BITS_9", value: 4)
!705 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_flow_control", file: !503, line: 107, baseType: !32, size: 32, elements: !706)
!706 = !{!707, !708, !709}
!707 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_NONE", value: 0)
!708 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RTS_CTS", value: 1)
!709 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_DTR_DSR", value: 2)
!710 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_parity", file: !503, line: 75, baseType: !32, size: 32, elements: !711)
!711 = !{!712, !713, !714, !715, !716}
!712 = !DIEnumerator(name: "UART_CFG_PARITY_NONE", value: 0)
!713 = !DIEnumerator(name: "UART_CFG_PARITY_ODD", value: 1)
!714 = !DIEnumerator(name: "UART_CFG_PARITY_EVEN", value: 2)
!715 = !DIEnumerator(name: "UART_CFG_PARITY_MARK", value: 3)
!716 = !DIEnumerator(name: "UART_CFG_PARITY_SPACE", value: 4)
!717 = !{!718, !104, !132, !142}
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !503, line: 336, size: 160, elements: !721)
!721 = !{!722, !741, !745, !749, !762}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !720, file: !503, line: 365, baseType: !723, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = !DISubroutineType(types: !725)
!725 = !{!103, !726, !524}
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !729)
!729 = !{!730, !731, !732, !733, !739, !740}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !728, file: !118, line: 380, baseType: !121, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !728, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !728, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !728, file: !118, line: 386, baseType: !734, size: 32, offset: 96)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !736)
!736 = !{!737, !738}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !735, file: !118, line: 359, baseType: !131, size: 8)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !735, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !728, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !728, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !720, file: !503, line: 366, baseType: !742, size: 32, offset: 32)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 32)
!743 = !DISubroutineType(types: !744)
!744 = !{null, !726, !132}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !720, file: !503, line: 374, baseType: !746, size: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32)
!747 = !DISubroutineType(types: !748)
!748 = !{!103, !726}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !720, file: !503, line: 377, baseType: !750, size: 32, offset: 96)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!751 = !DISubroutineType(types: !752)
!752 = !{!103, !726, !753}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !503, line: 122, size: 64, elements: !756)
!756 = !{!757, !758, !759, !760, !761}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !755, file: !503, line: 123, baseType: !142, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !755, file: !503, line: 124, baseType: !131, size: 8, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !755, file: !503, line: 125, baseType: !131, size: 8, offset: 40)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !755, file: !503, line: 126, baseType: !131, size: 8, offset: 48)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !755, file: !503, line: 127, baseType: !131, size: 8, offset: 56)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !720, file: !503, line: 379, baseType: !763, size: 32, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!764 = !DISubroutineType(types: !765)
!765 = !{!103, !726, !766}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!767 = !{!768, !774, !776, !783, !785, !787, !680, !792, !811, !814}
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !682, file: !770, line: 494, type: !771, isLocal: false, isDefinition: true, align: 16)
!770 = !DIFile(filename: "zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 96, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 6)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "__device_dts_ord_21", scope: !682, file: !770, line: 494, type: !727, isLocal: false, isDefinition: true, align: 32)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_21", scope: !682, file: !770, line: 494, type: !778, isLocal: true, isDefinition: true, align: 32)
!778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !251, line: 51, size: 64, elements: !780)
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !779, file: !251, line: 60, baseType: !746, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !779, file: !251, line: 65, baseType: !726, size: 32, offset: 32)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_21", scope: !682, file: !770, line: 494, type: !735, isLocal: true, isDefinition: true, align: 8)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "uart_sam_driver_api", scope: !682, file: !770, line: 419, type: !719, isLocal: true, isDefinition: true)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "uart0_sam_data", scope: !682, file: !770, line: 494, type: !789, isLocal: true, isDefinition: true)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_sam_dev_data", file: !770, line: 38, size: 32, elements: !790)
!790 = !{!791}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "baud_rate", scope: !789, file: !770, line: 39, baseType: !142, size: 32)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "__pinctrl_dev_config__device_dts_ord_21", scope: !682, file: !770, line: 494, type: !794, isLocal: true, isDefinition: true)
!794 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_dev_config", file: !796, line: 60, size: 64, elements: !797)
!796 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!797 = !{!798, !810}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !795, file: !796, line: 69, baseType: !799, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_state", file: !796, line: 50, size: 64, elements: !802)
!802 = !{!803, !808, !809}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pins", scope: !801, file: !796, line: 52, baseType: !804, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "pinctrl_soc_pin_t", file: !807, line: 32, baseType: !142)
!807 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl/pinctrl_soc_sam_common.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pin_cnt", scope: !801, file: !796, line: 54, baseType: !131, size: 8, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !801, file: !796, line: 56, baseType: !131, size: 8, offset: 40)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "state_cnt", scope: !795, file: !796, line: 71, baseType: !131, size: 8, offset: 32)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "__pinctrl_states__device_dts_ord_21", scope: !682, file: !770, line: 494, type: !813, isLocal: true, isDefinition: true)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 64, elements: !207)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "__pinctrl_state_pins_0__device_dts_ord_21", scope: !682, file: !770, line: 494, type: !816, isLocal: true, isDefinition: true)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !805, size: 64, elements: !320)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_sam_dev_cfg", file: !770, line: 27, size: 96, elements: !819)
!819 = !{!820, !849, !850}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !818, file: !770, line: 28, baseType: !821, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uart", file: !823, line: 62, baseType: !824)
!823 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !823, line: 41, size: 2368, elements: !825)
!825 = !{!826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "UART_CR", scope: !824, file: !823, line: 42, baseType: !192, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "UART_MR", scope: !824, file: !823, line: 43, baseType: !192, size: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IER", scope: !824, file: !823, line: 44, baseType: !192, size: 32, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IDR", scope: !824, file: !823, line: 45, baseType: !192, size: 32, offset: 96)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IMR", scope: !824, file: !823, line: 46, baseType: !195, size: 32, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "UART_SR", scope: !824, file: !823, line: 47, baseType: !195, size: 32, offset: 160)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RHR", scope: !824, file: !823, line: 48, baseType: !195, size: 32, offset: 192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "UART_THR", scope: !824, file: !823, line: 49, baseType: !192, size: 32, offset: 224)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "UART_BRGR", scope: !824, file: !823, line: 50, baseType: !192, size: 32, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !824, file: !823, line: 51, baseType: !836, size: 1760, offset: 288)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 1760, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 55)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RPR", scope: !824, file: !823, line: 52, baseType: !192, size: 32, offset: 2048)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RCR", scope: !824, file: !823, line: 53, baseType: !192, size: 32, offset: 2080)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TPR", scope: !824, file: !823, line: 54, baseType: !192, size: 32, offset: 2112)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TCR", scope: !824, file: !823, line: 55, baseType: !192, size: 32, offset: 2144)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RNPR", scope: !824, file: !823, line: 56, baseType: !192, size: 32, offset: 2176)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RNCR", scope: !824, file: !823, line: 57, baseType: !192, size: 32, offset: 2208)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TNPR", scope: !824, file: !823, line: 58, baseType: !192, size: 32, offset: 2240)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TNCR", scope: !824, file: !823, line: 59, baseType: !192, size: 32, offset: 2272)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "UART_PTCR", scope: !824, file: !823, line: 60, baseType: !192, size: 32, offset: 2304)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "UART_PTSR", scope: !824, file: !823, line: 61, baseType: !195, size: 32, offset: 2336)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "periph_id", scope: !818, file: !770, line: 29, baseType: !142, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "pcfg", scope: !818, file: !770, line: 30, baseType: !851, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 32)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "overflow_cyc", scope: !854, file: !990, line: 65, type: !192, isLocal: true, isDefinition: true)
!854 = distinct !DICompileUnit(language: DW_LANG_C99, file: !855, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !856, retainedTypes: !910, globals: !987, splitDebugInlining: false, nameTableKind: None)
!855 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/timer/cortex_m_systick.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux")
!856 = !{!857}
!857 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !858, line: 57, baseType: !103, size: 32, elements: !859)
!858 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/sam3x8e.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!859 = !{!860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909}
!860 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!861 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!862 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!863 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!864 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!865 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!866 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!867 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!868 = !DIEnumerator(name: "SUPC_IRQn", value: 0)
!869 = !DIEnumerator(name: "RSTC_IRQn", value: 1)
!870 = !DIEnumerator(name: "RTC_IRQn", value: 2)
!871 = !DIEnumerator(name: "RTT_IRQn", value: 3)
!872 = !DIEnumerator(name: "WDT_IRQn", value: 4)
!873 = !DIEnumerator(name: "PMC_IRQn", value: 5)
!874 = !DIEnumerator(name: "EFC0_IRQn", value: 6)
!875 = !DIEnumerator(name: "EFC1_IRQn", value: 7)
!876 = !DIEnumerator(name: "UART_IRQn", value: 8)
!877 = !DIEnumerator(name: "SMC_IRQn", value: 9)
!878 = !DIEnumerator(name: "PIOA_IRQn", value: 11)
!879 = !DIEnumerator(name: "PIOB_IRQn", value: 12)
!880 = !DIEnumerator(name: "PIOC_IRQn", value: 13)
!881 = !DIEnumerator(name: "PIOD_IRQn", value: 14)
!882 = !DIEnumerator(name: "USART0_IRQn", value: 17)
!883 = !DIEnumerator(name: "USART1_IRQn", value: 18)
!884 = !DIEnumerator(name: "USART2_IRQn", value: 19)
!885 = !DIEnumerator(name: "USART3_IRQn", value: 20)
!886 = !DIEnumerator(name: "HSMCI_IRQn", value: 21)
!887 = !DIEnumerator(name: "TWI0_IRQn", value: 22)
!888 = !DIEnumerator(name: "TWI1_IRQn", value: 23)
!889 = !DIEnumerator(name: "SPI0_IRQn", value: 24)
!890 = !DIEnumerator(name: "SSC_IRQn", value: 26)
!891 = !DIEnumerator(name: "TC0_IRQn", value: 27)
!892 = !DIEnumerator(name: "TC1_IRQn", value: 28)
!893 = !DIEnumerator(name: "TC2_IRQn", value: 29)
!894 = !DIEnumerator(name: "TC3_IRQn", value: 30)
!895 = !DIEnumerator(name: "TC4_IRQn", value: 31)
!896 = !DIEnumerator(name: "TC5_IRQn", value: 32)
!897 = !DIEnumerator(name: "TC6_IRQn", value: 33)
!898 = !DIEnumerator(name: "TC7_IRQn", value: 34)
!899 = !DIEnumerator(name: "TC8_IRQn", value: 35)
!900 = !DIEnumerator(name: "PWM_IRQn", value: 36)
!901 = !DIEnumerator(name: "ADC_IRQn", value: 37)
!902 = !DIEnumerator(name: "DACC_IRQn", value: 38)
!903 = !DIEnumerator(name: "DMAC_IRQn", value: 39)
!904 = !DIEnumerator(name: "UOTGHS_IRQn", value: 40)
!905 = !DIEnumerator(name: "TRNG_IRQn", value: 41)
!906 = !DIEnumerator(name: "EMAC_IRQn", value: 42)
!907 = !DIEnumerator(name: "CAN0_IRQn", value: 43)
!908 = !DIEnumerator(name: "CAN1_IRQn", value: 44)
!909 = !DIEnumerator(name: "PERIPH_COUNT_IRQn", value: 45)
!910 = !{!911, !913, !664, !131, !142, !921, !954}
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !912, line: 46, baseType: !358)
!912 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !432, line: 712, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !432, line: 706, size: 128, elements: !916)
!916 = !{!917, !918, !919, !920}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !915, file: !432, line: 708, baseType: !192, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !915, file: !432, line: 709, baseType: !192, size: 32, offset: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !915, file: !432, line: 710, baseType: !192, size: 32, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !915, file: !432, line: 711, baseType: !195, size: 32, offset: 96)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !432, line: 360, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !432, line: 345, size: 28704, elements: !924)
!924 = !{!925, !929, !933, !934, !935, !936, !937, !938, !939, !940, !944, !949, !953}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !923, file: !432, line: 347, baseType: !926, size: 256)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 256, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 8)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !923, file: !432, line: 348, baseType: !930, size: 768, offset: 256)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 768, elements: !931)
!931 = !{!932}
!932 = !DISubrange(count: 24)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !923, file: !432, line: 349, baseType: !926, size: 256, offset: 1024)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !923, file: !432, line: 350, baseType: !930, size: 768, offset: 1280)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !923, file: !432, line: 351, baseType: !926, size: 256, offset: 2048)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !923, file: !432, line: 352, baseType: !930, size: 768, offset: 2304)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !923, file: !432, line: 353, baseType: !926, size: 256, offset: 3072)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !923, file: !432, line: 354, baseType: !930, size: 768, offset: 3328)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !923, file: !432, line: 355, baseType: !926, size: 256, offset: 4096)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !923, file: !432, line: 356, baseType: !941, size: 1792, offset: 4352)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 1792, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 56)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !923, file: !432, line: 357, baseType: !945, size: 1920, offset: 6144)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 1920, elements: !947)
!946 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !131)
!947 = !{!948}
!948 = !DISubrange(count: 240)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !923, file: !432, line: 358, baseType: !950, size: 20608, offset: 8064)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 20608, elements: !951)
!951 = !{!952}
!952 = !DISubrange(count: 644)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !923, file: !432, line: 359, baseType: !192, size: 32, offset: 28672)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !432, line: 402, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !432, line: 379, size: 1120, elements: !957)
!957 = !{!958, !959, !960, !961, !962, !963, !964, !968, !969, !970, !971, !972, !973, !974, !975, !977, !978, !979, !983, !984, !986}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !956, file: !432, line: 381, baseType: !195, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !956, file: !432, line: 382, baseType: !192, size: 32, offset: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !956, file: !432, line: 383, baseType: !192, size: 32, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !956, file: !432, line: 384, baseType: !192, size: 32, offset: 96)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !956, file: !432, line: 385, baseType: !192, size: 32, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !956, file: !432, line: 386, baseType: !192, size: 32, offset: 160)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !956, file: !432, line: 387, baseType: !965, size: 96, offset: 192)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 96, elements: !966)
!966 = !{!967}
!967 = !DISubrange(count: 12)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !956, file: !432, line: 388, baseType: !192, size: 32, offset: 288)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !956, file: !432, line: 389, baseType: !192, size: 32, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !956, file: !432, line: 390, baseType: !192, size: 32, offset: 352)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !956, file: !432, line: 391, baseType: !192, size: 32, offset: 384)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !956, file: !432, line: 392, baseType: !192, size: 32, offset: 416)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !956, file: !432, line: 393, baseType: !192, size: 32, offset: 448)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !956, file: !432, line: 394, baseType: !192, size: 32, offset: 480)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !956, file: !432, line: 395, baseType: !976, size: 64, offset: 512)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 64, elements: !320)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !956, file: !432, line: 396, baseType: !195, size: 32, offset: 576)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !956, file: !432, line: 397, baseType: !195, size: 32, offset: 608)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !956, file: !432, line: 398, baseType: !980, size: 128, offset: 640)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 128, elements: !981)
!981 = !{!982}
!982 = !DISubrange(count: 4)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !956, file: !432, line: 399, baseType: !226, size: 160, offset: 768)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !956, file: !432, line: 400, baseType: !985, size: 160, offset: 928)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 160, elements: !227)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !956, file: !432, line: 401, baseType: !192, size: 32, offset: 1088)
!987 = !{!988, !1014, !1017, !1019, !1021, !852}
!988 = !DIGlobalVariableExpression(var: !989, expr: !DIExpression())
!989 = distinct !DIGlobalVariable(name: "__init_sys_clock_driver_init", scope: !854, file: !990, line: 285, type: !991, isLocal: true, isDefinition: true, align: 32)
!990 = !DIFile(filename: "zephyr/drivers/timer/cortex_m_systick.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!991 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !251, line: 51, size: 64, elements: !993)
!993 = !{!994, !1013}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !992, file: !251, line: 60, baseType: !995, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DISubroutineType(types: !997)
!997 = !{!103, !998}
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005, !1011, !1012}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1000, file: !118, line: 380, baseType: !121, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1000, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1000, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1000, file: !118, line: 386, baseType: !1006, size: 32, offset: 96)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 32)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !1008)
!1008 = !{!1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1007, file: !118, line: 359, baseType: !131, size: 8)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1007, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1000, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1000, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !992, file: !251, line: 65, baseType: !998, size: 32, offset: 32)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(name: "lock", scope: !854, file: !990, line: 34, type: !1016, isLocal: true, isDefinition: true)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !399, line: 43, elements: !400)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "last_load", scope: !854, file: !990, line: 36, type: !142, isLocal: true, isDefinition: true)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "cycle_count", scope: !854, file: !990, line: 48, type: !142, isLocal: true, isDefinition: true)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(name: "announced_cycles", scope: !854, file: !990, line: 54, type: !142, isLocal: true, isDefinition: true)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(name: "sam_port_addrs", scope: !1025, file: !1091, line: 21, type: !1092, isLocal: true, isDefinition: true)
!1025 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1026, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1027, globals: !1088, splitDebugInlining: false, nameTableKind: None)
!1026 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/pinctrl/pinctrl_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/ipm/ipm_mcux")
!1027 = !{!1028}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pio", file: !1030, line: 96, baseType: !1031)
!1030 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1030, line: 41, size: 1888, elements: !1032)
