; ModuleID = 'build/adafruit_feather_m0_lora/subsys/pm/device_pm/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16*, %struct.pm_device* }
%struct.device_state = type { i8, i8 }
%struct.pm_device = type { %struct.device*, %struct.k_mutex, i32, %struct.k_work_delayable, %struct.k_condvar, %struct.device*, i32, i32, i32 (%struct.device*, i32)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/pm/device_pm/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/pm/device_pm")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/pm/device_pm")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "parent", scope: !27, file: !338, line: 13, type: !126, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !114, globals: !335, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/pm/device_pm/src/dummy_driver.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/pm/device_pm")
!29 = !{!30, !38, !44}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_state", file: !31, line: 53, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/pm/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "PM_DEVICE_STATE_ACTIVE", value: 0)
!35 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDED", value: 1)
!36 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDING", value: 2)
!37 = !DIEnumerator(name: "PM_DEVICE_STATE_OFF", value: 3)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_action", file: !31, line: 75, baseType: !32, size: 32, elements: !39)
!39 = !{!40, !41, !42, !43}
!40 = !DIEnumerator(name: "PM_DEVICE_ACTION_SUSPEND", value: 0)
!41 = !DIEnumerator(name: "PM_DEVICE_ACTION_RESUME", value: 1)
!42 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_OFF", value: 2)
!43 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_ON", value: 3)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !45, line: 27, baseType: !32, size: 32, elements: !46)
!45 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113}
!47 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!48 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!49 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!50 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!51 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!52 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!53 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!54 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!55 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!56 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!57 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!58 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!59 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!60 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!61 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!62 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!63 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!113 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!114 = !{!115, !116, !117}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!116 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dummy_parent_api", file: !119, line: 17, size: 32, elements: !120)
!119 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_parent.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "transfer", scope: !118, file: !119, line: 18, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_transfer_t", file: !119, line: 14, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DISubroutineType(types: !125)
!125 = !{!116, !126, !223, !334}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !129, line: 378, size: 224, elements: !130)
!129 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !{!131, !135, !136, !137, !146, !147, !153}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !129, line: 380, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !128, file: !129, line: 382, baseType: !13, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !128, file: !129, line: 384, baseType: !13, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !128, file: !129, line: 386, baseType: !138, size: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !129, line: 351, size: 16, elements: !140)
!140 = !{!141, !144}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !139, file: !129, line: 359, baseType: !142, size: 8)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !143)
!143 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !139, file: !129, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!145 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !128, file: !129, line: 388, baseType: !115, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !128, file: !129, line: 396, baseType: !148, size: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !129, line: 43, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !152)
!152 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !128, file: !129, line: 403, baseType: !154, size: 32, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_device", file: !31, line: 121, size: 832, elements: !156)
!156 = !{!157, !158, !281, !282, !319, !323, !324, !328, !329}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !155, file: !31, line: 124, baseType: !126, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !155, file: !31, line: 126, baseType: !159, size: 160, offset: 32)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !160, line: 2720, size: 160, elements: !161)
!160 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!161 = !{!162, !183, !279, !280}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !159, file: !160, line: 2722, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !164, line: 233, baseType: !165)
!164 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 231, size: 64, elements: !166)
!166 = !{!167}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !165, file: !164, line: 232, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !169, line: 48, baseType: !170)
!169 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !169, line: 37, size: 64, elements: !171)
!171 = !{!172, !178}
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !170, file: !169, line: 38, baseType: !173, size: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !170, file: !169, line: 38, size: 32, elements: !174)
!174 = !{!175, !177}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !173, file: !169, line: 39, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !169, line: 40, baseType: !176, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, scope: !170, file: !169, line: 42, baseType: !179, size: 32, offset: 32)
!179 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !170, file: !169, line: 42, size: 32, elements: !180)
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !179, file: !169, line: 43, baseType: !176, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !179, file: !169, line: 44, baseType: !176, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !159, file: !160, line: 2724, baseType: !184, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !186, line: 245, size: 896, elements: !187)
!186 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!187 = !{!188, !238, !251, !252, !253, !254, !274}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !185, file: !186, line: 247, baseType: !189, size: 384)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !186, line: 57, size: 384, elements: !190)
!190 = !{!191, !205, !207, !208, !209, !222, !224, !225}
!191 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !186, line: 60, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !186, line: 60, size: 64, elements: !193)
!193 = !{!194, !196}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !192, file: !186, line: 61, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !169, line: 49, baseType: !170)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !192, file: !186, line: 62, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !198, line: 49, size: 64, elements: !199)
!198 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !197, file: !198, line: 50, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 64, elements: !203)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!203 = !{!204}
!204 = !DISubrange(count: 2)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !189, file: !186, line: 68, baseType: !206, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !189, file: !186, line: 71, baseType: !142, size: 8, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !189, file: !186, line: 74, baseType: !142, size: 8, offset: 104)
!209 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !186, line: 90, baseType: !210, size: 16, offset: 112)
!210 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !186, line: 90, size: 16, elements: !211)
!211 = !{!212, !219}
!212 = !DIDerivedType(tag: DW_TAG_member, scope: !210, file: !186, line: 91, baseType: !213, size: 16)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !186, line: 91, size: 16, elements: !214)
!214 = !{!215, !218}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !213, file: !186, line: 96, baseType: !216, size: 8)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !217)
!217 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !213, file: !186, line: 97, baseType: !142, size: 8, offset: 8)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !210, file: !186, line: 100, baseType: !220, size: 16)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !221)
!221 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !189, file: !186, line: 107, baseType: !223, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !189, file: !186, line: 127, baseType: !115, size: 32, offset: 160)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !189, file: !186, line: 131, baseType: !226, size: 192, offset: 192)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !164, line: 244, size: 192, elements: !227)
!227 = !{!228, !229, !235}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !226, file: !164, line: 245, baseType: !195, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !226, file: !164, line: 246, baseType: !230, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !164, line: 242, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !226, file: !164, line: 249, baseType: !236, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !237)
!237 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !185, file: !186, line: 250, baseType: !239, size: 288, offset: 384)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !240, line: 25, size: 288, elements: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !239, file: !240, line: 26, baseType: !223, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !239, file: !240, line: 27, baseType: !223, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !239, file: !240, line: 28, baseType: !223, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !239, file: !240, line: 29, baseType: !223, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !239, file: !240, line: 30, baseType: !223, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !239, file: !240, line: 31, baseType: !223, size: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !239, file: !240, line: 32, baseType: !223, size: 32, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !239, file: !240, line: 33, baseType: !223, size: 32, offset: 224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !239, file: !240, line: 34, baseType: !223, size: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !185, file: !186, line: 253, baseType: !115, size: 32, offset: 672)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !185, file: !186, line: 256, baseType: !163, size: 64, offset: 704)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !185, file: !186, line: 294, baseType: !116, size: 32, offset: 768)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !185, file: !186, line: 325, baseType: !255, size: 32, offset: 800)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !160, line: 5073, size: 160, elements: !257)
!257 = !{!258, !269, !270}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !256, file: !160, line: 5074, baseType: !259, size: 96)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !260, line: 56, size: 96, elements: !261)
!260 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!261 = !{!262, !265, !266}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !259, file: !260, line: 57, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !260, line: 57, flags: DIFlagFwdDecl)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !259, file: !260, line: 58, baseType: !115, size: 32, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !259, file: !260, line: 59, baseType: !267, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !268, line: 214, baseType: !32)
!268 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !256, file: !160, line: 5075, baseType: !163, size: 64, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !256, file: !160, line: 5076, baseType: !271, offset: 160)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !272, line: 43, elements: !273)
!272 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!273 = !{}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !185, file: !186, line: 343, baseType: !275, size: 64, offset: 832)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !240, line: 60, size: 64, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !275, file: !240, line: 63, baseType: !223, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !275, file: !240, line: 66, baseType: !223, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !159, file: !160, line: 2727, baseType: !223, size: 32, offset: 96)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !159, file: !160, line: 2730, baseType: !116, size: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !155, file: !31, line: 128, baseType: !223, size: 32, offset: 192)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !155, file: !31, line: 130, baseType: !283, size: 384, offset: 256)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_delayable", file: !160, line: 3691, size: 384, elements: !284)
!284 = !{!285, !317, !318}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !283, file: !160, line: 3693, baseType: !286, size: 128)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work", file: !160, line: 3663, size: 128, elements: !287)
!287 = !{!288, !295, !301, !316}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !286, file: !160, line: 3669, baseType: !289, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !290, line: 33, baseType: !291)
!290 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !290, line: 29, size: 32, elements: !292)
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !291, file: !290, line: 30, baseType: !294, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !286, file: !160, line: 3672, baseType: !296, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_work_handler_t", file: !160, line: 3071, baseType: !297)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !286, file: !160, line: 3675, baseType: !302, size: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_q", file: !160, line: 3810, size: 1152, elements: !304)
!304 = !{!305, !306, !313, !314, !315}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !303, file: !160, line: 3812, baseType: !185, size: 896)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !303, file: !160, line: 3819, baseType: !307, size: 64, offset: 896)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !290, line: 40, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !290, line: 35, size: 64, elements: !309)
!309 = !{!310, !312}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !308, file: !290, line: 36, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !308, file: !290, line: 37, baseType: !311, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "notifyq", scope: !303, file: !160, line: 3822, baseType: !163, size: 64, offset: 960)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "drainq", scope: !303, file: !160, line: 3825, baseType: !163, size: 64, offset: 1024)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !303, file: !160, line: 3828, baseType: !223, size: 32, offset: 1088)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !286, file: !160, line: 3683, baseType: !223, size: 32, offset: 96)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !283, file: !160, line: 3696, baseType: !226, size: 192, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !283, file: !160, line: 3699, baseType: !302, size: 32, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "condvar", scope: !155, file: !31, line: 132, baseType: !320, size: 64, offset: 640)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !160, line: 2828, size: 64, elements: !321)
!321 = !{!322}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !320, file: !160, line: 2829, baseType: !163, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !155, file: !31, line: 136, baseType: !126, size: 32, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !155, file: !31, line: 139, baseType: !325, size: 32, offset: 736)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !326, line: 22, baseType: !327)
!326 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!327 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !155, file: !31, line: 141, baseType: !30, size: 32, offset: 768)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "action_cb", scope: !155, file: !31, line: 143, baseType: !330, size: 32, offset: 800)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_device_action_cb_t", file: !31, line: 104, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DISubroutineType(types: !333)
!333 = !{!116, !126, !38}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!335 = !{!336, !342, !344, !25, !355, !357, !359, !379}
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_driver", scope: !27, file: !338, line: 117, type: !339, isLocal: false, isDefinition: true, align: 16)
!338 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_driver.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 48, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 3)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "__device_dummy_driver", scope: !27, file: !338, line: 117, type: !127, isLocal: true, isDefinition: true, align: 32)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "__init___device_dummy_driver", scope: !27, file: !338, line: 117, type: !346, isLocal: true, isDefinition: true, align: 32)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !348, line: 51, size: 64, elements: !349)
!348 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!349 = !{!350, !354}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !347, file: !348, line: 60, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!352 = !DISubroutineType(types: !353)
!353 = !{!116, !126}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !347, file: !348, line: 65, baseType: !126, size: 32, offset: 32)
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "__pm_slot_dummy_driver", scope: !27, file: !338, line: 115, type: !126, isLocal: true, isDefinition: true, align: 32)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "__devstate_dummy_driver", scope: !27, file: !338, line: 117, type: !139, isLocal: true, isDefinition: true, align: 8)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "funcs", scope: !27, file: !338, line: 98, type: !361, isLocal: true, isDefinition: true)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dummy_driver_api", file: !363, line: 19, size: 128, elements: !364)
!363 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_driver.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = !{!365, !367, !372, !377}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !362, file: !363, line: 20, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_open_t", file: !363, line: 11, baseType: !351)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !362, file: !363, line: 21, baseType: !368, size: 32, offset: 32)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_read_t", file: !363, line: 13, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = !DISubroutineType(types: !371)
!371 = !{!116, !126, !334}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !362, file: !363, line: 22, baseType: !373, size: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_write_t", file: !363, line: 15, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 32)
!375 = !DISubroutineType(types: !376)
!376 = !{!116, !126, !223}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !362, file: !363, line: 23, baseType: !378, size: 32, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_close_t", file: !363, line: 17, baseType: !351)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "__pm_device_dummy_driver", scope: !27, file: !338, line: 115, type: !155, isLocal: true, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_driver", scope: !383, file: !388, line: 22, type: !339, isLocal: false, isDefinition: true, align: 16)
!383 = distinct !DICompileUnit(language: DW_LANG_C99, file: !384, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !385, splitDebugInlining: false, nameTableKind: None)
!384 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/pm/device_pm/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/pm/device_pm")
!385 = !{!386, !389, !391, !381}
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_18", scope: !383, file: !388, line: 7, type: !339, isLocal: false, isDefinition: true, align: 16)
!388 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/pm/device_pm")
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !383, file: !388, line: 12, type: !339, isLocal: false, isDefinition: true, align: 16)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_parent", scope: !383, file: !388, line: 17, type: !339, isLocal: false, isDefinition: true, align: 16)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "funcs", scope: !395, file: !401, line: 43, type: !592, isLocal: true, isDefinition: true)
!395 = distinct !DICompileUnit(language: DW_LANG_C99, file: !396, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !397, globals: !398, splitDebugInlining: false, nameTableKind: None)
!396 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/pm/device_pm/src/dummy_parent.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/pm/device_pm")
!397 = !{!115, !116}
!398 = !{!399, !402, !574, !584, !586, !393, !588, !590}
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_parent", scope: !395, file: !401, line: 54, type: !339, isLocal: false, isDefinition: true, align: 16)
!401 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_parent.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "__device_dummy_parent", scope: !395, file: !401, line: 54, type: !404, isLocal: true, isDefinition: true, align: 32)
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !129, line: 378, size: 224, elements: !406)
!406 = !{!407, !408, !409, !410, !416, !417, !418}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !405, file: !129, line: 380, baseType: !132, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !405, file: !129, line: 382, baseType: !13, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !405, file: !129, line: 384, baseType: !13, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !405, file: !129, line: 386, baseType: !411, size: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !129, line: 351, size: 16, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !412, file: !129, line: 359, baseType: !142, size: 8)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !412, file: !129, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !405, file: !129, line: 388, baseType: !115, size: 32, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !405, file: !129, line: 396, baseType: !148, size: 32, offset: 160)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !405, file: !129, line: 403, baseType: !419, size: 32, offset: 192)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 32)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_device", file: !31, line: 121, size: 832, elements: !421)
!421 = !{!422, !424, !525, !526, !562, !566, !567, !568, !569}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !420, file: !31, line: 124, baseType: !423, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !420, file: !31, line: 126, baseType: !425, size: 160, offset: 32)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !160, line: 2720, size: 160, elements: !426)
!426 = !{!427, !446, !523, !524}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !425, file: !160, line: 2722, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !164, line: 233, baseType: !429)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 231, size: 64, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !429, file: !164, line: 232, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !169, line: 48, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !169, line: 37, size: 64, elements: !434)
!434 = !{!435, !441}
!435 = !DIDerivedType(tag: DW_TAG_member, scope: !433, file: !169, line: 38, baseType: !436, size: 32)
!436 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !433, file: !169, line: 38, size: 32, elements: !437)
!437 = !{!438, !440}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !436, file: !169, line: 39, baseType: !439, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !436, file: !169, line: 40, baseType: !439, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, scope: !433, file: !169, line: 42, baseType: !442, size: 32, offset: 32)
!442 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !433, file: !169, line: 42, size: 32, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !442, file: !169, line: 43, baseType: !439, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !442, file: !169, line: 44, baseType: !439, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !425, file: !160, line: 2724, baseType: !447, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !186, line: 245, size: 896, elements: !449)
!449 = !{!450, !490, !502, !503, !504, !505, !518}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !448, file: !186, line: 247, baseType: !451, size: 384)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !186, line: 57, size: 384, elements: !452)
!452 = !{!453, !464, !466, !467, !468, !477, !478, !479}
!453 = !DIDerivedType(tag: DW_TAG_member, scope: !451, file: !186, line: 60, baseType: !454, size: 64)
!454 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !451, file: !186, line: 60, size: 64, elements: !455)
!455 = !{!456, !458}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !454, file: !186, line: 61, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !169, line: 49, baseType: !433)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !454, file: !186, line: 62, baseType: !459, size: 64)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !198, line: 49, size: 64, elements: !460)
!460 = !{!461}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !459, file: !198, line: 50, baseType: !462, size: 64)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 64, elements: !203)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !451, file: !186, line: 68, baseType: !465, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !451, file: !186, line: 71, baseType: !142, size: 8, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !451, file: !186, line: 74, baseType: !142, size: 8, offset: 104)
!468 = !DIDerivedType(tag: DW_TAG_member, scope: !451, file: !186, line: 90, baseType: !469, size: 16, offset: 112)
!469 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !451, file: !186, line: 90, size: 16, elements: !470)
!470 = !{!471, !476}
!471 = !DIDerivedType(tag: DW_TAG_member, scope: !469, file: !186, line: 91, baseType: !472, size: 16)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !469, file: !186, line: 91, size: 16, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !472, file: !186, line: 96, baseType: !216, size: 8)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !472, file: !186, line: 97, baseType: !142, size: 8, offset: 8)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !469, file: !186, line: 100, baseType: !220, size: 16)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !451, file: !186, line: 107, baseType: !223, size: 32, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !451, file: !186, line: 127, baseType: !115, size: 32, offset: 160)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !451, file: !186, line: 131, baseType: !480, size: 192, offset: 192)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !164, line: 244, size: 192, elements: !481)
!481 = !{!482, !483, !489}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !480, file: !164, line: 245, baseType: !457, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !480, file: !164, line: 246, baseType: !484, size: 32, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !164, line: 242, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 32)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !488}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !480, file: !164, line: 249, baseType: !236, size: 64, offset: 128)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !448, file: !186, line: 250, baseType: !491, size: 288, offset: 384)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !240, line: 25, size: 288, elements: !492)
!492 = !{!493, !494, !495, !496, !497, !498, !499, !500, !501}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !491, file: !240, line: 26, baseType: !223, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !491, file: !240, line: 27, baseType: !223, size: 32, offset: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !491, file: !240, line: 28, baseType: !223, size: 32, offset: 64)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !491, file: !240, line: 29, baseType: !223, size: 32, offset: 96)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !491, file: !240, line: 30, baseType: !223, size: 32, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !491, file: !240, line: 31, baseType: !223, size: 32, offset: 160)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !491, file: !240, line: 32, baseType: !223, size: 32, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !491, file: !240, line: 33, baseType: !223, size: 32, offset: 224)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !491, file: !240, line: 34, baseType: !223, size: 32, offset: 256)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !448, file: !186, line: 253, baseType: !115, size: 32, offset: 672)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !448, file: !186, line: 256, baseType: !428, size: 64, offset: 704)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !448, file: !186, line: 294, baseType: !116, size: 32, offset: 768)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !448, file: !186, line: 325, baseType: !506, size: 32, offset: 800)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !160, line: 5073, size: 160, elements: !508)
!508 = !{!509, !515, !516}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !507, file: !160, line: 5074, baseType: !510, size: 96)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !260, line: 56, size: 96, elements: !511)
!511 = !{!512, !513, !514}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !510, file: !260, line: 57, baseType: !263, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !510, file: !260, line: 58, baseType: !115, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !510, file: !260, line: 59, baseType: !267, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !507, file: !160, line: 5075, baseType: !428, size: 64, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !507, file: !160, line: 5076, baseType: !517, offset: 160)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !272, line: 43, elements: !273)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !448, file: !186, line: 343, baseType: !519, size: 64, offset: 832)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !240, line: 60, size: 64, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !519, file: !240, line: 63, baseType: !223, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !519, file: !240, line: 66, baseType: !223, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !425, file: !160, line: 2727, baseType: !223, size: 32, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !425, file: !160, line: 2730, baseType: !116, size: 32, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !420, file: !31, line: 128, baseType: !223, size: 32, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !420, file: !31, line: 130, baseType: !527, size: 384, offset: 256)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_delayable", file: !160, line: 3691, size: 384, elements: !528)
!528 = !{!529, !560, !561}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !527, file: !160, line: 3693, baseType: !530, size: 128)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work", file: !160, line: 3663, size: 128, elements: !531)
!531 = !{!532, !538, !544, !559}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !530, file: !160, line: 3669, baseType: !533, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !290, line: 33, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !290, line: 29, size: 32, elements: !535)
!535 = !{!536}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !534, file: !290, line: 30, baseType: !537, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !530, file: !160, line: 3672, baseType: !539, size: 32, offset: 32)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_work_handler_t", file: !160, line: 3071, baseType: !540)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !543}
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !530, file: !160, line: 3675, baseType: !545, size: 32, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 32)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_q", file: !160, line: 3810, size: 1152, elements: !547)
!547 = !{!548, !549, !556, !557, !558}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !546, file: !160, line: 3812, baseType: !448, size: 896)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !546, file: !160, line: 3819, baseType: !550, size: 64, offset: 896)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !290, line: 40, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !290, line: 35, size: 64, elements: !552)
!552 = !{!553, !555}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !551, file: !290, line: 36, baseType: !554, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !551, file: !290, line: 37, baseType: !554, size: 32, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "notifyq", scope: !546, file: !160, line: 3822, baseType: !428, size: 64, offset: 960)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "drainq", scope: !546, file: !160, line: 3825, baseType: !428, size: 64, offset: 1024)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !546, file: !160, line: 3828, baseType: !223, size: 32, offset: 1088)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !530, file: !160, line: 3683, baseType: !223, size: 32, offset: 96)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !527, file: !160, line: 3696, baseType: !480, size: 192, offset: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !527, file: !160, line: 3699, baseType: !545, size: 32, offset: 320)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "condvar", scope: !420, file: !31, line: 132, baseType: !563, size: 64, offset: 640)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !160, line: 2828, size: 64, elements: !564)
!564 = !{!565}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !563, file: !160, line: 2829, baseType: !428, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !420, file: !31, line: 136, baseType: !423, size: 32, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !420, file: !31, line: 139, baseType: !325, size: 32, offset: 736)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !420, file: !31, line: 141, baseType: !30, size: 32, offset: 768)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "action_cb", scope: !420, file: !31, line: 143, baseType: !570, size: 32, offset: 800)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_device_action_cb_t", file: !31, line: 104, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!572 = !DISubroutineType(types: !573)
!573 = !{!116, !423, !38}
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "__init___device_dummy_parent", scope: !395, file: !401, line: 54, type: !576, isLocal: true, isDefinition: true, align: 32)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !348, line: 51, size: 64, elements: !578)
!578 = !{!579, !583}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !577, file: !348, line: 60, baseType: !580, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DISubroutineType(types: !582)
!582 = !{!116, !423}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !577, file: !348, line: 65, baseType: !423, size: 32, offset: 32)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "__pm_slot_dummy_parent", scope: !395, file: !401, line: 52, type: !423, isLocal: true, isDefinition: true, align: 32)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "__devstate_dummy_parent", scope: !395, file: !401, line: 54, type: !412, isLocal: true, isDefinition: true, align: 8)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "store_value", scope: !395, file: !401, line: 12, type: !223, isLocal: true, isDefinition: true)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "__pm_device_dummy_parent", scope: !395, file: !401, line: 52, type: !420, isLocal: true, isDefinition: true)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dummy_parent_api", file: !119, line: 17, size: 32, elements: !594)
!594 = !{!595}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "transfer", scope: !593, file: !119, line: 18, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_transfer_t", file: !119, line: 14, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DISubroutineType(types: !599)
!599 = !{!116, !423, !223, !334}
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "_char_out", scope: !602, file: !606, line: 54, type: !607, isLocal: false, isDefinition: true)
!602 = distinct !DICompileUnit(language: DW_LANG_C99, file: !603, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !604, retainedTypes: !397, globals: !605, splitDebugInlining: false, nameTableKind: None)
!603 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/pm/device_pm")
!604 = !{!44}
!605 = !{!600}
!606 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = !DISubroutineType(types: !609)
!609 = !{!116, !116}
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !612, file: !1343, line: 202, type: !1344, isLocal: true, isDefinition: true, align: 32)
!612 = distinct !DICompileUnit(language: DW_LANG_C99, file: !613, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !604, retainedTypes: !614, globals: !1342, splitDebugInlining: false, nameTableKind: None)
!613 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/pm/device_pm")
!614 = !{!115, !116, !615, !735, !334, !1074, !1141}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !617, line: 335, baseType: !618)
!617 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !617, line: 320, size: 288, elements: !619)
!619 = !{!620, !631, !637, !651, !662, !673, !675, !686, !687, !698, !699, !714, !715, !725}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !618, file: !617, line: 321, baseType: !621, size: 16)
!621 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !617, line: 50, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !617, line: 43, size: 16, elements: !624)
!624 = !{!625, !630}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !623, file: !617, line: 48, baseType: !626, size: 16)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !623, file: !617, line: 44, size: 16, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !626, file: !617, line: 45, baseType: !220, size: 7, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !626, file: !617, line: 47, baseType: !220, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !623, file: !617, line: 49, baseType: !220, size: 16)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !618, file: !617, line: 322, baseType: !632, size: 16, offset: 16)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 16, elements: !203)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !634, line: 52, baseType: !635)
!634 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!635 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !142)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !618, file: !617, line: 323, baseType: !638, size: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !617, line: 107, baseType: !640)
!640 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !617, line: 94, size: 32, elements: !641)
!641 = !{!642, !650}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !640, file: !617, line: 105, baseType: !643, size: 32)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !640, file: !617, line: 95, size: 32, elements: !644)
!644 = !{!645, !646, !647, !648, !649}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !643, file: !617, line: 97, baseType: !223, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !643, file: !617, line: 99, baseType: !223, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !643, file: !617, line: 100, baseType: !223, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !643, file: !617, line: 102, baseType: !223, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !643, file: !617, line: 103, baseType: !223, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !640, file: !617, line: 106, baseType: !223, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !618, file: !617, line: 324, baseType: !652, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !617, line: 155, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !617, line: 148, size: 32, elements: !655)
!655 = !{!656, !661}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !654, file: !617, line: 153, baseType: !657, size: 32)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !654, file: !617, line: 149, size: 32, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !657, file: !617, line: 150, baseType: !223, size: 16, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !657, file: !617, line: 151, baseType: !223, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !654, file: !617, line: 154, baseType: !223, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !618, file: !617, line: 325, baseType: !663, size: 8, offset: 96)
!663 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !617, line: 194, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !617, line: 187, size: 8, elements: !666)
!666 = !{!667, !672}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !665, file: !617, line: 192, baseType: !668, size: 8)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !665, file: !617, line: 188, size: 8, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !668, file: !617, line: 189, baseType: !142, size: 1, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !668, file: !617, line: 190, baseType: !142, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !665, file: !617, line: 193, baseType: !142, size: 8)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !618, file: !617, line: 326, baseType: !674, size: 24, offset: 104)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 24, elements: !340)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !618, file: !617, line: 327, baseType: !676, size: 8, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !617, line: 215, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !617, line: 208, size: 8, elements: !679)
!679 = !{!680, !685}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !678, file: !617, line: 213, baseType: !681, size: 8)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !678, file: !617, line: 209, size: 8, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !681, file: !617, line: 210, baseType: !142, size: 1, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !681, file: !617, line: 211, baseType: !142, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !678, file: !617, line: 214, baseType: !142, size: 8)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !618, file: !617, line: 328, baseType: !674, size: 24, offset: 136)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !618, file: !617, line: 329, baseType: !688, size: 8, offset: 160)
!688 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !617, line: 236, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !617, line: 229, size: 8, elements: !691)
!691 = !{!692, !697}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !690, file: !617, line: 234, baseType: !693, size: 8)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !690, file: !617, line: 230, size: 8, elements: !694)
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !693, file: !617, line: 231, baseType: !635, size: 1, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !693, file: !617, line: 232, baseType: !635, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !690, file: !617, line: 235, baseType: !142, size: 8)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !618, file: !617, line: 330, baseType: !674, size: 24, offset: 168)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !618, file: !617, line: 331, baseType: !700, size: 16, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !701)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !617, line: 262, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !617, line: 250, size: 16, elements: !703)
!703 = !{!704, !713}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !702, file: !617, line: 260, baseType: !705, size: 16)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !702, file: !617, line: 251, size: 16, elements: !706)
!706 = !{!707, !708, !709, !710, !711, !712}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !705, file: !617, line: 252, baseType: !220, size: 1, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !705, file: !617, line: 253, baseType: !220, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !705, file: !617, line: 254, baseType: !220, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !705, file: !617, line: 255, baseType: !220, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !705, file: !617, line: 256, baseType: !220, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !705, file: !617, line: 258, baseType: !220, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !702, file: !617, line: 261, baseType: !220, size: 16)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !618, file: !617, line: 332, baseType: !632, size: 16, offset: 208)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !618, file: !617, line: 333, baseType: !716, size: 32, offset: 224)
!716 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !717)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !617, line: 290, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !617, line: 284, size: 32, elements: !719)
!719 = !{!720, !724}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !718, file: !617, line: 288, baseType: !721, size: 32)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !718, file: !617, line: 285, size: 32, elements: !722)
!722 = !{!723}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !721, file: !617, line: 286, baseType: !223, size: 22, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !718, file: !617, line: 289, baseType: !223, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !618, file: !617, line: 334, baseType: !726, size: 16, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !617, line: 308, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !617, line: 303, size: 16, elements: !729)
!729 = !{!730, !734}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !728, file: !617, line: 306, baseType: !731, size: 16)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !728, file: !617, line: 304, size: 16, elements: !732)
!732 = !{!733}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !731, file: !617, line: 305, baseType: !220, size: 16, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !728, file: !617, line: 307, baseType: !220, size: 16)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !737, line: 928, baseType: !738)
!737 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !737, line: 899, size: 672, elements: !739)
!739 = !{!740, !764, !788, !814, !839, !855, !856, !874, !875, !892, !903, !904, !919, !939, !940, !952, !964, !974, !975, !992, !996, !1007, !1008, !1020, !1032, !1033, !1044, !1060}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !738, file: !737, line: 900, baseType: !741, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !737, line: 64, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !737, line: 43, size: 32, elements: !744)
!744 = !{!745, !763}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !743, file: !737, line: 62, baseType: !746, size: 32)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !743, file: !737, line: 44, size: 32, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !746, file: !737, line: 45, baseType: !223, size: 1, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !746, file: !737, line: 46, baseType: !223, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !746, file: !737, line: 47, baseType: !223, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !746, file: !737, line: 48, baseType: !223, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !746, file: !737, line: 49, baseType: !223, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !746, file: !737, line: 50, baseType: !223, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !746, file: !737, line: 51, baseType: !223, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !746, file: !737, line: 52, baseType: !223, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !746, file: !737, line: 53, baseType: !223, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !746, file: !737, line: 54, baseType: !223, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !746, file: !737, line: 55, baseType: !223, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !746, file: !737, line: 56, baseType: !223, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !746, file: !737, line: 58, baseType: !223, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !746, file: !737, line: 59, baseType: !223, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !746, file: !737, line: 60, baseType: !223, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !743, file: !737, line: 63, baseType: !223, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !738, file: !737, line: 901, baseType: !765, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !766)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !737, line: 125, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !737, line: 104, size: 32, elements: !768)
!768 = !{!769, !787}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !767, file: !737, line: 123, baseType: !770, size: 32)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !767, file: !737, line: 105, size: 32, elements: !771)
!771 = !{!772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !770, file: !737, line: 106, baseType: !223, size: 1, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !770, file: !737, line: 107, baseType: !223, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !770, file: !737, line: 108, baseType: !223, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !770, file: !737, line: 109, baseType: !223, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !770, file: !737, line: 110, baseType: !223, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !770, file: !737, line: 111, baseType: !223, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !770, file: !737, line: 112, baseType: !223, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !770, file: !737, line: 113, baseType: !223, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !770, file: !737, line: 114, baseType: !223, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !770, file: !737, line: 115, baseType: !223, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !770, file: !737, line: 116, baseType: !223, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !770, file: !737, line: 117, baseType: !223, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !770, file: !737, line: 119, baseType: !223, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !770, file: !737, line: 120, baseType: !223, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !770, file: !737, line: 121, baseType: !223, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !767, file: !737, line: 124, baseType: !223, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !738, file: !737, line: 902, baseType: !789, size: 32, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !737, line: 186, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !737, line: 165, size: 32, elements: !792)
!792 = !{!793, !813}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !791, file: !737, line: 184, baseType: !794, size: 32)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !791, file: !737, line: 166, size: 32, elements: !795)
!795 = !{!796, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !794, file: !737, line: 167, baseType: !797, size: 1, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !223)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !794, file: !737, line: 168, baseType: !797, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !794, file: !737, line: 169, baseType: !797, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !794, file: !737, line: 170, baseType: !797, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !794, file: !737, line: 171, baseType: !797, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !794, file: !737, line: 172, baseType: !797, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !794, file: !737, line: 173, baseType: !797, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !794, file: !737, line: 174, baseType: !797, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !794, file: !737, line: 175, baseType: !797, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !794, file: !737, line: 176, baseType: !797, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !794, file: !737, line: 177, baseType: !797, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !794, file: !737, line: 178, baseType: !797, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !794, file: !737, line: 180, baseType: !797, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !794, file: !737, line: 181, baseType: !797, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !794, file: !737, line: 182, baseType: !797, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !791, file: !737, line: 185, baseType: !223, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !738, file: !737, line: 903, baseType: !815, size: 32, offset: 96)
!815 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !737, line: 247, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !737, line: 226, size: 32, elements: !819)
!819 = !{!820, !838}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !818, file: !737, line: 245, baseType: !821, size: 32)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !818, file: !737, line: 227, size: 32, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !821, file: !737, line: 228, baseType: !223, size: 1, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !821, file: !737, line: 229, baseType: !223, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !821, file: !737, line: 230, baseType: !223, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !821, file: !737, line: 231, baseType: !223, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !821, file: !737, line: 232, baseType: !223, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !821, file: !737, line: 233, baseType: !223, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !821, file: !737, line: 234, baseType: !223, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !821, file: !737, line: 235, baseType: !223, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !821, file: !737, line: 236, baseType: !223, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !821, file: !737, line: 237, baseType: !223, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !821, file: !737, line: 238, baseType: !223, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !821, file: !737, line: 239, baseType: !223, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !821, file: !737, line: 241, baseType: !223, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !821, file: !737, line: 242, baseType: !223, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !821, file: !737, line: 243, baseType: !223, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !818, file: !737, line: 246, baseType: !223, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !738, file: !737, line: 904, baseType: !840, size: 16, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !841)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !737, line: 300, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !737, line: 287, size: 16, elements: !843)
!843 = !{!844, !854}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !842, file: !737, line: 298, baseType: !845, size: 16)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !842, file: !737, line: 288, size: 16, elements: !846)
!846 = !{!847, !848, !849, !850, !851, !852, !853}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !845, file: !737, line: 290, baseType: !220, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !845, file: !737, line: 291, baseType: !220, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !845, file: !737, line: 293, baseType: !220, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !845, file: !737, line: 294, baseType: !220, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !845, file: !737, line: 295, baseType: !220, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !845, file: !737, line: 296, baseType: !220, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !845, file: !737, line: 297, baseType: !220, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !842, file: !737, line: 299, baseType: !220, size: 16)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !738, file: !737, line: 905, baseType: !632, size: 16, offset: 144)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !738, file: !737, line: 906, baseType: !857, size: 16, offset: 160)
!857 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !737, line: 352, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !737, line: 336, size: 16, elements: !860)
!860 = !{!861, !873}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !859, file: !737, line: 350, baseType: !862, size: 16)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !859, file: !737, line: 337, size: 16, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871, !872}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !862, file: !737, line: 339, baseType: !220, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !862, file: !737, line: 340, baseType: !220, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !862, file: !737, line: 341, baseType: !220, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !862, file: !737, line: 342, baseType: !220, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !862, file: !737, line: 343, baseType: !220, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !862, file: !737, line: 344, baseType: !220, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !862, file: !737, line: 345, baseType: !220, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !862, file: !737, line: 346, baseType: !220, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !862, file: !737, line: 348, baseType: !220, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !859, file: !737, line: 351, baseType: !220, size: 16)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !738, file: !737, line: 907, baseType: !632, size: 16, offset: 176)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !738, file: !737, line: 908, baseType: !876, size: 32, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !877)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !737, line: 398, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !737, line: 381, size: 32, elements: !879)
!879 = !{!880, !891}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !878, file: !737, line: 396, baseType: !881, size: 32)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !878, file: !737, line: 382, size: 32, elements: !882)
!882 = !{!883, !884, !885, !886, !887, !888, !889, !890}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !881, file: !737, line: 384, baseType: !223, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !881, file: !737, line: 385, baseType: !223, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !881, file: !737, line: 386, baseType: !223, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !881, file: !737, line: 388, baseType: !223, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !881, file: !737, line: 389, baseType: !223, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !881, file: !737, line: 390, baseType: !223, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !881, file: !737, line: 392, baseType: !223, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !881, file: !737, line: 394, baseType: !223, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !878, file: !737, line: 397, baseType: !223, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !738, file: !737, line: 909, baseType: !893, size: 8, offset: 224)
!893 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !737, line: 433, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !737, line: 426, size: 8, elements: !896)
!896 = !{!897, !902}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !895, file: !737, line: 431, baseType: !898, size: 8)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !895, file: !737, line: 427, size: 8, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !898, file: !737, line: 428, baseType: !142, size: 5, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !898, file: !737, line: 430, baseType: !142, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !895, file: !737, line: 432, baseType: !142, size: 8)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !738, file: !737, line: 910, baseType: !674, size: 24, offset: 232)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !738, file: !737, line: 911, baseType: !905, size: 32, offset: 256)
!905 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !737, line: 462, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !737, line: 448, size: 32, elements: !908)
!908 = !{!909, !918}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !907, file: !737, line: 460, baseType: !910, size: 32)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !907, file: !737, line: 449, size: 32, elements: !911)
!911 = !{!912, !913, !914, !915, !916, !917}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !910, file: !737, line: 451, baseType: !223, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !910, file: !737, line: 453, baseType: !223, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !910, file: !737, line: 454, baseType: !223, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !910, file: !737, line: 455, baseType: !223, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !910, file: !737, line: 457, baseType: !223, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !910, file: !737, line: 459, baseType: !223, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !907, file: !737, line: 461, baseType: !223, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !738, file: !737, line: 912, baseType: !920, size: 16, offset: 288)
!920 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !921)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !737, line: 520, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !737, line: 503, size: 16, elements: !923)
!923 = !{!924, !938}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !922, file: !737, line: 518, baseType: !925, size: 16)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !922, file: !737, line: 504, size: 16, elements: !926)
!926 = !{!927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !925, file: !737, line: 506, baseType: !220, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !925, file: !737, line: 507, baseType: !220, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !925, file: !737, line: 508, baseType: !220, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !925, file: !737, line: 509, baseType: !220, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
