; ModuleID = 'build/arduino_due/compression/lz4/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.z_heap_bucket = type { i32 }
%struct.k_mutex = type { %union.anon, %struct.k_thread*, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/compression/lz4/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/compression/lz4")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/compression/lz4")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 256, baseType: !24)
!23 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stdint.h", directory: "")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/compression/lz4")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !111, file: !177, line: 235, type: !178, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !176, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/compression/lz4")
!113 = !{!102, !103, !114, !126}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !116, line: 46, baseType: !117)
!116 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 41, size: 128, elements: !118)
!118 = !{!119, !122, !123, !125}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !117, file: !116, line: 42, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 172, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !117, file: !116, line: 43, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !117, file: !116, line: 44, baseType: !124, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !117, file: !116, line: 45, baseType: !124, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !128, line: 75, baseType: !129)
!128 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 41, size: 2176, elements: !130)
!130 = !{!131, !132, !133, !134, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !154, !158, !159, !160, !161, !162, !163, !164, !165, !169, !170, !171, !172, !173, !174, !175}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !129, file: !128, line: 42, baseType: !120, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !129, file: !128, line: 43, baseType: !120, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !129, file: !128, line: 44, baseType: !124, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !129, file: !128, line: 45, baseType: !135, size: 32, offset: 96)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 32, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 1)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !129, file: !128, line: 46, baseType: !120, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !129, file: !128, line: 47, baseType: !120, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !129, file: !128, line: 48, baseType: !124, size: 32, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !129, file: !128, line: 49, baseType: !120, size: 32, offset: 224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !129, file: !128, line: 50, baseType: !120, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !129, file: !128, line: 51, baseType: !124, size: 32, offset: 288)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !129, file: !128, line: 52, baseType: !120, size: 32, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !129, file: !128, line: 53, baseType: !135, size: 32, offset: 352)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !129, file: !128, line: 54, baseType: !120, size: 32, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !129, file: !128, line: 55, baseType: !135, size: 32, offset: 416)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !129, file: !128, line: 56, baseType: !120, size: 32, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !129, file: !128, line: 57, baseType: !135, size: 32, offset: 480)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !129, file: !128, line: 58, baseType: !151, size: 96, offset: 512)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 96, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 3)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !129, file: !128, line: 59, baseType: !155, size: 160, offset: 608)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 160, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 5)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !129, file: !128, line: 60, baseType: !120, size: 32, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !129, file: !128, line: 61, baseType: !120, size: 32, offset: 800)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !129, file: !128, line: 62, baseType: !124, size: 32, offset: 832)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !129, file: !128, line: 63, baseType: !124, size: 32, offset: 864)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !129, file: !128, line: 64, baseType: !120, size: 32, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !129, file: !128, line: 65, baseType: !120, size: 32, offset: 928)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !129, file: !128, line: 66, baseType: !120, size: 32, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !129, file: !128, line: 67, baseType: !166, size: 832, offset: 992)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 832, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 26)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !129, file: !128, line: 68, baseType: !120, size: 32, offset: 1824)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !129, file: !128, line: 69, baseType: !124, size: 32, offset: 1856)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !129, file: !128, line: 70, baseType: !155, size: 160, offset: 1888)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !129, file: !128, line: 71, baseType: !120, size: 32, offset: 2048)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !129, file: !128, line: 72, baseType: !120, size: 32, offset: 2080)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !129, file: !128, line: 73, baseType: !124, size: 32, offset: 2112)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !129, file: !128, line: 74, baseType: !120, size: 32, offset: 2144)
!176 = !{!109}
!177 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !181)
!180 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = !{!182, !216}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !179, file: !180, line: 60, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DISubroutineType(types: !185)
!185 = !{!103, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !190)
!189 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!190 = !{!191, !195, !196, !197, !206, !207}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !188, file: !189, line: 380, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !188, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !188, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !188, file: !189, line: 386, baseType: !198, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !200)
!200 = !{!201, !204}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !199, file: !189, line: 359, baseType: !202, size: 8)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 226, baseType: !203)
!203 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !199, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!205 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !188, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !188, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !189, line: 43, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !212, line: 32, baseType: !213)
!212 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/../../../../arm-zephyr-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !214, line: 55, baseType: !215)
!214 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/../../../../arm-zephyr-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !179, file: !180, line: 65, baseType: !186, size: 32, offset: 32)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "static_regions", scope: !219, file: !228, line: 62, type: !369, isLocal: true, isDefinition: true)
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !221, globals: !224, splitDebugInlining: false, nameTableKind: None)
!220 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/compression/lz4")
!221 = !{!222, !103, !121, !102}
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !223, line: 46, baseType: !32)
!223 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!224 = !{!225, !217}
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !227, file: !228, line: 198, type: !357, isLocal: true, isDefinition: true)
!227 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !228, file: !228, line: 175, type: !229, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !219, retainedNodes: !352)
!228 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = !DISubroutineType(types: !230)
!230 = !{null, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !233, line: 245, size: 1024, elements: !234)
!233 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!234 = !{!235, !306, !319, !320, !321, !322, !328, !347}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !232, file: !233, line: 247, baseType: !236, size: 384)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !233, line: 57, size: 384, elements: !237)
!237 = !{!238, !266, !274, !275, !276, !290, !291, !292}
!238 = !DIDerivedType(tag: DW_TAG_member, scope: !236, file: !233, line: 60, baseType: !239, size: 64)
!239 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !236, file: !233, line: 60, size: 64, elements: !240)
!240 = !{!241, !257}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !239, file: !233, line: 61, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !243, line: 49, baseType: !244)
!243 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !243, line: 37, size: 64, elements: !245)
!245 = !{!246, !252}
!246 = !DIDerivedType(tag: DW_TAG_member, scope: !244, file: !243, line: 38, baseType: !247, size: 32)
!247 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !244, file: !243, line: 38, size: 32, elements: !248)
!248 = !{!249, !251}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !247, file: !243, line: 39, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !247, file: !243, line: 40, baseType: !250, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, scope: !244, file: !243, line: 42, baseType: !253, size: 32, offset: 32)
!253 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !244, file: !243, line: 42, size: 32, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !253, file: !243, line: 43, baseType: !250, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !253, file: !243, line: 44, baseType: !250, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !239, file: !233, line: 62, baseType: !258, size: 64)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !259, line: 49, size: 64, elements: !260)
!259 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !258, file: !259, line: 50, baseType: !262, size: 64)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 64, elements: !264)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!264 = !{!265}
!265 = !DISubrange(count: 2)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !236, file: !233, line: 68, baseType: !267, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !269, line: 233, baseType: !270)
!269 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !269, line: 231, size: 64, elements: !271)
!271 = !{!272}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !270, file: !269, line: 232, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !243, line: 48, baseType: !244)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !236, file: !233, line: 71, baseType: !202, size: 8, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !236, file: !233, line: 74, baseType: !202, size: 8, offset: 104)
!276 = !DIDerivedType(tag: DW_TAG_member, scope: !236, file: !233, line: 90, baseType: !277, size: 16, offset: 112)
!277 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !236, file: !233, line: 90, size: 16, elements: !278)
!278 = !{!279, !287}
!279 = !DIDerivedType(tag: DW_TAG_member, scope: !277, file: !233, line: 91, baseType: !280, size: 16)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !277, file: !233, line: 91, size: 16, elements: !281)
!281 = !{!282, !286}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !280, file: !233, line: 96, baseType: !283, size: 8)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !212, line: 20, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !214, line: 41, baseType: !285)
!285 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !280, file: !233, line: 97, baseType: !202, size: 8, offset: 8)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !277, file: !233, line: 100, baseType: !288, size: 16)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 207, baseType: !289)
!289 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !236, file: !233, line: 107, baseType: !121, size: 32, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !236, file: !233, line: 127, baseType: !102, size: 32, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !236, file: !233, line: 131, baseType: !293, size: 192, offset: 192)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !269, line: 244, size: 192, elements: !294)
!294 = !{!295, !296, !302}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !293, file: !269, line: 245, baseType: !242, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !293, file: !269, line: 246, baseType: !297, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !269, line: 242, baseType: !298)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !301}
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !293, file: !269, line: 249, baseType: !303, size: 64, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !212, line: 56, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !214, line: 103, baseType: !305)
!305 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !232, file: !233, line: 250, baseType: !307, size: 288, offset: 384)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !308, line: 25, size: 288, elements: !309)
!308 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!309 = !{!310, !311, !312, !313, !314, !315, !316, !317, !318}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !307, file: !308, line: 26, baseType: !121, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !307, file: !308, line: 27, baseType: !121, size: 32, offset: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !307, file: !308, line: 28, baseType: !121, size: 32, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !307, file: !308, line: 29, baseType: !121, size: 32, offset: 96)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !307, file: !308, line: 30, baseType: !121, size: 32, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !307, file: !308, line: 31, baseType: !121, size: 32, offset: 160)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !307, file: !308, line: 32, baseType: !121, size: 32, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !307, file: !308, line: 33, baseType: !121, size: 32, offset: 224)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !307, file: !308, line: 34, baseType: !121, size: 32, offset: 256)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !232, file: !233, line: 253, baseType: !102, size: 32, offset: 672)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !232, file: !233, line: 256, baseType: !268, size: 64, offset: 704)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !232, file: !233, line: 294, baseType: !103, size: 32, offset: 768)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !232, file: !233, line: 300, baseType: !323, size: 96, offset: 800)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !233, line: 149, size: 96, elements: !324)
!324 = !{!325, !326, !327}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !323, file: !233, line: 153, baseType: !22, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !323, file: !233, line: 162, baseType: !222, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !323, file: !233, line: 168, baseType: !222, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !232, file: !233, line: 325, baseType: !329, size: 32, offset: 896)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !331, line: 5073, size: 160, elements: !332)
!331 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!332 = !{!333, !342, !343}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !330, file: !331, line: 5074, baseType: !334, size: 96)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !335, line: 56, size: 96, elements: !336)
!335 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!336 = !{!337, !340, !341}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !334, file: !335, line: 57, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !335, line: 57, flags: DIFlagFwdDecl)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !334, file: !335, line: 58, baseType: !102, size: 32, offset: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !334, file: !335, line: 59, baseType: !222, size: 32, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !330, file: !331, line: 5075, baseType: !268, size: 64, offset: 96)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !330, file: !331, line: 5076, baseType: !344, offset: 160)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !345, line: 43, elements: !346)
!345 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!346 = !{}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !232, file: !233, line: 343, baseType: !348, size: 64, offset: 928)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !308, line: 60, size: 64, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !348, file: !308, line: 63, baseType: !121, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !348, file: !308, line: 66, baseType: !121, size: 32, offset: 32)
!352 = !{!353, !354, !355, !356}
!353 = !DILocalVariable(name: "thread", arg: 1, scope: !227, file: !228, line: 175, type: !231)
!354 = !DILocalVariable(name: "region_num", scope: !227, file: !228, line: 200, type: !202)
!355 = !DILocalVariable(name: "guard_start", scope: !227, file: !228, line: 265, type: !22)
!356 = !DILocalVariable(name: "guard_size", scope: !227, file: !228, line: 266, type: !222)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 96, elements: !136)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !359, line: 52, size: 96, elements: !360)
!359 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!360 = !{!361, !362, !363}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !358, file: !359, line: 53, baseType: !22, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !358, file: !359, line: 54, baseType: !222, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !358, file: !359, line: 55, baseType: !364, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !365, line: 151, baseType: !366)
!365 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !365, line: 149, size: 32, elements: !367)
!367 = !{!368}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !366, file: !365, line: 150, baseType: !121, size: 32)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 96, elements: !136)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !358)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !373, file: !405, line: 39, type: !202, isLocal: true, isDefinition: true)
!373 = distinct !DICompileUnit(language: DW_LANG_C99, file: !374, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !375, globals: !404, splitDebugInlining: false, nameTableKind: None)
!374 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/compression/lz4")
!375 = !{!376, !102, !103, !392, !202}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !378, line: 1168, baseType: !379)
!378 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 1155, size: 352, elements: !380)
!380 = !{!381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !379, file: !378, line: 1157, baseType: !124, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !379, file: !378, line: 1158, baseType: !120, size: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !379, file: !378, line: 1159, baseType: !120, size: 32, offset: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !379, file: !378, line: 1160, baseType: !120, size: 32, offset: 96)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !379, file: !378, line: 1161, baseType: !120, size: 32, offset: 128)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !379, file: !378, line: 1162, baseType: !120, size: 32, offset: 160)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !379, file: !378, line: 1163, baseType: !120, size: 32, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !379, file: !378, line: 1164, baseType: !120, size: 32, offset: 224)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !379, file: !378, line: 1165, baseType: !120, size: 32, offset: 256)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !379, file: !378, line: 1166, baseType: !120, size: 32, offset: 288)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !379, file: !378, line: 1167, baseType: !120, size: 32, offset: 320)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !395, line: 27, size: 96, elements: !396)
!395 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!396 = !{!397, !398, !399}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !394, file: !395, line: 29, baseType: !121, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !394, file: !395, line: 31, baseType: !192, size: 32, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !394, file: !395, line: 37, baseType: !400, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !365, line: 146, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !365, line: 141, size: 32, elements: !402)
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !401, file: !365, line: 143, baseType: !121, size: 32)
!404 = !{!371}
!405 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "__init_malloc_prepare", scope: !408, file: !530, line: 137, type: !564, isLocal: true, isDefinition: true, align: 32)
!408 = distinct !DICompileUnit(language: DW_LANG_C99, file: !409, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !410, globals: !527, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/newlib/libc-hooks.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/compression/lz4")
!410 = !{!411, !22, !222, !102, !412, !436, !525, !103}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 32)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !331, line: 2909, size: 128, elements: !414)
!414 = !{!415, !434, !435}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !413, file: !331, line: 2910, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !269, line: 233, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !269, line: 231, size: 64, elements: !418)
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !417, file: !269, line: 232, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !243, line: 48, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !243, line: 37, size: 64, elements: !422)
!422 = !{!423, !429}
!423 = !DIDerivedType(tag: DW_TAG_member, scope: !421, file: !243, line: 38, baseType: !424, size: 32)
!424 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !421, file: !243, line: 38, size: 32, elements: !425)
!425 = !{!426, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !424, file: !243, line: 39, baseType: !427, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !424, file: !243, line: 40, baseType: !427, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, scope: !421, file: !243, line: 42, baseType: !430, size: 32, offset: 32)
!430 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !421, file: !243, line: 42, size: 32, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !430, file: !243, line: 43, baseType: !427, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !430, file: !243, line: 44, baseType: !427, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !413, file: !331, line: 2911, baseType: !32, size: 32, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !413, file: !331, line: 2912, baseType: !32, size: 32, offset: 96)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !331, line: 2720, size: 160, elements: !438)
!438 = !{!439, !440, !523, !524}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !437, file: !331, line: 2722, baseType: !416, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !437, file: !331, line: 2724, baseType: !441, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !233, line: 245, size: 1024, elements: !443)
!443 = !{!444, !484, !496, !497, !498, !499, !505, !518}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !442, file: !233, line: 247, baseType: !445, size: 384)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !233, line: 57, size: 384, elements: !446)
!446 = !{!447, !458, !460, !461, !462, !471, !472, !473}
!447 = !DIDerivedType(tag: DW_TAG_member, scope: !445, file: !233, line: 60, baseType: !448, size: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !445, file: !233, line: 60, size: 64, elements: !449)
!449 = !{!450, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !448, file: !233, line: 61, baseType: !451, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !243, line: 49, baseType: !421)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !448, file: !233, line: 62, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !259, line: 49, size: 64, elements: !454)
!454 = !{!455}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !453, file: !259, line: 50, baseType: !456, size: 64)
!456 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 64, elements: !264)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !445, file: !233, line: 68, baseType: !459, size: 32, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !445, file: !233, line: 71, baseType: !202, size: 8, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !445, file: !233, line: 74, baseType: !202, size: 8, offset: 104)
!462 = !DIDerivedType(tag: DW_TAG_member, scope: !445, file: !233, line: 90, baseType: !463, size: 16, offset: 112)
!463 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !445, file: !233, line: 90, size: 16, elements: !464)
!464 = !{!465, !470}
!465 = !DIDerivedType(tag: DW_TAG_member, scope: !463, file: !233, line: 91, baseType: !466, size: 16)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !463, file: !233, line: 91, size: 16, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !466, file: !233, line: 96, baseType: !283, size: 8)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !466, file: !233, line: 97, baseType: !202, size: 8, offset: 8)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !463, file: !233, line: 100, baseType: !288, size: 16)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !445, file: !233, line: 107, baseType: !121, size: 32, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !445, file: !233, line: 127, baseType: !102, size: 32, offset: 160)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !445, file: !233, line: 131, baseType: !474, size: 192, offset: 192)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !269, line: 244, size: 192, elements: !475)
!475 = !{!476, !477, !483}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !474, file: !269, line: 245, baseType: !451, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !474, file: !269, line: 246, baseType: !478, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !269, line: 242, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !482}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !474, file: !269, line: 249, baseType: !303, size: 64, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !442, file: !233, line: 250, baseType: !485, size: 288, offset: 384)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !308, line: 25, size: 288, elements: !486)
!486 = !{!487, !488, !489, !490, !491, !492, !493, !494, !495}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !485, file: !308, line: 26, baseType: !121, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !485, file: !308, line: 27, baseType: !121, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !485, file: !308, line: 28, baseType: !121, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !485, file: !308, line: 29, baseType: !121, size: 32, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !485, file: !308, line: 30, baseType: !121, size: 32, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !485, file: !308, line: 31, baseType: !121, size: 32, offset: 160)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !485, file: !308, line: 32, baseType: !121, size: 32, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !485, file: !308, line: 33, baseType: !121, size: 32, offset: 224)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !485, file: !308, line: 34, baseType: !121, size: 32, offset: 256)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !442, file: !233, line: 253, baseType: !102, size: 32, offset: 672)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !442, file: !233, line: 256, baseType: !416, size: 64, offset: 704)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !442, file: !233, line: 294, baseType: !103, size: 32, offset: 768)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !442, file: !233, line: 300, baseType: !500, size: 96, offset: 800)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !233, line: 149, size: 96, elements: !501)
!501 = !{!502, !503, !504}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !500, file: !233, line: 153, baseType: !22, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !500, file: !233, line: 162, baseType: !222, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !500, file: !233, line: 168, baseType: !222, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !442, file: !233, line: 325, baseType: !506, size: 32, offset: 896)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !331, line: 5073, size: 160, elements: !508)
!508 = !{!509, !515, !516}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !507, file: !331, line: 5074, baseType: !510, size: 96)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !335, line: 56, size: 96, elements: !511)
!511 = !{!512, !513, !514}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !510, file: !335, line: 57, baseType: !338, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !510, file: !335, line: 58, baseType: !102, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !510, file: !335, line: 59, baseType: !222, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !507, file: !331, line: 5075, baseType: !416, size: 64, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !507, file: !331, line: 5076, baseType: !517, offset: 160)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !345, line: 43, elements: !346)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !442, file: !233, line: 343, baseType: !519, size: 64, offset: 928)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !308, line: 60, size: 64, elements: !520)
!520 = !{!521, !522}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !519, file: !308, line: 63, baseType: !121, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !519, file: !308, line: 66, baseType: !121, size: 32, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !437, file: !331, line: 2727, baseType: !121, size: 32, offset: 96)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !437, file: !331, line: 2730, baseType: !103, size: 32, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !526, line: 46, baseType: !303)
!526 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!527 = !{!406, !528, !531, !533, !535, !537, !539, !541, !543, !545, !547, !555, !557, !559}
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "__lock___sinit_recursive_mutex", scope: !408, file: !530, line: 324, type: !437, isLocal: false, isDefinition: true, align: 32)
!530 = !DIFile(filename: "zephyr/lib/libc/newlib/libc-hooks.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "__lock___sfp_recursive_mutex", scope: !408, file: !530, line: 325, type: !437, isLocal: false, isDefinition: true, align: 32)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "__lock___atexit_recursive_mutex", scope: !408, file: !530, line: 326, type: !437, isLocal: false, isDefinition: true, align: 32)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "__lock___malloc_recursive_mutex", scope: !408, file: !530, line: 327, type: !437, isLocal: false, isDefinition: true, align: 32)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "__lock___env_recursive_mutex", scope: !408, file: !530, line: 328, type: !437, isLocal: false, isDefinition: true, align: 32)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "__lock___at_quick_exit_mutex", scope: !408, file: !530, line: 329, type: !413, isLocal: false, isDefinition: true, align: 32)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "__lock___tz_mutex", scope: !408, file: !530, line: 330, type: !413, isLocal: false, isDefinition: true, align: 32)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "__lock___dd_hash_mutex", scope: !408, file: !530, line: 331, type: !413, isLocal: false, isDefinition: true, align: 32)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "__lock___arc4random_mutex", scope: !408, file: !530, line: 332, type: !413, isLocal: false, isDefinition: true, align: 32)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "chk_fail_msg", scope: !549, file: !530, line: 468, type: !552, isLocal: true, isDefinition: true)
!549 = distinct !DISubprogram(name: "__chk_fail", scope: !530, file: !530, line: 466, type: !550, scopeLine: 467, flags: DIFlagPrototyped | DIFlagNoReturn | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !408, retainedNodes: !346)
!550 = !DISubroutineType(types: !551)
!551 = !{null}
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 240, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 30)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "heap_sz", scope: !408, file: !530, line: 140, type: !222, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !408, file: !530, line: 149, type: !106, isLocal: true, isDefinition: true)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "_stdin_hook", scope: !408, file: !530, line: 161, type: !561, isLocal: true, isDefinition: true)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!562 = !DISubroutineType(types: !563)
!563 = !{!203}
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !566)
!566 = !{!567, !574}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !565, file: !180, line: 60, baseType: !568, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!569 = !DISubroutineType(types: !570)
!570 = !{!103, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !573)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !180, line: 48, flags: DIFlagFwdDecl)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !565, file: !180, line: 65, baseType: !571, size: 32, offset: 32)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !577, file: !582, line: 13, type: !599, isLocal: true, isDefinition: true)
!577 = distinct !DICompileUnit(language: DW_LANG_C99, file: !578, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !579, splitDebugInlining: false, nameTableKind: None)
!578 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/compression/lz4")
!579 = !{!580, !575}
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "mpu_config", scope: !577, file: !582, line: 37, type: !583, isLocal: false, isDefinition: true)
!582 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !395, line: 41, size: 64, elements: !585)
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !584, file: !395, line: 43, baseType: !121, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !584, file: !395, line: 45, baseType: !588, size: 32, offset: 32)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !395, line: 27, size: 96, elements: !591)
!591 = !{!592, !593, !594}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !590, file: !395, line: 29, baseType: !121, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !590, file: !395, line: 31, baseType: !192, size: 32, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !590, file: !395, line: 37, baseType: !595, size: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !365, line: 146, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !365, line: 141, size: 32, elements: !597)
!597 = !{!598}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !596, file: !365, line: 143, baseType: !121, size: 32)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 192, elements: !264)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !602, file: !659, line: 603, type: !661, isLocal: true, isDefinition: true, align: 32)
!602 = distinct !DICompileUnit(language: DW_LANG_C99, file: !603, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !604, globals: !656, splitDebugInlining: false, nameTableKind: None)
!603 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/compression/lz4")
!604 = !{!102, !103, !605}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !608, line: 336, size: 160, elements: !609)
!608 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!609 = !{!610, !630, !634, !638, !651}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !607, file: !608, line: 365, baseType: !611, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!612 = !DISubroutineType(types: !613)
!613 = !{!103, !614, !629}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !617)
!617 = !{!618, !619, !620, !621, !627, !628}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !616, file: !189, line: 380, baseType: !192, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !616, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !616, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !616, file: !189, line: 386, baseType: !622, size: 32, offset: 96)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !624)
!624 = !{!625, !626}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !623, file: !189, line: 359, baseType: !202, size: 8)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !623, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !616, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !616, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !607, file: !608, line: 366, baseType: !631, size: 32, offset: 32)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 32)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !614, !203}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !607, file: !608, line: 374, baseType: !635, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!636 = !DISubroutineType(types: !637)
!637 = !{!103, !614}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !607, file: !608, line: 377, baseType: !639, size: 32, offset: 96)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!640 = !DISubroutineType(types: !641)
!641 = !{!103, !614, !642}
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !608, line: 122, size: 64, elements: !645)
!645 = !{!646, !647, !648, !649, !650}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !644, file: !608, line: 123, baseType: !121, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !644, file: !608, line: 124, baseType: !202, size: 8, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !644, file: !608, line: 125, baseType: !202, size: 8, offset: 40)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !644, file: !608, line: 126, baseType: !202, size: 8, offset: 48)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !644, file: !608, line: 127, baseType: !202, size: 8, offset: 56)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !607, file: !608, line: 379, baseType: !652, size: 32, offset: 128)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 32)
!653 = !DISubroutineType(types: !654)
!654 = !{!103, !614, !655}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 32)
!656 = !{!600, !657}
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !602, file: !659, line: 38, type: !660, isLocal: true, isDefinition: true)
!659 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !663)
!663 = !{!664, !665}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !662, file: !180, line: 60, baseType: !635, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !662, file: !180, line: 65, baseType: !614, size: 32, offset: 32)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !668, file: !673, line: 7, type: !674, isLocal: false, isDefinition: true, align: 16)
!668 = distinct !DICompileUnit(language: DW_LANG_C99, file: !669, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !670, splitDebugInlining: false, nameTableKind: None)
!669 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/compression/lz4/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/compression/lz4")
!670 = !{!666, !671}
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !668, file: !673, line: 12, type: !674, isLocal: false, isDefinition: true, align: 16)
!673 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/compression/lz4")
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 48, elements: !152)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "wdt_sam_cfg", scope: !677, file: !738, line: 234, type: !772, isLocal: true, isDefinition: true)
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !678, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !679, globals: !735, splitDebugInlining: false, nameTableKind: None)
!678 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/compression/lz4")
!679 = !{!680, !121}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !683, line: 134, size: 128, elements: !684)
!683 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!684 = !{!685, !705, !710, !730}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !682, file: !683, line: 135, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !683, line: 113, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = !DISubroutineType(types: !689)
!689 = !{!103, !690, !202}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !693)
!693 = !{!694, !695, !696, !697, !703, !704}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !692, file: !189, line: 380, baseType: !192, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !692, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !692, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !692, file: !189, line: 386, baseType: !698, size: 32, offset: 96)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !700)
!700 = !{!701, !702}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !699, file: !189, line: 359, baseType: !202, size: 8)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !699, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !692, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !692, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !682, file: !683, line: 136, baseType: !706, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_disable", file: !683, line: 119, baseType: !707)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 32)
!708 = !DISubroutineType(types: !709)
!709 = !{!103, !690}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "install_timeout", scope: !682, file: !683, line: 137, baseType: !711, size: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_install_timeout", file: !683, line: 125, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!713 = !DISubroutineType(types: !714)
!714 = !{!103, !690, !715}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_timeout_cfg", file: !683, line: 88, size: 128, elements: !718)
!718 = !{!719, !724, !729}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !717, file: !683, line: 90, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_window", file: !683, line: 72, size: 64, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !720, file: !683, line: 74, baseType: !121, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !720, file: !683, line: 76, baseType: !121, size: 32, offset: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !717, file: !683, line: 92, baseType: !725, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_callback_t", file: !683, line: 85, baseType: !726)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!727 = !DISubroutineType(types: !728)
!728 = !{null, !690, !103}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !717, file: !683, line: 104, baseType: !202, size: 8, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "feed", scope: !682, file: !683, line: 138, baseType: !731, size: 32, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_feed", file: !683, line: 132, baseType: !732)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!733 = !DISubroutineType(types: !734)
!734 = !{!103, !690, !103}
!735 = !{!736, !740, !742, !749, !675, !751, !753, !761}
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !677, file: !738, line: 256, type: !739, isLocal: false, isDefinition: true, align: 16)
!738 = !DIFile(filename: "zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 80, elements: !156)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "__device_dts_ord_26", scope: !677, file: !738, line: 256, type: !691, isLocal: false, isDefinition: true, align: 32)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_26", scope: !677, file: !738, line: 256, type: !744, isLocal: true, isDefinition: true, align: 32)
!744 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !745, file: !180, line: 60, baseType: !707, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !745, file: !180, line: 65, baseType: !690, size: 32, offset: 32)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_26", scope: !677, file: !738, line: 256, type: !699, isLocal: true, isDefinition: true, align: 8)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "wdt_sam_api", scope: !677, file: !738, line: 227, type: !681, isLocal: true, isDefinition: true)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "wdt_sam_data", scope: !677, file: !738, line: 45, type: !755, isLocal: true, isDefinition: true)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_data", file: !738, line: 38, size: 96, elements: !756)
!756 = !{!757, !758, !759, !760}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !755, file: !738, line: 39, baseType: !725, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !755, file: !738, line: 40, baseType: !121, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_valid", scope: !755, file: !738, line: 41, baseType: !205, size: 8, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "mode_set", scope: !755, file: !738, line: 42, baseType: !205, size: 8, offset: 72)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "__isr_wdt_sam_isr_irq_0", scope: !763, file: !738, line: 240, type: !764, isLocal: true, isDefinition: true, align: 32)
!763 = distinct !DISubprogram(name: "wdt_sam_irq_config", scope: !738, file: !738, line: 238, type: !550, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !677, retainedNodes: !346)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !765)
!765 = !{!766, !769, !770, !771}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !764, file: !10, line: 55, baseType: !767, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !212, line: 44, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !214, line: 77, baseType: !103)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !764, file: !10, line: 57, baseType: !767, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !764, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !764, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_cfg", file: !738, line: 34, size: 32, elements: !774)
!774 = !{!775}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !773, file: !738, line: 35, baseType: !776, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "Wdt", file: !778, line: 45, baseType: !779)
!778 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/wdt.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !778, line: 41, size: 96, elements: !780)
!780 = !{!781, !782, !783}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_CR", scope: !779, file: !778, line: 42, baseType: !120, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_MR", scope: !779, file: !778, line: 43, baseType: !120, size: 32, offset: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_SR", scope: !779, file: !778, line: 44, baseType: !124, size: 32, offset: 64)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "uart0_sam_config", scope: !786, file: !874, line: 494, type: !921, isLocal: true, isDefinition: true)
!786 = distinct !DICompileUnit(language: DW_LANG_C99, file: !787, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !788, retainedTypes: !821, globals: !871, splitDebugInlining: false, nameTableKind: None)
!787 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/compression/lz4")
!788 = !{!789, !796, !802, !809, !814}
!789 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_rx_stop_reason", file: !608, line: 47, baseType: !32, size: 32, elements: !790)
!790 = !{!791, !792, !793, !794, !795}
!791 = !DIEnumerator(name: "UART_ERROR_OVERRUN", value: 1)
!792 = !DIEnumerator(name: "UART_ERROR_PARITY", value: 2)
!793 = !DIEnumerator(name: "UART_ERROR_FRAMING", value: 4)
!794 = !DIEnumerator(name: "UART_BREAK", value: 8)
!795 = !DIEnumerator(name: "UART_ERROR_COLLISION", value: 16)
!796 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_stop_bits", file: !608, line: 84, baseType: !32, size: 32, elements: !797)
!797 = !{!798, !799, !800, !801}
!798 = !DIEnumerator(name: "UART_CFG_STOP_BITS_0_5", value: 0)
!799 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1", value: 1)
!800 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1_5", value: 2)
!801 = !DIEnumerator(name: "UART_CFG_STOP_BITS_2", value: 3)
!802 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_data_bits", file: !608, line: 92, baseType: !32, size: 32, elements: !803)
!803 = !{!804, !805, !806, !807, !808}
!804 = !DIEnumerator(name: "UART_CFG_DATA_BITS_5", value: 0)
!805 = !DIEnumerator(name: "UART_CFG_DATA_BITS_6", value: 1)
!806 = !DIEnumerator(name: "UART_CFG_DATA_BITS_7", value: 2)
!807 = !DIEnumerator(name: "UART_CFG_DATA_BITS_8", value: 3)
!808 = !DIEnumerator(name: "UART_CFG_DATA_BITS_9", value: 4)
!809 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_flow_control", file: !608, line: 107, baseType: !32, size: 32, elements: !810)
!810 = !{!811, !812, !813}
!811 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_NONE", value: 0)
!812 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RTS_CTS", value: 1)
!813 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_DTR_DSR", value: 2)
!814 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_parity", file: !608, line: 75, baseType: !32, size: 32, elements: !815)
!815 = !{!816, !817, !818, !819, !820}
!816 = !DIEnumerator(name: "UART_CFG_PARITY_NONE", value: 0)
!817 = !DIEnumerator(name: "UART_CFG_PARITY_ODD", value: 1)
!818 = !DIEnumerator(name: "UART_CFG_PARITY_EVEN", value: 2)
!819 = !DIEnumerator(name: "UART_CFG_PARITY_MARK", value: 3)
!820 = !DIEnumerator(name: "UART_CFG_PARITY_SPACE", value: 4)
!821 = !{!822, !102, !203, !121}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !608, line: 336, size: 160, elements: !825)
!825 = !{!826, !845, !849, !853, !866}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !824, file: !608, line: 365, baseType: !827, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 32)
!828 = !DISubroutineType(types: !829)
!829 = !{!103, !830, !629}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !833)
!833 = !{!834, !835, !836, !837, !843, !844}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !832, file: !189, line: 380, baseType: !192, size: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !832, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !832, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !832, file: !189, line: 386, baseType: !838, size: 32, offset: 96)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !839, file: !189, line: 359, baseType: !202, size: 8)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !839, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !832, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !832, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !824, file: !608, line: 366, baseType: !846, size: 32, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !830, !203}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !824, file: !608, line: 374, baseType: !850, size: 32, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = !DISubroutineType(types: !852)
!852 = !{!103, !830}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !824, file: !608, line: 377, baseType: !854, size: 32, offset: 96)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!855 = !DISubroutineType(types: !856)
!856 = !{!103, !830, !857}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !608, line: 122, size: 64, elements: !860)
!860 = !{!861, !862, !863, !864, !865}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !859, file: !608, line: 123, baseType: !121, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !859, file: !608, line: 124, baseType: !202, size: 8, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !859, file: !608, line: 125, baseType: !202, size: 8, offset: 40)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !859, file: !608, line: 126, baseType: !202, size: 8, offset: 48)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !859, file: !608, line: 127, baseType: !202, size: 8, offset: 56)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !824, file: !608, line: 379, baseType: !867, size: 32, offset: 128)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!868 = !DISubroutineType(types: !869)
!869 = !{!103, !830, !870}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 32)
!871 = !{!872, !878, !880, !887, !889, !891, !784, !896, !915, !918}
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !786, file: !874, line: 494, type: !875, isLocal: false, isDefinition: true, align: 16)
!874 = !DIFile(filename: "zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 96, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 6)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "__device_dts_ord_21", scope: !786, file: !874, line: 494, type: !831, isLocal: false, isDefinition: true, align: 32)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_21", scope: !786, file: !874, line: 494, type: !882, isLocal: true, isDefinition: true, align: 32)
!882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !884)
!884 = !{!885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !883, file: !180, line: 60, baseType: !850, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !883, file: !180, line: 65, baseType: !830, size: 32, offset: 32)
!887 = !DIGlobalVariableExpression(var: !888, expr: !DIExpression())
!888 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_21", scope: !786, file: !874, line: 494, type: !839, isLocal: true, isDefinition: true, align: 8)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "uart_sam_driver_api", scope: !786, file: !874, line: 419, type: !823, isLocal: true, isDefinition: true)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(name: "uart0_sam_data", scope: !786, file: !874, line: 494, type: !893, isLocal: true, isDefinition: true)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_sam_dev_data", file: !874, line: 38, size: 32, elements: !894)
!894 = !{!895}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "baud_rate", scope: !893, file: !874, line: 39, baseType: !121, size: 32)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "__pinctrl_dev_config__device_dts_ord_21", scope: !786, file: !874, line: 494, type: !898, isLocal: true, isDefinition: true)
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_dev_config", file: !900, line: 60, size: 64, elements: !901)
!900 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!901 = !{!902, !914}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !899, file: !900, line: 69, baseType: !903, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_state", file: !900, line: 50, size: 64, elements: !906)
!906 = !{!907, !912, !913}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "pins", scope: !905, file: !900, line: 52, baseType: !908, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "pinctrl_soc_pin_t", file: !911, line: 32, baseType: !121)
!911 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl/pinctrl_soc_sam_common.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!912 = !DIDerivedType(tag: DW_TAG_member, name: "pin_cnt", scope: !905, file: !900, line: 54, baseType: !202, size: 8, offset: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !905, file: !900, line: 56, baseType: !202, size: 8, offset: 40)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "state_cnt", scope: !899, file: !900, line: 71, baseType: !202, size: 8, offset: 32)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "__pinctrl_states__device_dts_ord_21", scope: !786, file: !874, line: 494, type: !917, isLocal: true, isDefinition: true)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 64, elements: !136)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(name: "__pinctrl_state_pins_0__device_dts_ord_21", scope: !786, file: !874, line: 494, type: !920, isLocal: true, isDefinition: true)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 64, elements: !264)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_sam_dev_cfg", file: !874, line: 27, size: 96, elements: !923)
!923 = !{!924, !953, !954}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !922, file: !874, line: 28, baseType: !925, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uart", file: !927, line: 62, baseType: !928)
!927 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !927, line: 41, size: 2368, elements: !929)
!929 = !{!930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "UART_CR", scope: !928, file: !927, line: 42, baseType: !120, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "UART_MR", scope: !928, file: !927, line: 43, baseType: !120, size: 32, offset: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IER", scope: !928, file: !927, line: 44, baseType: !120, size: 32, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IDR", scope: !928, file: !927, line: 45, baseType: !120, size: 32, offset: 96)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IMR", scope: !928, file: !927, line: 46, baseType: !124, size: 32, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "UART_SR", scope: !928, file: !927, line: 47, baseType: !124, size: 32, offset: 160)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RHR", scope: !928, file: !927, line: 48, baseType: !124, size: 32, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "UART_THR", scope: !928, file: !927, line: 49, baseType: !120, size: 32, offset: 224)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "UART_BRGR", scope: !928, file: !927, line: 50, baseType: !120, size: 32, offset: 256)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !928, file: !927, line: 51, baseType: !940, size: 1760, offset: 288)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 1760, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 55)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RPR", scope: !928, file: !927, line: 52, baseType: !120, size: 32, offset: 2048)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RCR", scope: !928, file: !927, line: 53, baseType: !120, size: 32, offset: 2080)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TPR", scope: !928, file: !927, line: 54, baseType: !120, size: 32, offset: 2112)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TCR", scope: !928, file: !927, line: 55, baseType: !120, size: 32, offset: 2144)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RNPR", scope: !928, file: !927, line: 56, baseType: !120, size: 32, offset: 2176)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RNCR", scope: !928, file: !927, line: 57, baseType: !120, size: 32, offset: 2208)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TNPR", scope: !928, file: !927, line: 58, baseType: !120, size: 32, offset: 2240)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TNCR", scope: !928, file: !927, line: 59, baseType: !120, size: 32, offset: 2272)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "UART_PTCR", scope: !928, file: !927, line: 60, baseType: !120, size: 32, offset: 2304)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "UART_PTSR", scope: !928, file: !927, line: 61, baseType: !124, size: 32, offset: 2336)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "periph_id", scope: !922, file: !874, line: 29, baseType: !121, size: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "pcfg", scope: !922, file: !874, line: 30, baseType: !955, size: 32, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(name: "overflow_cyc", scope: !958, file: !1092, line: 65, type: !120, isLocal: true, isDefinition: true)
!958 = distinct !DICompileUnit(language: DW_LANG_C99, file: !959, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !960, retainedTypes: !1014, globals: !1089, splitDebugInlining: false, nameTableKind: None)
!959 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/timer/cortex_m_systick.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/compression/lz4")
!960 = !{!961}
!961 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !962, line: 57, baseType: !103, size: 32, elements: !963)
!962 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/sam3x8e.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!963 = !{!964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013}
!964 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!965 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!966 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!967 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!968 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!969 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!970 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!971 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!972 = !DIEnumerator(name: "SUPC_IRQn", value: 0)
!973 = !DIEnumerator(name: "RSTC_IRQn", value: 1)
!974 = !DIEnumerator(name: "RTC_IRQn", value: 2)
!975 = !DIEnumerator(name: "RTT_IRQn", value: 3)
!976 = !DIEnumerator(name: "WDT_IRQn", value: 4)
!977 = !DIEnumerator(name: "PMC_IRQn", value: 5)
!978 = !DIEnumerator(name: "EFC0_IRQn", value: 6)
!979 = !DIEnumerator(name: "EFC1_IRQn", value: 7)
!980 = !DIEnumerator(name: "UART_IRQn", value: 8)
!981 = !DIEnumerator(name: "SMC_IRQn", value: 9)
!982 = !DIEnumerator(name: "PIOA_IRQn", value: 11)
!983 = !DIEnumerator(name: "PIOB_IRQn", value: 12)
!984 = !DIEnumerator(name: "PIOC_IRQn", value: 13)
!985 = !DIEnumerator(name: "PIOD_IRQn", value: 14)
!986 = !DIEnumerator(name: "USART0_IRQn", value: 17)
!987 = !DIEnumerator(name: "USART1_IRQn", value: 18)
!988 = !DIEnumerator(name: "USART2_IRQn", value: 19)
!989 = !DIEnumerator(name: "USART3_IRQn", value: 20)
!990 = !DIEnumerator(name: "HSMCI_IRQn", value: 21)
!991 = !DIEnumerator(name: "TWI0_IRQn", value: 22)
!992 = !DIEnumerator(name: "TWI1_IRQn", value: 23)
!993 = !DIEnumerator(name: "SPI0_IRQn", value: 24)
!994 = !DIEnumerator(name: "SSC_IRQn", value: 26)
!995 = !DIEnumerator(name: "TC0_IRQn", value: 27)
!996 = !DIEnumerator(name: "TC1_IRQn", value: 28)
!997 = !DIEnumerator(name: "TC2_IRQn", value: 29)
!998 = !DIEnumerator(name: "TC3_IRQn", value: 30)
!999 = !DIEnumerator(name: "TC4_IRQn", value: 31)
!1000 = !DIEnumerator(name: "TC5_IRQn", value: 32)
!1001 = !DIEnumerator(name: "TC6_IRQn", value: 33)
!1002 = !DIEnumerator(name: "TC7_IRQn", value: 34)
!1003 = !DIEnumerator(name: "TC8_IRQn", value: 35)
!1004 = !DIEnumerator(name: "PWM_IRQn", value: 36)
!1005 = !DIEnumerator(name: "ADC_IRQn", value: 37)
!1006 = !DIEnumerator(name: "DACC_IRQn", value: 38)
!1007 = !DIEnumerator(name: "DMAC_IRQn", value: 39)
!1008 = !DIEnumerator(name: "UOTGHS_IRQn", value: 40)
!1009 = !DIEnumerator(name: "TRNG_IRQn", value: 41)
!1010 = !DIEnumerator(name: "EMAC_IRQn", value: 42)
!1011 = !DIEnumerator(name: "CAN0_IRQn", value: 43)
!1012 = !DIEnumerator(name: "CAN1_IRQn", value: 44)
!1013 = !DIEnumerator(name: "PERIPH_COUNT_IRQn", value: 45)
!1014 = !{!525, !1015, !767, !202, !121, !1023, !1056}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !378, line: 712, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 706, size: 128, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !1017, file: !378, line: 708, baseType: !120, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !1017, file: !378, line: 709, baseType: !120, size: 32, offset: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !1017, file: !378, line: 710, baseType: !120, size: 32, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !1017, file: !378, line: 711, baseType: !124, size: 32, offset: 96)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !378, line: 360, baseType: !1025)
