; ModuleID = 'build/96b_argonkey/external_lib/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %union.anon.1, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/external_lib/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/external_lib")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 109, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/external_lib")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 6208, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 97)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 3104, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/external_lib")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !111, file: !129, line: 56, type: !130, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !128, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/external_lib")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !116, line: 379, baseType: !117)
!116 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f412cx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 370, size: 224, elements: !118)
!118 = !{!119, !122, !123, !124, !125, !126, !127}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !117, file: !116, line: 372, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !117, file: !116, line: 373, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !117, file: !116, line: 374, baseType: !120, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !117, file: !116, line: 375, baseType: !120, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !117, file: !116, line: 376, baseType: !120, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !117, file: !116, line: 377, baseType: !120, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !117, file: !116, line: 378, baseType: !120, size: 32, offset: 192)
!128 = !{!109}
!129 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !165}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !131, file: !132, line: 60, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DISubroutineType(types: !137)
!137 = !{!103, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !{!143, !147, !148, !149, !158, !159}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !141, line: 380, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !140, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !140, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !140, file: !141, line: 386, baseType: !150, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !152)
!152 = !{!153, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !151, file: !141, line: 359, baseType: !154, size: 8)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !155)
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !151, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!157 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !140, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !141, line: 43, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !164)
!164 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !131, file: !132, line: 65, baseType: !138, size: 32, offset: 32)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !168, file: !171, line: 71, type: !172, isLocal: true, isDefinition: true, align: 32)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !170, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/external_lib")
!170 = !{!166}
!171 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !174)
!174 = !{!175, !194}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !173, file: !132, line: 60, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DISubroutineType(types: !178)
!178 = !{!103, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !182)
!182 = !{!183, !184, !185, !186, !192, !193}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !141, line: 380, baseType: !144, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !181, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !181, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !181, file: !141, line: 386, baseType: !187, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !188, file: !141, line: 359, baseType: !154, size: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !188, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !181, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !173, file: !132, line: 65, baseType: !179, size: 32, offset: 32)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "static_regions", scope: !197, file: !206, line: 62, type: !347, isLocal: true, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !199, globals: !202, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/external_lib")
!199 = !{!200, !103, !121, !102}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !201, line: 214, baseType: !32)
!201 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!202 = !{!203, !195}
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !205, file: !206, line: 198, type: !333, isLocal: true, isDefinition: true)
!205 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !206, file: !206, line: 175, type: !207, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !197, retainedNodes: !328)
!206 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!207 = !DISubroutineType(types: !208)
!208 = !{null, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !211, line: 245, size: 1024, elements: !212)
!211 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !{!213, !282, !295, !296, !297, !298, !304, !323}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !210, file: !211, line: 247, baseType: !214, size: 384)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !211, line: 57, size: 384, elements: !215)
!215 = !{!216, !244, !252, !253, !254, !267, !268, !269}
!216 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 60, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 60, size: 64, elements: !218)
!218 = !{!219, !235}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !217, file: !211, line: 61, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !221, line: 49, baseType: !222)
!221 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !221, line: 37, size: 64, elements: !223)
!223 = !{!224, !230}
!224 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 38, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 38, size: 32, elements: !226)
!226 = !{!227, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !225, file: !221, line: 39, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !221, line: 40, baseType: !228, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 42, baseType: !231, size: 32, offset: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 42, size: 32, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !231, file: !221, line: 43, baseType: !228, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !231, file: !221, line: 44, baseType: !228, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !217, file: !211, line: 62, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !237, line: 49, size: 64, elements: !238)
!237 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !236, file: !237, line: 50, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 64, elements: !242)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!242 = !{!243}
!243 = !DISubrange(count: 2)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !214, file: !211, line: 68, baseType: !245, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !247, line: 233, baseType: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 231, size: 64, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !248, file: !247, line: 232, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !221, line: 48, baseType: !222)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !214, file: !211, line: 71, baseType: !154, size: 8, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !214, file: !211, line: 74, baseType: !154, size: 8, offset: 104)
!254 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 90, baseType: !255, size: 16, offset: 112)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 90, size: 16, elements: !256)
!256 = !{!257, !264}
!257 = !DIDerivedType(tag: DW_TAG_member, scope: !255, file: !211, line: 91, baseType: !258, size: 16)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !255, file: !211, line: 91, size: 16, elements: !259)
!259 = !{!260, !263}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !258, file: !211, line: 96, baseType: !261, size: 8)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !262)
!262 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !258, file: !211, line: 97, baseType: !154, size: 8, offset: 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !255, file: !211, line: 100, baseType: !265, size: 16)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !266)
!266 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !214, file: !211, line: 107, baseType: !121, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !214, file: !211, line: 127, baseType: !102, size: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !214, file: !211, line: 131, baseType: !270, size: 192, offset: 192)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !247, line: 244, size: 192, elements: !271)
!271 = !{!272, !273, !279}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !270, file: !247, line: 245, baseType: !220, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !270, file: !247, line: 246, baseType: !274, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !247, line: 242, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !278}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !270, file: !247, line: 249, baseType: !280, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !281)
!281 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !210, file: !211, line: 250, baseType: !283, size: 288, offset: 384)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !284, line: 25, size: 288, elements: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !283, file: !284, line: 26, baseType: !121, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !283, file: !284, line: 27, baseType: !121, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !283, file: !284, line: 28, baseType: !121, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !283, file: !284, line: 29, baseType: !121, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !283, file: !284, line: 30, baseType: !121, size: 32, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !283, file: !284, line: 31, baseType: !121, size: 32, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !283, file: !284, line: 32, baseType: !121, size: 32, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !283, file: !284, line: 33, baseType: !121, size: 32, offset: 224)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !283, file: !284, line: 34, baseType: !121, size: 32, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !210, file: !211, line: 253, baseType: !102, size: 32, offset: 672)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !210, file: !211, line: 256, baseType: !246, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !210, file: !211, line: 294, baseType: !103, size: 32, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !210, file: !211, line: 300, baseType: !299, size: 96, offset: 800)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !211, line: 149, size: 96, elements: !300)
!300 = !{!301, !302, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !299, file: !211, line: 153, baseType: !22, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !299, file: !211, line: 162, baseType: !200, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !299, file: !211, line: 168, baseType: !200, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !210, file: !211, line: 325, baseType: !305, size: 32, offset: 896)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !307, line: 5073, size: 160, elements: !308)
!307 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = !{!309, !318, !319}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !306, file: !307, line: 5074, baseType: !310, size: 96)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !311, line: 56, size: 96, elements: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = !{!313, !316, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !310, file: !311, line: 57, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !311, line: 57, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !310, file: !311, line: 58, baseType: !102, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !310, file: !311, line: 59, baseType: !200, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !306, file: !307, line: 5075, baseType: !246, size: 64, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !306, file: !307, line: 5076, baseType: !320, offset: 160)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !321, line: 43, elements: !322)
!321 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = !{}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !210, file: !211, line: 343, baseType: !324, size: 64, offset: 928)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !284, line: 60, size: 64, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !324, file: !284, line: 63, baseType: !121, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !324, file: !284, line: 66, baseType: !121, size: 32, offset: 32)
!328 = !{!329, !330, !331, !332}
!329 = !DILocalVariable(name: "thread", arg: 1, scope: !205, file: !206, line: 175, type: !209)
!330 = !DILocalVariable(name: "region_num", scope: !205, file: !206, line: 200, type: !154)
!331 = !DILocalVariable(name: "guard_start", scope: !205, file: !206, line: 265, type: !22)
!332 = !DILocalVariable(name: "guard_size", scope: !205, file: !206, line: 266, type: !200)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 96, elements: !345)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !335, line: 52, size: 96, elements: !336)
!335 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!336 = !{!337, !338, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !334, file: !335, line: 53, baseType: !22, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !334, file: !335, line: 54, baseType: !200, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !334, file: !335, line: 55, baseType: !340, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !341, line: 151, baseType: !342)
!341 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 149, size: 32, elements: !343)
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !342, file: !341, line: 150, baseType: !121, size: 32)
!345 = !{!346}
!346 = !DISubrange(count: 1)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 96, elements: !345)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !351, file: !384, line: 39, type: !154, isLocal: true, isDefinition: true)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !353, globals: !383, splitDebugInlining: false, nameTableKind: None)
!352 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/external_lib")
!353 = !{!354, !102, !103, !371, !154}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !356, line: 1226, baseType: !357)
!356 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !356, line: 1213, size: 352, elements: !358)
!358 = !{!359, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !357, file: !356, line: 1215, baseType: !360, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !357, file: !356, line: 1216, baseType: !120, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !357, file: !356, line: 1217, baseType: !120, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !357, file: !356, line: 1218, baseType: !120, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !357, file: !356, line: 1219, baseType: !120, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !357, file: !356, line: 1220, baseType: !120, size: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !357, file: !356, line: 1221, baseType: !120, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !357, file: !356, line: 1222, baseType: !120, size: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !357, file: !356, line: 1223, baseType: !120, size: 32, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !357, file: !356, line: 1224, baseType: !120, size: 32, offset: 288)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !357, file: !356, line: 1225, baseType: !120, size: 32, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !374, line: 27, size: 96, elements: !375)
!374 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!375 = !{!376, !377, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !373, file: !374, line: 29, baseType: !121, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !373, file: !374, line: 31, baseType: !144, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !373, file: !374, line: 37, baseType: !379, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !341, line: 146, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !341, line: 141, size: 32, elements: !381)
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !380, file: !341, line: 143, baseType: !121, size: 32)
!383 = !{!349}
!384 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !387, file: !394, line: 21, type: !106, isLocal: true, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !389, globals: !393, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/external_lib")
!389 = !{!390, !103, !102}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !392, line: 22, baseType: !103)
!392 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!393 = !{!385}
!394 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !397, file: !402, line: 13, type: !419, isLocal: true, isDefinition: true)
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !399, splitDebugInlining: false, nameTableKind: None)
!398 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/external_lib")
!399 = !{!400, !395}
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "mpu_config", scope: !397, file: !402, line: 37, type: !403, isLocal: false, isDefinition: true)
!402 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !374, line: 41, size: 64, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !404, file: !374, line: 43, baseType: !121, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !404, file: !374, line: 45, baseType: !408, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !374, line: 27, size: 96, elements: !411)
!411 = !{!412, !413, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !410, file: !374, line: 29, baseType: !121, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !410, file: !374, line: 31, baseType: !144, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !410, file: !374, line: 37, baseType: !415, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !341, line: 146, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !341, line: 141, size: 32, elements: !417)
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !416, file: !341, line: 143, baseType: !121, size: 32)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 192, elements: !242)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !422, file: !526, line: 72, type: !610, isLocal: true, isDefinition: true)
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !424, retainedTypes: !512, globals: !523, splitDebugInlining: false, nameTableKind: None)
!423 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/external_lib")
!424 = !{!30, !425}
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 65, baseType: !103, size: 32, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511}
!427 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!428 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!429 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!430 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!431 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!432 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!433 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!434 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!435 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!436 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!437 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!438 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!439 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!440 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!441 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!442 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!443 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!444 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!445 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!446 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!447 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!448 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!449 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!450 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!451 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!452 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!453 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!454 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!455 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!456 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!457 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!458 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!459 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!460 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!461 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!462 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!463 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!464 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!465 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!466 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!467 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!468 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!469 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!470 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!471 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!472 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!473 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!474 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!475 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!476 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!477 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!478 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!479 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!480 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!481 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!482 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!483 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!484 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!485 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!486 = !DIEnumerator(name: "TIM6_IRQn", value: 54)
!487 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!488 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!489 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!490 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!491 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!492 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!493 = !DIEnumerator(name: "DFSDM1_FLT0_IRQn", value: 61)
!494 = !DIEnumerator(name: "DFSDM1_FLT1_IRQn", value: 62)
!495 = !DIEnumerator(name: "CAN2_TX_IRQn", value: 63)
!496 = !DIEnumerator(name: "CAN2_RX0_IRQn", value: 64)
!497 = !DIEnumerator(name: "CAN2_RX1_IRQn", value: 65)
!498 = !DIEnumerator(name: "CAN2_SCE_IRQn", value: 66)
!499 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!500 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!501 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!502 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!503 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!504 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!505 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!506 = !DIEnumerator(name: "RNG_IRQn", value: 80)
!507 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!508 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!509 = !DIEnumerator(name: "SPI5_IRQn", value: 85)
!510 = !DIEnumerator(name: "FMPI2C1_EV_IRQn", value: 95)
!511 = !DIEnumerator(name: "FMPI2C1_ER_IRQn", value: 96)
!512 = !{!200, !103, !102, !513}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !116, line: 364, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 356, size: 192, elements: !516)
!516 = !{!517, !518, !519, !520, !521, !522}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !515, file: !116, line: 358, baseType: !120, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !515, file: !116, line: 359, baseType: !120, size: 32, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !515, file: !116, line: 360, baseType: !120, size: 32, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !515, file: !116, line: 361, baseType: !120, size: 32, offset: 96)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !515, file: !116, line: 362, baseType: !120, size: 32, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !515, file: !116, line: 363, baseType: !120, size: 32, offset: 160)
!523 = !{!524, !530, !546, !557, !574, !420, !576, !590, !592, !594, !596, !598, !600, !602, !604, !606, !608}
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_35", scope: !422, file: !526, line: 424, type: !527, isLocal: false, isDefinition: true, align: 16)
!526 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !528)
!528 = !{!529}
!529 = !DISubrange(count: 4)
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "__device_dts_ord_35", scope: !422, file: !526, line: 424, type: !532, isLocal: false, isDefinition: true, align: 32)
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !534)
!534 = !{!535, !536, !537, !538, !544, !545}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !533, file: !141, line: 380, baseType: !144, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !533, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !533, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !533, file: !141, line: 386, baseType: !539, size: 32, offset: 96)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !540, file: !141, line: 359, baseType: !154, size: 8)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !540, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !533, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !533, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!546 = !DIGlobalVariableExpression(var: !547, expr: !DIExpression())
!547 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_35", scope: !422, file: !526, line: 424, type: !548, isLocal: true, isDefinition: true, align: 32)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !550)
!550 = !{!551, !556}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !549, file: !132, line: 60, baseType: !552, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!553 = !DISubroutineType(types: !554)
!554 = !{!103, !555}
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !549, file: !132, line: 65, baseType: !555, size: 32, offset: 32)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "exti_data", scope: !422, file: !526, line: 423, type: !559, isLocal: true, isDefinition: true)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !526, line: 107, size: 1472, elements: !560)
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !559, file: !526, line: 109, baseType: !562, size: 1472)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 1472, elements: !572)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !526, line: 101, size: 64, elements: !564)
!564 = !{!565, !571}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !563, file: !526, line: 102, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !567, line: 63, baseType: !568)
!567 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !103, !102}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !563, file: !526, line: 103, baseType: !102, size: 32, offset: 32)
!572 = !{!573}
!573 = !DISubrange(count: 23)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_35", scope: !422, file: !526, line: 424, type: !540, isLocal: true, isDefinition: true, align: 8)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !578, file: !526, line: 493, type: !583, isLocal: true, isDefinition: true, align: 32)
!578 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !526, file: !526, line: 460, type: !579, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !422, retainedNodes: !581)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !555}
!581 = !{!582}
!582 = !DILocalVariable(name: "dev", arg: 1, scope: !578, file: !526, line: 460, type: !555)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !584)
!584 = !{!585, !587, !588, !589}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !583, file: !10, line: 55, baseType: !586, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !583, file: !10, line: 57, baseType: !586, size: 32, offset: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !583, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !583, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !578, file: !526, line: 497, type: !583, isLocal: true, isDefinition: true, align: 32)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !578, file: !526, line: 507, type: !583, isLocal: true, isDefinition: true, align: 32)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !578, file: !526, line: 512, type: !583, isLocal: true, isDefinition: true, align: 32)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !578, file: !526, line: 516, type: !583, isLocal: true, isDefinition: true, align: 32)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !578, file: !526, line: 523, type: !583, isLocal: true, isDefinition: true, align: 32)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !578, file: !526, line: 527, type: !583, isLocal: true, isDefinition: true, align: 32)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !578, file: !526, line: 581, type: !583, isLocal: true, isDefinition: true, align: 32)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !578, file: !526, line: 586, type: !583, isLocal: true, isDefinition: true, align: 32)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !578, file: !526, line: 591, type: !583, isLocal: true, isDefinition: true, align: 32)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !578, file: !526, line: 595, type: !583, isLocal: true, isDefinition: true, align: 32)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 736, elements: !572)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !116, line: 154, baseType: !425)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_35", scope: !615, file: !620, line: 22, type: !642, isLocal: false, isDefinition: true, align: 16)
!615 = distinct !DICompileUnit(language: DW_LANG_C99, file: !616, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !617, splitDebugInlining: false, nameTableKind: None)
!616 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/external_lib/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/external_lib")
!617 = !{!618, !613, !624, !626, !628, !630, !632, !634, !636, !638, !640}
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !615, file: !620, line: 17, type: !621, isLocal: false, isDefinition: true, align: 16)
!620 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/external_lib")
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 192, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 12)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_79", scope: !615, file: !620, line: 29, type: !527, isLocal: false, isDefinition: true, align: 16)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_78", scope: !615, file: !620, line: 36, type: !527, isLocal: false, isDefinition: true, align: 16)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_77", scope: !615, file: !620, line: 43, type: !527, isLocal: false, isDefinition: true, align: 16)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_76", scope: !615, file: !620, line: 50, type: !527, isLocal: false, isDefinition: true, align: 16)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_75", scope: !615, file: !620, line: 57, type: !527, isLocal: false, isDefinition: true, align: 16)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_22", scope: !615, file: !620, line: 64, type: !527, isLocal: false, isDefinition: true, align: 16)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_24", scope: !615, file: !620, line: 71, type: !527, isLocal: false, isDefinition: true, align: 16)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !615, file: !620, line: 78, type: !527, isLocal: false, isDefinition: true, align: 16)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_44", scope: !615, file: !620, line: 85, type: !527, isLocal: false, isDefinition: true, align: 16)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 48, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 3)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !647, file: !709, line: 398, type: !742, isLocal: true, isDefinition: true)
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !649, retainedTypes: !662, globals: !706, splitDebugInlining: false, nameTableKind: None)
!648 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/external_lib")
!649 = !{!650, !30, !655}
!650 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !651, line: 197, baseType: !32, size: 32, elements: !652)
!651 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!652 = !{!653, !654}
!653 = !DIEnumerator(name: "SUCCESS", value: 0)
!654 = !DIEnumerator(name: "ERROR", value: 1)
!655 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !656, line: 44, baseType: !32, size: 32, elements: !657)
!656 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!657 = !{!658, !659, !660, !661}
!658 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!659 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!660 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!661 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!662 = !{!102, !103, !121, !663, !699, !705}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 510, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 477, size: 1216, elements: !666)
!666 = !{!667, !668, !669, !670, !671, !672, !673, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !665, file: !116, line: 479, baseType: !120, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !665, file: !116, line: 480, baseType: !120, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !665, file: !116, line: 481, baseType: !120, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !665, file: !116, line: 482, baseType: !120, size: 32, offset: 96)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !665, file: !116, line: 483, baseType: !120, size: 32, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !665, file: !116, line: 484, baseType: !120, size: 32, offset: 160)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !665, file: !116, line: 485, baseType: !674, size: 64, offset: 192)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, elements: !242)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !665, file: !116, line: 486, baseType: !120, size: 32, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !665, file: !116, line: 487, baseType: !120, size: 32, offset: 288)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !665, file: !116, line: 488, baseType: !674, size: 64, offset: 320)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !665, file: !116, line: 489, baseType: !120, size: 32, offset: 384)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !665, file: !116, line: 490, baseType: !120, size: 32, offset: 416)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !665, file: !116, line: 491, baseType: !674, size: 64, offset: 448)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !665, file: !116, line: 492, baseType: !120, size: 32, offset: 512)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !665, file: !116, line: 493, baseType: !120, size: 32, offset: 544)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !665, file: !116, line: 494, baseType: !674, size: 64, offset: 576)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !665, file: !116, line: 495, baseType: !120, size: 32, offset: 640)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !665, file: !116, line: 496, baseType: !120, size: 32, offset: 672)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !665, file: !116, line: 497, baseType: !674, size: 64, offset: 704)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !665, file: !116, line: 498, baseType: !120, size: 32, offset: 768)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !665, file: !116, line: 499, baseType: !120, size: 32, offset: 800)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !665, file: !116, line: 500, baseType: !674, size: 64, offset: 832)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !665, file: !116, line: 501, baseType: !120, size: 32, offset: 896)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !665, file: !116, line: 502, baseType: !120, size: 32, offset: 928)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !665, file: !116, line: 503, baseType: !674, size: 64, offset: 960)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !665, file: !116, line: 504, baseType: !120, size: 32, offset: 1024)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !665, file: !116, line: 505, baseType: !120, size: 32, offset: 1056)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !665, file: !116, line: 506, baseType: !121, size: 32, offset: 1088)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !665, file: !116, line: 507, baseType: !120, size: 32, offset: 1120)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "CKGATENR", scope: !665, file: !116, line: 508, baseType: !120, size: 32, offset: 1152)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR2", scope: !665, file: !116, line: 509, baseType: !120, size: 32, offset: 1184)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !701, line: 343, size: 64, elements: !702)
!701 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!702 = !{!703, !704}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !700, file: !701, line: 344, baseType: !121, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !700, file: !701, line: 345, baseType: !121, size: 32, offset: 32)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!706 = !{!707, !713, !729, !740, !645}
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !647, file: !709, line: 752, type: !710, isLocal: false, isDefinition: true, align: 16)
!709 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 848, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 53)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "__device_dts_ord_8", scope: !647, file: !709, line: 752, type: !715, isLocal: false, isDefinition: true, align: 32)
!715 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !717)
!717 = !{!718, !719, !720, !721, !727, !728}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !716, file: !141, line: 380, baseType: !144, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !716, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !716, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !716, file: !141, line: 386, baseType: !722, size: 32, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 32)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !724)
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !723, file: !141, line: 359, baseType: !154, size: 8)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !723, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !716, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !716, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_8", scope: !647, file: !709, line: 752, type: !731, isLocal: true, isDefinition: true, align: 32)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !733)
!733 = !{!734, !739}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !732, file: !132, line: 60, baseType: !735, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 32)
!736 = !DISubroutineType(types: !737)
!737 = !{!103, !738}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !732, file: !132, line: 65, baseType: !738, size: 32, offset: 32)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_8", scope: !647, file: !709, line: 752, type: !723, isLocal: true, isDefinition: true, align: 8)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !656, line: 100, size: 224, elements: !743)
!743 = !{!744, !750, !751, !760, !765, !770, !776}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !742, file: !656, line: 101, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !656, line: 76, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32)
!747 = !DISubroutineType(types: !748)
!748 = !{!103, !738, !749}
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !656, line: 56, baseType: !102)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !742, file: !656, line: 102, baseType: !745, size: 32, offset: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !742, file: !656, line: 103, baseType: !752, size: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !656, line: 83, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!754 = !DISubroutineType(types: !755)
!755 = !{!103, !738, !749, !756, !102}
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !656, line: 72, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !738, !749, !102}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !742, file: !656, line: 104, baseType: !761, size: 32, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !656, line: 79, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!763 = !DISubroutineType(types: !764)
!764 = !{!103, !738, !749, !705}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !742, file: !656, line: 105, baseType: !766, size: 32, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !656, line: 88, baseType: !767)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 32)
!768 = !DISubroutineType(types: !769)
!769 = !{!655, !738, !749}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !742, file: !656, line: 106, baseType: !771, size: 32, offset: 160)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !656, line: 92, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!773 = !DISubroutineType(types: !774)
!774 = !{!103, !738, !749, !775}
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !656, line: 64, baseType: !102)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !742, file: !656, line: 107, baseType: !777, size: 32, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !656, line: 96, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32)
!779 = !DISubroutineType(types: !780)
!780 = !{!103, !738, !749, !102}
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !783, file: !840, line: 603, type: !842, isLocal: true, isDefinition: true, align: 32)
!783 = distinct !DICompileUnit(language: DW_LANG_C99, file: !784, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !785, globals: !837, splitDebugInlining: false, nameTableKind: None)
!784 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/external_lib")
!785 = !{!102, !103, !786}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !789, line: 336, size: 160, elements: !790)
!789 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!790 = !{!791, !811, !815, !819, !832}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !788, file: !789, line: 365, baseType: !792, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 32)
!793 = !DISubroutineType(types: !794)
!794 = !{!103, !795, !810}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !798)
!798 = !{!799, !800, !801, !802, !808, !809}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !797, file: !141, line: 380, baseType: !144, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !797, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !797, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !797, file: !141, line: 386, baseType: !803, size: 32, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !805)
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !804, file: !141, line: 359, baseType: !154, size: 8)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !804, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !797, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !797, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !788, file: !789, line: 366, baseType: !812, size: 32, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = !DISubroutineType(types: !814)
!814 = !{null, !795, !155}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !788, file: !789, line: 374, baseType: !816, size: 32, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = !DISubroutineType(types: !818)
!818 = !{!103, !795}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !788, file: !789, line: 377, baseType: !820, size: 32, offset: 96)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = !DISubroutineType(types: !822)
!822 = !{!103, !795, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !789, line: 122, size: 64, elements: !826)
!826 = !{!827, !828, !829, !830, !831}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !825, file: !789, line: 123, baseType: !121, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !825, file: !789, line: 124, baseType: !154, size: 8, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !825, file: !789, line: 125, baseType: !154, size: 8, offset: 40)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !825, file: !789, line: 126, baseType: !154, size: 8, offset: 48)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !825, file: !789, line: 127, baseType: !154, size: 8, offset: 56)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !788, file: !789, line: 379, baseType: !833, size: 32, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 32)
!834 = !DISubroutineType(types: !835)
!835 = !{!103, !795, !836}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 32)
!837 = !{!781, !838}
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !783, file: !840, line: 38, type: !841, isLocal: true, isDefinition: true)
!840 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !795)
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !843, file: !132, line: 60, baseType: !816, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !843, file: !132, line: 65, baseType: !795, size: 32, offset: 32)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !849, file: !1021, line: 762, type: !1133, isLocal: true, isDefinition: true)
!849 = distinct !DICompileUnit(language: DW_LANG_C99, file: !850, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !851, retainedTypes: !869, globals: !1018, splitDebugInlining: false, nameTableKind: None)
!850 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/external_lib")
!851 = !{!30, !852, !858, !863, !655}
!852 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !853, line: 506, baseType: !32, size: 32, elements: !854)
!853 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!854 = !{!855, !856, !857}
!855 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!856 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!857 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!858 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !853, line: 512, baseType: !32, size: 32, elements: !859)
!859 = !{!860, !861, !862}
!860 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!861 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!862 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!863 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !567, line: 43, baseType: !32, size: 32, elements: !864)
!864 = !{!865, !866, !867, !868}
!865 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!866 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!867 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!868 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!869 = !{!102, !103, !870, !940, !945, !905, !858, !852, !950, !951, !121, !965, !920, !977, !978, !979}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !853, line: 523, size: 288, elements: !873)
!873 = !{!874, !895, !901, !906, !910, !911, !912, !916, !936}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !872, file: !853, line: 524, baseType: !875, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!876 = !DISubroutineType(types: !877)
!877 = !{!103, !878, !893, !894}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !881)
!881 = !{!882, !883, !884, !885, !891, !892}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !880, file: !141, line: 380, baseType: !144, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !880, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !880, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !880, file: !141, line: 386, baseType: !886, size: 32, offset: 96)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 32)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !888)
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !887, file: !141, line: 359, baseType: !154, size: 8)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !887, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !880, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !880, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !853, line: 237, baseType: !154)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !853, line: 257, baseType: !121)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !872, file: !853, line: 530, baseType: !896, size: 32, offset: 32)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 32)
!897 = !DISubroutineType(types: !898)
!898 = !{!103, !878, !899}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !853, line: 229, baseType: !121)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !872, file: !853, line: 532, baseType: !902, size: 32, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = !DISubroutineType(types: !904)
!904 = !{!103, !878, !905, !900}
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !853, line: 216, baseType: !121)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !872, file: !853, line: 535, baseType: !907, size: 32, offset: 96)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 32)
!908 = !DISubroutineType(types: !909)
!909 = !{!103, !878, !905}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !872, file: !853, line: 537, baseType: !907, size: 32, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !872, file: !853, line: 539, baseType: !907, size: 32, offset: 160)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !872, file: !853, line: 541, baseType: !913, size: 32, offset: 192)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = !DISubroutineType(types: !915)
!915 = !{!103, !878, !893, !852, !858}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !872, file: !853, line: 544, baseType: !917, size: 32, offset: 224)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = !DISubroutineType(types: !919)
!919 = !{!103, !878, !920, !157}
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 32)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !853, line: 478, size: 96, elements: !922)
!922 = !{!923, !930, !935}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !921, file: !853, line: 482, baseType: !924, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !925, line: 33, baseType: !926)
!925 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !925, line: 29, size: 32, elements: !927)
!927 = !{!928}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !926, file: !925, line: 30, baseType: !929, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !921, file: !853, line: 485, baseType: !931, size: 32, offset: 32)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !853, line: 464, baseType: !932)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 32)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !878, !920, !905}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !921, file: !853, line: 493, baseType: !905, size: 32, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !872, file: !853, line: 547, baseType: !937, size: 32, offset: 256)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = !DISubroutineType(types: !939)
!939 = !{!121, !878}
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !853, line: 428, size: 32, elements: !943)
!943 = !{!944}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !942, file: !853, line: 434, baseType: !905, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !853, line: 441, size: 32, elements: !948)
!948 = !{!949}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !947, file: !853, line: 447, baseType: !905, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !116, line: 396, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 385, size: 320, elements: !954)
!954 = !{!955, !956, !957, !958, !959, !960, !961, !962, !963}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !953, file: !116, line: 387, baseType: !120, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !953, file: !116, line: 388, baseType: !120, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !953, file: !116, line: 389, baseType: !120, size: 32, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !953, file: !116, line: 390, baseType: !120, size: 32, offset: 96)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !953, file: !116, line: 391, baseType: !120, size: 32, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !953, file: !116, line: 392, baseType: !120, size: 32, offset: 160)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !953, file: !116, line: 393, baseType: !120, size: 32, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !953, file: !116, line: 394, baseType: !120, size: 32, offset: 224)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !953, file: !116, line: 395, baseType: !964, size: 64, offset: 256)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !242)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !116, line: 411, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 402, size: 320, elements: !968)
!968 = !{!969, !970, !971, !973, !974, !975, !976}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !967, file: !116, line: 404, baseType: !120, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !967, file: !116, line: 405, baseType: !120, size: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !967, file: !116, line: 406, baseType: !972, size: 128, offset: 64)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !528)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !967, file: !116, line: 407, baseType: !121, size: 32, offset: 192)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR2", scope: !967, file: !116, line: 408, baseType: !120, size: 32, offset: 224)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !967, file: !116, line: 409, baseType: !120, size: 32, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !967, file: !116, line: 410, baseType: !120, size: 32, offset: 288)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !656, line: 100, size: 224, elements: !982)
!982 = !{!983, !988, !989, !998, !1003, !1008, !1013}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !981, file: !656, line: 101, baseType: !984, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !656, line: 76, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 32)
!986 = !DISubroutineType(types: !987)
!987 = !{!103, !878, !749}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !981, file: !656, line: 102, baseType: !984, size: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !981, file: !656, line: 103, baseType: !990, size: 32, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !656, line: 83, baseType: !991)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = !DISubroutineType(types: !993)
!993 = !{!103, !878, !749, !994, !102}
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !656, line: 72, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DISubroutineType(types: !997)
!997 = !{null, !878, !749, !102}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !981, file: !656, line: 104, baseType: !999, size: 32, offset: 96)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !656, line: 79, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!103, !878, !749, !705}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !981, file: !656, line: 105, baseType: !1004, size: 32, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !656, line: 88, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 32)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!655, !878, !749}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !981, file: !656, line: 106, baseType: !1009, size: 32, offset: 160)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !656, line: 92, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 32)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!103, !878, !749, !775}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !981, file: !656, line: 107, baseType: !1014, size: 32, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !656, line: 96, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!103, !878, !749, !102}
!1018 = !{!1019, !1025, !1027, !1037, !1039, !1041, !1043, !1048, !1050, !1052, !1057, !1059, !1061, !1063, !1065, !1067, !1069, !1071, !1073, !1075, !1077, !1079, !1081, !1083, !1085, !1099, !1101, !1103, !1105, !1107, !1109, !1111, !1113, !1115, !1117, !1119, !1121, !1123, !1125, !1127, !847, !1129, !1131, !1144, !1146, !1148, !1150, !1152, !1154}
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !849, file: !1021, line: 762, type: !1022, isLocal: false, isDefinition: true, align: 16)
!1021 = !DIFile(filename: "zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 112, elements: !1023)
!1023 = !{!1024}
!1024 = !DISubrange(count: 7)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(name: "__device_dts_ord_19", scope: !849, file: !1021, line: 762, type: !879, isLocal: false, isDefinition: true, align: 32)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_19", scope: !849, file: !1021, line: 762, type: !1029, isLocal: true, isDefinition: true, align: 32)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !1031)
!1031 = !{!1032, !1036}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1030, file: !132, line: 60, baseType: !1033, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 32)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!103, !878}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1030, file: !132, line: 65, baseType: !878, size: 32, offset: 32)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_24", scope: !849, file: !1021, line: 766, type: !1022, isLocal: false, isDefinition: true, align: 16)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(name: "__device_dts_ord_24", scope: !849, file: !1021, line: 766, type: !879, isLocal: false, isDefinition: true, align: 32)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_24", scope: !849, file: !1021, line: 766, type: !1029, isLocal: true, isDefinition: true, align: 32)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_22", scope: !849, file: !1021, line: 770, type: !1045, isLocal: false, isDefinition: true, align: 16)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 96, elements: !1046)
!1046 = !{!1047}
!1047 = !DISubrange(count: 6)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(name: "__device_dts_ord_22", scope: !849, file: !1021, line: 770, type: !879, isLocal: false, isDefinition: true, align: 32)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_22", scope: !849, file: !1021, line: 770, type: !1029, isLocal: true, isDefinition: true, align: 32)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_75", scope: !849, file: !1021, line: 774, type: !1054, isLocal: false, isDefinition: true, align: 16)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 80, elements: !1055)
!1055 = !{!1056}
!1056 = !DISubrange(count: 5)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
