; ModuleID = 'build/actinius_icarus_bee/synchronization/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/synchronization/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/synchronization")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/synchronization")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "threadA_sem", scope: !27, file: !116, line: 72, type: !117, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/synchronization")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !106, !107, !109, !110, !111}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !103, line: 46, baseType: !104)
!103 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !105)
!105 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 214, baseType: !32)
!108 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!25, !114, !143, !153, !257, !259}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "threadB_sem", scope: !27, file: !116, line: 73, type: !117, isLocal: false, isDefinition: true, align: 32)
!116 = !DIFile(filename: "zephyr/samples/synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !118, line: 2909, size: 128, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120, !141, !142}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !117, file: !118, line: 2910, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !123, file: !122, line: 232, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !129)
!129 = !{!130, !136}
!130 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 38, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 38, size: 32, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !127, line: 39, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !127, line: 40, baseType: !134, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 42, baseType: !137, size: 32, offset: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 42, size: 32, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !137, file: !127, line: 43, baseType: !134, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !127, line: 44, baseType: !134, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !117, file: !118, line: 2911, baseType: !32, size: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !117, file: !118, line: 2912, baseType: !32, size: 32, offset: 96)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "threadA_stack_area", scope: !27, file: !116, line: 88, type: !145, isLocal: false, isDefinition: true, align: 64)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 8192, elements: !151)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !147, line: 47, size: 8, elements: !148)
!147 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !147, line: 48, baseType: !150, size: 8)
!150 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!151 = !{!152}
!152 = !DISubrange(count: 1024)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "threadA_data", scope: !27, file: !116, line: 89, type: !155, isLocal: true, isDefinition: true)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !156, line: 245, size: 1344, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{!158, !208, !221, !222, !223, !227, !228, !234, !252}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !155, file: !156, line: 247, baseType: !159, size: 448)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !156, line: 57, size: 448, elements: !160)
!160 = !{!161, !175, !177, !180, !181, !194, !195, !196, !197}
!161 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 60, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 60, size: 64, elements: !163)
!163 = !{!164, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !162, file: !156, line: 61, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !162, file: !156, line: 62, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 49, size: 64, elements: !169)
!168 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !167, file: !168, line: 50, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!173 = !{!174}
!174 = !DISubrange(count: 2)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !159, file: !156, line: 68, baseType: !176, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !159, file: !156, line: 71, baseType: !178, size: 8, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !179)
!179 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !159, file: !156, line: 74, baseType: !178, size: 8, offset: 104)
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 90, baseType: !182, size: 16, offset: 112)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 90, size: 16, elements: !183)
!183 = !{!184, !191}
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !182, file: !156, line: 91, baseType: !185, size: 16)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !182, file: !156, line: 91, size: 16, elements: !186)
!186 = !{!187, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !185, file: !156, line: 96, baseType: !188, size: 8)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !189)
!189 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !185, file: !156, line: 97, baseType: !178, size: 8, offset: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !182, file: !156, line: 100, baseType: !192, size: 16)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !193)
!193 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !159, file: !156, line: 107, baseType: !110, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_mask", scope: !159, file: !156, line: 123, baseType: !178, size: 8, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !159, file: !156, line: 127, baseType: !106, size: 32, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !159, file: !156, line: 131, baseType: !198, size: 192, offset: 256)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !199)
!199 = !{!200, !201, !207}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !198, file: !122, line: 245, baseType: !165, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !198, file: !122, line: 246, baseType: !202, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !198, file: !122, line: 249, baseType: !104, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !155, file: !156, line: 250, baseType: !209, size: 288, offset: 448)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !210, line: 25, size: 288, elements: !211)
!210 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !209, file: !210, line: 26, baseType: !110, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !209, file: !210, line: 27, baseType: !110, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !209, file: !210, line: 28, baseType: !110, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !209, file: !210, line: 29, baseType: !110, size: 32, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !209, file: !210, line: 30, baseType: !110, size: 32, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !209, file: !210, line: 31, baseType: !110, size: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !209, file: !210, line: 32, baseType: !110, size: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !209, file: !210, line: 33, baseType: !110, size: 32, offset: 224)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !209, file: !210, line: 34, baseType: !110, size: 32, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !155, file: !156, line: 253, baseType: !106, size: 32, offset: 736)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !155, file: !156, line: 256, baseType: !121, size: 64, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !155, file: !156, line: 279, baseType: !224, size: 256, offset: 832)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !155, file: !156, line: 294, baseType: !109, size: 32, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !155, file: !156, line: 300, baseType: !229, size: 96, offset: 1120)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !156, line: 149, size: 96, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !229, file: !156, line: 153, baseType: !22, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !229, file: !156, line: 162, baseType: !107, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !229, file: !156, line: 168, baseType: !107, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !155, file: !156, line: 325, baseType: !235, size: 32, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 160, elements: !237)
!237 = !{!238, !247, !248}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !236, file: !118, line: 5074, baseType: !239, size: 96)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !{!242, !245, !246}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !239, file: !240, line: 57, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !240, line: 57, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !239, file: !240, line: 58, baseType: !106, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !239, file: !240, line: 59, baseType: !107, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !236, file: !118, line: 5075, baseType: !121, size: 64, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !236, file: !118, line: 5076, baseType: !249, offset: 160)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!250 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !{}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !155, file: !156, line: 343, baseType: !253, size: 64, offset: 1248)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !210, line: 60, size: 64, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !253, file: !210, line: 63, baseType: !110, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !253, file: !210, line: 66, baseType: !110, size: 32, offset: 32)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "threadB_stack_area", scope: !27, file: !116, line: 91, type: !145, isLocal: false, isDefinition: true, align: 64)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "threadB_data", scope: !27, file: !116, line: 92, type: !155, isLocal: true, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "_char_out", scope: !263, file: !267, line: 54, type: !268, isLocal: false, isDefinition: true)
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !265, globals: !266, splitDebugInlining: false, nameTableKind: None)
!264 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/synchronization")
!265 = !{!106, !109}
!266 = !{!261}
!267 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DISubroutineType(types: !270)
!270 = !{!109, !109}
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !273, file: !332, line: 65, type: !333, isLocal: true, isDefinition: true, align: 32)
!273 = distinct !DICompileUnit(language: DW_LANG_C99, file: !274, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !275, globals: !327, splitDebugInlining: false, nameTableKind: None)
!274 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/synchronization")
!275 = !{!106, !109, !276, !110, !287}
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !278, file: !277, line: 167, baseType: !286)
!277 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!278 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !277, file: !277, line: 134, type: !279, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !273, retainedNodes: !281)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !110}
!281 = !{!282, !283, !285}
!282 = !DILocalVariable(name: "time_us", arg: 1, scope: !278, file: !277, line: 134, type: !110)
!283 = !DILocalVariable(name: "delay_cycles", scope: !278, file: !277, line: 168, type: !284)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !276)
!285 = !DILocalVariable(name: "cycles", scope: !278, file: !277, line: 171, type: !110)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !289, line: 1928, baseType: !290)
!289 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !289, line: 1909, size: 11360, elements: !291)
!291 = !{!292, !298, !299, !300, !301, !305, !306, !307, !308, !312, !313, !317, !318, !319, !320, !321, !325, !326}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !290, file: !289, line: 1910, baseType: !293, size: 8192)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 8192, elements: !296)
!294 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!296 = !{!297}
!297 = !DISubrange(count: 256)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !290, file: !289, line: 1911, baseType: !294, size: 32, offset: 8192)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !290, file: !289, line: 1912, baseType: !294, size: 32, offset: 8224)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !290, file: !289, line: 1913, baseType: !294, size: 32, offset: 8256)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !290, file: !289, line: 1914, baseType: !302, size: 1984, offset: 8288)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 1984, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 62)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !290, file: !289, line: 1915, baseType: !295, size: 32, offset: 10272)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !290, file: !289, line: 1916, baseType: !294, size: 32, offset: 10304)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !290, file: !289, line: 1917, baseType: !295, size: 32, offset: 10336)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !290, file: !289, line: 1918, baseType: !309, size: 96, offset: 10368)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 96, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 3)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !290, file: !289, line: 1919, baseType: !295, size: 32, offset: 10464)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !290, file: !289, line: 1920, baseType: !314, size: 256, offset: 10496)
!314 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 256, elements: !315)
!315 = !{!316}
!316 = !DISubrange(count: 8)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !290, file: !289, line: 1921, baseType: !295, size: 32, offset: 10752)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !290, file: !289, line: 1922, baseType: !294, size: 32, offset: 10784)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !290, file: !289, line: 1923, baseType: !295, size: 32, offset: 10816)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !290, file: !289, line: 1924, baseType: !295, size: 32, offset: 10848)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !290, file: !289, line: 1925, baseType: !322, size: 416, offset: 10880)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 416, elements: !323)
!323 = !{!324}
!324 = !DISubrange(count: 13)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !290, file: !289, line: 1926, baseType: !295, size: 32, offset: 11296)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !290, file: !289, line: 1927, baseType: !295, size: 32, offset: 11328)
!327 = !{!271, !328}
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !278, file: !277, line: 161, type: !330, isLocal: true, isDefinition: true, align: 128)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 48, elements: !310)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!332 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !335, line: 51, size: 64, elements: !336)
!335 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!336 = !{!337, !344}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !334, file: !335, line: 60, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32)
!339 = !DISubroutineType(types: !340)
!340 = !{!109, !341}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!343 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !335, line: 48, flags: DIFlagFwdDecl)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !334, file: !335, line: 65, baseType: !341, size: 32, offset: 32)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !347, file: !382, line: 27, type: !407, isLocal: true, isDefinition: true)
!347 = distinct !DICompileUnit(language: DW_LANG_C99, file: !348, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, retainedTypes: !361, globals: !379, splitDebugInlining: false, nameTableKind: None)
!348 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/synchronization")
!349 = !{!350, !30}
!350 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !351, line: 27, baseType: !32, size: 32, elements: !352)
!351 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!352 = !{!353, !354, !355, !356, !357, !358, !359, !360}
!353 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!354 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!355 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!356 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!357 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!358 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!359 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!360 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!361 = !{!106, !102, !109, !24, !362, !378, !110, !111}
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !364, line: 54, size: 96, elements: !365)
!364 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!365 = !{!366, !373, !377}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !363, file: !364, line: 55, baseType: !367, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !368, line: 33, baseType: !369)
!368 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !368, line: 29, size: 32, elements: !370)
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !369, file: !368, line: 30, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !363, file: !364, line: 60, baseType: !374, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 32)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !350}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !363, file: !364, line: 65, baseType: !374, size: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!379 = !{!345, !380, !384, !386, !397, !399}
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !347, file: !382, line: 44, type: !383, isLocal: true, isDefinition: true)
!382 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !347, file: !382, line: 49, type: !383, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !347, file: !382, line: 36, type: !388, isLocal: true, isDefinition: true)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 128, elements: !395)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !351, line: 114, size: 128, elements: !390)
!390 = !{!391, !392, !393, !394}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !389, file: !351, line: 115, baseType: !350, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !389, file: !351, line: 141, baseType: !178, size: 8, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !389, file: !351, line: 149, baseType: !110, size: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !389, file: !351, line: 156, baseType: !110, size: 32, offset: 96)
!395 = !{!396}
!396 = !DISubrange(count: 1)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !347, file: !382, line: 40, type: !388, isLocal: true, isDefinition: true)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !347, file: !382, line: 28, type: !401, isLocal: true, isDefinition: true)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !368, line: 40, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !368, line: 35, size: 64, elements: !403)
!403 = !{!404, !406}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !402, file: !368, line: 36, baseType: !405, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !402, file: !368, line: 37, baseType: !405, size: 32, offset: 32)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 32, elements: !395)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !409, line: 22, baseType: !410)
!409 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!410 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!411 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!412 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !415, file: !444, line: 50, type: !431, isLocal: true, isDefinition: true)
!415 = distinct !DICompileUnit(language: DW_LANG_C99, file: !416, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !349, retainedTypes: !417, globals: !441, splitDebugInlining: false, nameTableKind: None)
!416 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/synchronization")
!417 = !{!418, !102, !107, !109, !106, !110, !111, !420, !378, !431, !432}
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !419)
!419 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !422, line: 45, size: 64, elements: !423)
!422 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!423 = !{!424, !430}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !421, file: !422, line: 46, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !368, line: 33, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !368, line: 29, size: 32, elements: !427)
!427 = !{!428}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !426, file: !368, line: 30, baseType: !429, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !421, file: !422, line: 48, baseType: !110, size: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !109)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 32)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !422, line: 38, size: 64, elements: !434)
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !433, file: !422, line: 39, baseType: !425, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !433, file: !422, line: 41, baseType: !437, size: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !422, line: 35, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 32)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !431}
!441 = !{!442, !446, !454, !413, !456, !466}
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "latency_lock", scope: !415, file: !444, line: 44, type: !445, isLocal: true, isDefinition: true)
!444 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !415, file: !444, line: 46, type: !448, isLocal: true, isDefinition: true)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !368, line: 40, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !368, line: 35, size: 64, elements: !450)
!450 = !{!451, !453}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !449, file: !368, line: 36, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !449, file: !368, line: 37, baseType: !452, size: 32, offset: 32)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "latency_subs", scope: !415, file: !444, line: 52, type: !448, isLocal: true, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !415, file: !444, line: 39, type: !458, isLocal: true, isDefinition: true)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, elements: !464)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !444, line: 35, size: 96, elements: !460)
!460 = !{!461, !462, !463}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !459, file: !444, line: 36, baseType: !350, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !459, file: !444, line: 37, baseType: !178, size: 8, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !459, file: !444, line: 38, baseType: !408, size: 32, offset: 64)
!464 = !{!465}
!465 = !DISubrange(count: 0)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !415, file: !444, line: 48, type: !431, isLocal: true, isDefinition: true)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !470, file: !477, line: 47, type: !491, isLocal: true, isDefinition: true)
!470 = distinct !DICompileUnit(language: DW_LANG_C99, file: !471, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !472, retainedTypes: !473, globals: !474, splitDebugInlining: false, nameTableKind: None)
!471 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/synchronization")
!472 = !{!350}
!473 = !{!107, !109}
!474 = !{!475, !468, !487}
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "cpus_states", scope: !470, file: !477, line: 50, type: !478, isLocal: true, isDefinition: true)
!477 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 32, elements: !395)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !351, line: 114, size: 128, elements: !482)
!482 = !{!483, !484, !485, !486}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !481, file: !351, line: 115, baseType: !350, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !481, file: !351, line: 141, baseType: !178, size: 8, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !481, file: !351, line: 149, baseType: !110, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !481, file: !351, line: 156, baseType: !110, size: 32, offset: 96)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !470, file: !477, line: 55, type: !489, isLocal: true, isDefinition: true)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 8, elements: !395)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, elements: !464)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "static_regions", scope: !494, file: !501, line: 62, type: !622, isLocal: true, isDefinition: true)
!494 = distinct !DICompileUnit(language: DW_LANG_C99, file: !495, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !496, globals: !497, splitDebugInlining: false, nameTableKind: None)
!495 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/synchronization")
!496 = !{!107, !109, !110, !106}
!497 = !{!498, !492}
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !500, file: !501, line: 198, type: !609, isLocal: true, isDefinition: true)
!500 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !501, file: !501, line: 175, type: !502, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !494, retainedNodes: !606)
!501 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!502 = !DISubroutineType(types: !503)
!503 = !{null, !504}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !156, line: 245, size: 1344, elements: !506)
!506 = !{!507, !566, !578, !579, !580, !581, !582, !588, !601}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !505, file: !156, line: 247, baseType: !508, size: 448)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !156, line: 57, size: 448, elements: !509)
!509 = !{!510, !534, !541, !542, !543, !552, !553, !554, !555}
!510 = !DIDerivedType(tag: DW_TAG_member, scope: !508, file: !156, line: 60, baseType: !511, size: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !508, file: !156, line: 60, size: 64, elements: !512)
!512 = !{!513, !528}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !511, file: !156, line: 61, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !516)
!516 = !{!517, !523}
!517 = !DIDerivedType(tag: DW_TAG_member, scope: !515, file: !127, line: 38, baseType: !518, size: 32)
!518 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !515, file: !127, line: 38, size: 32, elements: !519)
!519 = !{!520, !522}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !518, file: !127, line: 39, baseType: !521, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !518, file: !127, line: 40, baseType: !521, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, scope: !515, file: !127, line: 42, baseType: !524, size: 32, offset: 32)
!524 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !515, file: !127, line: 42, size: 32, elements: !525)
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !524, file: !127, line: 43, baseType: !521, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !524, file: !127, line: 44, baseType: !521, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !511, file: !156, line: 62, baseType: !529, size: 64)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 49, size: 64, elements: !530)
!530 = !{!531}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !529, file: !168, line: 50, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 64, elements: !173)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !508, file: !156, line: 68, baseType: !535, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !538)
!538 = !{!539}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !537, file: !122, line: 232, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !515)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !508, file: !156, line: 71, baseType: !178, size: 8, offset: 96)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !508, file: !156, line: 74, baseType: !178, size: 8, offset: 104)
!543 = !DIDerivedType(tag: DW_TAG_member, scope: !508, file: !156, line: 90, baseType: !544, size: 16, offset: 112)
!544 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !508, file: !156, line: 90, size: 16, elements: !545)
!545 = !{!546, !551}
!546 = !DIDerivedType(tag: DW_TAG_member, scope: !544, file: !156, line: 91, baseType: !547, size: 16)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !544, file: !156, line: 91, size: 16, elements: !548)
!548 = !{!549, !550}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !547, file: !156, line: 96, baseType: !188, size: 8)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !547, file: !156, line: 97, baseType: !178, size: 8, offset: 8)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !544, file: !156, line: 100, baseType: !192, size: 16)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !508, file: !156, line: 107, baseType: !110, size: 32, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_mask", scope: !508, file: !156, line: 123, baseType: !178, size: 8, offset: 160)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !508, file: !156, line: 127, baseType: !106, size: 32, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !508, file: !156, line: 131, baseType: !556, size: 192, offset: 256)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !557)
!557 = !{!558, !559, !565}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !556, file: !122, line: 245, baseType: !514, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !556, file: !122, line: 246, baseType: !560, size: 32, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!562 = !DISubroutineType(types: !563)
!563 = !{null, !564}
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !556, file: !122, line: 249, baseType: !104, size: 64, offset: 128)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !505, file: !156, line: 250, baseType: !567, size: 288, offset: 448)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !210, line: 25, size: 288, elements: !568)
!568 = !{!569, !570, !571, !572, !573, !574, !575, !576, !577}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !567, file: !210, line: 26, baseType: !110, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !567, file: !210, line: 27, baseType: !110, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !567, file: !210, line: 28, baseType: !110, size: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !567, file: !210, line: 29, baseType: !110, size: 32, offset: 96)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !567, file: !210, line: 30, baseType: !110, size: 32, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !567, file: !210, line: 31, baseType: !110, size: 32, offset: 160)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !567, file: !210, line: 32, baseType: !110, size: 32, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !567, file: !210, line: 33, baseType: !110, size: 32, offset: 224)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !567, file: !210, line: 34, baseType: !110, size: 32, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !505, file: !156, line: 253, baseType: !106, size: 32, offset: 736)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !505, file: !156, line: 256, baseType: !536, size: 64, offset: 768)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !505, file: !156, line: 279, baseType: !224, size: 256, offset: 832)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !505, file: !156, line: 294, baseType: !109, size: 32, offset: 1088)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !505, file: !156, line: 300, baseType: !583, size: 96, offset: 1120)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !156, line: 149, size: 96, elements: !584)
!584 = !{!585, !586, !587}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !583, file: !156, line: 153, baseType: !22, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !583, file: !156, line: 162, baseType: !107, size: 32, offset: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !583, file: !156, line: 168, baseType: !107, size: 32, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !505, file: !156, line: 325, baseType: !589, size: 32, offset: 1216)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 32)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 160, elements: !591)
!591 = !{!592, !598, !599}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !590, file: !118, line: 5074, baseType: !593, size: 96)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !594)
!594 = !{!595, !596, !597}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !593, file: !240, line: 57, baseType: !243, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !593, file: !240, line: 58, baseType: !106, size: 32, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !593, file: !240, line: 59, baseType: !107, size: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !590, file: !118, line: 5075, baseType: !536, size: 64, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !590, file: !118, line: 5076, baseType: !600, offset: 160)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !505, file: !156, line: 343, baseType: !602, size: 64, offset: 1248)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !210, line: 60, size: 64, elements: !603)
!603 = !{!604, !605}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !602, file: !210, line: 63, baseType: !110, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !602, file: !210, line: 66, baseType: !110, size: 32, offset: 32)
!606 = !{!607, !608}
!607 = !DILocalVariable(name: "thread", arg: 1, scope: !500, file: !501, line: 175, type: !504)
!608 = !DILocalVariable(name: "region_num", scope: !500, file: !501, line: 200, type: !178)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, elements: !464)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !611, line: 52, size: 96, elements: !612)
!611 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!612 = !{!613, !614, !615}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !610, file: !611, line: 53, baseType: !22, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !610, file: !611, line: 54, baseType: !107, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !610, file: !611, line: 55, baseType: !616, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !617, line: 304, baseType: !618)
!617 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !617, line: 301, size: 32, elements: !619)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !618, file: !617, line: 302, baseType: !192, size: 16)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !618, file: !617, line: 303, baseType: !192, size: 16, offset: 16)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 96, elements: !395)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !626, file: !682, line: 39, type: !178, isLocal: true, isDefinition: true)
!626 = distinct !DICompileUnit(language: DW_LANG_C99, file: !627, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !628, globals: !673, splitDebugInlining: false, nameTableKind: None)
!627 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/synchronization")
!628 = !{!629, !106, !109, !657}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !631, line: 1495, baseType: !632)
!631 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !631, line: 1474, size: 448, elements: !633)
!633 = !{!634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !647}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !632, file: !631, line: 1476, baseType: !294, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !632, file: !631, line: 1477, baseType: !295, size: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !632, file: !631, line: 1478, baseType: !295, size: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !632, file: !631, line: 1479, baseType: !295, size: 32, offset: 96)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !632, file: !631, line: 1480, baseType: !295, size: 32, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !632, file: !631, line: 1481, baseType: !295, size: 32, offset: 160)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !632, file: !631, line: 1482, baseType: !295, size: 32, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !632, file: !631, line: 1483, baseType: !295, size: 32, offset: 224)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !632, file: !631, line: 1484, baseType: !295, size: 32, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !632, file: !631, line: 1485, baseType: !295, size: 32, offset: 288)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !632, file: !631, line: 1486, baseType: !295, size: 32, offset: 320)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !632, file: !631, line: 1487, baseType: !646, size: 32, offset: 352)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 32, elements: !395)
!647 = !DIDerivedType(tag: DW_TAG_member, scope: !632, file: !631, line: 1488, baseType: !648, size: 64, offset: 384)
!648 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !632, file: !631, line: 1488, size: 64, elements: !649)
!649 = !{!650, !652}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !648, file: !631, line: 1489, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 64, elements: !173)
!652 = !DIDerivedType(tag: DW_TAG_member, scope: !648, file: !631, line: 1490, baseType: !653, size: 64)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !648, file: !631, line: 1490, size: 64, elements: !654)
!654 = !{!655, !656}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !653, file: !631, line: 1491, baseType: !295, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !653, file: !631, line: 1492, baseType: !295, size: 32, offset: 32)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !660, line: 27, size: 128, elements: !661)
!660 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!661 = !{!662, !663, !666}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !659, file: !660, line: 29, baseType: !110, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !659, file: !660, line: 31, baseType: !664, size: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !659, file: !660, line: 37, baseType: !667, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !617, line: 298, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !617, line: 289, size: 64, elements: !669)
!669 = !{!670, !671, !672}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !668, file: !617, line: 291, baseType: !178, size: 5, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !668, file: !617, line: 293, baseType: !178, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !668, file: !617, line: 295, baseType: !110, size: 32, offset: 32)
!673 = !{!624, !674}
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !626, file: !676, line: 31, type: !677, isLocal: true, isDefinition: true)
!676 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 160, elements: !395)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !676, line: 21, size: 160, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !678, file: !676, line: 22, baseType: !109, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !678, file: !676, line: 23, baseType: !659, size: 128, offset: 32)
!682 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !685, file: !692, line: 21, type: !268, isLocal: true, isDefinition: true)
!685 = distinct !DICompileUnit(language: DW_LANG_C99, file: !686, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !687, globals: !691, splitDebugInlining: false, nameTableKind: None)
!686 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/synchronization")
!687 = !{!688, !109, !106}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !690, line: 22, baseType: !109)
!690 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!691 = !{!683}
!692 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !695, file: !700, line: 13, type: !719, isLocal: true, isDefinition: true)
!695 = distinct !DICompileUnit(language: DW_LANG_C99, file: !696, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !697, splitDebugInlining: false, nameTableKind: None)
!696 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/synchronization")
!697 = !{!698, !693}
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "mpu_config", scope: !695, file: !700, line: 37, type: !701, isLocal: false, isDefinition: true)
!700 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!701 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !660, line: 41, size: 64, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !702, file: !660, line: 43, baseType: !110, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !702, file: !660, line: 45, baseType: !706, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !660, line: 27, size: 128, elements: !709)
!709 = !{!710, !711, !712}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !708, file: !660, line: 29, baseType: !110, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !708, file: !660, line: 31, baseType: !664, size: 32, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !708, file: !660, line: 37, baseType: !713, size: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !617, line: 298, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !617, line: 289, size: 64, elements: !715)
!715 = !{!716, !717, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !714, file: !617, line: 291, baseType: !178, size: 5, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !714, file: !617, line: 293, baseType: !178, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !714, file: !617, line: 295, baseType: !110, size: 32, offset: 32)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 256, elements: !173)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "__device_dts_ord_54", scope: !722, file: !927, line: 733, type: !1033, isLocal: false, isDefinition: true, align: 32)
!722 = distinct !DICompileUnit(language: DW_LANG_C99, file: !723, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !724, retainedTypes: !842, globals: !923, splitDebugInlining: false, nameTableKind: None)
!723 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee/synchronization")
!724 = !{!725, !731, !30, !736, !741, !745, !749, !753, !759, !763, !807, !814, !833}
!725 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !726, line: 23, baseType: !32, size: 32, elements: !727)
!726 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!727 = !{!728, !729, !730}
!728 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!729 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!730 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !726, line: 48, baseType: !32, size: 32, elements: !732)
!732 = !{!733, !734, !735}
!733 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!734 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!735 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!736 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !737, line: 167, baseType: !32, size: 32, elements: !738)
!737 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!738 = !{!739, !740}
!739 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!740 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!741 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !737, line: 107, baseType: !32, size: 32, elements: !742)
!742 = !{!743, !744}
!743 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!744 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!745 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !737, line: 208, baseType: !32, size: 32, elements: !746)
!746 = !{!747, !748}
!747 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!748 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!749 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !737, line: 261, baseType: !32, size: 32, elements: !750)
!750 = !{!751, !752}
!751 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!752 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!753 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !737, line: 237, baseType: !32, size: 32, elements: !754)
!754 = !{!755, !756, !757, !758}
!755 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!756 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!757 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!758 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!759 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !737, line: 152, baseType: !32, size: 32, elements: !760)
!760 = !{!761, !762}
!761 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!762 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!763 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !289, line: 71, baseType: !109, size: 32, elements: !764)
!764 = !{!765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806}
!765 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!766 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!767 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!768 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!769 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!770 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!771 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!772 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!773 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!774 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!775 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!776 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!777 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!778 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!779 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!780 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!781 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!782 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!783 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!784 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!785 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!786 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!787 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!788 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!789 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!790 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!791 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!792 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!793 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!794 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!795 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!796 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!797 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!798 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!799 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!800 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!801 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!802 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!803 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!804 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!805 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!806 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!807 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !808, line: 44, baseType: !32, size: 32, elements: !809)
!808 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!809 = !{!810, !811, !812, !813}
!810 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!811 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!812 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!813 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!814 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !815, line: 54, baseType: !32, size: 32, elements: !816)
!815 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!816 = !{!817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832}
!817 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!818 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!819 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!820 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!821 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!822 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!823 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!824 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!825 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!826 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!827 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!828 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!829 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!830 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!831 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!832 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!833 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !834, line: 53, baseType: !32, size: 32, elements: !835)
!834 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!835 = !{!836, !837, !838, !839, !840, !841}
!836 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!837 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!838 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!839 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!840 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!841 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!842 = !{!725, !106, !109, !843, !885, !886, !887, !888, !102, !110, !111, !889, !890, !891, !431, !892, !922, !107}
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !289, line: 923, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !289, line: 883, size: 10464, elements: !846)
!846 = !{!847, !848, !849, !850, !851, !855, !856, !857, !858, !859, !860, !861, !862, !866, !867, !868, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !845, file: !289, line: 884, baseType: !295, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !845, file: !289, line: 885, baseType: !295, size: 32, offset: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !845, file: !289, line: 886, baseType: !295, size: 32, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !845, file: !289, line: 887, baseType: !295, size: 32, offset: 96)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !845, file: !289, line: 888, baseType: !852, size: 896, offset: 128)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 896, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 28)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !845, file: !289, line: 889, baseType: !295, size: 32, offset: 1024)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !845, file: !289, line: 890, baseType: !295, size: 32, offset: 1056)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !845, file: !289, line: 891, baseType: !295, size: 32, offset: 1088)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !845, file: !289, line: 892, baseType: !295, size: 32, offset: 1120)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !845, file: !289, line: 893, baseType: !852, size: 896, offset: 1152)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !845, file: !289, line: 894, baseType: !295, size: 32, offset: 2048)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !845, file: !289, line: 895, baseType: !295, size: 32, offset: 2080)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !845, file: !289, line: 896, baseType: !863, size: 960, offset: 2112)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 960, elements: !864)
!864 = !{!865}
!865 = !DISubrange(count: 30)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !845, file: !289, line: 897, baseType: !295, size: 32, offset: 3072)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !845, file: !289, line: 898, baseType: !295, size: 32, offset: 3104)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !845, file: !289, line: 899, baseType: !869, size: 3008, offset: 3136)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 3008, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 94)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !845, file: !289, line: 900, baseType: !295, size: 32, offset: 6144)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !845, file: !289, line: 901, baseType: !295, size: 32, offset: 6176)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !845, file: !289, line: 902, baseType: !295, size: 32, offset: 6208)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !845, file: !289, line: 903, baseType: !294, size: 32, offset: 6240)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !845, file: !289, line: 904, baseType: !302, size: 1984, offset: 6272)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !845, file: !289, line: 905, baseType: !294, size: 32, offset: 8256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !845, file: !289, line: 907, baseType: !294, size: 32, offset: 8288)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !845, file: !289, line: 910, baseType: !294, size: 32, offset: 8320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !845, file: !289, line: 911, baseType: !294, size: 32, offset: 8352)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !845, file: !289, line: 913, baseType: !294, size: 32, offset: 8384)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !845, file: !289, line: 917, baseType: !294, size: 32, offset: 8416)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !845, file: !289, line: 919, baseType: !302, size: 1984, offset: 8448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !845, file: !289, line: 920, baseType: !295, size: 32, offset: 10432)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !737, line: 146, baseType: !741)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !737, line: 164, baseType: !759)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 32)
!889 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !631, line: 485, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !631, line: 468, size: 28704, elements: !895)
!895 = !{!896, !900, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !917, !921}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !894, file: !631, line: 470, baseType: !897, size: 512)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 512, elements: !898)
!898 = !{!899}
!899 = !DISubrange(count: 16)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !894, file: !631, line: 471, baseType: !901, size: 512, offset: 512)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 512, elements: !898)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !894, file: !631, line: 472, baseType: !897, size: 512, offset: 1024)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !894, file: !631, line: 473, baseType: !901, size: 512, offset: 1536)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !894, file: !631, line: 474, baseType: !897, size: 512, offset: 2048)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !894, file: !631, line: 475, baseType: !901, size: 512, offset: 2560)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !894, file: !631, line: 476, baseType: !897, size: 512, offset: 3072)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !894, file: !631, line: 477, baseType: !901, size: 512, offset: 3584)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !894, file: !631, line: 478, baseType: !897, size: 512, offset: 4096)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !894, file: !631, line: 479, baseType: !901, size: 512, offset: 4608)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !894, file: !631, line: 480, baseType: !897, size: 512, offset: 5120)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !894, file: !631, line: 481, baseType: !901, size: 512, offset: 5632)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !894, file: !631, line: 482, baseType: !913, size: 3968, offset: 6144)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !914, size: 3968, elements: !915)
!914 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !178)
!915 = !{!916}
!916 = !DISubrange(count: 496)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !894, file: !631, line: 483, baseType: !918, size: 18560, offset: 10112)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 18560, elements: !919)
!919 = !{!920}
!920 = !DISubrange(count: 580)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !894, file: !631, line: 484, baseType: !295, size: 32, offset: 28672)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !808, line: 56, baseType: !106)
!923 = !{!924, !974, !1015, !720, !1023, !1049, !1051, !1068, !1070, !1080, !1083, !1098, !1136, !1150}
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "on", scope: !926, file: !927, line: 549, type: !408, isLocal: true, isDefinition: true)
!926 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !927, file: !927, line: 547, type: !928, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !722, retainedNodes: !930)
!927 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!928 = !DISubroutineType(types: !929)
!929 = !{null, !731}
!930 = !{!931, !932, !935}
!931 = !DILocalVariable(name: "start_mode", arg: 1, scope: !926, file: !927, line: 547, type: !731)
!932 = !DILocalVariable(name: "err", scope: !933, file: !927, line: 553, type: !109)
!933 = distinct !DILexicalBlock(scope: !934, file: !927, line: 552, column: 31)
!934 = distinct !DILexicalBlock(scope: !926, file: !927, line: 552, column: 6)
!935 = !DILocalVariable(name: "mgr", scope: !933, file: !927, line: 554, type: !936)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !938, line: 154, size: 224, elements: !939)
!938 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!939 = !{!940, !952, !953, !969, !971, !972, !973}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !937, file: !938, line: 158, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !368, line: 40, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !368, line: 35, size: 64, elements: !943)
!943 = !{!944, !951}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !942, file: !368, line: 36, baseType: !945, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !368, line: 33, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !368, line: 29, size: 32, elements: !948)
!948 = !{!949}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !947, file: !368, line: 30, baseType: !950, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !942, file: !368, line: 37, baseType: !945, size: 32, offset: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !937, file: !938, line: 163, baseType: !941, size: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !937, file: !938, line: 166, baseType: !954, size: 32, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !938, line: 133, size: 96, elements: !957)
!957 = !{!958, !967, !968}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !956, file: !938, line: 135, baseType: !959, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !938, line: 129, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = !DISubroutineType(types: !962)
!962 = !{null, !936, !963}
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !938, line: 101, baseType: !964)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = !DISubroutineType(types: !966)
!966 = !{null, !936, !109}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !956, file: !938, line: 138, baseType: !959, size: 32, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !956, file: !938, line: 143, baseType: !959, size: 32, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !937, file: !938, line: 169, baseType: !970, offset: 160)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !937, file: !938, line: 172, baseType: !109, size: 32, offset: 160)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !937, file: !938, line: 175, baseType: !192, size: 16, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !937, file: !938, line: 178, baseType: !192, size: 16, offset: 208)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(name: "cli", scope: !926, file: !927, line: 550, type: !976, isLocal: true, isDefinition: true)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !938, line: 273, size: 128, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !976, file: !938, line: 280, baseType: !946, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !976, file: !938, line: 283, baseType: !980, size: 96, offset: 32)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !981, line: 138, size: 96, elements: !982)
!981 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!982 = !{!983, !1012, !1013}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !980, file: !981, line: 149, baseType: !984, size: 32)
!984 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !981, line: 139, size: 32, elements: !985)
!985 = !{!986, !1007}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !984, file: !981, line: 145, baseType: !987, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !118, line: 5397, size: 128, elements: !989)
!989 = !{!990, !1005, !1006}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !988, file: !118, line: 5399, baseType: !991, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !992)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !993)
!993 = !{!994, !1000}
!994 = !DIDerivedType(tag: DW_TAG_member, scope: !992, file: !127, line: 38, baseType: !995, size: 32)
!995 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !992, file: !127, line: 38, size: 32, elements: !996)
!996 = !{!997, !999}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !995, file: !127, line: 39, baseType: !998, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !995, file: !127, line: 40, baseType: !998, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, scope: !992, file: !127, line: 42, baseType: !1001, size: 32, offset: 32)
!1001 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !992, file: !127, line: 42, size: 32, elements: !1002)
!1002 = !{!1003, !1004}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1001, file: !127, line: 43, baseType: !998, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1001, file: !127, line: 44, baseType: !998, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !988, file: !118, line: 5405, baseType: !32, size: 32, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !988, file: !118, line: 5408, baseType: !109, size: 32, offset: 96)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !984, file: !981, line: 148, baseType: !1008, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !981, line: 98, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{null, null}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !980, file: !981, line: 165, baseType: !295, size: 32, offset: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !980, file: !981, line: 174, baseType: !1014, size: 32, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !109)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !722, file: !927, line: 733, type: !1017, isLocal: false, isDefinition: true, align: 16)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 80, elements: !1021)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !1020, line: 43, baseType: !418)
!1020 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1021 = !{!1022}
!1022 = !DISubrange(count: 5)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_54", scope: !722, file: !927, line: 733, type: !1025, isLocal: true, isDefinition: true, align: 32)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !335, line: 51, size: 64, elements: !1027)
!1027 = !{!1028, !1048}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1026, file: !335, line: 60, baseType: !1029, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 32)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!109, !1032}
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !1020, line: 378, size: 192, elements: !1035)
!1035 = !{!1036, !1037, !1038, !1039, !1045, !1046}
