; ModuleID = './build/trng_generate_random_data.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.__va_list = type { i8* }
%struct.hal_cache_region_config_t = type { i32, i32 }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, i8*, i32, i32, %struct.__locale_t*, %struct._mprec*, void (%struct._reent*)*, i32, i32, i8*, %struct._rand48*, %struct.__tm*, i8*, void (i32)**, %struct._atexit*, %struct._atexit, %struct._glue, %struct.__sFILE*, %struct._misc_reent*, i8* }
%struct.__locale_t = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_u4ClkCnt1ms", scope: !2, file: !3, line: 71, type: !79, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !57, globals: !62, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!4 = !{!5, !11}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 121, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!10 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !12, line: 47, baseType: !13, size: 32, elements: !14)
!12 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!13 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!14 = !{!15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56}
!15 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!16 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!17 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!18 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!19 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!20 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!21 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!22 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!23 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!24 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!25 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!26 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!27 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!28 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!29 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!30 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!31 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!32 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!33 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!34 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!35 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!36 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!37 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!38 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!39 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!40 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!41 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!42 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!43 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!44 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!45 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!46 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!47 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!48 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!49 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!50 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!51 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!52 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!53 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!54 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!55 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!56 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!57 = !{!58, !61}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!59 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !6, line: 116, baseType: !7)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !12, line: 95, baseType: !11)
!62 = !{!0, !63}
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "GPTTimer", scope: !2, file: !3, line: 67, type: !65, isLocal: true, isDefinition: true)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPTStruct", file: !66, line: 111, baseType: !67)
!66 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 109, size: 96, elements: !68)
!68 = !{!69}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_FUNC", scope: !67, file: !66, line: 110, baseType: !70, size: 96)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_func", file: !66, line: 106, baseType: !71)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !66, line: 102, size: 96, elements: !72)
!72 = !{!73, !77, !78}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "gpt0_func", scope: !71, file: !66, line: 103, baseType: !74, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 32)
!75 = !DISubroutineType(types: !76)
!76 = !{null}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "gpt1_func", scope: !71, file: !66, line: 104, baseType: !74, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "gpt3_func", scope: !71, file: !66, line: 105, baseType: !74, size: 32, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !6, line: 62, baseType: !7)
!81 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!82 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !85, file: !86, line: 43, type: !92, isLocal: true, isDefinition: true)
!85 = distinct !DICompileUnit(language: DW_LANG_C99, file: !86, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !87, globals: !97, splitDebugInlining: false, nameTableKind: None)
!86 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!87 = !{!88, !80, !90, !96}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !92)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !93, line: 48, baseType: !94)
!93 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !95, line: 79, baseType: !7)
!95 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!97 = !{!83, !98}
!98 = !DIGlobalVariableExpression(var: !99, expr: !DIExpression())
!99 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !85, file: !86, line: 44, type: !92, isLocal: true, isDefinition: true)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !102, file: !103, line: 54, type: !92, isLocal: false, isDefinition: true)
!102 = distinct !DICompileUnit(language: DW_LANG_C99, file: !103, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !104, retainedTypes: !128, globals: !137, splitDebugInlining: false, nameTableKind: None)
!103 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!104 = !{!105, !111}
!105 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !106, line: 71, baseType: !7, size: 32, elements: !107)
!106 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!107 = !{!108, !109, !110}
!108 = !DIEnumerator(name: "UART_PORT0", value: 0)
!109 = !DIEnumerator(name: "UART_PORT1", value: 1)
!110 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!111 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !112, line: 129, baseType: !7, size: 32, elements: !113)
!112 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/dma_sw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127}
!114 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!115 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!116 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!117 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!118 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!119 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!120 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!121 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!122 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!123 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!124 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!125 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!126 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!127 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!128 = !{!88, !92, !129, !131, !133, !135, !80}
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !6, line: 113, baseType: !132)
!132 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !6, line: 59, baseType: !134)
!134 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !133)
!137 = !{!100}
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !140, file: !141, line: 51, type: !221, isLocal: false, isDefinition: true)
!140 = distinct !DICompileUnit(language: DW_LANG_C99, file: !141, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !142, retainedTypes: !189, globals: !220, splitDebugInlining: false, nameTableKind: None)
!141 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!142 = !{!143, !154, !173, !180}
!143 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !144, line: 163, baseType: !13, size: 32, elements: !145)
!144 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153}
!146 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!147 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!148 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!149 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!150 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!151 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!152 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!153 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!154 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !144, line: 186, baseType: !7, size: 32, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172}
!156 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!157 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!158 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!159 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!160 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!161 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!162 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!163 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!164 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!165 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!166 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!167 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!168 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!169 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!170 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!171 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!172 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!173 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !144, line: 176, baseType: !7, size: 32, elements: !174)
!174 = !{!175, !176, !177, !178, !179}
!175 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!176 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!177 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!178 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!179 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !181, line: 99, baseType: !7, size: 32, elements: !182)
!181 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!182 = !{!183, !184, !185, !186, !187, !188}
!183 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!184 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!185 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!186 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!187 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!188 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!189 = !{!190, !219}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !192, line: 72, baseType: !193)
!192 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 56, size: 525312, elements: !194)
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !209, !210, !214, !218}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !193, file: !192, line: 57, baseType: !91, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !193, file: !192, line: 58, baseType: !91, size: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !193, file: !192, line: 59, baseType: !91, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !193, file: !192, line: 60, baseType: !91, size: 32, offset: 96)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !193, file: !192, line: 61, baseType: !91, size: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !193, file: !192, line: 62, baseType: !91, size: 32, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !193, file: !192, line: 63, baseType: !91, size: 32, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !193, file: !192, line: 64, baseType: !91, size: 32, offset: 224)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !193, file: !192, line: 65, baseType: !91, size: 32, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !193, file: !192, line: 66, baseType: !91, size: 32, offset: 288)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !193, file: !192, line: 67, baseType: !206, size: 32, offset: 320)
!206 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 32, elements: !207)
!207 = !{!208}
!208 = !DISubrange(count: 1)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !193, file: !192, line: 68, baseType: !91, size: 32, offset: 352)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !193, file: !192, line: 69, baseType: !211, size: 523904, offset: 384)
!211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 523904, elements: !212)
!212 = !{!213}
!213 = !DISubrange(count: 16372)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !193, file: !192, line: 70, baseType: !215, size: 512, offset: 524288)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 512, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 16)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !193, file: !192, line: 71, baseType: !215, size: 512, offset: 524800)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!220 = !{!138}
!221 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !222)
!222 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !225, file: !226, line: 53, type: !316, isLocal: false, isDefinition: true)
!225 = distinct !DICompileUnit(language: DW_LANG_C99, file: !226, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !227, retainedTypes: !236, globals: !315, splitDebugInlining: false, nameTableKind: None)
!226 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!227 = !{!228, !11}
!228 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !229, line: 152, baseType: !13, size: 32, elements: !230)
!229 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!230 = !{!231, !232, !233, !234, !235}
!231 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!232 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!233 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!234 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!235 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!236 = !{!237, !219, !92, !238, !240, !276}
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !12, line: 97, baseType: !61)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !93, line: 44, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !95, line: 77, baseType: !13)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !242, line: 378, baseType: !243)
!242 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 363, size: 28704, elements: !244)
!244 = !{!245, !249, !253, !254, !255, !256, !257, !258, !259, !260, !264, !271, !275}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !243, file: !242, line: 365, baseType: !246, size: 256)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 256, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 8)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !243, file: !242, line: 366, baseType: !250, size: 768, offset: 256)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 768, elements: !251)
!251 = !{!252}
!252 = !DISubrange(count: 24)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !243, file: !242, line: 367, baseType: !246, size: 256, offset: 1024)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !243, file: !242, line: 368, baseType: !250, size: 768, offset: 1280)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !243, file: !242, line: 369, baseType: !246, size: 256, offset: 2048)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !243, file: !242, line: 370, baseType: !250, size: 768, offset: 2304)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !243, file: !242, line: 371, baseType: !246, size: 256, offset: 3072)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !243, file: !242, line: 372, baseType: !250, size: 768, offset: 3328)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !243, file: !242, line: 373, baseType: !246, size: 256, offset: 4096)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !243, file: !242, line: 374, baseType: !261, size: 1792, offset: 4352)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 1792, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 56)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !243, file: !242, line: 375, baseType: !265, size: 1920, offset: 6144)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 1920, elements: !269)
!266 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !93, line: 24, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !95, line: 43, baseType: !134)
!269 = !{!270}
!270 = !DISubrange(count: 240)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !243, file: !242, line: 376, baseType: !272, size: 20608, offset: 8064)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 20608, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 644)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !243, file: !242, line: 377, baseType: !91, size: 32, offset: 28672)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !242, line: 418, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 395, size: 1120, elements: !279)
!279 = !{!280, !282, !283, !284, !285, !286, !287, !291, !292, !293, !294, !295, !296, !297, !298, !302, !303, !304, !308, !312, !314}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !278, file: !242, line: 397, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !278, file: !242, line: 398, baseType: !91, size: 32, offset: 32)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !278, file: !242, line: 399, baseType: !91, size: 32, offset: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !278, file: !242, line: 400, baseType: !91, size: 32, offset: 96)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !278, file: !242, line: 401, baseType: !91, size: 32, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !278, file: !242, line: 402, baseType: !91, size: 32, offset: 160)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !278, file: !242, line: 403, baseType: !288, size: 96, offset: 192)
!288 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 96, elements: !289)
!289 = !{!290}
!290 = !DISubrange(count: 12)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !278, file: !242, line: 404, baseType: !91, size: 32, offset: 288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !278, file: !242, line: 405, baseType: !91, size: 32, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !278, file: !242, line: 406, baseType: !91, size: 32, offset: 352)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !278, file: !242, line: 407, baseType: !91, size: 32, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !278, file: !242, line: 408, baseType: !91, size: 32, offset: 416)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !278, file: !242, line: 409, baseType: !91, size: 32, offset: 448)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !278, file: !242, line: 410, baseType: !91, size: 32, offset: 480)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !278, file: !242, line: 411, baseType: !299, size: 64, offset: 512)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 64, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 2)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !278, file: !242, line: 412, baseType: !281, size: 32, offset: 576)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !278, file: !242, line: 413, baseType: !281, size: 32, offset: 608)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !278, file: !242, line: 414, baseType: !305, size: 128, offset: 640)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 128, elements: !306)
!306 = !{!307}
!307 = !DISubrange(count: 4)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !278, file: !242, line: 415, baseType: !309, size: 160, offset: 768)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, size: 160, elements: !310)
!310 = !{!311}
!311 = !DISubrange(count: 5)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !278, file: !242, line: 416, baseType: !313, size: 160, offset: 928)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 160, elements: !310)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !278, file: !242, line: 417, baseType: !91, size: 32, offset: 1088)
!315 = !{!223}
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 6144, elements: !325)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !226, line: 50, baseType: !318)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !226, line: 47, size: 64, elements: !319)
!319 = !{!320, !324}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !318, file: !226, line: 48, baseType: !321, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !237}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !318, file: !226, line: 49, baseType: !92, size: 32, offset: 32)
!325 = !{!326}
!326 = !DISubrange(count: 96)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !329, file: !330, line: 77, type: !396, isLocal: true, isDefinition: true)
!329 = distinct !DICompileUnit(language: DW_LANG_C99, file: !330, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !331, retainedTypes: !382, globals: !384, splitDebugInlining: false, nameTableKind: None)
!330 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!331 = !{!332, !340, !346, !362, !368, !372, !105, !111, !377}
!332 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !333, line: 345, baseType: !13, size: 32, elements: !334)
!333 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!334 = !{!335, !336, !337, !338, !339}
!335 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!336 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!337 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!338 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!339 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!340 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !341, line: 109, baseType: !7, size: 32, elements: !342)
!341 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!342 = !{!343, !344, !345}
!343 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!344 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!345 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!346 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !333, line: 302, baseType: !7, size: 32, elements: !347)
!347 = !{!348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361}
!348 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!349 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!350 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!351 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!352 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!353 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!354 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!355 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!356 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!357 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!358 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!359 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!360 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!361 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!362 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !333, line: 321, baseType: !7, size: 32, elements: !363)
!363 = !{!364, !365, !366, !367}
!364 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!365 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!366 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!367 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!368 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !333, line: 330, baseType: !7, size: 32, elements: !369)
!369 = !{!370, !371}
!370 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!371 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!372 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !333, line: 337, baseType: !7, size: 32, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!375 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!376 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !333, line: 355, baseType: !13, size: 32, elements: !378)
!378 = !{!379, !380, !381}
!379 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!380 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!381 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!382 = !{!7, !219, !134, !383, !267}
!383 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!384 = !{!327, !385}
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "func_tbl", scope: !387, file: !330, line: 536, type: !394, isLocal: true, isDefinition: true)
!387 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !330, file: !330, line: 534, type: !388, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !329, retainedNodes: !392)
!388 = !DISubroutineType(types: !389)
!389 = !{!390, !391}
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !112, line: 197, baseType: !74)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !341, line: 113, baseType: !340)
!392 = !{!393}
!393 = !DILocalVariable(name: "uart_port", arg: 1, scope: !387, file: !330, line: 534, type: !391)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 64, elements: !300)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 1024, elements: !300)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !330, line: 75, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 68, size: 512, elements: !399)
!399 = !{!400, !401, !413, !414, !425, !426}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !398, file: !330, line: 69, baseType: !222, size: 8)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !398, file: !330, line: 70, baseType: !402, size: 128, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !333, line: 378, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 373, size: 128, elements: !404)
!404 = !{!405, !407, !409, !411}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !403, file: !333, line: 374, baseType: !406, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !333, line: 317, baseType: !346)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !403, file: !333, line: 375, baseType: !408, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !333, line: 326, baseType: !362)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !403, file: !333, line: 376, baseType: !410, size: 32, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !333, line: 333, baseType: !368)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !403, file: !333, line: 377, baseType: !412, size: 32, offset: 96)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !333, line: 341, baseType: !372)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !398, file: !330, line: 71, baseType: !222, size: 8, offset: 160)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !398, file: !330, line: 72, baseType: !415, size: 64, offset: 192)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !330, line: 66, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !330, line: 63, size: 64, elements: !417)
!417 = !{!418, !424}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !416, file: !330, line: 64, baseType: !419, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !333, line: 410, baseType: !420)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !423, !219}
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !333, line: 359, baseType: !377)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !416, file: !330, line: 65, baseType: !219, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !398, file: !330, line: 73, baseType: !222, size: 8, offset: 256)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !398, file: !330, line: 74, baseType: !427, size: 224, offset: 288)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !333, line: 390, baseType: !428)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 382, size: 224, elements: !429)
!429 = !{!430, !432, !433, !434, !435, !436, !437}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !428, file: !333, line: 383, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !428, file: !333, line: 384, baseType: !92, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !428, file: !333, line: 385, baseType: !92, size: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !428, file: !333, line: 386, baseType: !431, size: 32, offset: 96)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !428, file: !333, line: 387, baseType: !92, size: 32, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !428, file: !333, line: 388, baseType: !92, size: 32, offset: 160)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !428, file: !333, line: 389, baseType: !92, size: 32, offset: 192)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !440, file: !441, line: 59, type: !92, isLocal: false, isDefinition: true)
!440 = distinct !DICompileUnit(language: DW_LANG_C99, file: !441, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !442, globals: !495, splitDebugInlining: false, nameTableKind: None)
!441 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/trng_generate_random_data/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!442 = !{!443, !451, !476}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !242, line: 656, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 650, size: 128, elements: !446)
!446 = !{!447, !448, !449, !450}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !445, file: !242, line: 652, baseType: !91, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !445, file: !242, line: 653, baseType: !91, size: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !445, file: !242, line: 654, baseType: !91, size: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !445, file: !242, line: 655, baseType: !281, size: 32, offset: 96)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !242, line: 418, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 395, size: 1120, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !453, file: !242, line: 397, baseType: !281, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !453, file: !242, line: 398, baseType: !91, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !453, file: !242, line: 399, baseType: !91, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !453, file: !242, line: 400, baseType: !91, size: 32, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !453, file: !242, line: 401, baseType: !91, size: 32, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !453, file: !242, line: 402, baseType: !91, size: 32, offset: 160)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !453, file: !242, line: 403, baseType: !288, size: 96, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !453, file: !242, line: 404, baseType: !91, size: 32, offset: 288)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !453, file: !242, line: 405, baseType: !91, size: 32, offset: 320)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !453, file: !242, line: 406, baseType: !91, size: 32, offset: 352)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !453, file: !242, line: 407, baseType: !91, size: 32, offset: 384)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !453, file: !242, line: 408, baseType: !91, size: 32, offset: 416)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !453, file: !242, line: 409, baseType: !91, size: 32, offset: 448)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !453, file: !242, line: 410, baseType: !91, size: 32, offset: 480)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !453, file: !242, line: 411, baseType: !299, size: 64, offset: 512)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !453, file: !242, line: 412, baseType: !281, size: 32, offset: 576)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !453, file: !242, line: 413, baseType: !281, size: 32, offset: 608)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !453, file: !242, line: 414, baseType: !305, size: 128, offset: 640)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !453, file: !242, line: 415, baseType: !309, size: 160, offset: 768)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !453, file: !242, line: 416, baseType: !313, size: 160, offset: 928)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !453, file: !242, line: 417, baseType: !91, size: 32, offset: 1088)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !192, line: 72, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !192, line: 56, size: 525312, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !478, file: !192, line: 57, baseType: !91, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !478, file: !192, line: 58, baseType: !91, size: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !478, file: !192, line: 59, baseType: !91, size: 32, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !478, file: !192, line: 60, baseType: !91, size: 32, offset: 96)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !478, file: !192, line: 61, baseType: !91, size: 32, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !478, file: !192, line: 62, baseType: !91, size: 32, offset: 160)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !478, file: !192, line: 63, baseType: !91, size: 32, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !478, file: !192, line: 64, baseType: !91, size: 32, offset: 224)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !478, file: !192, line: 65, baseType: !91, size: 32, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !478, file: !192, line: 66, baseType: !91, size: 32, offset: 288)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !478, file: !192, line: 67, baseType: !206, size: 32, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !478, file: !192, line: 68, baseType: !91, size: 32, offset: 352)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !478, file: !192, line: 69, baseType: !211, size: 523904, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !478, file: !192, line: 70, baseType: !215, size: 512, offset: 524288)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !478, file: !192, line: 71, baseType: !215, size: 512, offset: 524800)
!495 = !{!438, !496}
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !440, file: !441, line: 61, type: !91, isLocal: true, isDefinition: true)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "heap_end", scope: !500, file: !501, line: 66, type: !506, isLocal: true, isDefinition: true)
!500 = distinct !DISubprogram(name: "_sbrk_r", scope: !501, file: !501, line: 63, type: !502, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !698, retainedNodes: !702)
!501 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!502 = !DISubroutineType(types: !503)
!503 = !{!504, !507, !697}
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !505, line: 123, baseType: !506)
!505 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 32)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !509, line: 377, size: 1920, elements: !510)
!509 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!510 = !{!511, !512, !586, !587, !588, !589, !590, !591, !592, !595, !616, !620, !621, !622, !623, !633, !646, !647, !652, !671, !672, !679, !680, !696}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !508, file: !509, line: 381, baseType: !13, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !508, file: !509, line: 386, baseType: !513, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !509, line: 292, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !509, line: 186, size: 832, elements: !516)
!516 = !{!517, !519, !520, !521, !523, !524, !529, !530, !531, !532, !536, !542, !549, !553, !554, !555, !556, !560, !562, !563, !564, !566, !572, !585}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !515, file: !509, line: 187, baseType: !518, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !515, file: !509, line: 188, baseType: !13, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !515, file: !509, line: 189, baseType: !13, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !515, file: !509, line: 190, baseType: !522, size: 16, offset: 96)
!522 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !515, file: !509, line: 191, baseType: !522, size: 16, offset: 112)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !515, file: !509, line: 192, baseType: !525, size: 64, offset: 128)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !509, line: 122, size: 64, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !525, file: !509, line: 123, baseType: !518, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !525, file: !509, line: 124, baseType: !13, size: 32, offset: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !515, file: !509, line: 193, baseType: !13, size: 32, offset: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !515, file: !509, line: 196, baseType: !507, size: 32, offset: 224)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !515, file: !509, line: 200, baseType: !219, size: 32, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !515, file: !509, line: 202, baseType: !533, size: 32, offset: 288)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 32)
!534 = !DISubroutineType(types: !535)
!535 = !{!13, !507, !219, !506, !13}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !515, file: !509, line: 204, baseType: !537, size: 32, offset: 320)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = !DISubroutineType(types: !539)
!539 = !{!13, !507, !219, !540, !13}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !515, file: !509, line: 207, baseType: !543, size: 32, offset: 352)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = !DISubroutineType(types: !545)
!545 = !{!546, !507, !219, !546, !13}
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !547, line: 116, baseType: !548)
!547 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!548 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !515, file: !509, line: 208, baseType: !550, size: 32, offset: 384)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!551 = !DISubroutineType(types: !552)
!552 = !{!13, !507, !219}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !515, file: !509, line: 211, baseType: !525, size: 64, offset: 416)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !515, file: !509, line: 212, baseType: !518, size: 32, offset: 480)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !515, file: !509, line: 213, baseType: !13, size: 32, offset: 512)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !515, file: !509, line: 216, baseType: !557, size: 24, offset: 544)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 24, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 3)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !515, file: !509, line: 217, baseType: !561, size: 8, offset: 568)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 8, elements: !207)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !515, file: !509, line: 220, baseType: !525, size: 64, offset: 576)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !515, file: !509, line: 223, baseType: !13, size: 32, offset: 640)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !515, file: !509, line: 224, baseType: !565, size: 32, offset: 672)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !547, line: 46, baseType: !548)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !515, file: !509, line: 231, baseType: !567, size: 32, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !509, line: 35, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !569, line: 34, baseType: !570)
!569 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !569, line: 33, flags: DIFlagFwdDecl)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !515, file: !509, line: 233, baseType: !573, size: 64, offset: 736)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !547, line: 170, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !547, line: 162, size: 64, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !574, file: !547, line: 164, baseType: !13, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !574, file: !547, line: 169, baseType: !578, size: 32, offset: 32)
!578 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !574, file: !547, line: 165, size: 32, elements: !579)
!579 = !{!580, !583}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !578, file: !547, line: 167, baseType: !581, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !582, line: 116, baseType: !13)
!582 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !578, file: !547, line: 168, baseType: !584, size: 32)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 32, elements: !306)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !515, file: !509, line: 234, baseType: !13, size: 32, offset: 800)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !508, file: !509, line: 386, baseType: !513, size: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !508, file: !509, line: 386, baseType: !513, size: 32, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !508, file: !509, line: 388, baseType: !13, size: 32, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !508, file: !509, line: 390, baseType: !506, size: 32, offset: 160)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !508, file: !509, line: 392, baseType: !13, size: 32, offset: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !508, file: !509, line: 394, baseType: !13, size: 32, offset: 224)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !508, file: !509, line: 395, baseType: !593, size: 32, offset: 256)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !509, line: 45, flags: DIFlagFwdDecl)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !508, file: !509, line: 397, baseType: !596, size: 32, offset: 288)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 32)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !509, line: 349, size: 128, elements: !598)
!598 = !{!599, !612, !613, !614}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !597, file: !509, line: 352, baseType: !600, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !509, line: 52, size: 192, elements: !602)
!602 = !{!603, !604, !605, !606, !607, !608}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !601, file: !509, line: 54, baseType: !600, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !601, file: !509, line: 55, baseType: !13, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !601, file: !509, line: 55, baseType: !13, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !601, file: !509, line: 55, baseType: !13, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !601, file: !509, line: 55, baseType: !13, size: 32, offset: 128)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !601, file: !509, line: 56, baseType: !609, size: 32, offset: 160)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 32, elements: !207)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !509, line: 22, baseType: !611)
!611 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !597, file: !509, line: 353, baseType: !13, size: 32, offset: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !597, file: !509, line: 354, baseType: !600, size: 32, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !597, file: !509, line: 355, baseType: !615, size: 32, offset: 96)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !508, file: !509, line: 399, baseType: !617, size: 32, offset: 320)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !507}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !508, file: !509, line: 401, baseType: !13, size: 32, offset: 352)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !508, file: !509, line: 404, baseType: !13, size: 32, offset: 384)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !508, file: !509, line: 405, baseType: !506, size: 32, offset: 416)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !508, file: !509, line: 407, baseType: !624, size: 32, offset: 448)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 32)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !509, line: 324, size: 192, elements: !626)
!626 = !{!627, !629, !630, !631}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !625, file: !509, line: 325, baseType: !628, size: 48)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 48, elements: !558)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !625, file: !509, line: 326, baseType: !628, size: 48, offset: 48)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !625, file: !509, line: 327, baseType: !132, size: 16, offset: 96)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !625, file: !509, line: 330, baseType: !632, size: 64, offset: 128)
!632 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !508, file: !509, line: 408, baseType: !634, size: 32, offset: 480)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !509, line: 60, size: 288, elements: !636)
!636 = !{!637, !638, !639, !640, !641, !642, !643, !644, !645}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !635, file: !509, line: 62, baseType: !13, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !635, file: !509, line: 63, baseType: !13, size: 32, offset: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !635, file: !509, line: 64, baseType: !13, size: 32, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !635, file: !509, line: 65, baseType: !13, size: 32, offset: 96)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !635, file: !509, line: 66, baseType: !13, size: 32, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !635, file: !509, line: 67, baseType: !13, size: 32, offset: 160)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !635, file: !509, line: 68, baseType: !13, size: 32, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !635, file: !509, line: 69, baseType: !13, size: 32, offset: 224)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !635, file: !509, line: 70, baseType: !13, size: 32, offset: 256)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !508, file: !509, line: 409, baseType: !506, size: 32, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !508, file: !509, line: 412, baseType: !648, size: 32, offset: 544)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 32)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !13}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !508, file: !509, line: 416, baseType: !653, size: 32, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 32)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !509, line: 90, size: 1120, elements: !655)
!655 = !{!656, !657, !658, !662}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !654, file: !509, line: 91, baseType: !653, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !654, file: !509, line: 92, baseType: !13, size: 32, offset: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !654, file: !509, line: 93, baseType: !659, size: 1024, offset: 64)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 1024, elements: !660)
!660 = !{!661}
!661 = !DISubrange(count: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !654, file: !509, line: 94, baseType: !663, size: 32, offset: 1088)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 32)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !509, line: 79, size: 2112, elements: !665)
!665 = !{!666, !668, !669, !670}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !664, file: !509, line: 80, baseType: !667, size: 1024)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !219, size: 1024, elements: !660)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !664, file: !509, line: 81, baseType: !667, size: 1024, offset: 1024)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !664, file: !509, line: 83, baseType: !610, size: 32, offset: 2048)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !664, file: !509, line: 86, baseType: !610, size: 32, offset: 2080)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !508, file: !509, line: 417, baseType: !654, size: 1120, offset: 608)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !508, file: !509, line: 420, baseType: !673, size: 96, offset: 1728)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !509, line: 296, size: 96, elements: !674)
!674 = !{!675, !677, !678}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !673, file: !509, line: 298, baseType: !676, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !673, file: !509, line: 299, baseType: !13, size: 32, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !673, file: !509, line: 300, baseType: !513, size: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !508, file: !509, line: 421, baseType: !513, size: 32, offset: 1824)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !508, file: !509, line: 422, baseType: !681, size: 32, offset: 1856)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 32)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !509, line: 359, size: 640, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !690, !691, !692, !693, !694, !695}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !682, file: !509, line: 362, baseType: !506, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !682, file: !509, line: 363, baseType: !573, size: 64, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !682, file: !509, line: 364, baseType: !573, size: 64, offset: 96)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !682, file: !509, line: 365, baseType: !573, size: 64, offset: 160)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !682, file: !509, line: 366, baseType: !689, size: 64, offset: 224)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 64, elements: !247)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !682, file: !509, line: 367, baseType: !13, size: 32, offset: 288)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !682, file: !509, line: 368, baseType: !573, size: 64, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !682, file: !509, line: 369, baseType: !573, size: 64, offset: 384)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !682, file: !509, line: 370, baseType: !573, size: 64, offset: 448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !682, file: !509, line: 371, baseType: !573, size: 64, offset: 512)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !682, file: !509, line: 372, baseType: !573, size: 64, offset: 576)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !508, file: !509, line: 423, baseType: !506, size: 32, offset: 1888)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !582, line: 46, baseType: !7)
!698 = distinct !DICompileUnit(language: DW_LANG_C99, file: !699, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !700, globals: !701, splitDebugInlining: false, nameTableKind: None)
!699 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!700 = !{!506, !504}
!701 = !{!498}
!702 = !{!703, !704, !705, !706}
!703 = !DILocalVariable(name: "r", arg: 1, scope: !500, file: !501, line: 63, type: !507)
!704 = !DILocalVariable(name: "nbytes", arg: 2, scope: !500, file: !501, line: 63, type: !697)
!705 = !DILocalVariable(name: "prev_heap_end", scope: !500, file: !501, line: 67, type: !506)
!706 = !DILocalVariable(name: "stack", scope: !500, file: !501, line: 68, type: !506)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !709, file: !714, line: 4, type: !720, isLocal: false, isDefinition: true)
!709 = distinct !DICompileUnit(language: DW_LANG_C99, file: !710, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !711, splitDebugInlining: false, nameTableKind: None)
!710 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!711 = !{!707, !712, !718}
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !709, file: !714, line: 5, type: !715, isLocal: false, isDefinition: true)
!714 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 88, elements: !716)
!716 = !{!717}
!717 = !DISubrange(count: 11)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !709, file: !714, line: 6, type: !715, isLocal: false, isDefinition: true)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 248, elements: !721)
!721 = !{!722}
!722 = !DISubrange(count: 31)
!723 = distinct !DICompileUnit(language: DW_LANG_C99, file: !724, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !725, retainedTypes: !731, splitDebugInlining: false, nameTableKind: None)
!724 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!725 = !{!726}
!726 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !727, line: 1209, baseType: !7, size: 32, elements: !728)
!727 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!728 = !{!729, !730}
!729 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!730 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!731 = !{!58, !60}
!732 = distinct !DICompileUnit(language: DW_LANG_C99, file: !733, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !734, retainedTypes: !812, splitDebugInlining: false, nameTableKind: None)
!733 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!734 = !{!735}
!735 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !736, line: 150, baseType: !7, size: 32, elements: !737)
!736 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!737 = !{!738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811}
!738 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!739 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!740 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!741 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!742 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!743 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!744 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!745 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!746 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!747 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!748 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!749 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!750 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!751 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!752 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!753 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!754 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!755 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!756 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!757 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!758 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!759 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!760 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!761 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!762 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!763 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!764 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!765 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!766 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!767 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!768 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!769 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!770 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!771 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!772 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!773 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!774 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!775 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!776 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!777 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!778 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!779 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!780 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!781 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!782 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!783 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!784 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!785 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!786 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!787 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!788 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!789 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!790 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!791 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!792 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!793 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!794 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!795 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!796 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!797 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!798 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!799 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!800 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!801 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!802 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!803 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!804 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!805 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!806 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!807 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!808 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!809 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!810 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!811 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!812 = !{!58, !80}
!813 = distinct !DICompileUnit(language: DW_LANG_C99, file: !814, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !815, retainedTypes: !822, splitDebugInlining: false, nameTableKind: None)
!814 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_trng.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!815 = !{!816}
!816 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !817, line: 92, baseType: !13, size: 32, elements: !818)
!817 = !DIFile(filename: "../../../../../driver/chip/inc/hal_trng.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!818 = !{!819, !820, !821}
!819 = !DIEnumerator(name: "HAL_TRNG_STATUS_ERROR", value: -2)
!820 = !DIEnumerator(name: "HAL_TRNG_STATUS_INVALID_PARAMETER", value: -1)
!821 = !DIEnumerator(name: "HAL_TRNG_STATUS_OK", value: 0)
!822 = !{!823, !825}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32", file: !6, line: 133, baseType: !7)
!826 = distinct !DICompileUnit(language: DW_LANG_C99, file: !827, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !828, splitDebugInlining: false, nameTableKind: None)
!827 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!828 = !{!829, !854}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !242, line: 418, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 395, size: 1120, elements: !832)
!832 = !{!833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !831, file: !242, line: 397, baseType: !281, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !831, file: !242, line: 398, baseType: !91, size: 32, offset: 32)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !831, file: !242, line: 399, baseType: !91, size: 32, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !831, file: !242, line: 400, baseType: !91, size: 32, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !831, file: !242, line: 401, baseType: !91, size: 32, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !831, file: !242, line: 402, baseType: !91, size: 32, offset: 160)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !831, file: !242, line: 403, baseType: !288, size: 96, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !831, file: !242, line: 404, baseType: !91, size: 32, offset: 288)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !831, file: !242, line: 405, baseType: !91, size: 32, offset: 320)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !831, file: !242, line: 406, baseType: !91, size: 32, offset: 352)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !831, file: !242, line: 407, baseType: !91, size: 32, offset: 384)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !831, file: !242, line: 408, baseType: !91, size: 32, offset: 416)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !831, file: !242, line: 409, baseType: !91, size: 32, offset: 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !831, file: !242, line: 410, baseType: !91, size: 32, offset: 480)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !831, file: !242, line: 411, baseType: !299, size: 64, offset: 512)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !831, file: !242, line: 412, baseType: !281, size: 32, offset: 576)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !831, file: !242, line: 413, baseType: !281, size: 32, offset: 608)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !831, file: !242, line: 414, baseType: !305, size: 128, offset: 640)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !831, file: !242, line: 415, baseType: !309, size: 160, offset: 768)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !831, file: !242, line: 416, baseType: !313, size: 160, offset: 928)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !831, file: !242, line: 417, baseType: !91, size: 32, offset: 1088)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !242, line: 378, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 363, size: 28704, elements: !857)
!857 = !{!858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !856, file: !242, line: 365, baseType: !246, size: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !856, file: !242, line: 366, baseType: !250, size: 768, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !856, file: !242, line: 367, baseType: !246, size: 256, offset: 1024)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !856, file: !242, line: 368, baseType: !250, size: 768, offset: 1280)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !856, file: !242, line: 369, baseType: !246, size: 256, offset: 2048)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !856, file: !242, line: 370, baseType: !250, size: 768, offset: 2304)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !856, file: !242, line: 371, baseType: !246, size: 256, offset: 3072)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !856, file: !242, line: 372, baseType: !250, size: 768, offset: 3328)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !856, file: !242, line: 373, baseType: !246, size: 256, offset: 4096)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !856, file: !242, line: 374, baseType: !261, size: 1792, offset: 4352)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !856, file: !242, line: 375, baseType: !265, size: 1920, offset: 6144)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !856, file: !242, line: 376, baseType: !272, size: 20608, offset: 8064)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !856, file: !242, line: 377, baseType: !91, size: 32, offset: 28672)
!871 = distinct !DICompileUnit(language: DW_LANG_C99, file: !872, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !873, splitDebugInlining: false, nameTableKind: None)
!872 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!873 = !{!874, !735}
!874 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !875, line: 55, baseType: !7, size: 32, elements: !876)
!875 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!876 = !{!877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904}
!877 = !DIEnumerator(name: "eIOT_GPIO_IDX_0", value: 0)
!878 = !DIEnumerator(name: "eIOT_GPIO_IDX_1", value: 1)
!879 = !DIEnumerator(name: "eIOT_GPIO_IDX_2", value: 2)
!880 = !DIEnumerator(name: "eIOT_GPIO_IDX_3", value: 3)
!881 = !DIEnumerator(name: "eIOT_GPIO_IDX_4", value: 4)
!882 = !DIEnumerator(name: "eIOT_GPIO_IDX_5", value: 5)
!883 = !DIEnumerator(name: "eIOT_GPIO_IDX_6", value: 6)
!884 = !DIEnumerator(name: "eIOT_GPIO_IDX_7", value: 7)
!885 = !DIEnumerator(name: "eIOT_GPIO_IDX_24", value: 24)
!886 = !DIEnumerator(name: "eIOT_GPIO_IDX_25", value: 25)
!887 = !DIEnumerator(name: "eIOT_GPIO_IDX_26", value: 26)
!888 = !DIEnumerator(name: "eIOT_GPIO_IDX_27", value: 27)
!889 = !DIEnumerator(name: "eIOT_GPIO_IDX_28", value: 28)
!890 = !DIEnumerator(name: "eIOT_GPIO_IDX_29", value: 29)
!891 = !DIEnumerator(name: "eIOT_GPIO_IDX_30", value: 30)
!892 = !DIEnumerator(name: "eIOT_GPIO_IDX_31", value: 31)
!893 = !DIEnumerator(name: "eIOT_GPIO_IDX_32", value: 32)
!894 = !DIEnumerator(name: "eIOT_GPIO_IDX_33", value: 33)
!895 = !DIEnumerator(name: "eIOT_GPIO_IDX_34", value: 34)
!896 = !DIEnumerator(name: "eIOT_GPIO_IDX_35", value: 35)
!897 = !DIEnumerator(name: "eIOT_GPIO_IDX_36", value: 36)
!898 = !DIEnumerator(name: "eIOT_GPIO_IDX_37", value: 37)
!899 = !DIEnumerator(name: "eIOT_GPIO_IDX_38", value: 38)
!900 = !DIEnumerator(name: "eIOT_GPIO_IDX_39", value: 39)
!901 = !DIEnumerator(name: "eIOT_GPIO_IDX_57", value: 57)
!902 = !DIEnumerator(name: "eIOT_GPIO_IDX_58", value: 58)
!903 = !DIEnumerator(name: "eIOT_GPIO_IDX_59", value: 59)
!904 = !DIEnumerator(name: "eIOT_GPIO_IDX_60", value: 60)
!905 = distinct !DICompileUnit(language: DW_LANG_C99, file: !906, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !907, splitDebugInlining: false, nameTableKind: None)
!906 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/timer.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!907 = !{!548, !58}
!908 = distinct !DICompileUnit(language: DW_LANG_C99, file: !909, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!909 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_log.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!910 = distinct !DICompileUnit(language: DW_LANG_C99, file: !911, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !912, retainedTypes: !976, splitDebugInlining: false, nameTableKind: None)
!911 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!912 = !{!913, !920, !874, !951, !957, !961, !965, !971}
!913 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !914, line: 233, baseType: !13, size: 32, elements: !915)
!914 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!915 = !{!916, !917, !918, !919}
!916 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!917 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!918 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!919 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!920 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !341, line: 249, baseType: !7, size: 32, elements: !921)
!921 = !{!922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950}
!922 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!923 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!924 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!925 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!926 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!927 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!928 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!929 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!930 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!931 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!932 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!933 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!934 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!935 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!936 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!937 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!938 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!939 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!940 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!941 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!942 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!943 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!944 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!945 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!946 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!947 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!948 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!949 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!950 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!951 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !914, line: 224, baseType: !13, size: 32, elements: !952)
!952 = !{!953, !954, !955, !956}
!953 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!954 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!955 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!956 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!957 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !914, line: 217, baseType: !7, size: 32, elements: !958)
!958 = !{!959, !960}
!959 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!960 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!961 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !914, line: 210, baseType: !7, size: 32, elements: !962)
!962 = !{!963, !964}
!963 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!964 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!965 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !914, line: 242, baseType: !7, size: 32, elements: !966)
!966 = !{!967, !968, !969, !970}
!967 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!968 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!969 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!970 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!971 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !972, line: 57, baseType: !7, size: 32, elements: !973)
!972 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/low_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!973 = !{!974, !975}
!974 = !DIEnumerator(name: "eDirection_IN", value: 0)
!975 = !DIEnumerator(name: "eDirection_OUT", value: 1)
!976 = !{!977, !219, !978, !267, !979, !980}
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_IOT_GPIO_NAME_T", file: !875, line: 87, baseType: !874)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !914, line: 220, baseType: !957)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !914, line: 247, baseType: !965)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_DIR_T", file: !972, line: 60, baseType: !971)
!981 = distinct !DICompileUnit(language: DW_LANG_C99, file: !982, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !983, retainedTypes: !984, splitDebugInlining: false, nameTableKind: None)
!982 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/trng_generate_random_data/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/trng_generate_random_data/GCC")
!983 = !{!340, !346, !362, !368, !372, !920}
!984 = !{!7}
!985 = !{!"Ubuntu clang version 14.0.6"}
!986 = !{i32 7, !"Dwarf Version", i32 2}
!987 = !{i32 2, !"Debug Info Version", i32 3}
!988 = !{i32 1, !"wchar_size", i32 4}
!989 = !{i32 1, !"min_enum_size", i32 4}
!990 = !{i32 1, !"branch-target-enforcement", i32 0}
!991 = !{i32 1, !"sign-return-address", i32 0}
!992 = !{i32 1, !"sign-return-address-all", i32 0}
!993 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!994 = !{i32 7, !"frame-pointer", i32 2}
!995 = distinct !DISubprogram(name: "GPT_ResetTimer", scope: !3, file: !3, line: 73, type: !996, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !998)
!996 = !DISubroutineType(types: !997)
!997 = !{null, !60, !60, !222}
!998 = !{!999, !1000, !1001}
!999 = !DILocalVariable(name: "timerNum", arg: 1, scope: !995, file: !3, line: 73, type: !60)
!1000 = !DILocalVariable(name: "countValue", arg: 2, scope: !995, file: !3, line: 73, type: !60)
!1001 = !DILocalVariable(name: "autoRepeat", arg: 3, scope: !995, file: !3, line: 73, type: !222)
!1002 = !DILocation(line: 0, scope: !995)
!1003 = !DILocation(line: 75, column: 5, scope: !1004)
!1004 = distinct !DILexicalBlock(scope: !995, file: !3, line: 75, column: 5)
!1005 = !DILocation(line: 75, column: 5, scope: !995)
!1006 = !DILocation(line: 75, column: 5, scope: !1007)
!1007 = distinct !DILexicalBlock(scope: !1004, file: !3, line: 75, column: 5)
!1008 = distinct !{!1008, !1006, !1006}
!1009 = !DILocation(line: 77, column: 9, scope: !995)
!1010 = !DILocation(line: 78, column: 30, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 77, column: 24)
!1012 = distinct !DILexicalBlock(scope: !995, file: !3, line: 77, column: 9)
!1013 = !DILocation(line: 0, scope: !1014)
!1014 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 79, column: 13)
!1015 = !DILocation(line: 79, column: 13, scope: !1011)
!1016 = !DILocation(line: 80, column: 34, scope: !1017)
!1017 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 79, column: 37)
!1018 = !DILocation(line: 81, column: 9, scope: !1017)
!1019 = !DILocation(line: 82, column: 34, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 81, column: 16)
!1021 = !DILocation(line: 85, column: 30, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !1023, file: !3, line: 84, column: 31)
!1023 = distinct !DILexicalBlock(scope: !1012, file: !3, line: 84, column: 16)
!1024 = !DILocation(line: 0, scope: !1025)
!1025 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 86, column: 13)
!1026 = !DILocation(line: 86, column: 13, scope: !1022)
!1027 = !DILocation(line: 87, column: 34, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 86, column: 37)
!1029 = !DILocation(line: 88, column: 9, scope: !1028)
!1030 = !DILocation(line: 89, column: 34, scope: !1031)
!1031 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 88, column: 16)
!1032 = !DILocation(line: 92, column: 1, scope: !995)
!1033 = distinct !DISubprogram(name: "GPT_Start", scope: !3, file: !3, line: 94, type: !1034, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1036)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{null, !60}
!1036 = !{!1037}
!1037 = !DILocalVariable(name: "timerNum", arg: 1, scope: !1033, file: !3, line: 94, type: !60)
!1038 = !DILocation(line: 0, scope: !1033)
!1039 = !DILocation(line: 96, column: 5, scope: !1033)
!1040 = !DILocation(line: 96, column: 5, scope: !1041)
!1041 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 96, column: 5)
!1042 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 96, column: 5)
!1043 = distinct !{!1043, !1040, !1040}
!1044 = !DILocation(line: 99, column: 30, scope: !1045)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !3, line: 98, column: 24)
!1046 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 98, column: 9)
!1047 = !DILocation(line: 100, column: 9, scope: !1045)
!1048 = !DILocation(line: 101, column: 5, scope: !1045)
!1049 = !DILocation(line: 102, column: 30, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 101, column: 31)
!1051 = distinct !DILexicalBlock(scope: !1046, file: !3, line: 101, column: 16)
!1052 = !DILocation(line: 103, column: 9, scope: !1050)
!1053 = !DILocation(line: 104, column: 5, scope: !1050)
!1054 = !DILocation(line: 105, column: 30, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1056, file: !3, line: 104, column: 31)
!1056 = distinct !DILexicalBlock(scope: !1051, file: !3, line: 104, column: 16)
!1057 = !DILocation(line: 106, column: 5, scope: !1055)
!1058 = !DILocation(line: 108, column: 1, scope: !1033)
!1059 = distinct !DISubprogram(name: "GPT_Stop", scope: !3, file: !3, line: 110, type: !1034, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1060)
!1060 = !{!1061}
!1061 = !DILocalVariable(name: "timerNum", arg: 1, scope: !1059, file: !3, line: 110, type: !60)
!1062 = !DILocation(line: 0, scope: !1059)
!1063 = !DILocation(line: 112, column: 9, scope: !1059)
!1064 = !DILocation(line: 113, column: 30, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 112, column: 24)
!1066 = distinct !DILexicalBlock(scope: !1059, file: !3, line: 112, column: 9)
!1067 = !DILocation(line: 114, column: 30, scope: !1065)
!1068 = !DILocation(line: 115, column: 31, scope: !1065)
!1069 = !DILocation(line: 117, column: 5, scope: !1065)
!1070 = !DILocation(line: 118, column: 30, scope: !1071)
!1071 = distinct !DILexicalBlock(scope: !1072, file: !3, line: 117, column: 31)
!1072 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 117, column: 16)
!1073 = !DILocation(line: 119, column: 30, scope: !1071)
!1074 = !DILocation(line: 120, column: 31, scope: !1071)
!1075 = !DILocation(line: 121, column: 5, scope: !1071)
!1076 = !DILocation(line: 122, column: 30, scope: !1077)
