; ModuleID = 'build/96b_meerkat96/subsys/zbus/hello_world/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.version_msg = type { i8, i8, i16 }
%struct.zbus_observer = type { i8*, i8, %struct.k_msgq*, void (%struct.zbus_channel*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/zbus/hello_world/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/zbus/hello_world")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/zbus/hello_world")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_mutex_version_chan", scope: !27, file: !114, line: 25, type: !141, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/hello_world/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/zbus/hello_world")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !106, !107, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !103, line: 46, baseType: !104)
!103 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !105)
!105 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112, !289, !291, !293, !295, !297, !299, !301, !303, !334, !338, !343, !348, !350, !352, !359, !364, !371, !376, !378}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "version_chan", scope: !27, file: !114, line: 25, type: !115, isLocal: false, isDefinition: true, align: 32)
!114 = !DIFile(filename: "zephyr/samples/subsys/zbus/hello_world/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !117, line: 29, size: 224, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !124, !128, !130, !131, !139, !258}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !117, line: 32, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !116, file: !117, line: 35, baseType: !125, size: 16, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !127)
!127 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !116, file: !117, line: 40, baseType: !129, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !116, file: !117, line: 45, baseType: !129, size: 32, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !116, file: !117, line: 51, baseType: !132, size: 32, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !13, !137}
!136 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !138, line: 214, baseType: !32)
!138 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !116, file: !117, line: 56, baseType: !140, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !142, line: 2720, size: 160, elements: !143)
!142 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !165, !256, !257}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !141, file: !142, line: 2722, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !146, line: 233, baseType: !147)
!146 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 231, size: 64, elements: !148)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !147, file: !146, line: 232, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !151, line: 48, baseType: !152)
!151 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !151, line: 37, size: 64, elements: !153)
!153 = !{!154, !160}
!154 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !151, line: 38, baseType: !155, size: 32)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !151, line: 38, size: 32, elements: !156)
!156 = !{!157, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !155, file: !151, line: 39, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !151, line: 40, baseType: !158, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !151, line: 42, baseType: !161, size: 32, offset: 32)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !151, line: 42, size: 32, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !161, file: !151, line: 43, baseType: !158, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !161, file: !151, line: 44, baseType: !158, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !141, file: !142, line: 2724, baseType: !166, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !168, line: 245, size: 896, elements: !169)
!168 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!169 = !{!170, !217, !230, !231, !232, !233, !251}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !167, file: !168, line: 247, baseType: !171, size: 384)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !168, line: 57, size: 384, elements: !172)
!172 = !{!173, !187, !189, !192, !193, !204, !205, !206}
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !168, line: 60, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !168, line: 60, size: 64, elements: !175)
!175 = !{!176, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !174, file: !168, line: 61, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !151, line: 49, baseType: !152)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !174, file: !168, line: 62, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !180, line: 49, size: 64, elements: !181)
!180 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = !{!182}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !179, file: !180, line: 50, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, elements: !185)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!185 = !{!186}
!186 = !DISubrange(count: 2)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !171, file: !168, line: 68, baseType: !188, size: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !171, file: !168, line: 71, baseType: !190, size: 8, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !191)
!191 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !171, file: !168, line: 74, baseType: !190, size: 8, offset: 104)
!193 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !168, line: 90, baseType: !194, size: 16, offset: 112)
!194 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !168, line: 90, size: 16, elements: !195)
!195 = !{!196, !203}
!196 = !DIDerivedType(tag: DW_TAG_member, scope: !194, file: !168, line: 91, baseType: !197, size: 16)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !194, file: !168, line: 91, size: 16, elements: !198)
!198 = !{!199, !202}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !197, file: !168, line: 96, baseType: !200, size: 8)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !201)
!201 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !197, file: !168, line: 97, baseType: !190, size: 8, offset: 8)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !194, file: !168, line: 100, baseType: !126, size: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !171, file: !168, line: 107, baseType: !108, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !171, file: !168, line: 127, baseType: !106, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !171, file: !168, line: 131, baseType: !207, size: 192, offset: 192)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !146, line: 244, size: 192, elements: !208)
!208 = !{!209, !210, !216}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !207, file: !146, line: 245, baseType: !177, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !207, file: !146, line: 246, baseType: !211, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !146, line: 242, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !207, file: !146, line: 249, baseType: !104, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !167, file: !168, line: 250, baseType: !218, size: 288, offset: 384)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !219, line: 25, size: 288, elements: !220)
!219 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!220 = !{!221, !222, !223, !224, !225, !226, !227, !228, !229}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !218, file: !219, line: 26, baseType: !108, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !218, file: !219, line: 27, baseType: !108, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !218, file: !219, line: 28, baseType: !108, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !218, file: !219, line: 29, baseType: !108, size: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !218, file: !219, line: 30, baseType: !108, size: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !218, file: !219, line: 31, baseType: !108, size: 32, offset: 160)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !218, file: !219, line: 32, baseType: !108, size: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !218, file: !219, line: 33, baseType: !108, size: 32, offset: 224)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !218, file: !219, line: 34, baseType: !108, size: 32, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !167, file: !168, line: 253, baseType: !106, size: 32, offset: 672)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !167, file: !168, line: 256, baseType: !145, size: 64, offset: 704)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !167, file: !168, line: 294, baseType: !107, size: 32, offset: 768)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !167, file: !168, line: 325, baseType: !234, size: 32, offset: 800)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !142, line: 5073, size: 160, elements: !236)
!236 = !{!237, !246, !247}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !235, file: !142, line: 5074, baseType: !238, size: 96)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !239, line: 56, size: 96, elements: !240)
!239 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!240 = !{!241, !244, !245}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !238, file: !239, line: 57, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !239, line: 57, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !238, file: !239, line: 58, baseType: !106, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !238, file: !239, line: 59, baseType: !137, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !235, file: !142, line: 5075, baseType: !145, size: 64, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !235, file: !142, line: 5076, baseType: !248, offset: 160)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!249 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!250 = !{}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !167, file: !168, line: 343, baseType: !252, size: 64, offset: 832)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !219, line: 60, size: 64, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !252, file: !219, line: 63, baseType: !108, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !252, file: !219, line: 66, baseType: !108, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !141, file: !142, line: 2727, baseType: !108, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !141, file: !142, line: 2730, baseType: !107, size: 32, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !116, file: !117, line: 67, baseType: !259, size: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !117, line: 85, size: 128, elements: !264)
!264 = !{!265, !266, !267, !283}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !263, file: !117, line: 88, baseType: !120, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !263, file: !117, line: 91, baseType: !136, size: 8, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !263, file: !117, line: 93, baseType: !268, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !142, line: 4204, size: 320, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !278, !279, !280, !281, !282}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !270, file: !142, line: 4206, baseType: !145, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !270, file: !142, line: 4208, baseType: !248, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !270, file: !142, line: 4210, baseType: !137, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !270, file: !142, line: 4212, baseType: !108, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !270, file: !142, line: 4214, baseType: !277, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !270, file: !142, line: 4216, baseType: !277, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !270, file: !142, line: 4218, baseType: !277, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !270, file: !142, line: 4220, baseType: !277, size: 32, offset: 224)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !270, file: !142, line: 4222, baseType: !108, size: 32, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !270, file: !142, line: 4227, baseType: !190, size: 8, offset: 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !263, file: !117, line: 96, baseType: !284, size: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "_zbus_mutex_acc_data_chan", scope: !27, file: !114, line: 35, type: !141, isLocal: true, isDefinition: true, align: 32)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "acc_data_chan", scope: !27, file: !114, line: 35, type: !115, isLocal: false, isDefinition: true, align: 32)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "_zbus_mutex_simple_chan", scope: !27, file: !114, line: 57, type: !141, isLocal: true, isDefinition: true, align: 32)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "simple_chan", scope: !27, file: !114, line: 57, type: !115, isLocal: false, isDefinition: true, align: 32)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "foo_lis", scope: !27, file: !114, line: 73, type: !263, isLocal: false, isDefinition: true, align: 32)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_bar_sub", scope: !27, file: !114, line: 75, type: !270, isLocal: false, isDefinition: true, align: 32)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "bar_sub", scope: !27, file: !114, line: 75, type: !263, isLocal: false, isDefinition: true, align: 32)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "_k_thread_data_subscriber_task_id", scope: !27, file: !114, line: 92, type: !305, isLocal: false, isDefinition: true, align: 32)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !142, line: 620, size: 384, elements: !306)
!306 = !{!307, !308, !316, !317, !322, !323, !324, !325, !326, !327, !329, !333}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !305, file: !142, line: 621, baseType: !166, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !305, file: !142, line: 622, baseType: !309, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !311, line: 44, baseType: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !313, line: 47, size: 8, elements: !314)
!313 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !312, file: !313, line: 48, baseType: !123, size: 8)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !305, file: !142, line: 623, baseType: !32, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !305, file: !142, line: 624, baseType: !318, size: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !311, line: 46, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !106, !106, !106}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !305, file: !142, line: 625, baseType: !106, size: 32, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !305, file: !142, line: 626, baseType: !106, size: 32, offset: 160)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !305, file: !142, line: 627, baseType: !106, size: 32, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !305, file: !142, line: 628, baseType: !107, size: 32, offset: 224)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !305, file: !142, line: 629, baseType: !108, size: 32, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !305, file: !142, line: 630, baseType: !328, size: 32, offset: 288)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !305, file: !142, line: 631, baseType: !330, size: 32, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!331 = !DISubroutineType(types: !332)
!332 = !{null}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !305, file: !142, line: 632, baseType: !121, size: 32, offset: 352)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "subscriber_task_id", scope: !27, file: !114, line: 92, type: !336, isLocal: false, isDefinition: true)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !168, line: 347, baseType: !166)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_bar_sub", scope: !27, file: !114, line: 75, type: !340, isLocal: true, isDefinition: true, align: 32)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 16)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "_k_thread_stack_subscriber_task_id", scope: !27, file: !114, line: 92, type: !345, isLocal: false, isDefinition: true, align: 64)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 4096, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 512)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "_k_thread_obj_subscriber_task_id", scope: !27, file: !114, line: 92, type: !167, isLocal: false, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !114, line: 95, type: !107, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "_zbus_message_version_chan", scope: !27, file: !114, line: 25, type: !354, isLocal: true, isDefinition: true)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "version_msg", file: !114, line: 13, size: 32, elements: !355)
!355 = !{!356, !357, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !354, file: !114, line: 14, baseType: !190, size: 8)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !354, file: !114, line: 15, baseType: !190, size: 8, offset: 8)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "build", scope: !354, file: !114, line: 16, baseType: !126, size: 16, offset: 16)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "_zbus_observers_version_chan", scope: !27, file: !114, line: 25, type: !361, isLocal: true, isDefinition: true)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 32, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 1)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "_zbus_message_acc_data_chan", scope: !27, file: !114, line: 35, type: !366, isLocal: true, isDefinition: true)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acc_msg", file: !114, line: 19, size: 96, elements: !367)
!367 = !{!368, !369, !370}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !366, file: !114, line: 20, baseType: !107, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !366, file: !114, line: 21, baseType: !107, size: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !366, file: !114, line: 22, baseType: !107, size: 32, offset: 64)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "_zbus_observers_acc_data_chan", scope: !27, file: !114, line: 35, type: !373, isLocal: true, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 96, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 3)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "_zbus_message_simple_chan", scope: !27, file: !114, line: 57, type: !107, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "_zbus_observers_simple_chan", scope: !27, file: !114, line: 57, type: !361, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !382, file: !397, line: 18, type: !398, isLocal: false, isDefinition: true)
!382 = distinct !DICompileUnit(language: DW_LANG_C99, file: !383, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !384, globals: !396, splitDebugInlining: false, nameTableKind: None)
!383 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/zbus/hello_world")
!384 = !{!22, !106, !24, !385, !387, !389, !137, !107, !390, !391, !393, !394, !277, !395, !126, !121}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!388 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!396 = !{!380}
!397 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !400, line: 16, size: 64, elements: !401)
!400 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!401 = !{!402, !403}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !399, file: !400, line: 17, baseType: !121, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !399, file: !400, line: 18, baseType: !190, size: 8, offset: 32)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "_char_out", scope: !406, file: !410, line: 54, type: !411, isLocal: false, isDefinition: true)
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !408, globals: !409, splitDebugInlining: false, nameTableKind: None)
!407 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/zbus/hello_world")
!408 = !{!106, !107}
!409 = !{!404}
!410 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = !DISubroutineType(types: !413)
!413 = !{!107, !107}
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !416, file: !830, line: 258, type: !831, isLocal: true, isDefinition: true, align: 32)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !418, retainedTypes: !701, globals: !829, splitDebugInlining: false, nameTableKind: None)
!417 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/zbus/hello_world")
!418 = !{!419, !451, !461, !510, !516, !637, !672}
!419 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !420, line: 54, baseType: !32, size: 32, elements: !421)
!420 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!421 = !{!422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450}
!422 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!423 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!424 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!425 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!426 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!427 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!428 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!429 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!430 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!431 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!432 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!433 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!434 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!435 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!436 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!437 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!438 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!439 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!440 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!441 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!442 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!443 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!444 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!445 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!446 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!447 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!448 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!449 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!450 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!451 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !420, line: 224, baseType: !32, size: 32, elements: !452)
!452 = !{!453, !454, !455, !456, !457, !458, !459, !460}
!453 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!454 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!455 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!456 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!457 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!458 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!459 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!460 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!461 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !420, line: 275, baseType: !32, size: 32, elements: !462)
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509}
!463 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!464 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!465 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!466 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!467 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!468 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!469 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!470 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!471 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!472 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!473 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!474 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!475 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!476 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!477 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!478 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!479 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!480 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!481 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!482 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!483 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!484 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!485 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!486 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!487 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!488 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!489 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!490 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!491 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!492 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!493 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!494 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!495 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!496 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!497 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!498 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!499 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!500 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!501 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!502 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!503 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!504 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!505 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!506 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!507 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!508 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!509 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!510 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !420, line: 327, baseType: !32, size: 32, elements: !511)
!511 = !{!512, !513, !514, !515}
!512 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!513 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!514 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!515 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!516 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !517, line: 76, baseType: !32, size: 32, elements: !518)
!517 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636}
!519 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!520 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!521 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!522 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!523 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!524 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!525 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!526 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!527 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!528 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!529 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!530 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!531 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!532 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!533 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!534 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!535 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!536 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!537 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!538 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!539 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!540 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!541 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!542 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!543 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!544 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!545 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!546 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!547 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!548 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!549 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!550 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!551 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!552 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!553 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!554 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!555 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!556 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!557 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!558 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!559 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!560 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!561 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!562 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!563 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!564 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!565 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!566 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!567 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!568 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!569 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!570 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!571 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!572 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!573 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!574 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!575 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!576 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!577 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!578 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!579 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!580 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!581 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!582 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!583 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!584 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!585 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!586 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!587 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!588 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!589 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!590 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!591 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!592 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!593 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!594 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!595 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!596 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!597 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!598 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!599 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!600 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!601 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!602 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!603 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!604 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!605 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!606 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!607 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!608 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!609 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!610 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!611 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!612 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!613 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!614 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!615 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!616 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!617 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!618 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!619 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!620 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!621 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!622 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!623 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!624 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!625 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!626 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!627 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!628 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!629 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!630 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!631 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!632 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!633 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!634 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!635 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!636 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!637 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !420, line: 237, baseType: !32, size: 32, elements: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!639 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!640 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!641 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!642 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!643 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!644 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!645 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!646 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!647 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!648 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!649 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!650 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!651 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!652 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!653 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!654 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!655 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!656 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!657 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!658 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!659 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!660 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!661 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!662 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!663 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!664 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!665 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!666 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!667 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!668 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!669 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!670 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!671 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!672 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !517, line: 44, baseType: !32, size: 32, elements: !673)
!673 = !{!674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700}
!674 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!675 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!676 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!677 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!678 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!679 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!680 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!681 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!682 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!683 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!684 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!685 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!686 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!687 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!688 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!689 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!690 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!691 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!692 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!693 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!694 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!695 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!696 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!697 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!698 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!699 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!700 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!701 = !{!702, !774, !817, !828, !108}
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !704, line: 4575, baseType: !705)
!704 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !704, line: 4532, size: 390144, elements: !706)
!706 = !{!707, !709, !710, !711, !712, !716, !726, !730, !740, !744}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !705, file: !704, line: 4533, baseType: !708, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !705, file: !704, line: 4534, baseType: !708, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !705, file: !704, line: 4535, baseType: !708, size: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !705, file: !704, line: 4536, baseType: !708, size: 32, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !705, file: !704, line: 4537, baseType: !713, size: 16256, offset: 128)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 16256, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 2032)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !705, file: !704, line: 4543, baseType: !717, size: 4224, offset: 16384)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !718, size: 4224, elements: !724)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !705, file: !704, line: 4538, size: 128, elements: !719)
!719 = !{!720, !721, !722, !723}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !718, file: !704, line: 4539, baseType: !708, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_SET", scope: !718, file: !704, line: 4540, baseType: !708, size: 32, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_CLR", scope: !718, file: !704, line: 4541, baseType: !708, size: 32, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_TOG", scope: !718, file: !704, line: 4542, baseType: !708, size: 32, offset: 96)
!724 = !{!725}
!725 = !DISubrange(count: 33)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !705, file: !704, line: 4544, baseType: !727, size: 110464, offset: 20608)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 110464, elements: !728)
!728 = !{!729}
!729 = !DISubrange(count: 13808)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !705, file: !704, line: 4550, baseType: !731, size: 24448, offset: 131072)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !732, size: 24448, elements: !738)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !705, file: !704, line: 4545, size: 128, elements: !733)
!733 = !{!734, !735, !736, !737}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !732, file: !704, line: 4546, baseType: !708, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_SET", scope: !732, file: !704, line: 4547, baseType: !708, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_CLR", scope: !732, file: !704, line: 4548, baseType: !708, size: 32, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_TOG", scope: !732, file: !704, line: 4549, baseType: !708, size: 32, offset: 96)
!738 = !{!739}
!739 = !DISubrange(count: 191)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !705, file: !704, line: 4551, baseType: !741, size: 106624, offset: 155520)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 106624, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 13328)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !705, file: !704, line: 4574, baseType: !745, size: 128000, offset: 262144)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 128000, elements: !772)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !705, file: !704, line: 4552, size: 1024, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !768, !769, !770, !771}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT", scope: !746, file: !704, line: 4553, baseType: !708, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_SET", scope: !746, file: !704, line: 4554, baseType: !708, size: 32, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_CLR", scope: !746, file: !704, line: 4555, baseType: !708, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_TOG", scope: !746, file: !704, line: 4556, baseType: !708, size: 32, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "MISC", scope: !746, file: !704, line: 4557, baseType: !708, size: 32, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_SET", scope: !746, file: !704, line: 4558, baseType: !708, size: 32, offset: 160)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_CLR", scope: !746, file: !704, line: 4559, baseType: !708, size: 32, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_TOG", scope: !746, file: !704, line: 4560, baseType: !708, size: 32, offset: 224)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "POST", scope: !746, file: !704, line: 4561, baseType: !708, size: 32, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_SET", scope: !746, file: !704, line: 4562, baseType: !708, size: 32, offset: 288)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_CLR", scope: !746, file: !704, line: 4563, baseType: !708, size: 32, offset: 320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_TOG", scope: !746, file: !704, line: 4564, baseType: !708, size: 32, offset: 352)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "PRE", scope: !746, file: !704, line: 4565, baseType: !708, size: 32, offset: 384)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_SET", scope: !746, file: !704, line: 4566, baseType: !708, size: 32, offset: 416)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_CLR", scope: !746, file: !704, line: 4567, baseType: !708, size: 32, offset: 448)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_TOG", scope: !746, file: !704, line: 4568, baseType: !708, size: 32, offset: 480)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !746, file: !704, line: 4569, baseType: !765, size: 384, offset: 512)
!765 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 384, elements: !766)
!766 = !{!767}
!767 = !DISubrange(count: 48)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL", scope: !746, file: !704, line: 4570, baseType: !708, size: 32, offset: 896)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_SET", scope: !746, file: !704, line: 4571, baseType: !708, size: 32, offset: 928)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_CLR", scope: !746, file: !704, line: 4572, baseType: !708, size: 32, offset: 960)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !746, file: !704, line: 4573, baseType: !708, size: 32, offset: 992)
!772 = !{!773}
!773 = !DISubrange(count: 125)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDC_Type", file: !704, line: 38320, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !704, line: 38303, size: 23040, elements: !777)
!777 = !{!778, !780, !784, !785, !786, !787, !791, !795, !799, !803, !807}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "VIR", scope: !776, file: !704, line: 38304, baseType: !779, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !776, file: !704, line: 38305, baseType: !781, size: 256, offset: 32)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 256, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "STAT", scope: !776, file: !704, line: 38306, baseType: !708, size: 32, offset: 288)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "INTCTRL", scope: !776, file: !704, line: 38307, baseType: !708, size: 32, offset: 320)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "INTSTAT", scope: !776, file: !704, line: 38308, baseType: !708, size: 32, offset: 352)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !776, file: !704, line: 38309, baseType: !788, size: 3712, offset: 384)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 3712, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 464)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "MDA", scope: !776, file: !704, line: 38310, baseType: !792, size: 864, offset: 4096)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 864, elements: !793)
!793 = !{!794}
!794 = !DISubrange(count: 27)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !776, file: !704, line: 38311, baseType: !796, size: 3232, offset: 4960)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 3232, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 404)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "PDAP", scope: !776, file: !704, line: 38312, baseType: !800, size: 3776, offset: 8192)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 3776, elements: !801)
!801 = !{!802}
!802 = !DISubrange(count: 118)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_3", scope: !776, file: !704, line: 38313, baseType: !804, size: 4416, offset: 11968)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !190, size: 4416, elements: !805)
!805 = !{!806}
!806 = !DISubrange(count: 552)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "MR", scope: !776, file: !704, line: 38319, baseType: !808, size: 6656, offset: 16384)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !809, size: 6656, elements: !815)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !776, file: !704, line: 38314, size: 128, elements: !810)
!810 = !{!811, !812, !813, !814}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "MRSA", scope: !809, file: !704, line: 38315, baseType: !708, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "MREA", scope: !809, file: !704, line: 38316, baseType: !708, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "MRC", scope: !809, file: !704, line: 38317, baseType: !708, size: 32, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "MRVS", scope: !809, file: !704, line: 38318, baseType: !708, size: 32, offset: 96)
!815 = !{!816}
!816 = !DISubrange(count: 52)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "WDOG_Type", file: !704, line: 43319, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !704, line: 43313, size: 80, elements: !820)
!820 = !{!821, !823, !824, !826, !827}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "WCR", scope: !819, file: !704, line: 43314, baseType: !822, size: 16)
!822 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !126)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "WSR", scope: !819, file: !704, line: 43315, baseType: !822, size: 16, offset: 16)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "WRSR", scope: !819, file: !704, line: 43316, baseType: !825, size: 16, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "WICR", scope: !819, file: !704, line: 43317, baseType: !822, size: 16, offset: 48)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "WMCR", scope: !819, file: !704, line: 43318, baseType: !822, size: 16, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 32)
!829 = !{!414}
!830 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !833, line: 51, size: 64, elements: !834)
!833 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!834 = !{!835, !842}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !832, file: !833, line: 60, baseType: !836, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!837 = !DISubroutineType(types: !838)
!838 = !{!107, !839}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !841)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !833, line: 48, flags: DIFlagFwdDecl)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !832, file: !833, line: 65, baseType: !839, size: 32, offset: 32)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !845, file: !852, line: 21, type: !411, isLocal: true, isDefinition: true)
!845 = distinct !DICompileUnit(language: DW_LANG_C99, file: !846, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !847, globals: !851, splitDebugInlining: false, nameTableKind: None)
!846 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/zbus/hello_world")
!847 = !{!848, !107, !106}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !850, line: 22, baseType: !107)
!850 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!851 = !{!843}
!852 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "log_const_zbus", scope: !855, file: !859, line: 10, type: !860, isLocal: false, isDefinition: true)
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !857, globals: !858, splitDebugInlining: false, nameTableKind: None)
!856 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/zbus/hello_world")
!857 = !{!102, !106, !107}
!858 = !{!853}
!859 = !DIFile(filename: "zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!860 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !861)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !400, line: 16, size: 64, elements: !862)
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !861, file: !400, line: 17, baseType: !121, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !861, file: !400, line: 18, baseType: !190, size: 8, offset: 32)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !867, file: !963, line: 603, type: !965, isLocal: true, isDefinition: true, align: 32)
!867 = distinct !DICompileUnit(language: DW_LANG_C99, file: !868, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !869, globals: !960, splitDebugInlining: false, nameTableKind: None)
!868 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/zbus/hello_world")
!869 = !{!106, !107, !870}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !873, line: 336, size: 608, elements: !874)
!873 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!874 = !{!875, !901, !905, !909, !922, !927, !933, !938, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !872, file: !873, line: 365, baseType: !876, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 32)
!877 = !DISubroutineType(types: !878)
!878 = !{!107, !879, !900}
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !882, line: 378, size: 192, elements: !883)
!882 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!883 = !{!884, !885, !886, !887, !893, !894}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !881, file: !882, line: 380, baseType: !121, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !881, file: !882, line: 382, baseType: !13, size: 32, offset: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !881, file: !882, line: 384, baseType: !13, size: 32, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !881, file: !882, line: 386, baseType: !888, size: 32, offset: 96)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !882, line: 351, size: 16, elements: !890)
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !889, file: !882, line: 359, baseType: !190, size: 8)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !889, file: !882, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !881, file: !882, line: 388, baseType: !106, size: 32, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !881, file: !882, line: 396, baseType: !895, size: 32, offset: 160)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !882, line: 43, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !899)
!899 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !872, file: !873, line: 366, baseType: !902, size: 32, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !879, !191}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !872, file: !873, line: 374, baseType: !906, size: 32, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 32)
!907 = !DISubroutineType(types: !908)
!908 = !{!107, !879}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !872, file: !873, line: 377, baseType: !910, size: 32, offset: 96)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = !DISubroutineType(types: !912)
!912 = !{!107, !879, !913}
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !873, line: 122, size: 64, elements: !916)
!916 = !{!917, !918, !919, !920, !921}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !915, file: !873, line: 123, baseType: !108, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !915, file: !873, line: 124, baseType: !190, size: 8, offset: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !915, file: !873, line: 125, baseType: !190, size: 8, offset: 40)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !915, file: !873, line: 126, baseType: !190, size: 8, offset: 48)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !915, file: !873, line: 127, baseType: !190, size: 8, offset: 56)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !872, file: !873, line: 379, baseType: !923, size: 32, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 32)
!924 = !DISubroutineType(types: !925)
!925 = !{!107, !879, !926}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !872, file: !873, line: 384, baseType: !928, size: 32, offset: 160)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 32)
!929 = !DISubroutineType(types: !930)
!930 = !{!107, !879, !931, !107}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !872, file: !873, line: 393, baseType: !934, size: 32, offset: 192)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DISubroutineType(types: !936)
!936 = !{!107, !879, !395, !937}
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !872, file: !873, line: 402, baseType: !939, size: 32, offset: 224)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !879}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !872, file: !873, line: 405, baseType: !939, size: 32, offset: 256)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !872, file: !873, line: 408, baseType: !906, size: 32, offset: 288)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !872, file: !873, line: 411, baseType: !939, size: 32, offset: 320)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !872, file: !873, line: 414, baseType: !939, size: 32, offset: 352)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !872, file: !873, line: 417, baseType: !906, size: 32, offset: 384)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !872, file: !873, line: 420, baseType: !906, size: 32, offset: 416)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !872, file: !873, line: 423, baseType: !939, size: 32, offset: 448)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !872, file: !873, line: 426, baseType: !939, size: 32, offset: 480)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !872, file: !873, line: 429, baseType: !906, size: 32, offset: 512)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !872, file: !873, line: 432, baseType: !906, size: 32, offset: 544)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !872, file: !873, line: 435, baseType: !953, size: 32, offset: 576)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 32)
!954 = !DISubroutineType(types: !955)
!955 = !{null, !879, !956, !106}
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !873, line: 142, baseType: !957)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !879, !106}
!960 = !{!865, !961}
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !867, file: !963, line: 38, type: !964, isLocal: true, isDefinition: true)
!963 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !879)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !833, line: 51, size: 64, elements: !967)
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !966, file: !833, line: 60, baseType: !906, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !966, file: !833, line: 65, baseType: !879, size: 32, offset: 32)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "mcux_igpio_pinmux_0", scope: !972, file: !1076, line: 318, type: !1152, isLocal: false, isDefinition: true)
!972 = distinct !DICompileUnit(language: DW_LANG_C99, file: !973, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !974, retainedTypes: !991, globals: !1073, splitDebugInlining: false, nameTableKind: None)
!973 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/zbus/hello_world")
!974 = !{!975, !981, !986}
!975 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !976, line: 506, baseType: !32, size: 32, elements: !977)
!976 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!977 = !{!978, !979, !980}
!978 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!979 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!980 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!981 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !976, line: 512, baseType: !32, size: 32, elements: !982)
!982 = !{!983, !984, !985}
!983 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!984 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!985 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!986 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_gpio_pin_action", file: !987, line: 66, baseType: !32, size: 32, elements: !988)
!987 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./gpio_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!988 = !{!989, !990}
!989 = !DIEnumerator(name: "gpioPinClear", value: 0)
!990 = !DIEnumerator(name: "gpioPinSet", value: 1)
!991 = !{!992, !1062, !1067, !1027, !981, !975, !1072, !106, !828, !1042, !277}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !976, line: 523, size: 288, elements: !995)
!995 = !{!996, !1017, !1023, !1028, !1032, !1033, !1034, !1038, !1058}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !994, file: !976, line: 524, baseType: !997, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 32)
!998 = !DISubroutineType(types: !999)
!999 = !{!107, !1000, !1015, !1016}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !882, line: 378, size: 192, elements: !1003)
!1003 = !{!1004, !1005, !1006, !1007, !1013, !1014}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1002, file: !882, line: 380, baseType: !121, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1002, file: !882, line: 382, baseType: !13, size: 32, offset: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1002, file: !882, line: 384, baseType: !13, size: 32, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1002, file: !882, line: 386, baseType: !1008, size: 32, offset: 96)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 32)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !882, line: 351, size: 16, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1009, file: !882, line: 359, baseType: !190, size: 8)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1009, file: !882, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1002, file: !882, line: 388, baseType: !106, size: 32, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1002, file: !882, line: 396, baseType: !895, size: 32, offset: 160)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !976, line: 237, baseType: !190)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !976, line: 257, baseType: !108)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !994, file: !976, line: 530, baseType: !1018, size: 32, offset: 32)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 32)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!107, !1000, !1021}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !976, line: 229, baseType: !108)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !994, file: !976, line: 532, baseType: !1024, size: 32, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 32)
!1025 = !DISubroutineType(types: !1026)
!1026 = !{!107, !1000, !1027, !1022}
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !976, line: 216, baseType: !108)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !994, file: !976, line: 535, baseType: !1029, size: 32, offset: 96)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 32)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!107, !1000, !1027}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !994, file: !976, line: 537, baseType: !1029, size: 32, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !994, file: !976, line: 539, baseType: !1029, size: 32, offset: 160)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !994, file: !976, line: 541, baseType: !1035, size: 32, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 32)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!107, !1000, !1015, !975, !981}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !994, file: !976, line: 544, baseType: !1039, size: 32, offset: 224)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 32)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!107, !1000, !1042, !136}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 32)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !976, line: 478, size: 96, elements: !1044)
!1044 = !{!1045, !1052, !1057}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1043, file: !976, line: 482, baseType: !1046, size: 32)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !1047, line: 33, baseType: !1048)
!1047 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !1047, line: 29, size: 32, elements: !1049)
!1049 = !{!1050}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1048, file: !1047, line: 30, baseType: !1051, size: 32)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 32)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1043, file: !976, line: 485, baseType: !1053, size: 32, offset: 32)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !976, line: 464, baseType: !1054)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 32)
!1055 = !DISubroutineType(types: !1056)
!1056 = !{null, !1000, !1042, !1027}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !1043, file: !976, line: 493, baseType: !1027, size: 32, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !994, file: !976, line: 547, baseType: !1059, size: 32, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 32)
!1060 = !DISubroutineType(types: !1061)
!1061 = !{!108, !1000}
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 32)
!1063 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !976, line: 428, size: 32, elements: !1065)
!1065 = !{!1066}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !1064, file: !976, line: 434, baseType: !1027, size: 32)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 32)
!1068 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1069)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !976, line: 441, size: 32, elements: !1070)
!1070 = !{!1071}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1069, file: !976, line: 447, baseType: !1027, size: 32)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 32)
!1073 = !{!970, !1074, !1080, !1082, !1092, !1104, !1106, !1137, !1139, !1150}
!1074 = !DIGlobalVariableExpression(var: !1075, expr: !DIExpression())
!1075 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !972, file: !1076, line: 318, type: !1077, isLocal: false, isDefinition: true, align: 16)
!1076 = !DIFile(filename: "zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 400, elements: !1078)
!1078 = !{!1079}
!1079 = !DISubrange(count: 25)
!1080 = !DIGlobalVariableExpression(var: !1081, expr: !DIExpression())
!1081 = distinct !DIGlobalVariable(name: "__device_dts_ord_25", scope: !972, file: !1076, line: 318, type: !1001, isLocal: false, isDefinition: true, align: 32)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_25", scope: !972, file: !1076, line: 318, type: !1084, isLocal: true, isDefinition: true, align: 32)
!1084 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !833, line: 51, size: 64, elements: !1086)
!1086 = !{!1087, !1091}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1085, file: !833, line: 60, baseType: !1088, size: 32)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 32)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{!107, !1000}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1085, file: !833, line: 65, baseType: !1000, size: 32, offset: 32)
!1092 = !DIGlobalVariableExpression(var: !1093, expr: !DIExpression())
!1093 = distinct !DIGlobalVariable(name: "imx_gpio_0_data", scope: !972, file: !1076, line: 318, type: !1094, isLocal: true, isDefinition: true)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_data", file: !1076, line: 33, size: 96, elements: !1095)
!1095 = !{!1096, !1097}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1094, file: !1076, line: 35, baseType: !1069, size: 32)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !1094, file: !1076, line: 37, baseType: !1098, size: 64, offset: 32)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !1047, line: 40, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !1047, line: 35, size: 64, elements: !1100)
!1100 = !{!1101, !1103}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1099, file: !1047, line: 36, baseType: !1102, size: 32)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 32)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1099, file: !1047, line: 37, baseType: !1102, size: 32, offset: 32)
!1104 = !DIGlobalVariableExpression(var: !1105, expr: !DIExpression())
!1105 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_25", scope: !972, file: !1076, line: 318, type: !1009, isLocal: true, isDefinition: true, align: 8)
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(name: "imx_gpio_0_config", scope: !972, file: !1076, line: 318, type: !1108, isLocal: true, isDefinition: true)
!1108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_config", file: !1076, line: 23, size: 128, elements: !1110)
!1110 = !{!1111, !1112, !1125, !1136}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1109, file: !1076, line: 25, baseType: !1064, size: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1109, file: !1076, line: 26, baseType: !1113, size: 32, offset: 32)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 32)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_Type", file: !704, line: 19729, baseType: !1115)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !704, line: 19720, size: 256, elements: !1116)
!1116 = !{!1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !1115, file: !704, line: 19721, baseType: !708, size: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "GDIR", scope: !1115, file: !704, line: 19722, baseType: !708, size: 32, offset: 32)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "PSR", scope: !1115, file: !704, line: 19723, baseType: !779, size: 32, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "ICR1", scope: !1115, file: !704, line: 19724, baseType: !708, size: 32, offset: 96)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "ICR2", scope: !1115, file: !704, line: 19725, baseType: !708, size: 32, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !1115, file: !704, line: 19726, baseType: !708, size: 32, offset: 160)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ISR", scope: !1115, file: !704, line: 19727, baseType: !708, size: 32, offset: 192)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "EDGE_SEL", scope: !1115, file: !704, line: 19728, baseType: !708, size: 32, offset: 224)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "pin_muxes", scope: !1109, file: !1076, line: 28, baseType: !1126, size: 32, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 32)
!1127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1128)
