; ModuleID = 'build/arduino_mkrzero/kernel/metairq_dispatch/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.k_spinlock] }
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct._static_thread_data = type { %struct.k_thread*, %struct.z_thread_stack_element*, i32, void (i8*, i8*, i8*)*, i8*, i8*, i8*, i32, i32, i32, void ()*, i8* }
%struct.k_sem = type { %union.anon, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/kernel/metairq_dispatch/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/kernel/metairq_dispatch")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/kernel/metairq_dispatch")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !120, line: 10, type: !340, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !117, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/metairq_dispatch/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/kernel/metairq_dispatch")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !104, !105, !106, !107, !111, !113, !114, !116}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!106 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !108, line: 46, baseType: !109)
!108 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !110)
!110 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !112, line: 214, baseType: !32)
!112 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !115)
!115 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !105)
!117 = !{!25, !118, !265, !269, !276, !309, !314, !318, !320}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "_k_thread_data_metairq_thread", scope: !27, file: !120, line: 28, type: !121, isLocal: false, isDefinition: true, align: 32)
!120 = !DIFile(filename: "zephyr/samples/kernel/metairq_dispatch/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !122, line: 620, size: 384, elements: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = !{!124, !238, !246, !247, !252, !253, !254, !255, !256, !257, !258, !262}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !121, file: !122, line: 621, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !127, line: 245, size: 896, elements: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !{!129, !198, !211, !212, !213, !214, !233}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !126, file: !127, line: 247, baseType: !130, size: 384)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !127, line: 57, size: 384, elements: !131)
!131 = !{!132, !160, !168, !171, !172, !185, !186, !187}
!132 = !DIDerivedType(tag: DW_TAG_member, scope: !130, file: !127, line: 60, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !127, line: 60, size: 64, elements: !134)
!134 = !{!135, !151}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !133, file: !127, line: 61, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !137, line: 49, baseType: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !137, line: 37, size: 64, elements: !139)
!139 = !{!140, !146}
!140 = !DIDerivedType(tag: DW_TAG_member, scope: !138, file: !137, line: 38, baseType: !141, size: 32)
!141 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !138, file: !137, line: 38, size: 32, elements: !142)
!142 = !{!143, !145}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !141, file: !137, line: 39, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !137, line: 40, baseType: !144, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, scope: !138, file: !137, line: 42, baseType: !147, size: 32, offset: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !138, file: !137, line: 42, size: 32, elements: !148)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !147, file: !137, line: 43, baseType: !144, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !147, file: !137, line: 44, baseType: !144, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !133, file: !127, line: 62, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !153, line: 49, size: 64, elements: !154)
!153 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !152, file: !153, line: 50, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 64, elements: !158)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!158 = !{!159}
!159 = !DISubrange(count: 2)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !130, file: !127, line: 68, baseType: !161, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !163, line: 233, baseType: !164)
!163 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !163, line: 231, size: 64, elements: !165)
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !164, file: !163, line: 232, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !137, line: 48, baseType: !138)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !130, file: !127, line: 71, baseType: !169, size: 8, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !170)
!170 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !130, file: !127, line: 74, baseType: !169, size: 8, offset: 104)
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !130, file: !127, line: 90, baseType: !173, size: 16, offset: 112)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !127, line: 90, size: 16, elements: !174)
!174 = !{!175, !182}
!175 = !DIDerivedType(tag: DW_TAG_member, scope: !173, file: !127, line: 91, baseType: !176, size: 16)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !173, file: !127, line: 91, size: 16, elements: !177)
!177 = !{!178, !181}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !176, file: !127, line: 96, baseType: !179, size: 8)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !180)
!180 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !176, file: !127, line: 97, baseType: !169, size: 8, offset: 8)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !173, file: !127, line: 100, baseType: !183, size: 16)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !184)
!184 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !130, file: !127, line: 107, baseType: !113, size: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !130, file: !127, line: 127, baseType: !104, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !130, file: !127, line: 131, baseType: !188, size: 192, offset: 192)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !163, line: 244, size: 192, elements: !189)
!189 = !{!190, !191, !197}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !188, file: !163, line: 245, baseType: !136, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !188, file: !163, line: 246, baseType: !192, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !163, line: 242, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !188, file: !163, line: 249, baseType: !109, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !126, file: !127, line: 250, baseType: !199, size: 288, offset: 384)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !200, line: 25, size: 288, elements: !201)
!200 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !199, file: !200, line: 26, baseType: !113, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !199, file: !200, line: 27, baseType: !113, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !199, file: !200, line: 28, baseType: !113, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !199, file: !200, line: 29, baseType: !113, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !199, file: !200, line: 30, baseType: !113, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !199, file: !200, line: 31, baseType: !113, size: 32, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !199, file: !200, line: 32, baseType: !113, size: 32, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !199, file: !200, line: 33, baseType: !113, size: 32, offset: 224)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !199, file: !200, line: 34, baseType: !113, size: 32, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !126, file: !127, line: 253, baseType: !104, size: 32, offset: 672)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !126, file: !127, line: 256, baseType: !162, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !126, file: !127, line: 294, baseType: !105, size: 32, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !126, file: !127, line: 325, baseType: !215, size: 32, offset: 800)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !122, line: 5073, size: 192, elements: !217)
!217 = !{!218, !227, !228}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !216, file: !122, line: 5074, baseType: !219, size: 96)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !220, line: 56, size: 96, elements: !221)
!220 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!221 = !{!222, !225, !226}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !219, file: !220, line: 57, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !220, line: 57, flags: DIFlagFwdDecl)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !219, file: !220, line: 58, baseType: !104, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !219, file: !220, line: 59, baseType: !111, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !216, file: !122, line: 5075, baseType: !162, size: 64, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !216, file: !122, line: 5076, baseType: !229, size: 32, offset: 160)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !230, line: 43, size: 32, elements: !231)
!230 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = !{!232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !229, file: !230, line: 52, baseType: !22, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !126, file: !127, line: 343, baseType: !234, size: 64, offset: 832)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !200, line: 60, size: 64, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !234, file: !200, line: 63, baseType: !113, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !234, file: !200, line: 66, baseType: !113, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !121, file: !122, line: 622, baseType: !239, size: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !241, line: 44, baseType: !242)
!241 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !243, line: 47, size: 8, elements: !244)
!243 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!244 = !{!245}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !242, file: !243, line: 48, baseType: !103, size: 8)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !121, file: !122, line: 623, baseType: !32, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !121, file: !122, line: 624, baseType: !248, size: 32, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !241, line: 46, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DISubroutineType(types: !251)
!251 = !{null, !104, !104, !104}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !121, file: !122, line: 625, baseType: !104, size: 32, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !121, file: !122, line: 626, baseType: !104, size: 32, offset: 160)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !121, file: !122, line: 627, baseType: !104, size: 32, offset: 192)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !121, file: !122, line: 628, baseType: !105, size: 32, offset: 224)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !121, file: !122, line: 629, baseType: !113, size: 32, offset: 256)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !121, file: !122, line: 630, baseType: !116, size: 32, offset: 288)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !121, file: !122, line: 631, baseType: !259, size: 32, offset: 320)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DISubroutineType(types: !261)
!261 = !{null}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !121, file: !122, line: 632, baseType: !263, size: 32, offset: 352)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "metairq_thread", scope: !27, file: !120, line: 28, type: !267, isLocal: false, isDefinition: true)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !127, line: 347, baseType: !125)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "report_cookie", scope: !27, file: !120, line: 46, type: !271, isLocal: false, isDefinition: true, align: 32)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !122, line: 2909, size: 128, elements: !272)
!272 = !{!273, !274, !275}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !271, file: !122, line: 2910, baseType: !162, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !271, file: !122, line: 2911, baseType: !32, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !271, file: !122, line: 2912, baseType: !32, size: 32, offset: 96)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "threads", scope: !27, file: !120, line: 22, type: !278, isLocal: true, isDefinition: true)
!278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !279, size: 15360, elements: !307)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_rec", file: !120, line: 18, size: 3840, elements: !280)
!280 = !{!281, !282, !295}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !279, file: !120, line: 19, baseType: !126, size: 896)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "msgq", scope: !279, file: !120, line: 20, baseType: !283, size: 352, offset: 896)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !122, line: 4204, size: 352, elements: !284)
!284 = !{!285, !286, !287, !288, !289, !290, !291, !292, !293, !294}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !283, file: !122, line: 4206, baseType: !162, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !283, file: !122, line: 4208, baseType: !229, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !283, file: !122, line: 4210, baseType: !111, size: 32, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !283, file: !122, line: 4212, baseType: !113, size: 32, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !283, file: !122, line: 4214, baseType: !102, size: 32, offset: 160)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !283, file: !122, line: 4216, baseType: !102, size: 32, offset: 192)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !283, file: !122, line: 4218, baseType: !102, size: 32, offset: 224)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !283, file: !122, line: 4220, baseType: !102, size: 32, offset: 256)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !283, file: !122, line: 4222, baseType: !113, size: 32, offset: 288)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !283, file: !122, line: 4227, baseType: !169, size: 8, offset: 320)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "msgq_buf", scope: !279, file: !120, line: 21, baseType: !296, size: 2560, offset: 1248)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 2560, elements: !305)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msg", file: !298, line: 44, size: 160, elements: !299)
!298 = !DIFile(filename: "zephyr/samples/kernel/metairq_dispatch/src/msgdev.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!299 = !{!300, !301, !302, !303, !304}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !297, file: !298, line: 46, baseType: !113, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !297, file: !298, line: 49, baseType: !113, size: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !297, file: !298, line: 52, baseType: !113, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "proc_cyc", scope: !297, file: !298, line: 55, baseType: !113, size: 32, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "metairq_latency", scope: !297, file: !298, line: 58, baseType: !113, size: 32, offset: 128)
!305 = !{!306}
!306 = !DISubrange(count: 16)
!307 = !{!308}
!308 = !DISubrange(count: 4)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "thread_stacks", scope: !27, file: !120, line: 24, type: !311, isLocal: false, isDefinition: true, align: 64)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 65536, elements: !312)
!312 = !{!308, !313}
!313 = !DISubrange(count: 2048)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "_k_thread_stack_metairq_thread", scope: !27, file: !120, line: 28, type: !316, isLocal: false, isDefinition: true, align: 64)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 16384, elements: !317)
!317 = !{!313}
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "_k_thread_obj_metairq_thread", scope: !27, file: !120, line: 28, type: !126, isLocal: false, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "stats", scope: !27, file: !120, line: 41, type: !322, isLocal: false, isDefinition: true)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 34, size: 4000, elements: !323)
!323 = !{!324, !327, !331}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "num_mirq", scope: !322, file: !120, line: 35, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !326, line: 22, baseType: !106)
!326 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!327 = !DIDerivedType(tag: DW_TAG_member, name: "mirq_latencies", scope: !322, file: !120, line: 36, baseType: !328, size: 1280, offset: 32)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 1280, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 40)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !322, file: !120, line: 40, baseType: !332, size: 2688, offset: 1312)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 2688, elements: !307)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !322, file: !120, line: 37, size: 672, elements: !334)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "nevt", scope: !333, file: !120, line: 38, baseType: !113, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "latencies", scope: !333, file: !120, line: 39, baseType: !337, size: 640, offset: 32)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 640, elements: !338)
!338 = !{!339}
!339 = !DISubrange(count: 20)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !341)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !342, line: 16, size: 64, elements: !343)
!342 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!343 = !{!344, !345}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !341, file: !342, line: 17, baseType: !263, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !341, file: !342, line: 18, baseType: !169, size: 8, offset: 32)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "hw_msgs", scope: !348, file: !354, line: 27, type: !392, isLocal: false, isDefinition: true, align: 32)
!348 = distinct !DICompileUnit(language: DW_LANG_C99, file: !349, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !350, globals: !351, splitDebugInlining: false, nameTableKind: None)
!349 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/metairq_dispatch/src/msgdev.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/kernel/metairq_dispatch")
!350 = !{!107, !104, !105, !113, !114}
!351 = !{!346, !352, !379, !381, !383, !386}
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "timeout", scope: !348, file: !354, line: 17, type: !355, isLocal: true, isDefinition: true)
!354 = !DIFile(filename: "zephyr/samples/kernel/metairq_dispatch/src/msgdev.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !163, line: 244, size: 192, elements: !356)
!356 = !{!357, !372, !378}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !355, file: !163, line: 245, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !137, line: 49, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !137, line: 37, size: 64, elements: !360)
!360 = !{!361, !367}
!361 = !DIDerivedType(tag: DW_TAG_member, scope: !359, file: !137, line: 38, baseType: !362, size: 32)
!362 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !359, file: !137, line: 38, size: 32, elements: !363)
!363 = !{!364, !366}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !362, file: !137, line: 39, baseType: !365, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !362, file: !137, line: 40, baseType: !365, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, scope: !359, file: !137, line: 42, baseType: !368, size: 32, offset: 32)
!368 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !359, file: !137, line: 42, size: 32, elements: !369)
!369 = !{!370, !371}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !368, file: !137, line: 43, baseType: !365, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !368, file: !137, line: 44, baseType: !365, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !355, file: !163, line: 246, baseType: !373, size: 32, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !163, line: 242, baseType: !374)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 32)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !377}
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !355, file: !163, line: 249, baseType: !109, size: 64, offset: 128)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "max_duty_cyc", scope: !348, file: !354, line: 23, type: !113, isLocal: false, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "msg_seq", scope: !348, file: !354, line: 25, type: !113, isLocal: false, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "_k_fifo_buf_hw_msgs", scope: !348, file: !354, line: 27, type: !385, isLocal: true, isDefinition: true, align: 32)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 320, elements: !329)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "state", scope: !388, file: !354, line: 38, type: !114, isLocal: true, isDefinition: true)
!388 = distinct !DISubprogram(name: "rand32", scope: !354, file: !354, line: 36, type: !389, scopeLine: 37, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !348, retainedNodes: !391)
!389 = !DISubroutineType(types: !390)
!390 = !{!113}
!391 = !{}
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !122, line: 4204, size: 352, elements: !393)
!393 = !{!394, !400, !404, !405, !406, !407, !408, !409, !410, !411}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !392, file: !122, line: 4206, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !163, line: 233, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !163, line: 231, size: 64, elements: !397)
!397 = !{!398}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !396, file: !163, line: 232, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !137, line: 48, baseType: !359)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !392, file: !122, line: 4208, baseType: !401, size: 32, offset: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !230, line: 43, size: 32, elements: !402)
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !401, file: !230, line: 52, baseType: !22, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !392, file: !122, line: 4210, baseType: !111, size: 32, offset: 96)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !392, file: !122, line: 4212, baseType: !113, size: 32, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !392, file: !122, line: 4214, baseType: !102, size: 32, offset: 160)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !392, file: !122, line: 4216, baseType: !102, size: 32, offset: 192)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !392, file: !122, line: 4218, baseType: !102, size: 32, offset: 224)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !392, file: !122, line: 4220, baseType: !102, size: 32, offset: 256)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !392, file: !122, line: 4222, baseType: !113, size: 32, offset: 288)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !392, file: !122, line: 4227, baseType: !169, size: 8, offset: 320)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !414, file: !428, line: 18, type: !429, isLocal: false, isDefinition: true)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !416, globals: !427, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/kernel/metairq_dispatch")
!416 = !{!22, !104, !24, !417, !419, !421, !111, !105, !422, !423, !424, !425, !102, !426, !183, !263}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 32)
!420 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!427 = !{!412}
!428 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !342, line: 16, size: 64, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !430, file: !342, line: 17, baseType: !263, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !430, file: !342, line: 18, baseType: !169, size: 8, offset: 32)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "_char_out", scope: !436, file: !440, line: 54, type: !441, isLocal: false, isDefinition: true)
!436 = distinct !DICompileUnit(language: DW_LANG_C99, file: !437, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !438, globals: !439, splitDebugInlining: false, nameTableKind: None)
!437 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/kernel/metairq_dispatch")
!438 = !{!104, !105}
!439 = !{!434}
!440 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = !DISubroutineType(types: !443)
!443 = !{!105, !105}
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !446, file: !1176, line: 202, type: !1177, isLocal: true, isDefinition: true, align: 32)
!446 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !448, globals: !1175, splitDebugInlining: false, nameTableKind: None)
!447 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/kernel/metairq_dispatch")
!448 = !{!104, !105, !449, !571, !908, !909, !976}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !451, line: 335, baseType: !452)
!451 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 320, size: 288, elements: !453)
!453 = !{!454, !465, !471, !485, !496, !507, !511, !522, !523, !534, !535, !550, !551, !561}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !452, file: !451, line: 321, baseType: !455, size: 16)
!455 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !451, line: 50, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !451, line: 43, size: 16, elements: !458)
!458 = !{!459, !464}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !457, file: !451, line: 48, baseType: !460, size: 16)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !457, file: !451, line: 44, size: 16, elements: !461)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !460, file: !451, line: 45, baseType: !183, size: 7, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !460, file: !451, line: 47, baseType: !183, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !457, file: !451, line: 49, baseType: !183, size: 16)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !452, file: !451, line: 322, baseType: !466, size: 16, offset: 16)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 16, elements: !158)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !468, line: 52, baseType: !469)
!468 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !169)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !452, file: !451, line: 323, baseType: !472, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !451, line: 107, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !451, line: 94, size: 32, elements: !475)
!475 = !{!476, !484}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !474, file: !451, line: 105, baseType: !477, size: 32)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !474, file: !451, line: 95, size: 32, elements: !478)
!478 = !{!479, !480, !481, !482, !483}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !477, file: !451, line: 97, baseType: !113, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !477, file: !451, line: 99, baseType: !113, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !477, file: !451, line: 100, baseType: !113, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !477, file: !451, line: 102, baseType: !113, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !477, file: !451, line: 103, baseType: !113, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !474, file: !451, line: 106, baseType: !113, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !452, file: !451, line: 324, baseType: !486, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !451, line: 155, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !451, line: 148, size: 32, elements: !489)
!489 = !{!490, !495}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !488, file: !451, line: 153, baseType: !491, size: 32)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !488, file: !451, line: 149, size: 32, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !491, file: !451, line: 150, baseType: !113, size: 16, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !491, file: !451, line: 151, baseType: !113, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !488, file: !451, line: 154, baseType: !113, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !452, file: !451, line: 325, baseType: !497, size: 8, offset: 96)
!497 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !451, line: 194, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !451, line: 187, size: 8, elements: !500)
!500 = !{!501, !506}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !499, file: !451, line: 192, baseType: !502, size: 8)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !499, file: !451, line: 188, size: 8, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !502, file: !451, line: 189, baseType: !169, size: 1, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !502, file: !451, line: 190, baseType: !169, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !499, file: !451, line: 193, baseType: !169, size: 8)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !452, file: !451, line: 326, baseType: !508, size: 24, offset: 104)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 24, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 3)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !452, file: !451, line: 327, baseType: !512, size: 8, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !451, line: 215, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !451, line: 208, size: 8, elements: !515)
!515 = !{!516, !521}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !514, file: !451, line: 213, baseType: !517, size: 8)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !514, file: !451, line: 209, size: 8, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !517, file: !451, line: 210, baseType: !169, size: 1, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !517, file: !451, line: 211, baseType: !169, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !514, file: !451, line: 214, baseType: !169, size: 8)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !452, file: !451, line: 328, baseType: !508, size: 24, offset: 136)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !452, file: !451, line: 329, baseType: !524, size: 8, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !451, line: 236, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !451, line: 229, size: 8, elements: !527)
!527 = !{!528, !533}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !526, file: !451, line: 234, baseType: !529, size: 8)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !451, line: 230, size: 8, elements: !530)
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !529, file: !451, line: 231, baseType: !469, size: 1, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !529, file: !451, line: 232, baseType: !469, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !526, file: !451, line: 235, baseType: !169, size: 8)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !452, file: !451, line: 330, baseType: !508, size: 24, offset: 168)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !452, file: !451, line: 331, baseType: !536, size: 16, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !451, line: 262, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !451, line: 250, size: 16, elements: !539)
!539 = !{!540, !549}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !538, file: !451, line: 260, baseType: !541, size: 16)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !538, file: !451, line: 251, size: 16, elements: !542)
!542 = !{!543, !544, !545, !546, !547, !548}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !541, file: !451, line: 252, baseType: !183, size: 1, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !541, file: !451, line: 253, baseType: !183, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !541, file: !451, line: 254, baseType: !183, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !541, file: !451, line: 255, baseType: !183, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !541, file: !451, line: 256, baseType: !183, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !541, file: !451, line: 258, baseType: !183, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !538, file: !451, line: 261, baseType: !183, size: 16)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !452, file: !451, line: 332, baseType: !466, size: 16, offset: 208)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !452, file: !451, line: 333, baseType: !552, size: 32, offset: 224)
!552 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !451, line: 290, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !451, line: 284, size: 32, elements: !555)
!555 = !{!556, !560}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !554, file: !451, line: 288, baseType: !557, size: 32)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !554, file: !451, line: 285, size: 32, elements: !558)
!558 = !{!559}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !557, file: !451, line: 286, baseType: !113, size: 22, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !554, file: !451, line: 289, baseType: !113, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !452, file: !451, line: 334, baseType: !562, size: 16, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !451, line: 308, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !451, line: 303, size: 16, elements: !565)
!565 = !{!566, !570}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !564, file: !451, line: 306, baseType: !567, size: 16)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !564, file: !451, line: 304, size: 16, elements: !568)
!568 = !{!569}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !567, file: !451, line: 305, baseType: !183, size: 16, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !564, file: !451, line: 307, baseType: !183, size: 16)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !573, line: 928, baseType: !574)
!573 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !573, line: 899, size: 672, elements: !575)
!575 = !{!576, !600, !624, !650, !675, !691, !692, !710, !711, !728, !739, !740, !755, !775, !776, !788, !800, !810, !811, !828, !830, !841, !842, !854, !866, !867, !878, !894}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !574, file: !573, line: 900, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !573, line: 64, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 43, size: 32, elements: !580)
!580 = !{!581, !599}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !579, file: !573, line: 62, baseType: !582, size: 32)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !579, file: !573, line: 44, size: 32, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !582, file: !573, line: 45, baseType: !113, size: 1, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !582, file: !573, line: 46, baseType: !113, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !582, file: !573, line: 47, baseType: !113, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !582, file: !573, line: 48, baseType: !113, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !582, file: !573, line: 49, baseType: !113, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !582, file: !573, line: 50, baseType: !113, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !582, file: !573, line: 51, baseType: !113, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !582, file: !573, line: 52, baseType: !113, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !582, file: !573, line: 53, baseType: !113, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !582, file: !573, line: 54, baseType: !113, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !582, file: !573, line: 55, baseType: !113, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !582, file: !573, line: 56, baseType: !113, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !582, file: !573, line: 58, baseType: !113, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !582, file: !573, line: 59, baseType: !113, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !582, file: !573, line: 60, baseType: !113, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !579, file: !573, line: 63, baseType: !113, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !574, file: !573, line: 901, baseType: !601, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !573, line: 125, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 104, size: 32, elements: !604)
!604 = !{!605, !623}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !603, file: !573, line: 123, baseType: !606, size: 32)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !603, file: !573, line: 105, size: 32, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !606, file: !573, line: 106, baseType: !113, size: 1, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !606, file: !573, line: 107, baseType: !113, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !606, file: !573, line: 108, baseType: !113, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !606, file: !573, line: 109, baseType: !113, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !606, file: !573, line: 110, baseType: !113, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !606, file: !573, line: 111, baseType: !113, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !606, file: !573, line: 112, baseType: !113, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !606, file: !573, line: 113, baseType: !113, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !606, file: !573, line: 114, baseType: !113, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !606, file: !573, line: 115, baseType: !113, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !606, file: !573, line: 116, baseType: !113, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !606, file: !573, line: 117, baseType: !113, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !606, file: !573, line: 119, baseType: !113, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !606, file: !573, line: 120, baseType: !113, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !606, file: !573, line: 121, baseType: !113, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !603, file: !573, line: 124, baseType: !113, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !574, file: !573, line: 902, baseType: !625, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !573, line: 186, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 165, size: 32, elements: !628)
!628 = !{!629, !649}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !627, file: !573, line: 184, baseType: !630, size: 32)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !627, file: !573, line: 166, size: 32, elements: !631)
!631 = !{!632, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !630, file: !573, line: 167, baseType: !633, size: 1, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !630, file: !573, line: 168, baseType: !633, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !630, file: !573, line: 169, baseType: !633, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !630, file: !573, line: 170, baseType: !633, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !630, file: !573, line: 171, baseType: !633, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !630, file: !573, line: 172, baseType: !633, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !630, file: !573, line: 173, baseType: !633, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !630, file: !573, line: 174, baseType: !633, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !630, file: !573, line: 175, baseType: !633, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !630, file: !573, line: 176, baseType: !633, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !630, file: !573, line: 177, baseType: !633, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !630, file: !573, line: 178, baseType: !633, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !630, file: !573, line: 180, baseType: !633, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !630, file: !573, line: 181, baseType: !633, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !630, file: !573, line: 182, baseType: !633, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !627, file: !573, line: 185, baseType: !113, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !574, file: !573, line: 903, baseType: !651, size: 32, offset: 96)
!651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !573, line: 247, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 226, size: 32, elements: !655)
!655 = !{!656, !674}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !654, file: !573, line: 245, baseType: !657, size: 32)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !654, file: !573, line: 227, size: 32, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !657, file: !573, line: 228, baseType: !113, size: 1, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !657, file: !573, line: 229, baseType: !113, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !657, file: !573, line: 230, baseType: !113, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !657, file: !573, line: 231, baseType: !113, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !657, file: !573, line: 232, baseType: !113, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !657, file: !573, line: 233, baseType: !113, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !657, file: !573, line: 234, baseType: !113, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !657, file: !573, line: 235, baseType: !113, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !657, file: !573, line: 236, baseType: !113, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !657, file: !573, line: 237, baseType: !113, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !657, file: !573, line: 238, baseType: !113, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !657, file: !573, line: 239, baseType: !113, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !657, file: !573, line: 241, baseType: !113, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !657, file: !573, line: 242, baseType: !113, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !657, file: !573, line: 243, baseType: !113, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !654, file: !573, line: 246, baseType: !113, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !574, file: !573, line: 904, baseType: !676, size: 16, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !573, line: 300, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 287, size: 16, elements: !679)
!679 = !{!680, !690}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !678, file: !573, line: 298, baseType: !681, size: 16)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !678, file: !573, line: 288, size: 16, elements: !682)
!682 = !{!683, !684, !685, !686, !687, !688, !689}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !681, file: !573, line: 290, baseType: !183, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !681, file: !573, line: 291, baseType: !183, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !681, file: !573, line: 293, baseType: !183, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !681, file: !573, line: 294, baseType: !183, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !681, file: !573, line: 295, baseType: !183, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !681, file: !573, line: 296, baseType: !183, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !681, file: !573, line: 297, baseType: !183, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !678, file: !573, line: 299, baseType: !183, size: 16)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !574, file: !573, line: 905, baseType: !466, size: 16, offset: 144)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !574, file: !573, line: 906, baseType: !693, size: 16, offset: 160)
!693 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !573, line: 352, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 336, size: 16, elements: !696)
!696 = !{!697, !709}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !695, file: !573, line: 350, baseType: !698, size: 16)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !695, file: !573, line: 337, size: 16, elements: !699)
!699 = !{!700, !701, !702, !703, !704, !705, !706, !707, !708}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !698, file: !573, line: 339, baseType: !183, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !698, file: !573, line: 340, baseType: !183, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !698, file: !573, line: 341, baseType: !183, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !698, file: !573, line: 342, baseType: !183, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !698, file: !573, line: 343, baseType: !183, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !698, file: !573, line: 344, baseType: !183, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !698, file: !573, line: 345, baseType: !183, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !698, file: !573, line: 346, baseType: !183, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !698, file: !573, line: 348, baseType: !183, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !695, file: !573, line: 351, baseType: !183, size: 16)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !574, file: !573, line: 907, baseType: !466, size: 16, offset: 176)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !574, file: !573, line: 908, baseType: !712, size: 32, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !573, line: 398, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 381, size: 32, elements: !715)
!715 = !{!716, !727}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !714, file: !573, line: 396, baseType: !717, size: 32)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !573, line: 382, size: 32, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724, !725, !726}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !717, file: !573, line: 384, baseType: !113, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !717, file: !573, line: 385, baseType: !113, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !717, file: !573, line: 386, baseType: !113, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !717, file: !573, line: 388, baseType: !113, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !717, file: !573, line: 389, baseType: !113, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !717, file: !573, line: 390, baseType: !113, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !717, file: !573, line: 392, baseType: !113, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !717, file: !573, line: 394, baseType: !113, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !714, file: !573, line: 397, baseType: !113, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !574, file: !573, line: 909, baseType: !729, size: 8, offset: 224)
!729 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !573, line: 433, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 426, size: 8, elements: !732)
!732 = !{!733, !738}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !731, file: !573, line: 431, baseType: !734, size: 8)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !731, file: !573, line: 427, size: 8, elements: !735)
!735 = !{!736, !737}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !734, file: !573, line: 428, baseType: !169, size: 5, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !734, file: !573, line: 430, baseType: !169, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !731, file: !573, line: 432, baseType: !169, size: 8)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !574, file: !573, line: 910, baseType: !508, size: 24, offset: 232)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !574, file: !573, line: 911, baseType: !741, size: 32, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !573, line: 462, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 448, size: 32, elements: !744)
!744 = !{!745, !754}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !743, file: !573, line: 460, baseType: !746, size: 32)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !743, file: !573, line: 449, size: 32, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !746, file: !573, line: 451, baseType: !113, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !746, file: !573, line: 453, baseType: !113, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !746, file: !573, line: 454, baseType: !113, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !746, file: !573, line: 455, baseType: !113, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !746, file: !573, line: 457, baseType: !113, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !746, file: !573, line: 459, baseType: !113, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !743, file: !573, line: 461, baseType: !113, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !574, file: !573, line: 912, baseType: !756, size: 16, offset: 288)
!756 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !573, line: 520, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 503, size: 16, elements: !759)
!759 = !{!760, !774}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !758, file: !573, line: 518, baseType: !761, size: 16)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !758, file: !573, line: 504, size: 16, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !761, file: !573, line: 506, baseType: !183, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !761, file: !573, line: 507, baseType: !183, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !761, file: !573, line: 508, baseType: !183, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !761, file: !573, line: 509, baseType: !183, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !761, file: !573, line: 510, baseType: !183, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !761, file: !573, line: 511, baseType: !183, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !761, file: !573, line: 512, baseType: !183, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !761, file: !573, line: 513, baseType: !183, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !761, file: !573, line: 514, baseType: !183, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !761, file: !573, line: 515, baseType: !183, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !761, file: !573, line: 516, baseType: !183, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !758, file: !573, line: 519, baseType: !183, size: 16)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !574, file: !573, line: 913, baseType: !466, size: 16, offset: 304)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !574, file: !573, line: 914, baseType: !777, size: 32, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !573, line: 559, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 552, size: 32, elements: !780)
!780 = !{!781, !787}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !779, file: !573, line: 557, baseType: !782, size: 32)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !779, file: !573, line: 553, size: 32, elements: !783)
!783 = !{!784, !785, !786}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !782, file: !573, line: 554, baseType: !113, size: 10, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !782, file: !573, line: 555, baseType: !113, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !782, file: !573, line: 556, baseType: !113, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !779, file: !573, line: 558, baseType: !113, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !574, file: !573, line: 915, baseType: !789, size: 32, offset: 352)
!789 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !573, line: 585, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 578, size: 32, elements: !792)
!792 = !{!793, !799}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !791, file: !573, line: 583, baseType: !794, size: 32)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !791, file: !573, line: 579, size: 32, elements: !795)
!795 = !{!796, !797, !798}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !794, file: !573, line: 580, baseType: !113, size: 16, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !794, file: !573, line: 581, baseType: !113, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !794, file: !573, line: 582, baseType: !113, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !791, file: !573, line: 584, baseType: !113, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !574, file: !573, line: 916, baseType: !801, size: 8, offset: 384)
!801 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !573, line: 610, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 604, size: 8, elements: !804)
!804 = !{!805, !809}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !803, file: !573, line: 608, baseType: !806, size: 8)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !803, file: !573, line: 605, size: 8, elements: !807)
!807 = !{!808}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !806, file: !573, line: 607, baseType: !169, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !803, file: !573, line: 609, baseType: !169, size: 8)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !574, file: !573, line: 917, baseType: !508, size: 24, offset: 392)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !574, file: !573, line: 918, baseType: !812, size: 32, offset: 416)
!812 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !573, line: 639, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 622, size: 32, elements: !815)
!815 = !{!816, !827}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !814, file: !573, line: 637, baseType: !817, size: 32)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !814, file: !573, line: 623, size: 32, elements: !818)
!818 = !{!819, !820, !821, !822, !823, !824, !825, !826}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !817, file: !573, line: 625, baseType: !113, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !817, file: !573, line: 626, baseType: !113, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !817, file: !573, line: 627, baseType: !113, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !817, file: !573, line: 629, baseType: !113, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !817, file: !573, line: 631, baseType: !113, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !817, file: !573, line: 632, baseType: !113, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !817, file: !573, line: 634, baseType: !113, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !817, file: !573, line: 635, baseType: !113, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !814, file: !573, line: 638, baseType: !113, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !574, file: !573, line: 919, baseType: !829, size: 32, offset: 448)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 32, elements: !307)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !574, file: !573, line: 920, baseType: !831, size: 16, offset: 480)
!831 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !573, line: 715, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 706, size: 16, elements: !834)
!834 = !{!835, !840}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !833, file: !573, line: 713, baseType: !836, size: 16)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !833, file: !573, line: 707, size: 16, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !836, file: !573, line: 709, baseType: !183, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !836, file: !573, line: 711, baseType: !183, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !833, file: !573, line: 714, baseType: !183, size: 16)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !574, file: !573, line: 921, baseType: !466, size: 16, offset: 496)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !574, file: !573, line: 922, baseType: !843, size: 32, offset: 512)
!843 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !573, line: 739, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 729, size: 32, elements: !846)
!846 = !{!847, !853}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !845, file: !573, line: 737, baseType: !848, size: 32)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !845, file: !573, line: 730, size: 32, elements: !849)
!849 = !{!850, !851, !852}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !848, file: !573, line: 732, baseType: !113, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !848, file: !573, line: 733, baseType: !113, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !848, file: !573, line: 735, baseType: !113, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !845, file: !573, line: 738, baseType: !113, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !574, file: !573, line: 923, baseType: !855, size: 8, offset: 544)
!855 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !856)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !573, line: 765, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 756, size: 8, elements: !858)
!858 = !{!859, !865}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !857, file: !573, line: 763, baseType: !860, size: 8)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !857, file: !573, line: 757, size: 8, elements: !861)
!861 = !{!862, !863, !864}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !860, file: !573, line: 759, baseType: !169, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !860, file: !573, line: 761, baseType: !169, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !860, file: !573, line: 762, baseType: !169, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !857, file: !573, line: 764, baseType: !169, size: 8)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !574, file: !573, line: 924, baseType: !508, size: 24, offset: 552)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !574, file: !573, line: 925, baseType: !868, size: 32, offset: 576)
!868 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !573, line: 789, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 781, size: 32, elements: !871)
!871 = !{!872, !877}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !870, file: !573, line: 787, baseType: !873, size: 32)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !870, file: !573, line: 782, size: 32, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !873, file: !573, line: 783, baseType: !113, size: 12, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !873, file: !573, line: 785, baseType: !113, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !870, file: !573, line: 788, baseType: !113, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !574, file: !573, line: 926, baseType: !879, size: 32, offset: 608)
!879 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !573, line: 820, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 805, size: 32, elements: !882)
!882 = !{!883, !893}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !881, file: !573, line: 818, baseType: !884, size: 32)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !881, file: !573, line: 806, size: 32, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !884, file: !573, line: 807, baseType: !113, size: 2, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !884, file: !573, line: 808, baseType: !113, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !884, file: !573, line: 809, baseType: !113, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !884, file: !573, line: 810, baseType: !113, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !884, file: !573, line: 812, baseType: !113, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !884, file: !573, line: 814, baseType: !113, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !884, file: !573, line: 816, baseType: !113, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !881, file: !573, line: 819, baseType: !113, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !574, file: !573, line: 927, baseType: !895, size: 8, offset: 640)
!895 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !573, line: 881, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 872, size: 8, elements: !899)
!899 = !{!900, !907}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !898, file: !573, line: 879, baseType: !901, size: 8)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !898, file: !573, line: 873, size: 8, elements: !902)
!902 = !{!903, !904, !905, !906}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !901, file: !573, line: 874, baseType: !169, size: 1, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !901, file: !573, line: 875, baseType: !169, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !901, file: !573, line: 876, baseType: !169, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !901, file: !573, line: 877, baseType: !169, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !898, file: !573, line: 880, baseType: !169, size: 8)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !911, line: 290, baseType: !912)
