; ModuleID = 'build/96b_carbon/getchar/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.tty_serial = type { %struct.device*, %struct.k_sem, i8*, i32, i16, i16, i32, %struct.k_sem, i8*, i32, i16, i16, i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.z_heap_bucket = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.k_fifo = type { %struct.k_queue }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/getchar/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/getchar")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 97, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/getchar")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5440, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 85)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2720, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/getchar")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !111, file: !129, line: 56, type: !130, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !128, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/getchar")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !116, line: 258, baseType: !117)
!116 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f401xe.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 249, size: 224, elements: !118)
!118 = !{!119, !122, !123, !124, !125, !126, !127}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !117, file: !116, line: 251, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !117, file: !116, line: 252, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !117, file: !116, line: 253, baseType: !120, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !117, file: !116, line: 254, baseType: !120, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !117, file: !116, line: 255, baseType: !120, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !117, file: !116, line: 256, baseType: !120, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !117, file: !116, line: 257, baseType: !120, size: 32, offset: 192)
!128 = !{!109}
!129 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !165}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !131, file: !132, line: 60, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DISubroutineType(types: !137)
!137 = !{!103, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !{!143, !147, !148, !149, !158, !159}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !141, line: 380, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !140, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !140, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !140, file: !141, line: 386, baseType: !150, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !152)
!152 = !{!153, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !151, file: !141, line: 359, baseType: !154, size: 8)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !155)
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !151, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!157 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !140, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !141, line: 43, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !164)
!164 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !131, file: !132, line: 65, baseType: !138, size: 32, offset: 32)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !168, file: !171, line: 71, type: !172, isLocal: true, isDefinition: true, align: 32)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !170, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/getchar")
!170 = !{!166}
!171 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !174)
!174 = !{!175, !194}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !173, file: !132, line: 60, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DISubroutineType(types: !178)
!178 = !{!103, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !182)
!182 = !{!183, !184, !185, !186, !192, !193}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !141, line: 380, baseType: !144, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !181, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !181, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !181, file: !141, line: 386, baseType: !187, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !188, file: !141, line: 359, baseType: !154, size: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !188, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !181, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !173, file: !132, line: 65, baseType: !179, size: 32, offset: 32)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "console_serial", scope: !197, file: !288, line: 13, type: !294, isLocal: true, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !199, globals: !285, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/console/getchar.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/getchar")
!199 = !{!200, !102, !103}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !203, line: 336, size: 608, elements: !204)
!203 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !{!205, !225, !229, !233, !246, !251, !257, !263, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !202, file: !203, line: 365, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!207 = !DISubroutineType(types: !208)
!208 = !{!103, !209, !224}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !212)
!212 = !{!213, !214, !215, !216, !222, !223}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !211, file: !141, line: 380, baseType: !144, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !211, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !211, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !211, file: !141, line: 386, baseType: !217, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !218, file: !141, line: 359, baseType: !154, size: 8)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !218, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !211, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !211, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !202, file: !203, line: 366, baseType: !226, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !209, !155}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !202, file: !203, line: 374, baseType: !230, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DISubroutineType(types: !232)
!232 = !{!103, !209}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !202, file: !203, line: 377, baseType: !234, size: 32, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = !DISubroutineType(types: !236)
!236 = !{!103, !209, !237}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !203, line: 122, size: 64, elements: !240)
!240 = !{!241, !242, !243, !244, !245}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !239, file: !203, line: 123, baseType: !121, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !239, file: !203, line: 124, baseType: !154, size: 8, offset: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !239, file: !203, line: 125, baseType: !154, size: 8, offset: 40)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !239, file: !203, line: 126, baseType: !154, size: 8, offset: 48)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !239, file: !203, line: 127, baseType: !154, size: 8, offset: 56)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !202, file: !203, line: 379, baseType: !247, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = !DISubroutineType(types: !249)
!249 = !{!103, !209, !250}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !202, file: !203, line: 384, baseType: !252, size: 32, offset: 160)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = !DISubroutineType(types: !254)
!254 = !{!103, !209, !255, !103}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !202, file: !203, line: 393, baseType: !258, size: 32, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DISubroutineType(types: !260)
!260 = !{!103, !209, !261, !262}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !202, file: !203, line: 402, baseType: !264, size: 32, offset: 224)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !209}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !202, file: !203, line: 405, baseType: !264, size: 32, offset: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !202, file: !203, line: 408, baseType: !230, size: 32, offset: 288)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !202, file: !203, line: 411, baseType: !264, size: 32, offset: 320)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !202, file: !203, line: 414, baseType: !264, size: 32, offset: 352)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !202, file: !203, line: 417, baseType: !230, size: 32, offset: 384)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !202, file: !203, line: 420, baseType: !230, size: 32, offset: 416)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !202, file: !203, line: 423, baseType: !264, size: 32, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !202, file: !203, line: 426, baseType: !264, size: 32, offset: 480)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !202, file: !203, line: 429, baseType: !230, size: 32, offset: 512)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !202, file: !203, line: 432, baseType: !230, size: 32, offset: 544)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !202, file: !203, line: 435, baseType: !278, size: 32, offset: 576)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !209, !281, !102}
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !203, line: 142, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DISubroutineType(types: !284)
!284 = !{null, !209, !102}
!285 = !{!195, !286, !292}
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "console_rxbuf", scope: !197, file: !288, line: 15, type: !289, isLocal: true, isDefinition: true)
!288 = !DIFile(filename: "zephyr/subsys/console/getchar.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 128, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 16)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "console_txbuf", scope: !197, file: !288, line: 16, type: !289, isLocal: true, isDefinition: true)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tty_serial", file: !295, line: 18, size: 544, elements: !296)
!295 = !DIFile(filename: "zephyr/include/zephyr/console/tty.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!296 = !{!297, !298, !325, !326, !327, !330, !331, !333, !334, !335, !336, !337, !338}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "uart_dev", scope: !294, file: !295, line: 19, baseType: !209, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "rx_sem", scope: !294, file: !295, line: 21, baseType: !299, size: 128, offset: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !300, line: 2909, size: 128, elements: !301)
!300 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!301 = !{!302, !323, !324}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !299, file: !300, line: 2910, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !304, line: 233, baseType: !305)
!304 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !304, line: 231, size: 64, elements: !306)
!306 = !{!307}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !305, file: !304, line: 232, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !309, line: 48, baseType: !310)
!309 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !309, line: 37, size: 64, elements: !311)
!311 = !{!312, !318}
!312 = !DIDerivedType(tag: DW_TAG_member, scope: !310, file: !309, line: 38, baseType: !313, size: 32)
!313 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !310, file: !309, line: 38, size: 32, elements: !314)
!314 = !{!315, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !313, file: !309, line: 39, baseType: !316, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !313, file: !309, line: 40, baseType: !316, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, scope: !310, file: !309, line: 42, baseType: !319, size: 32, offset: 32)
!319 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !310, file: !309, line: 42, size: 32, elements: !320)
!320 = !{!321, !322}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !319, file: !309, line: 43, baseType: !316, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !319, file: !309, line: 44, baseType: !316, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !299, file: !300, line: 2911, baseType: !32, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !299, file: !300, line: 2912, baseType: !32, size: 32, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "rx_ringbuf", scope: !294, file: !295, line: 22, baseType: !261, size: 32, offset: 160)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "rx_ringbuf_sz", scope: !294, file: !295, line: 23, baseType: !121, size: 32, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "rx_get", scope: !294, file: !295, line: 24, baseType: !328, size: 16, offset: 224)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !329)
!329 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "rx_put", scope: !294, file: !295, line: 24, baseType: !328, size: 16, offset: 240)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "rx_timeout", scope: !294, file: !295, line: 25, baseType: !332, size: 32, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tx_sem", scope: !294, file: !295, line: 27, baseType: !299, size: 128, offset: 288)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ringbuf", scope: !294, file: !295, line: 28, baseType: !261, size: 32, offset: 416)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ringbuf_sz", scope: !294, file: !295, line: 29, baseType: !121, size: 32, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tx_get", scope: !294, file: !295, line: 30, baseType: !328, size: 16, offset: 480)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "tx_put", scope: !294, file: !295, line: 30, baseType: !328, size: 16, offset: 496)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tx_timeout", scope: !294, file: !295, line: 31, baseType: !332, size: 32, offset: 512)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "static_regions", scope: !341, file: !350, line: 62, type: !486, isLocal: true, isDefinition: true)
!341 = distinct !DICompileUnit(language: DW_LANG_C99, file: !342, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !343, globals: !346, splitDebugInlining: false, nameTableKind: None)
!342 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/getchar")
!343 = !{!344, !103, !121, !102}
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !345, line: 214, baseType: !32)
!345 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!346 = !{!347, !339}
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !349, file: !350, line: 198, type: !472, isLocal: true, isDefinition: true)
!349 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !350, file: !350, line: 175, type: !351, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !341, retainedNodes: !467)
!350 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!351 = !DISubroutineType(types: !352)
!352 = !{null, !353}
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 32)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !355, line: 245, size: 1024, elements: !356)
!355 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!356 = !{!357, !422, !435, !436, !437, !438, !444, !462}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !354, file: !355, line: 247, baseType: !358, size: 384)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !355, line: 57, size: 384, elements: !359)
!359 = !{!360, !387, !394, !395, !396, !407, !408, !409}
!360 = !DIDerivedType(tag: DW_TAG_member, scope: !358, file: !355, line: 60, baseType: !361, size: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !358, file: !355, line: 60, size: 64, elements: !362)
!362 = !{!363, !378}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !361, file: !355, line: 61, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !309, line: 49, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !309, line: 37, size: 64, elements: !366)
!366 = !{!367, !373}
!367 = !DIDerivedType(tag: DW_TAG_member, scope: !365, file: !309, line: 38, baseType: !368, size: 32)
!368 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !365, file: !309, line: 38, size: 32, elements: !369)
!369 = !{!370, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !368, file: !309, line: 39, baseType: !371, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !368, file: !309, line: 40, baseType: !371, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, scope: !365, file: !309, line: 42, baseType: !374, size: 32, offset: 32)
!374 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !365, file: !309, line: 42, size: 32, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !374, file: !309, line: 43, baseType: !371, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !374, file: !309, line: 44, baseType: !371, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !361, file: !355, line: 62, baseType: !379, size: 64)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !380, line: 49, size: 64, elements: !381)
!380 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !379, file: !380, line: 50, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 64, elements: !385)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 32)
!385 = !{!386}
!386 = !DISubrange(count: 2)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !358, file: !355, line: 68, baseType: !388, size: 32, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !304, line: 233, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !304, line: 231, size: 64, elements: !391)
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !390, file: !304, line: 232, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !309, line: 48, baseType: !365)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !358, file: !355, line: 71, baseType: !154, size: 8, offset: 96)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !358, file: !355, line: 74, baseType: !154, size: 8, offset: 104)
!396 = !DIDerivedType(tag: DW_TAG_member, scope: !358, file: !355, line: 90, baseType: !397, size: 16, offset: 112)
!397 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !358, file: !355, line: 90, size: 16, elements: !398)
!398 = !{!399, !406}
!399 = !DIDerivedType(tag: DW_TAG_member, scope: !397, file: !355, line: 91, baseType: !400, size: 16)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !397, file: !355, line: 91, size: 16, elements: !401)
!401 = !{!402, !405}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !400, file: !355, line: 96, baseType: !403, size: 8)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !404)
!404 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !400, file: !355, line: 97, baseType: !154, size: 8, offset: 8)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !397, file: !355, line: 100, baseType: !328, size: 16)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !358, file: !355, line: 107, baseType: !121, size: 32, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !358, file: !355, line: 127, baseType: !102, size: 32, offset: 160)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !358, file: !355, line: 131, baseType: !410, size: 192, offset: 192)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !304, line: 244, size: 192, elements: !411)
!411 = !{!412, !413, !419}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !410, file: !304, line: 245, baseType: !364, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !410, file: !304, line: 246, baseType: !414, size: 32, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !304, line: 242, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !410, file: !304, line: 249, baseType: !420, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !421)
!421 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !354, file: !355, line: 250, baseType: !423, size: 288, offset: 384)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !424, line: 25, size: 288, elements: !425)
!424 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!425 = !{!426, !427, !428, !429, !430, !431, !432, !433, !434}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !423, file: !424, line: 26, baseType: !121, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !423, file: !424, line: 27, baseType: !121, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !423, file: !424, line: 28, baseType: !121, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !423, file: !424, line: 29, baseType: !121, size: 32, offset: 96)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !423, file: !424, line: 30, baseType: !121, size: 32, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !423, file: !424, line: 31, baseType: !121, size: 32, offset: 160)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !423, file: !424, line: 32, baseType: !121, size: 32, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !423, file: !424, line: 33, baseType: !121, size: 32, offset: 224)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !423, file: !424, line: 34, baseType: !121, size: 32, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !354, file: !355, line: 253, baseType: !102, size: 32, offset: 672)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !354, file: !355, line: 256, baseType: !389, size: 64, offset: 704)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !354, file: !355, line: 294, baseType: !103, size: 32, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !354, file: !355, line: 300, baseType: !439, size: 96, offset: 800)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !355, line: 149, size: 96, elements: !440)
!440 = !{!441, !442, !443}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !439, file: !355, line: 153, baseType: !22, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !439, file: !355, line: 162, baseType: !344, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !439, file: !355, line: 168, baseType: !344, size: 32, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !354, file: !355, line: 325, baseType: !445, size: 32, offset: 896)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !300, line: 5073, size: 160, elements: !447)
!447 = !{!448, !457, !458}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !446, file: !300, line: 5074, baseType: !449, size: 96)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !450, line: 56, size: 96, elements: !451)
!450 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!451 = !{!452, !455, !456}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !449, file: !450, line: 57, baseType: !453, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !450, line: 57, flags: DIFlagFwdDecl)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !449, file: !450, line: 58, baseType: !102, size: 32, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !449, file: !450, line: 59, baseType: !344, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !446, file: !300, line: 5075, baseType: !389, size: 64, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !446, file: !300, line: 5076, baseType: !459, offset: 160)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !460, line: 43, elements: !461)
!460 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!461 = !{}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !354, file: !355, line: 343, baseType: !463, size: 64, offset: 928)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !424, line: 60, size: 64, elements: !464)
!464 = !{!465, !466}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !463, file: !424, line: 63, baseType: !121, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !463, file: !424, line: 66, baseType: !121, size: 32, offset: 32)
!467 = !{!468, !469, !470, !471}
!468 = !DILocalVariable(name: "thread", arg: 1, scope: !349, file: !350, line: 175, type: !353)
!469 = !DILocalVariable(name: "region_num", scope: !349, file: !350, line: 200, type: !154)
!470 = !DILocalVariable(name: "guard_start", scope: !349, file: !350, line: 265, type: !22)
!471 = !DILocalVariable(name: "guard_size", scope: !349, file: !350, line: 266, type: !344)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 96, elements: !484)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !474, line: 52, size: 96, elements: !475)
!474 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!475 = !{!476, !477, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !473, file: !474, line: 53, baseType: !22, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !473, file: !474, line: 54, baseType: !344, size: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !473, file: !474, line: 55, baseType: !479, size: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !480, line: 151, baseType: !481)
!480 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !480, line: 149, size: 32, elements: !482)
!482 = !{!483}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !481, file: !480, line: 150, baseType: !121, size: 32)
!484 = !{!485}
!485 = !DISubrange(count: 1)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 96, elements: !484)
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !490, file: !523, line: 39, type: !154, isLocal: true, isDefinition: true)
!490 = distinct !DICompileUnit(language: DW_LANG_C99, file: !491, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !492, globals: !522, splitDebugInlining: false, nameTableKind: None)
!491 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/getchar")
!492 = !{!493, !102, !103, !510, !154}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !495, line: 1226, baseType: !496)
!495 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !495, line: 1213, size: 352, elements: !497)
!497 = !{!498, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !496, file: !495, line: 1215, baseType: !499, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !496, file: !495, line: 1216, baseType: !120, size: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !496, file: !495, line: 1217, baseType: !120, size: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !496, file: !495, line: 1218, baseType: !120, size: 32, offset: 96)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !496, file: !495, line: 1219, baseType: !120, size: 32, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !496, file: !495, line: 1220, baseType: !120, size: 32, offset: 160)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !496, file: !495, line: 1221, baseType: !120, size: 32, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !496, file: !495, line: 1222, baseType: !120, size: 32, offset: 224)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !496, file: !495, line: 1223, baseType: !120, size: 32, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !496, file: !495, line: 1224, baseType: !120, size: 32, offset: 288)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !496, file: !495, line: 1225, baseType: !120, size: 32, offset: 320)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !513, line: 27, size: 96, elements: !514)
!513 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!514 = !{!515, !516, !517}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !512, file: !513, line: 29, baseType: !121, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !512, file: !513, line: 31, baseType: !144, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !512, file: !513, line: 37, baseType: !518, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !480, line: 146, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !480, line: 141, size: 32, elements: !520)
!520 = !{!521}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !519, file: !480, line: 143, baseType: !121, size: 32)
!522 = !{!488}
!523 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !526, file: !533, line: 21, type: !106, isLocal: true, isDefinition: true)
!526 = distinct !DICompileUnit(language: DW_LANG_C99, file: !527, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !528, globals: !532, splitDebugInlining: false, nameTableKind: None)
!527 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/getchar")
!528 = !{!529, !103, !102}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !531, line: 22, baseType: !103)
!531 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!532 = !{!524}
!533 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !536, file: !541, line: 13, type: !558, isLocal: true, isDefinition: true)
!536 = distinct !DICompileUnit(language: DW_LANG_C99, file: !537, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !538, splitDebugInlining: false, nameTableKind: None)
!537 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/getchar")
!538 = !{!539, !534}
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "mpu_config", scope: !536, file: !541, line: 37, type: !542, isLocal: false, isDefinition: true)
!541 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !513, line: 41, size: 64, elements: !544)
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !543, file: !513, line: 43, baseType: !121, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !543, file: !513, line: 45, baseType: !547, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !513, line: 27, size: 96, elements: !550)
!550 = !{!551, !552, !553}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !549, file: !513, line: 29, baseType: !121, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !549, file: !513, line: 31, baseType: !144, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !549, file: !513, line: 37, baseType: !554, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !480, line: 146, baseType: !555)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !480, line: 141, size: 32, elements: !556)
!556 = !{!557}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !555, file: !480, line: 143, baseType: !121, size: 32)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 192, elements: !385)
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !561, file: !644, line: 72, type: !727, isLocal: true, isDefinition: true)
!561 = distinct !DICompileUnit(language: DW_LANG_C99, file: !562, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !563, retainedTypes: !630, globals: !641, splitDebugInlining: false, nameTableKind: None)
!562 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/getchar")
!563 = !{!30, !564}
!564 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 65, baseType: !103, size: 32, elements: !565)
!565 = !{!566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629}
!566 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!567 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!568 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!569 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!570 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!571 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!572 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!573 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!574 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!575 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!576 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!577 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!578 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!579 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!580 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!581 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!582 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!583 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!584 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!585 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!586 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!587 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!588 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!589 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!590 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!591 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!592 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!593 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!594 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!595 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!596 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!597 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!598 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!599 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!600 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!601 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!602 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!603 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!604 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!605 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!606 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!607 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!608 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!609 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!610 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!611 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!612 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!613 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!614 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!615 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!616 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!617 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!618 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!619 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!620 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!621 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!622 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!623 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!624 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!625 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!626 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!627 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!628 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!629 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!630 = !{!344, !103, !102, !631}
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !116, line: 243, baseType: !633)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 235, size: 192, elements: !634)
!634 = !{!635, !636, !637, !638, !639, !640}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !633, file: !116, line: 237, baseType: !120, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !633, file: !116, line: 238, baseType: !120, size: 32, offset: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !633, file: !116, line: 239, baseType: !120, size: 32, offset: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !633, file: !116, line: 240, baseType: !120, size: 32, offset: 96)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !633, file: !116, line: 241, baseType: !120, size: 32, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !633, file: !116, line: 242, baseType: !120, size: 32, offset: 160)
!641 = !{!642, !648, !664, !675, !692, !559, !694, !707, !709, !711, !713, !715, !717, !719, !721, !723, !725}
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !561, file: !644, line: 424, type: !645, isLocal: false, isDefinition: true, align: 16)
!644 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 4)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "__device_dts_ord_39", scope: !561, file: !644, line: 424, type: !650, isLocal: false, isDefinition: true, align: 32)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !652)
!652 = !{!653, !654, !655, !656, !662, !663}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !651, file: !141, line: 380, baseType: !144, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !651, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !651, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !651, file: !141, line: 386, baseType: !657, size: 32, offset: 96)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !658, file: !141, line: 359, baseType: !154, size: 8)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !658, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !651, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !651, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_39", scope: !561, file: !644, line: 424, type: !666, isLocal: true, isDefinition: true, align: 32)
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !668)
!668 = !{!669, !674}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !667, file: !132, line: 60, baseType: !670, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!671 = !DISubroutineType(types: !672)
!672 = !{!103, !673}
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !667, file: !132, line: 65, baseType: !673, size: 32, offset: 32)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "exti_data", scope: !561, file: !644, line: 423, type: !677, isLocal: true, isDefinition: true)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !644, line: 107, size: 1472, elements: !678)
!678 = !{!679}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !677, file: !644, line: 109, baseType: !680, size: 1472)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 1472, elements: !690)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !644, line: 101, size: 64, elements: !682)
!682 = !{!683, !689}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !681, file: !644, line: 102, baseType: !684, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !685, line: 63, baseType: !686)
!685 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 32)
!687 = !DISubroutineType(types: !688)
!688 = !{null, !103, !102}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !681, file: !644, line: 103, baseType: !102, size: 32, offset: 32)
!690 = !{!691}
!691 = !DISubrange(count: 23)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_39", scope: !561, file: !644, line: 424, type: !658, isLocal: true, isDefinition: true, align: 8)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !696, file: !644, line: 493, type: !701, isLocal: true, isDefinition: true, align: 32)
!696 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !644, file: !644, line: 460, type: !697, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !561, retainedNodes: !699)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !673}
!699 = !{!700}
!700 = !DILocalVariable(name: "dev", arg: 1, scope: !696, file: !644, line: 460, type: !673)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !702)
!702 = !{!703, !704, !705, !706}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !701, file: !10, line: 55, baseType: !332, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !701, file: !10, line: 57, baseType: !332, size: 32, offset: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !701, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !701, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !696, file: !644, line: 497, type: !701, isLocal: true, isDefinition: true, align: 32)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !696, file: !644, line: 507, type: !701, isLocal: true, isDefinition: true, align: 32)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !696, file: !644, line: 512, type: !701, isLocal: true, isDefinition: true, align: 32)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !696, file: !644, line: 516, type: !701, isLocal: true, isDefinition: true, align: 32)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !696, file: !644, line: 523, type: !701, isLocal: true, isDefinition: true, align: 32)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !696, file: !644, line: 527, type: !701, isLocal: true, isDefinition: true, align: 32)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !696, file: !644, line: 581, type: !701, isLocal: true, isDefinition: true, align: 32)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !696, file: !644, line: 586, type: !701, isLocal: true, isDefinition: true, align: 32)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !696, file: !644, line: 591, type: !701, isLocal: true, isDefinition: true, align: 32)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !696, file: !644, line: 595, type: !701, isLocal: true, isDefinition: true, align: 32)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !728, size: 736, elements: !690)
!728 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !116, line: 133, baseType: !564)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !732, file: !737, line: 24, type: !763, isLocal: false, isDefinition: true, align: 16)
!732 = distinct !DICompileUnit(language: DW_LANG_C99, file: !733, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !734, splitDebugInlining: false, nameTableKind: None)
!733 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/getchar/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/getchar")
!734 = !{!735, !730, !741, !743, !745, !747, !749, !751, !753, !755, !757, !759, !761}
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !732, file: !737, line: 19, type: !738, isLocal: false, isDefinition: true, align: 16)
!737 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/getchar")
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 224, elements: !739)
!739 = !{!740}
!740 = !DISubrange(count: 14)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_76", scope: !732, file: !737, line: 31, type: !645, isLocal: false, isDefinition: true, align: 16)
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_75", scope: !732, file: !737, line: 38, type: !645, isLocal: false, isDefinition: true, align: 16)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_74", scope: !732, file: !737, line: 45, type: !645, isLocal: false, isDefinition: true, align: 16)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_73", scope: !732, file: !737, line: 52, type: !645, isLocal: false, isDefinition: true, align: 16)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !732, file: !737, line: 59, type: !645, isLocal: false, isDefinition: true, align: 16)
!751 = !DIGlobalVariableExpression(var: !752, expr: !DIExpression())
!752 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_72", scope: !732, file: !737, line: 66, type: !645, isLocal: false, isDefinition: true, align: 16)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_20", scope: !732, file: !737, line: 73, type: !645, isLocal: false, isDefinition: true, align: 16)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !732, file: !737, line: 80, type: !645, isLocal: false, isDefinition: true, align: 16)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_50", scope: !732, file: !737, line: 87, type: !645, isLocal: false, isDefinition: true, align: 16)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_44", scope: !732, file: !737, line: 94, type: !645, isLocal: false, isDefinition: true, align: 16)
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_47", scope: !732, file: !737, line: 101, type: !645, isLocal: false, isDefinition: true, align: 16)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 48, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 3)
!766 = !DIGlobalVariableExpression(var: !767, expr: !DIExpression())
!767 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !768, file: !832, line: 398, type: !865, isLocal: true, isDefinition: true)
!768 = distinct !DICompileUnit(language: DW_LANG_C99, file: !769, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !770, retainedTypes: !783, globals: !829, splitDebugInlining: false, nameTableKind: None)
!769 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/getchar")
!770 = !{!771, !30, !776}
!771 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !772, line: 197, baseType: !32, size: 32, elements: !773)
!772 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!773 = !{!774, !775}
!774 = !DIEnumerator(name: "SUCCESS", value: 0)
!775 = !DIEnumerator(name: "ERROR", value: 1)
!776 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !777, line: 44, baseType: !32, size: 32, elements: !778)
!777 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!778 = !{!779, !780, !781, !782}
!779 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!780 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!781 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!782 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!783 = !{!102, !103, !121, !784, !822, !828}
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 369, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 335, size: 1152, elements: !787)
!787 = !{!788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !821}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !786, file: !116, line: 337, baseType: !120, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !786, file: !116, line: 338, baseType: !120, size: 32, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !786, file: !116, line: 339, baseType: !120, size: 32, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !786, file: !116, line: 340, baseType: !120, size: 32, offset: 96)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !786, file: !116, line: 341, baseType: !120, size: 32, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !786, file: !116, line: 342, baseType: !120, size: 32, offset: 160)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !786, file: !116, line: 343, baseType: !120, size: 32, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !786, file: !116, line: 344, baseType: !121, size: 32, offset: 224)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !786, file: !116, line: 345, baseType: !120, size: 32, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !786, file: !116, line: 346, baseType: !120, size: 32, offset: 288)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !786, file: !116, line: 347, baseType: !799, size: 64, offset: 320)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, elements: !385)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !786, file: !116, line: 348, baseType: !120, size: 32, offset: 384)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !786, file: !116, line: 349, baseType: !120, size: 32, offset: 416)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !786, file: !116, line: 350, baseType: !120, size: 32, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !786, file: !116, line: 351, baseType: !121, size: 32, offset: 480)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !786, file: !116, line: 352, baseType: !120, size: 32, offset: 512)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !786, file: !116, line: 353, baseType: !120, size: 32, offset: 544)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !786, file: !116, line: 354, baseType: !799, size: 64, offset: 576)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !786, file: !116, line: 355, baseType: !120, size: 32, offset: 640)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !786, file: !116, line: 356, baseType: !120, size: 32, offset: 672)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !786, file: !116, line: 357, baseType: !120, size: 32, offset: 704)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !786, file: !116, line: 358, baseType: !121, size: 32, offset: 736)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !786, file: !116, line: 359, baseType: !120, size: 32, offset: 768)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !786, file: !116, line: 360, baseType: !120, size: 32, offset: 800)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !786, file: !116, line: 361, baseType: !799, size: 64, offset: 832)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !786, file: !116, line: 362, baseType: !120, size: 32, offset: 896)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !786, file: !116, line: 363, baseType: !120, size: 32, offset: 928)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !786, file: !116, line: 364, baseType: !799, size: 64, offset: 960)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !786, file: !116, line: 365, baseType: !120, size: 32, offset: 1024)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !786, file: !116, line: 366, baseType: !120, size: 32, offset: 1056)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !786, file: !116, line: 367, baseType: !820, size: 32, offset: 1088)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 32, elements: !484)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !786, file: !116, line: 368, baseType: !120, size: 32, offset: 1120)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 32)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !824, line: 343, size: 64, elements: !825)
!824 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !823, file: !824, line: 344, baseType: !121, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !823, file: !824, line: 345, baseType: !121, size: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!829 = !{!830, !836, !852, !863, !766}
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !768, file: !832, line: 752, type: !833, isLocal: false, isDefinition: true, align: 16)
!832 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 640, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 40)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !768, file: !832, line: 752, type: !838, isLocal: false, isDefinition: true, align: 32)
!838 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !840)
!840 = !{!841, !842, !843, !844, !850, !851}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !839, file: !141, line: 380, baseType: !144, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !839, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !839, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !839, file: !141, line: 386, baseType: !845, size: 32, offset: 96)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 32)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !847)
!847 = !{!848, !849}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !846, file: !141, line: 359, baseType: !154, size: 8)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !846, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !839, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !839, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !768, file: !832, line: 752, type: !854, isLocal: true, isDefinition: true, align: 32)
!854 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !856)
!856 = !{!857, !862}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !855, file: !132, line: 60, baseType: !858, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 32)
!859 = !DISubroutineType(types: !860)
!860 = !{!103, !861}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !855, file: !132, line: 65, baseType: !861, size: 32, offset: 32)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !768, file: !832, line: 752, type: !846, isLocal: true, isDefinition: true, align: 8)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !777, line: 100, size: 224, elements: !866)
!866 = !{!867, !873, !874, !883, !888, !893, !899}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !865, file: !777, line: 101, baseType: !868, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !777, line: 76, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 32)
!870 = !DISubroutineType(types: !871)
!871 = !{!103, !861, !872}
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !777, line: 56, baseType: !102)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !865, file: !777, line: 102, baseType: !868, size: 32, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !865, file: !777, line: 103, baseType: !875, size: 32, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !777, line: 83, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 32)
!877 = !DISubroutineType(types: !878)
!878 = !{!103, !861, !872, !879, !102}
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !777, line: 72, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 32)
!881 = !DISubroutineType(types: !882)
!882 = !{null, !861, !872, !102}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !865, file: !777, line: 104, baseType: !884, size: 32, offset: 96)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !777, line: 79, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DISubroutineType(types: !887)
!887 = !{!103, !861, !872, !828}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !865, file: !777, line: 105, baseType: !889, size: 32, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !777, line: 88, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 32)
!891 = !DISubroutineType(types: !892)
!892 = !{!776, !861, !872}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !865, file: !777, line: 106, baseType: !894, size: 32, offset: 160)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !777, line: 92, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = !DISubroutineType(types: !897)
!897 = !{!103, !861, !872, !898}
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !777, line: 64, baseType: !102)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !865, file: !777, line: 107, baseType: !900, size: 32, offset: 192)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !777, line: 96, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DISubroutineType(types: !903)
!903 = !{!103, !861, !872, !102}
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "debug_hook_in", scope: !906, file: !910, line: 43, type: !1102, isLocal: true, isDefinition: true)
!906 = distinct !DICompileUnit(language: DW_LANG_C99, file: !907, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !908, retainedTypes: !917, globals: !997, splitDebugInlining: false, nameTableKind: None)
!907 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon/getchar")
!908 = !{!30, !909}
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !910, line: 214, baseType: !32, size: 32, elements: !911)
!910 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!911 = !{!912, !913, !914, !915, !916}
!912 = !DIEnumerator(name: "ESC_ESC", value: 0)
!913 = !DIEnumerator(name: "ESC_ANSI", value: 1)
!914 = !DIEnumerator(name: "ESC_ANSI_FIRST", value: 2)
!915 = !DIEnumerator(name: "ESC_ANSI_VAL", value: 3)
!916 = !DIEnumerator(name: "ESC_ANSI_VAL_2", value: 4)
!917 = !{!102, !103, !918, !32, !24}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !203, line: 336, size: 608, elements: !921)
!921 = !{!922, !941, !945, !949, !962, !967, !971, !975, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !920, file: !203, line: 365, baseType: !923, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 32)
!924 = !DISubroutineType(types: !925)
!925 = !{!103, !926, !224}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !929)
!929 = !{!930, !931, !932, !933, !939, !940}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !928, file: !141, line: 380, baseType: !144, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !928, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !928, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !928, file: !141, line: 386, baseType: !934, size: 32, offset: 96)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !936)
!936 = !{!937, !938}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !935, file: !141, line: 359, baseType: !154, size: 8)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !935, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !928, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !928, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !920, file: !203, line: 366, baseType: !942, size: 32, offset: 32)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 32)
!943 = !DISubroutineType(types: !944)
!944 = !{null, !926, !155}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !920, file: !203, line: 374, baseType: !946, size: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 32)
!947 = !DISubroutineType(types: !948)
!948 = !{!103, !926}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !920, file: !203, line: 377, baseType: !950, size: 32, offset: 96)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 32)
!951 = !DISubroutineType(types: !952)
!952 = !{!103, !926, !953}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !203, line: 122, size: 64, elements: !956)
!956 = !{!957, !958, !959, !960, !961}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !955, file: !203, line: 123, baseType: !121, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !955, file: !203, line: 124, baseType: !154, size: 8, offset: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !955, file: !203, line: 125, baseType: !154, size: 8, offset: 40)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !955, file: !203, line: 126, baseType: !154, size: 8, offset: 48)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !955, file: !203, line: 127, baseType: !154, size: 8, offset: 56)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !920, file: !203, line: 379, baseType: !963, size: 32, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 32)
!964 = !DISubroutineType(types: !965)
!965 = !{!103, !926, !966}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !920, file: !203, line: 384, baseType: !968, size: 32, offset: 160)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!969 = !DISubroutineType(types: !970)
!970 = !{!103, !926, !255, !103}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !920, file: !203, line: 393, baseType: !972, size: 32, offset: 192)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = !DISubroutineType(types: !974)
!974 = !{!103, !926, !261, !262}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !920, file: !203, line: 402, baseType: !976, size: 32, offset: 224)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!977 = !DISubroutineType(types: !978)
!978 = !{null, !926}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !920, file: !203, line: 405, baseType: !976, size: 32, offset: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !920, file: !203, line: 408, baseType: !946, size: 32, offset: 288)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !920, file: !203, line: 411, baseType: !976, size: 32, offset: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !920, file: !203, line: 414, baseType: !976, size: 32, offset: 352)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !920, file: !203, line: 417, baseType: !946, size: 32, offset: 384)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !920, file: !203, line: 420, baseType: !946, size: 32, offset: 416)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !920, file: !203, line: 423, baseType: !976, size: 32, offset: 448)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !920, file: !203, line: 426, baseType: !976, size: 32, offset: 480)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !920, file: !203, line: 429, baseType: !946, size: 32, offset: 512)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !920, file: !203, line: 432, baseType: !946, size: 32, offset: 544)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !920, file: !203, line: 435, baseType: !990, size: 32, offset: 576)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = !DISubroutineType(types: !992)
!992 = !{null, !926, !993, !102}
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !203, line: 142, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 32)
!995 = !DISubroutineType(types: !996)
!996 = !{null, !926, !102}
!997 = !{!998, !904, !1005, !1047, !1049, !1055, !1062, !1065, !1090, !1094, !1096, !1098, !1100}
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !906, file: !910, line: 603, type: !1000, isLocal: true, isDefinition: true, align: 32)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !1002)
!1002 = !{!1003, !1004}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1001, file: !132, line: 60, baseType: !946, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1001, file: !132, line: 65, baseType: !926, size: 32, offset: 32)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "avail_queue", scope: !906, file: !910, line: 108, type: !1007, isLocal: true, isDefinition: true)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 32)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_fifo", file: !300, line: 2208, size: 128, elements: !1009)
!1009 = !{!1010}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "_queue", scope: !1008, file: !300, line: 2209, baseType: !1011, size: 128)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !300, line: 1709, size: 128, elements: !1012)
!1012 = !{!1013, !1026, !1028}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !1011, file: !300, line: 1710, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !1015, line: 46, baseType: !1016)
!1015 = !DIFile(filename: "zephyr/include/zephyr/sys/sflist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !1015, line: 41, size: 64, elements: !1017)
!1017 = !{!1018, !1025}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1016, file: !1015, line: 42, baseType: !1019, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !1015, line: 39, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !1015, line: 35, size: 32, elements: !1022)
!1022 = !{!1023}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !1021, file: !1015, line: 36, baseType: !1024, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !1015, line: 32, baseType: !121)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1016, file: !1015, line: 43, baseType: !1019, size: 32, offset: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1011, file: !300, line: 1711, baseType: !1027, offset: 64)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !460, line: 43, elements: !461)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !1011, file: !300, line: 1712, baseType: !1029, size: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !304, line: 233, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !304, line: 231, size: 64, elements: !1031)
!1031 = !{!1032}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !1030, file: !304, line: 232, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !309, line: 48, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !309, line: 37, size: 64, elements: !1035)
!1035 = !{!1036, !1042}
!1036 = !DIDerivedType(tag: DW_TAG_member, scope: !1034, file: !309, line: 38, baseType: !1037, size: 32)
!1037 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1034, file: !309, line: 38, size: 32, elements: !1038)
!1038 = !{!1039, !1041}
