; ModuleID = './build/powerkey.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.GPT_REGISTER_T = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.GPT_REGISTER_GLOABL_T = type { i32, i32, i32 }
%struct.gpt_context_t = type { i32, %struct.gpt_callback_context_t, i8, i8 }
%struct.gpt_callback_context_t = type { void (i8*)*, i8* }
%struct.gpt_sw_context_t = type { [32 x %struct.gpt_sw_timer_t], i32, i32, i32, i32, i8, i8, i8 }
%struct.gpt_sw_timer_t = type { %struct.gpt_callback_context_t, i32, i8, i8 }
%struct.keypad_buffer_t = type { [128 x %struct.GPT_REGISTER_GLOABL_T], i32, i32, i32 }
%struct.KEYPAD_REGISTER_T = type { i32, i32, i32, [3 x i32], i32, i32, i32, i32 }
%struct.keypad_key_bitmap_t = type { [2 x i32] }
%struct.powerkey_buffer_t = type { [32 x %struct.GPT_REGISTER_GLOABL_T], i8, i8, i8 }
%struct.powerkey_state_t = type { i32, i32 }

!143 = !DIEnumerator(name: "HAL_CLOCK_CG_GPDAC", value: 134)
!144 = !DIEnumerator(name: "HAL_CLOCK_CG_SENSOR_DMA", value: 136)
!145 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C1", value: 137)
!146 = !DIEnumerator(name: "HAL_CLOCK_CG_I2C0", value: 138)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !34, line: 75, baseType: !16, size: 32, elements: !148)
!148 = !{!149, !150, !151, !152}
!149 = !DIEnumerator(name: "GPT_MODE_ONE_SHOT", value: 0)
!150 = !DIEnumerator(name: "GPT_MODE_REPEAT", value: 16)
!151 = !DIEnumerator(name: "GPT_MODE_KEEP_GO", value: 32)
!152 = !DIEnumerator(name: "GPT_MODE_FREE_RUN", value: 48)
!153 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !154, line: 44, baseType: !7, size: 32, elements: !155)
!154 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt2523/Include/mt2523.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230}
!156 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!157 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!158 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!159 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!160 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!161 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!162 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!163 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!164 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!165 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!166 = !DIEnumerator(name: "OSTimer_IRQn", value: 0)
!167 = !DIEnumerator(name: "Reserved1_IRQn", value: 1)
!168 = !DIEnumerator(name: "MD_TOPSM_IRQn", value: 2)
!169 = !DIEnumerator(name: "CM4_TOPSM_IRQn", value: 3)
!170 = !DIEnumerator(name: "Reserved2_IRQn", value: 4)
!171 = !DIEnumerator(name: "Reserved3_IRQn", value: 5)
!172 = !DIEnumerator(name: "Reserved4_IRQn", value: 6)
!173 = !DIEnumerator(name: "Reserved5_IRQn", value: 7)
!174 = !DIEnumerator(name: "ACCDET_IRQn", value: 8)
!175 = !DIEnumerator(name: "RTC_IRQn", value: 9)
!176 = !DIEnumerator(name: "KP_IRQn", value: 10)
!177 = !DIEnumerator(name: "GPTimer_IRQn", value: 11)
!178 = !DIEnumerator(name: "EINT_IRQn", value: 12)
!179 = !DIEnumerator(name: "LCD_IRQn", value: 13)
!180 = !DIEnumerator(name: "LCD_AAL_IRQn", value: 14)
!181 = !DIEnumerator(name: "DSI_IRQn", value: 15)
!182 = !DIEnumerator(name: "RESIZE_IRQn", value: 16)
!183 = !DIEnumerator(name: "G2D_IRQn", value: 17)
!184 = !DIEnumerator(name: "CAM_IRQn", value: 18)
!185 = !DIEnumerator(name: "ROT_DMA_IRQn", value: 19)
!186 = !DIEnumerator(name: "SCAM_IRQn", value: 20)
!187 = !DIEnumerator(name: "DMA_IRQn", value: 21)
!188 = !DIEnumerator(name: "DMA_AO_IRQn", value: 22)
!189 = !DIEnumerator(name: "I2C_DUAL_IRQn", value: 23)
!190 = !DIEnumerator(name: "I2C0_IRQn", value: 24)
!191 = !DIEnumerator(name: "I2C1_IRQn", value: 25)
!192 = !DIEnumerator(name: "I2C2_IRQn", value: 26)
!193 = !DIEnumerator(name: "Reserved6_IRQn", value: 27)
!194 = !DIEnumerator(name: "GPCounter_IRQn", value: 28)
!195 = !DIEnumerator(name: "UART0_IRQn", value: 29)
!196 = !DIEnumerator(name: "UART1_IRQn", value: 30)
!197 = !DIEnumerator(name: "UART2_IRQn", value: 31)
!198 = !DIEnumerator(name: "UART3_IRQn", value: 32)
!199 = !DIEnumerator(name: "USB20_IRQn", value: 33)
!200 = !DIEnumerator(name: "MSDC0_IRQn", value: 34)
!201 = !DIEnumerator(name: "MSDC1_IRQn", value: 35)
!202 = !DIEnumerator(name: "Reserved7_IRQn", value: 36)
!203 = !DIEnumerator(name: "Reserved8_IRQn", value: 37)
!204 = !DIEnumerator(name: "SF_IRQn", value: 38)
!205 = !DIEnumerator(name: "DSP22CPU_IRQn", value: 39)
!206 = !DIEnumerator(name: "SensorDMA_IRQn", value: 40)
!207 = !DIEnumerator(name: "RGU_IRQn", value: 41)
!208 = !DIEnumerator(name: "SPI_SLV_IRQn", value: 42)
!209 = !DIEnumerator(name: "SPI_MST0_IRQn", value: 43)
!210 = !DIEnumerator(name: "SPI_MST1_IRQn", value: 44)
!211 = !DIEnumerator(name: "SPI_MST2_IRQn", value: 45)
!212 = !DIEnumerator(name: "SPI_MST3_IRQn", value: 46)
!213 = !DIEnumerator(name: "TRNG_IRQn", value: 47)
!214 = !DIEnumerator(name: "BT_TIMCON_IRQn", value: 48)
!215 = !DIEnumerator(name: "BTIF_IRQn", value: 49)
!216 = !DIEnumerator(name: "Reserved9_IRQn", value: 50)
!217 = !DIEnumerator(name: "Reserved10_IRQn", value: 51)
!218 = !DIEnumerator(name: "LISR0_IRQn", value: 52)
!219 = !DIEnumerator(name: "LISR1_IRQn", value: 53)
!220 = !DIEnumerator(name: "LISR2_IRQn", value: 54)
!221 = !DIEnumerator(name: "LISR3_IRQn", value: 55)
!222 = !DIEnumerator(name: "PSI_RISE_IRQn", value: 56)
!223 = !DIEnumerator(name: "PSI_FALL_IRQn", value: 57)
!224 = !DIEnumerator(name: "Reserved11_IRQn", value: 58)
!225 = !DIEnumerator(name: "Reserved12_IRQn", value: 59)
!226 = !DIEnumerator(name: "Reserved13_IRQn", value: 60)
!227 = !DIEnumerator(name: "Reserved14_IRQn", value: 61)
!228 = !DIEnumerator(name: "Reserved15_IRQn", value: 62)
!229 = !DIEnumerator(name: "Reserved16_IRQn", value: 63)
!230 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 64)
!231 = !{!61, !232, !65}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_T", file: !154, line: 1272, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1262, size: 288, elements: !235)
!235 = !{!236, !238, !239, !240, !242, !243, !244, !245, !246}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CON", scope: !234, file: !154, line: 1263, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !61)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CLK", scope: !234, file: !154, line: 1264, baseType: !237, size: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_EN", scope: !234, file: !154, line: 1265, baseType: !237, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_STA", scope: !234, file: !154, line: 1266, baseType: !241, size: 32, offset: 96)
!241 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_ACK", scope: !234, file: !154, line: 1267, baseType: !237, size: 32, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNT", scope: !234, file: !154, line: 1268, baseType: !237, size: 32, offset: 160)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPARE", scope: !234, file: !154, line: 1269, baseType: !237, size: 32, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNTH", scope: !234, file: !154, line: 1270, baseType: !237, size: 32, offset: 224)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPAREH", scope: !234, file: !154, line: 1271, baseType: !237, size: 32, offset: 256)
!247 = !{!83, !248, !257, !264, !280, !303}
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "gp_gpt_glb", scope: !85, file: !86, line: 49, type: !250, isLocal: false, isDefinition: true)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_GLOABL_T", file: !154, line: 1260, baseType: !252)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1256, size: 96, elements: !253)
!253 = !{!254, !255, !256}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQSTA", scope: !252, file: !154, line: 1257, baseType: !241, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK0", scope: !252, file: !154, line: 1258, baseType: !237, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK1", scope: !252, file: !154, line: 1259, baseType: !237, size: 32, offset: 64)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "flag", scope: !259, file: !86, line: 88, type: !263, isLocal: true, isDefinition: true)
!259 = distinct !DISubprogram(name: "gpt_get_lfosc_clock", scope: !86, file: !86, line: 86, type: !260, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !85, retainedNodes: !262)
!260 = !DISubroutineType(types: !261)
!261 = !{null}
!262 = !{}
!263 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !85, file: !86, line: 51, type: !266, isLocal: false, isDefinition: true)
!266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !267, size: 768, elements: !77)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_context_t", file: !34, line: 116, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 111, size: 128, elements: !269)
!269 = !{!270, !272, !278, !279}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !268, file: !34, line: 112, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !6, line: 400, baseType: !25)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !268, file: !34, line: 113, baseType: !273, size: 64, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_callback_context_t", file: !34, line: 109, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 106, size: 64, elements: !275)
!275 = !{!276, !277}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !274, file: !34, line: 107, baseType: !66, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !274, file: !34, line: 108, baseType: !65, size: 32, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "has_initilized", scope: !268, file: !34, line: 114, baseType: !263, size: 8, offset: 96)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "is_gpt_locked_sleep", scope: !268, file: !34, line: 115, baseType: !263, size: 8, offset: 104)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "gpt_sw_context", scope: !85, file: !86, line: 52, type: !282, isLocal: false, isDefinition: true)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_context_t", file: !34, line: 134, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 125, size: 4256, elements: !284)
!284 = !{!285, !296, !297, !298, !299, !300, !301, !302}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !283, file: !34, line: 126, baseType: !286, size: 4096)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 4096, elements: !294)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_timer_t", file: !34, line: 123, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !34, line: 118, size: 128, elements: !289)
!289 = !{!290, !291, !292, !293}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !288, file: !34, line: 119, baseType: !273, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "time_out_ms", scope: !288, file: !34, line: 120, baseType: !61, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !288, file: !34, line: 121, baseType: !263, size: 8, offset: 96)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "is_running", scope: !288, file: !34, line: 122, baseType: !263, size: 8, offset: 104)
!294 = !{!295}
!295 = !DISubrange(count: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_time", scope: !283, file: !34, line: 127, baseType: !61, size: 32, offset: 4096)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "last_absolute_time", scope: !283, file: !34, line: 128, baseType: !61, size: 32, offset: 4128)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "used_timer_count", scope: !283, file: !34, line: 129, baseType: !61, size: 32, offset: 4160)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "running_timer_count", scope: !283, file: !34, line: 130, baseType: !61, size: 32, offset: 4192)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_init", scope: !283, file: !34, line: 131, baseType: !263, size: 8, offset: 4224)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "is_start_from_isr", scope: !283, file: !34, line: 132, baseType: !263, size: 8, offset: 4232)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "is_sw_gpt", scope: !283, file: !34, line: 133, baseType: !263, size: 8, offset: 4240)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "gpt_clock_source", scope: !85, file: !86, line: 53, type: !61, isLocal: false, isDefinition: true)
!305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 192, elements: !77)
!306 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "powerkey_buffer", scope: !309, file: !310, line: 84, type: !398, isLocal: false, isDefinition: true)
!309 = distinct !DICompileUnit(language: DW_LANG_C99, file: !310, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !311, retainedTypes: !373, globals: !378, splitDebugInlining: false, nameTableKind: None)
!310 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_keypad_powerkey_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!311 = !{!312, !29, !5, !320, !325, !332, !367}
!312 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !313, line: 312, baseType: !16, size: 32, elements: !314)
!313 = !DIFile(filename: "../../../../../driver/chip/inc/hal_keypad.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!314 = !{!315, !316, !317, !318, !319}
!315 = !DIEnumerator(name: "HAL_KEYPAD_KEY_RELEASE", value: 0)
!316 = !DIEnumerator(name: "HAL_KEYPAD_KEY_PRESS", value: 1)
!317 = !DIEnumerator(name: "HAL_KEYPAD_KEY_LONG_PRESS", value: 2)
!318 = !DIEnumerator(name: "HAL_KEYPAD_KEY_REPEAT", value: 3)
!319 = !DIEnumerator(name: "HAL_KEYPAD_KEY_PMU_LONG_PRESS", value: 4)
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !321, line: 99, baseType: !16, size: 32, elements: !322)
!321 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_keypad_powerkey_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!322 = !{!323, !324}
!323 = !DIEnumerator(name: "POWERKEY_PMU_POWRKEY", value: 0)
!324 = !DIEnumerator(name: "POWERKEY_PMU_LONG_POWERKEY", value: 1)
!325 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 94, baseType: !7, size: 32, elements: !327)
!326 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_pmu.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!327 = !{!328, !329, !330, !331}
!328 = !DIEnumerator(name: "PMU_STATUS_ERROR_EINT_NUMBER", value: -3)
!329 = !DIEnumerator(name: "PMU_STATUS_INVALID_PARAMETER", value: -2)
!330 = !DIEnumerator(name: "PMU_STATUS_ERROR", value: -1)
!331 = !DIEnumerator(name: "PMU_STATUS_SUCCESS", value: 0)
!332 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 57, baseType: !16, size: 32, elements: !333)
!333 = !{!334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366}
!334 = !DIEnumerator(name: "PMU_INT_ALDO_OC", value: 0)
!335 = !DIEnumerator(name: "PMU_INT_ALDO_PG", value: 1)
!336 = !DIEnumerator(name: "PMU_INT_DLDO_OC", value: 2)
!337 = !DIEnumerator(name: "PMU_INT_DLDO_PG", value: 3)
!338 = !DIEnumerator(name: "PMU_INT_VC_BUCK_OC", value: 4)
!339 = !DIEnumerator(name: "PMU_INT_VCORE_PG", value: 5)
!340 = !DIEnumerator(name: "PMU_INT_VC_LDO_OC", value: 6)
!341 = !DIEnumerator(name: "PMU_INT_PKEYLP", value: 7)
!342 = !DIEnumerator(name: "PMU_INT_THM1", value: 8)
!343 = !DIEnumerator(name: "PMU_INT_THM2", value: 9)
!344 = !DIEnumerator(name: "PMU_INT_AXPKEY", value: 10)
!345 = !DIEnumerator(name: "PMU_INT_PWRKEY", value: 11)
!346 = !DIEnumerator(name: "PMU_INT_CHGOV", value: 12)
!347 = !DIEnumerator(name: "PMU_INT_CHRDET", value: 13)
!348 = !DIEnumerator(name: "PMU_INT_THR_H", value: 14)
!349 = !DIEnumerator(name: "PMU_INT_THR_L", value: 15)
!350 = !DIEnumerator(name: "PMU_INT_OVER110", value: 16)
!351 = !DIEnumerator(name: "PMU_INT_OVER40", value: 17)
!352 = !DIEnumerator(name: "PMU_INT_PSW_PG", value: 18)
!353 = !DIEnumerator(name: "PMU_INT_BAT_H", value: 19)
!354 = !DIEnumerator(name: "PMU_INT_BAT_L", value: 20)
!355 = !DIEnumerator(name: "PMU_INT_VBATON_HV_LV", value: 21)
!356 = !DIEnumerator(name: "PMU_INT_VBAT_UNDET_LV", value: 22)
!357 = !DIEnumerator(name: "PMU_INT_BVALID_DET_LV", value: 23)
!358 = !DIEnumerator(name: "PMU_INT_CHRWDT_LV", value: 24)
!359 = !DIEnumerator(name: "PMU_INT_HOT_LV", value: 25)
!360 = !DIEnumerator(name: "PMU_INT_WARM_LV", value: 26)
!361 = !DIEnumerator(name: "PMU_INT_COOL_LV", value: 27)
!362 = !DIEnumerator(name: "PMU_INT_COLD_LV", value: 28)
!363 = !DIEnumerator(name: "PMU_INT_IMP_LV", value: 29)
!364 = !DIEnumerator(name: "PMU_INT_NAG_C_LV", value: 30)
!365 = !DIEnumerator(name: "PMU_INT_AD_LBAT_LV", value: 31)
!366 = !DIEnumerator(name: "PMU_INT_MAX", value: 32)
!367 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !326, line: 45, baseType: !16, size: 32, elements: !368)
!368 = !{!369, !370, !371, !372}
!369 = !DIEnumerator(name: "PMU_NONE", value: 0)
!370 = !DIEnumerator(name: "PMU_EDGE_RISING", value: 1)
!371 = !DIEnumerator(name: "PMU_EDGE_FALLING", value: 2)
!372 = !DIEnumerator(name: "PMU_EDGE_FALLING_AND_RISING", value: 3)
!373 = !{!66, !65, !7, !61, !374, !16}
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "pmu_callback_t", file: !326, line: 108, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DISubroutineType(types: !377)
!377 = !{null, !74, !65}
!378 = !{!379, !386, !307, !388, !396}
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "last_state", scope: !381, file: !310, line: 355, type: !74, isLocal: true, isDefinition: true)
!381 = distinct !DISubprogram(name: "powerkey_get_pressed_state", scope: !310, file: !310, line: 353, type: !382, scopeLine: 354, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !309, retainedNodes: !384)
!382 = !DISubroutineType(types: !383)
!383 = !{!263}
!384 = !{!385}
!385 = !DILocalVariable(name: "current_state", scope: !381, file: !310, line: 356, type: !61)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "powerkey_lock_sleep_handle", scope: !309, file: !310, line: 50, type: !74, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "powerkey_state", scope: !309, file: !310, line: 85, type: !390, isLocal: false, isDefinition: true)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "powerkey_state_t", file: !321, line: 108, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !321, line: 104, size: 64, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "timer_handle", scope: !391, file: !321, line: 105, baseType: !61, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "current_state", scope: !391, file: !321, line: 106, baseType: !395, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_keypad_key_state_t", file: !313, line: 318, baseType: !312)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "powerkey_lock_sleep_name", scope: !309, file: !310, line: 49, type: !80, isLocal: true, isDefinition: true)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "powerkey_buffer_t", file: !321, line: 96, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !321, line: 91, size: 3104, elements: !400)
!400 = !{!401, !409, !410, !411}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !399, file: !321, line: 92, baseType: !402, size: 3072)
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 3072, elements: !294)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_keypad_powerkey_event_t", file: !313, line: 365, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !313, line: 361, size: 96, elements: !405)
!405 = !{!406, !407, !408}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !404, file: !313, line: 362, baseType: !395, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "key_data", scope: !404, file: !313, line: 363, baseType: !61, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "time_stamp", scope: !404, file: !313, line: 364, baseType: !61, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "write_index", scope: !399, file: !321, line: 93, baseType: !74, size: 8, offset: 3072)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "read_index", scope: !399, file: !321, line: 94, baseType: !74, size: 8, offset: 3080)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "press_count", scope: !399, file: !321, line: 95, baseType: !74, size: 8, offset: 3088)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "gpio_register_base", scope: !414, file: !415, line: 64, type: !515, isLocal: false, isDefinition: true)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !416, retainedTypes: !510, globals: !514, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!416 = !{!417, !469, !476, !480, !486, !490, !499, !504}
!417 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 339, baseType: !16, size: 32, elements: !418)
!418 = !{!419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468}
!419 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!420 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!421 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!422 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!423 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!424 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!425 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!426 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!427 = !DIEnumerator(name: "HAL_GPIO_8", value: 8)
!428 = !DIEnumerator(name: "HAL_GPIO_9", value: 9)
!429 = !DIEnumerator(name: "HAL_GPIO_10", value: 10)
!430 = !DIEnumerator(name: "HAL_GPIO_11", value: 11)
!431 = !DIEnumerator(name: "HAL_GPIO_12", value: 12)
!432 = !DIEnumerator(name: "HAL_GPIO_13", value: 13)
!433 = !DIEnumerator(name: "HAL_GPIO_14", value: 14)
!434 = !DIEnumerator(name: "HAL_GPIO_15", value: 15)
!435 = !DIEnumerator(name: "HAL_GPIO_16", value: 16)
!436 = !DIEnumerator(name: "HAL_GPIO_17", value: 17)
!437 = !DIEnumerator(name: "HAL_GPIO_18", value: 18)
!438 = !DIEnumerator(name: "HAL_GPIO_19", value: 19)
!439 = !DIEnumerator(name: "HAL_GPIO_20", value: 20)
!440 = !DIEnumerator(name: "HAL_GPIO_21", value: 21)
!441 = !DIEnumerator(name: "HAL_GPIO_22", value: 22)
!442 = !DIEnumerator(name: "HAL_GPIO_23", value: 23)
!443 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!444 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!445 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!446 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!447 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!448 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!449 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!450 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!451 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!452 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!453 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!454 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!455 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!456 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!457 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!458 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!459 = !DIEnumerator(name: "HAL_GPIO_40", value: 40)
!460 = !DIEnumerator(name: "HAL_GPIO_41", value: 41)
!461 = !DIEnumerator(name: "HAL_GPIO_42", value: 42)
!462 = !DIEnumerator(name: "HAL_GPIO_43", value: 43)
!463 = !DIEnumerator(name: "HAL_GPIO_44", value: 44)
!464 = !DIEnumerator(name: "HAL_GPIO_45", value: 45)
!465 = !DIEnumerator(name: "HAL_GPIO_46", value: 46)
!466 = !DIEnumerator(name: "HAL_GPIO_47", value: 47)
!467 = !DIEnumerator(name: "HAL_GPIO_48", value: 48)
!468 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 49)
!469 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !470, line: 224, baseType: !7, size: 32, elements: !471)
!470 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!471 = !{!472, !473, !474, !475}
!472 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!473 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!474 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!475 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!476 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !470, line: 210, baseType: !16, size: 32, elements: !477)
!477 = !{!478, !479}
!478 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!479 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!480 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !470, line: 233, baseType: !7, size: 32, elements: !481)
!481 = !{!482, !483, !484, !485}
!482 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!483 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!484 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!485 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!486 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !470, line: 217, baseType: !16, size: 32, elements: !487)
!487 = !{!488, !489}
!488 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!489 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!490 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 415, baseType: !16, size: 32, elements: !491)
!491 = !{!492, !493, !494, !495, !496, !497, !498}
!492 = !DIEnumerator(name: "HAL_GPIO_CLOCK_0", value: 0)
!493 = !DIEnumerator(name: "HAL_GPIO_CLOCK_1", value: 1)
!494 = !DIEnumerator(name: "HAL_GPIO_CLOCK_2", value: 2)
!495 = !DIEnumerator(name: "HAL_GPIO_CLOCK_3", value: 3)
!496 = !DIEnumerator(name: "HAL_GPIO_CLOCK_4", value: 4)
!497 = !DIEnumerator(name: "HAL_GPIO_CLOCK_5", value: 5)
!498 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MAX", value: 6)
!499 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 427, baseType: !16, size: 32, elements: !500)
!500 = !{!501, !502, !503}
!501 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_26M", value: 1)
!502 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_32K", value: 4)
!503 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_MAX", value: 5)
!504 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !470, line: 242, baseType: !16, size: 32, elements: !505)
!505 = !{!506, !507, !508, !509}
!506 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!507 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!508 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!509 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!510 = !{!65, !511, !512, !513}
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_direction_t", file: !470, line: 213, baseType: !476)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !470, line: 220, baseType: !486)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !470, line: 247, baseType: !504)
!514 = !{!412}
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_REGISTER_T", file: !154, line: 1554, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1522, size: 29440, elements: !518)
!518 = !{!519, !533, !537, !546, !547, !556, !557, !566, !567, !577, !578, !587, !588, !597, !598, !607, !608, !617, !621, !630, !631, !640, !641, !650, !659, !660, !671, !675, !684, !685}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_REGISTER", scope: !517, file: !154, line: 1523, baseType: !520, size: 256)
!520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !521, size: 256, elements: !531)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIR_REGISTER_T", file: !154, line: 1400, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1395, size: 128, elements: !523)
!523 = !{!524, !525, !526, !527}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR", scope: !522, file: !154, line: 1396, baseType: !237, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_SET", scope: !522, file: !154, line: 1397, baseType: !237, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_CLR", scope: !522, file: !154, line: 1398, baseType: !237, size: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !522, file: !154, line: 1399, baseType: !528, size: 32, offset: 96)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 32, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 4)
!531 = !{!532}
!532 = !DISubrange(count: 2)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET1", scope: !517, file: !154, line: 1524, baseType: !534, size: 1792, offset: 256)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 1792, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 224)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_REGISTER", scope: !517, file: !154, line: 1525, baseType: !538, size: 256, offset: 2048)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 256, elements: !531)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLEN_REGISTER_T", file: !154, line: 1409, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1404, size: 128, elements: !541)
!541 = !{!542, !543, !544, !545}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN", scope: !540, file: !154, line: 1405, baseType: !237, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_SET", scope: !540, file: !154, line: 1406, baseType: !237, size: 32, offset: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_CLR", scope: !540, file: !154, line: 1407, baseType: !237, size: 32, offset: 64)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !540, file: !154, line: 1408, baseType: !528, size: 32, offset: 96)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET2", scope: !517, file: !154, line: 1526, baseType: !534, size: 1792, offset: 2304)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_REGISTER", scope: !517, file: !154, line: 1527, baseType: !548, size: 256, offset: 4096)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !549, size: 256, elements: !531)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DINV_REGISTER_T", file: !154, line: 1417, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1412, size: 128, elements: !551)
!551 = !{!552, !553, !554, !555}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV", scope: !550, file: !154, line: 1413, baseType: !237, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_SET", scope: !550, file: !154, line: 1414, baseType: !237, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_CLR", scope: !550, file: !154, line: 1415, baseType: !237, size: 32, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !550, file: !154, line: 1416, baseType: !528, size: 32, offset: 96)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET3", scope: !517, file: !154, line: 1528, baseType: !534, size: 1792, offset: 4352)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_REGISTER", scope: !517, file: !154, line: 1529, baseType: !558, size: 256, offset: 6144)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 256, elements: !531)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DOUT_REGISTER_T", file: !154, line: 1426, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1421, size: 128, elements: !561)
!561 = !{!562, !563, !564, !565}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT", scope: !560, file: !154, line: 1422, baseType: !237, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_SET", scope: !560, file: !154, line: 1423, baseType: !237, size: 32, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_CLR", scope: !560, file: !154, line: 1424, baseType: !237, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !560, file: !154, line: 1425, baseType: !528, size: 32, offset: 96)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET4", scope: !517, file: !154, line: 1530, baseType: !534, size: 1792, offset: 6400)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN_REGISTER", scope: !517, file: !154, line: 1531, baseType: !568, size: 256, offset: 8192)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 256, elements: !531)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIN_REGISTER_T", file: !154, line: 1432, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1429, size: 128, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN", scope: !570, file: !154, line: 1430, baseType: !237, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !570, file: !154, line: 1431, baseType: !574, size: 96, offset: 32)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 96, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 12)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET5", scope: !517, file: !154, line: 1532, baseType: !534, size: 1792, offset: 8448)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_REGISTER", scope: !517, file: !154, line: 1533, baseType: !579, size: 256, offset: 10240)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 256, elements: !531)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLSEL_REGISTER_T", file: !154, line: 1440, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1435, size: 128, elements: !582)
!582 = !{!583, !584, !585, !586}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL", scope: !581, file: !154, line: 1436, baseType: !237, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_SET", scope: !581, file: !154, line: 1437, baseType: !237, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_CLR", scope: !581, file: !154, line: 1438, baseType: !237, size: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !581, file: !154, line: 1439, baseType: !528, size: 32, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET6", scope: !517, file: !154, line: 1534, baseType: !534, size: 1792, offset: 10496)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_REGISTER", scope: !517, file: !154, line: 1535, baseType: !589, size: 256, offset: 12288)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 256, elements: !531)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SMT_REGISTER_T", file: !154, line: 1448, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1443, size: 128, elements: !592)
!592 = !{!593, !594, !595, !596}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT", scope: !591, file: !154, line: 1444, baseType: !237, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_SET", scope: !591, file: !154, line: 1445, baseType: !237, size: 32, offset: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_CLR", scope: !591, file: !154, line: 1446, baseType: !237, size: 32, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !591, file: !154, line: 1447, baseType: !528, size: 32, offset: 96)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET7", scope: !517, file: !154, line: 1536, baseType: !534, size: 1792, offset: 12544)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_REGISTER", scope: !517, file: !154, line: 1537, baseType: !599, size: 256, offset: 14336)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 256, elements: !531)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SR_REGISTER_T", file: !154, line: 1455, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1450, size: 128, elements: !602)
!602 = !{!603, !604, !605, !606}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR", scope: !601, file: !154, line: 1451, baseType: !237, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_SET", scope: !601, file: !154, line: 1452, baseType: !237, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_CLR", scope: !601, file: !154, line: 1453, baseType: !237, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !601, file: !154, line: 1454, baseType: !528, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET8", scope: !517, file: !154, line: 1538, baseType: !534, size: 1792, offset: 14592)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_REGISTER", scope: !517, file: !154, line: 1539, baseType: !609, size: 512, offset: 16384)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 512, elements: !529)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DRV_REGISTER_T", file: !154, line: 1463, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1458, size: 128, elements: !612)
!612 = !{!613, !614, !615, !616}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV", scope: !611, file: !154, line: 1459, baseType: !237, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_SET", scope: !611, file: !154, line: 1460, baseType: !237, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_CLR", scope: !611, file: !154, line: 1461, baseType: !237, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !611, file: !154, line: 1462, baseType: !528, size: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET9", scope: !517, file: !154, line: 1540, baseType: !618, size: 1536, offset: 16896)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 1536, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_REGISTER", scope: !517, file: !154, line: 1541, baseType: !622, size: 256, offset: 18432)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 256, elements: !531)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_IES_REGISTER_T", file: !154, line: 1471, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1466, size: 128, elements: !625)
!625 = !{!626, !627, !628, !629}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES", scope: !624, file: !154, line: 1467, baseType: !237, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_SET", scope: !624, file: !154, line: 1468, baseType: !237, size: 32, offset: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_CLR", scope: !624, file: !154, line: 1469, baseType: !237, size: 32, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !624, file: !154, line: 1470, baseType: !528, size: 32, offset: 96)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET10", scope: !517, file: !154, line: 1542, baseType: !534, size: 1792, offset: 18688)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_REGISTER", scope: !517, file: !154, line: 1543, baseType: !632, size: 256, offset: 20480)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 256, elements: !531)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PUPD_REGISTER_T", file: !154, line: 1480, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1475, size: 128, elements: !635)
!635 = !{!636, !637, !638, !639}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD", scope: !634, file: !154, line: 1476, baseType: !237, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_SET", scope: !634, file: !154, line: 1477, baseType: !237, size: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_CLR", scope: !634, file: !154, line: 1478, baseType: !237, size: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !634, file: !154, line: 1479, baseType: !528, size: 32, offset: 96)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET11", scope: !517, file: !154, line: 1544, baseType: !534, size: 1792, offset: 20736)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_REGISTER", scope: !517, file: !154, line: 1545, baseType: !642, size: 256, offset: 22528)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 256, elements: !531)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN0_REGISTER_T", file: !154, line: 1489, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1484, size: 128, elements: !645)
!645 = !{!646, !647, !648, !649}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0", scope: !644, file: !154, line: 1485, baseType: !237, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_SET", scope: !644, file: !154, line: 1486, baseType: !237, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_CLR", scope: !644, file: !154, line: 1487, baseType: !237, size: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !644, file: !154, line: 1488, baseType: !528, size: 32, offset: 96)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_REGISTER", scope: !517, file: !154, line: 1546, baseType: !651, size: 256, offset: 22784)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 256, elements: !531)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN1_REGISTER_T", file: !154, line: 1497, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1492, size: 128, elements: !654)
!654 = !{!655, !656, !657, !658}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1", scope: !653, file: !154, line: 1493, baseType: !237, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_SET", scope: !653, file: !154, line: 1494, baseType: !237, size: 32, offset: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_CLR", scope: !653, file: !154, line: 1495, baseType: !237, size: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !653, file: !154, line: 1496, baseType: !528, size: 32, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET12", scope: !517, file: !154, line: 1547, baseType: !618, size: 1536, offset: 23040)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_REGISTER", scope: !517, file: !154, line: 1548, baseType: !661, size: 896, offset: 24576)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !662, size: 896, elements: !669)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_MODE_REGISTER_T", file: !154, line: 1505, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1500, size: 128, elements: !664)
!664 = !{!665, !666, !667, !668}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE", scope: !663, file: !154, line: 1501, baseType: !237, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_SET", scope: !663, file: !154, line: 1502, baseType: !237, size: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_CLR", scope: !663, file: !154, line: 1503, baseType: !237, size: 32, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !663, file: !154, line: 1504, baseType: !528, size: 32, offset: 96)
!669 = !{!670}
!670 = !DISubrange(count: 7)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET13", scope: !517, file: !154, line: 1549, baseType: !672, size: 1152, offset: 25472)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 1152, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 144)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_REGISTER", scope: !517, file: !154, line: 1550, baseType: !676, size: 512, offset: 26624)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 512, elements: !529)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TDSEL_REGISTER_T", file: !154, line: 1513, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1508, size: 128, elements: !679)
!679 = !{!680, !681, !682, !683}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL", scope: !678, file: !154, line: 1509, baseType: !237, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_SET", scope: !678, file: !154, line: 1510, baseType: !237, size: 32, offset: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_CLR", scope: !678, file: !154, line: 1511, baseType: !237, size: 32, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !678, file: !154, line: 1512, baseType: !528, size: 32, offset: 96)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET14", scope: !517, file: !154, line: 1551, baseType: !618, size: 1536, offset: 27136)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT_REGISTER", scope: !517, file: !154, line: 1552, baseType: !686, size: 768, offset: 28672)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !687, size: 768, elements: !77)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_CLKOUT_REGISTER_T", file: !154, line: 1519, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1516, size: 128, elements: !689)
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT", scope: !688, file: !154, line: 1517, baseType: !237, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !688, file: !154, line: 1518, baseType: !574, size: 96, offset: 32)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "g_uart_hwstatus", scope: !694, file: !695, line: 101, type: !887, isLocal: true, isDefinition: true)
!694 = distinct !DICompileUnit(language: DW_LANG_C99, file: !695, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !696, retainedTypes: !798, globals: !808, splitDebugInlining: false, nameTableKind: None)
!695 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!696 = !{!697, !704, !719, !725, !731, !736, !741, !748, !764, !770, !774, !779, !786, !794}
!697 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 180, baseType: !16, size: 32, elements: !698)
!698 = !{!699, !700, !701, !702, !703}
!699 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!700 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!701 = !DIEnumerator(name: "HAL_UART_2", value: 2)
!702 = !DIEnumerator(name: "HAL_UART_3", value: 3)
!703 = !DIEnumerator(name: "HAL_UART_MAX", value: 4)
!704 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !705, line: 189, baseType: !16, size: 32, elements: !706)
!705 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_pdma_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!706 = !{!707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!707 = !DIEnumerator(name: "VDMA_START_CHANNEL", value: 8)
!708 = !DIEnumerator(name: "VDMA_UART1TX", value: 8)
!709 = !DIEnumerator(name: "VDMA_UART1RX", value: 9)
!710 = !DIEnumerator(name: "VDMA_UART2TX", value: 10)
!711 = !DIEnumerator(name: "VDMA_UART2RX", value: 11)
!712 = !DIEnumerator(name: "VDMA_UART3TX", value: 12)
!713 = !DIEnumerator(name: "VDMA_UART3RX", value: 13)
!714 = !DIEnumerator(name: "VDMA_UART0TX", value: 14)
!715 = !DIEnumerator(name: "VDMA_UART0RX", value: 15)
!716 = !DIEnumerator(name: "VDMA_BTIFTX", value: 16)
!717 = !DIEnumerator(name: "VDMA_BTIFRX", value: 17)
!718 = !DIEnumerator(name: "VDMA_END_CHANNEL", value: 18)
!719 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !720, line: 355, baseType: !7, size: 32, elements: !721)
!720 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!721 = !{!722, !723, !724}
!722 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!723 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!724 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!725 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !705, line: 206, baseType: !7, size: 32, elements: !726)
!726 = !{!727, !728, !729, !730}
!727 = !DIEnumerator(name: "VDMA_ERROR", value: -3)
!728 = !DIEnumerator(name: "VDMA_ERROR_CHANNEL", value: -2)
!729 = !DIEnumerator(name: "VDMA_INVALID_PARAMETER", value: -1)
!730 = !DIEnumerator(name: "VDMA_OK", value: 0)
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !695, line: 65, baseType: !16, size: 32, elements: !732)
!732 = !{!733, !734, !735}
!733 = !DIEnumerator(name: "UART_HWSTATUS_UNINITIALIZED", value: 0)
!734 = !DIEnumerator(name: "UART_HWSTATUS_POLL_INITIALIZED", value: 1)
!735 = !DIEnumerator(name: "UART_HWSTATUS_DMA_INITIALIZED", value: 2)
!736 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !695, line: 77, baseType: !16, size: 32, elements: !737)
!737 = !{!738, !739, !740}
!738 = !DIEnumerator(name: "UART_FLOWCONTROL_NONE", value: 0)
!739 = !DIEnumerator(name: "UART_FLOWCONTROL_SOFTWARE", value: 1)
!740 = !DIEnumerator(name: "UART_FLOWCONTROL_HARDWARE", value: 2)
!741 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !720, line: 345, baseType: !7, size: 32, elements: !742)
!742 = !{!743, !744, !745, !746, !747}
!743 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!744 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!745 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!746 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!747 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!748 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !720, line: 302, baseType: !16, size: 32, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763}
!750 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!751 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!752 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!753 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!754 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!755 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!756 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!757 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!758 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!759 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!760 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!761 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!762 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!763 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!764 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !720, line: 321, baseType: !16, size: 32, elements: !765)
!765 = !{!766, !767, !768, !769}
!766 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!767 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!768 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!769 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!770 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !720, line: 330, baseType: !16, size: 32, elements: !771)
!771 = !{!772, !773}
!772 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!773 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!774 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !720, line: 337, baseType: !16, size: 32, elements: !775)
!775 = !{!776, !777, !778}
!776 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!777 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!778 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!779 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !780, line: 101, baseType: !7, size: 32, elements: !781)
!780 = !DIFile(filename: "../../../../../driver/chip/inc/hal_clock.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!781 = !{!782, !783, !784, !785}
!782 = !DIEnumerator(name: "HAL_CLOCK_STATUS_UNINITIALIZED", value: -3)
!783 = !DIEnumerator(name: "HAL_CLOCK_STATUS_INVALID_PARAMETER", value: -2)
!784 = !DIEnumerator(name: "HAL_CLOCK_STATUS_ERROR", value: -1)
!785 = !DIEnumerator(name: "HAL_CLOCK_STATUS_OK", value: 0)
!786 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !787, line: 152, baseType: !7, size: 32, elements: !788)
!787 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!788 = !{!789, !790, !791, !792, !793}
!789 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!790 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!791 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!792 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!793 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!794 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !705, line: 222, baseType: !7, size: 32, elements: !795)
!795 = !{!796, !797}
!796 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_ERROR", value: -1)
!797 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_SUCCESS", value: 0)
!798 = !{!65, !799, !61, !800}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_dma_callback_data_t", file: !802, line: 96, baseType: !803)
!802 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_uart_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !802, line: 93, size: 64, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "is_rx", scope: !803, file: !802, line: 94, baseType: !263, size: 8)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "uart_port", scope: !803, file: !802, line: 95, baseType: !807, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !15, line: 186, baseType: !697)
!808 = !{!809, !812, !814, !816, !818, !822, !831, !845, !692, !847, !860, !865, !879, !885}
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "g_uart_frist_send_complete_interrupt", scope: !694, file: !695, line: 92, type: !811, isLocal: true, isDefinition: true)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 32, elements: !529)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "g_uart_restore_init", scope: !694, file: !695, line: 93, type: !263, isLocal: true, isDefinition: true)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "g_uart_send_lock_status", scope: !694, file: !695, line: 94, type: !811, isLocal: true, isDefinition: true)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler", scope: !694, file: !695, line: 95, type: !528, isLocal: true, isDefinition: true)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "g_uart_flowcontrol_status", scope: !694, file: !695, line: 96, type: !820, isLocal: true, isDefinition: true)
!820 = !DICompositeType(tag: DW_TAG_array_type, baseType: !821, size: 128, elements: !529)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_flowcontrol_t", file: !695, line: 81, baseType: !736)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "g_uart_sw_flowcontrol_config", scope: !694, file: !695, line: 97, type: !824, isLocal: true, isDefinition: true)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !825, size: 96, elements: !529)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_sw_flowcontrol_config_t", file: !695, line: 87, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !695, line: 83, size: 24, elements: !827)
!827 = !{!828, !829, !830}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "xon", scope: !826, file: !695, line: 84, baseType: !74, size: 8)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "xoff", scope: !826, file: !695, line: 85, baseType: !74, size: 8, offset: 8)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "escape_character", scope: !826, file: !695, line: 86, baseType: !74, size: 8, offset: 16)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "g_uart_config", scope: !694, file: !695, line: 98, type: !833, isLocal: true, isDefinition: true)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !834, size: 512, elements: !529)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !720, line: 378, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !720, line: 373, size: 128, elements: !836)
!836 = !{!837, !839, !841, !843}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !835, file: !720, line: 374, baseType: !838, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !720, line: 317, baseType: !748)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !835, file: !720, line: 375, baseType: !840, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !720, line: 326, baseType: !764)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !835, file: !720, line: 376, baseType: !842, size: 32, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !720, line: 333, baseType: !770)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !835, file: !720, line: 377, baseType: !844, size: 32, offset: 96)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !720, line: 341, baseType: !774)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "g_uart_irq_pending_status", scope: !694, file: !695, line: 99, type: !811, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "g_uart_callback", scope: !694, file: !695, line: 102, type: !849, isLocal: true, isDefinition: true)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 256, elements: !529)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_callback_t", file: !695, line: 74, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !695, line: 71, size: 64, elements: !852)
!852 = !{!853, !859}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !851, file: !695, line: 72, baseType: !854, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !720, line: 410, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 32)
!856 = !DISubroutineType(types: !857)
!857 = !{null, !858, !65}
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !720, line: 359, baseType: !719)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !851, file: !695, line: 73, baseType: !65, size: 32, offset: 32)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "g_uart_dma_callback_data", scope: !694, file: !695, line: 103, type: !862, isLocal: true, isDefinition: true)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !801, size: 512, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 8)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "g_uart_dma_config", scope: !694, file: !695, line: 104, type: !867, isLocal: true, isDefinition: true)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !868, size: 896, elements: !529)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !720, line: 390, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !720, line: 382, size: 224, elements: !870)
!870 = !{!871, !873, !874, !875, !876, !877, !878}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !869, file: !720, line: 383, baseType: !872, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !869, file: !720, line: 384, baseType: !61, size: 32, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !869, file: !720, line: 385, baseType: !61, size: 32, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !869, file: !720, line: 386, baseType: !872, size: 32, offset: 96)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !869, file: !720, line: 387, baseType: !61, size: 32, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !869, file: !720, line: 388, baseType: !61, size: 32, offset: 160)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !869, file: !720, line: 389, baseType: !61, size: 32, offset: 192)
!879 = !DIGlobalVariableExpression(var: !880, expr: !DIExpression())
!880 = distinct !DIGlobalVariable(name: "g_uart_baudrate_map", scope: !694, file: !695, line: 105, type: !881, isLocal: true, isDefinition: true)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !882, size: 416, elements: !883)
!882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!883 = !{!884}
!884 = !DISubrange(count: 13)
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(name: "g_uart_global_data_initialized", scope: !694, file: !695, line: 90, type: !263, isLocal: true, isDefinition: true)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 128, elements: !529)
!888 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !889)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_hwstatus_t", file: !695, line: 69, baseType: !731)
!890 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!891 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "g_uart_regbase", scope: !894, file: !895, line: 53, type: !979, isLocal: false, isDefinition: true)
!894 = distinct !DICompileUnit(language: DW_LANG_C99, file: !895, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !896, retainedTypes: !907, globals: !963, splitDebugInlining: false, nameTableKind: None)
!895 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart_internal_platform.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!896 = !{!88, !153, !704, !697, !897}
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !802, line: 46, baseType: !16, size: 32, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906}
!899 = !DIEnumerator(name: "UART_INTERRUPT_NONE", value: 0)
!900 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_ERROR", value: 1)
!901 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_TIMEOUT", value: 2)
!902 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_BREAK", value: 3)
!903 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_AVAILABLE", value: 4)
!904 = !DIEnumerator(name: "UART_INTERRUPT_SEND_AVAILABLE", value: 5)
!905 = !DIEnumerator(name: "UART_INTERRUPT_SOFTWARE_FLOWCONTROL", value: 6)
!906 = !DIEnumerator(name: "UART_INTERRUPT_HARDWARE_FLOWCONTROL", value: 7)
!907 = !{!908}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_REGISTER_T", file: !154, line: 588, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 542, size: 800, elements: !911)
!911 = !{!912, !918, !923, !929, !930, !935, !940, !941, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "RBR_THR_DLL", scope: !910, file: !154, line: 547, baseType: !913, size: 32)
!913 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !910, file: !154, line: 543, size: 32, elements: !914)
!914 = !{!915, !916, !917}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "RBR", scope: !913, file: !154, line: 544, baseType: !241, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "THR", scope: !913, file: !154, line: 545, baseType: !237, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "DLL", scope: !913, file: !154, line: 546, baseType: !237, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "IER_DLM", scope: !910, file: !154, line: 551, baseType: !919, size: 32, offset: 32)
!919 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !910, file: !154, line: 548, size: 32, elements: !920)
!920 = !{!921, !922}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "IER", scope: !919, file: !154, line: 549, baseType: !237, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "DLM", scope: !919, file: !154, line: 550, baseType: !237, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "IIR_FCR_EFR", scope: !910, file: !154, line: 556, baseType: !924, size: 32, offset: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !910, file: !154, line: 552, size: 32, elements: !925)
!925 = !{!926, !927, !928}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "IIR", scope: !924, file: !154, line: 553, baseType: !241, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "FCR", scope: !924, file: !154, line: 554, baseType: !237, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "EFR", scope: !924, file: !154, line: 555, baseType: !237, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "LCR", scope: !910, file: !154, line: 557, baseType: !237, size: 32, offset: 96)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "MCR_XON1", scope: !910, file: !154, line: 561, baseType: !931, size: 32, offset: 128)
!931 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !910, file: !154, line: 558, size: 32, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "MCR", scope: !931, file: !154, line: 559, baseType: !237, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "XON1", scope: !931, file: !154, line: 560, baseType: !237, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "LSR_XON2", scope: !910, file: !154, line: 565, baseType: !936, size: 32, offset: 160)
!936 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !910, file: !154, line: 562, size: 32, elements: !937)
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "LSR", scope: !936, file: !154, line: 563, baseType: !241, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "XON2", scope: !936, file: !154, line: 564, baseType: !237, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF1", scope: !910, file: !154, line: 566, baseType: !237, size: 32, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "SCR_XOFF2", scope: !910, file: !154, line: 570, baseType: !942, size: 32, offset: 224)
!942 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !910, file: !154, line: 567, size: 32, elements: !943)
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !942, file: !154, line: 568, baseType: !237, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF2", scope: !942, file: !154, line: 569, baseType: !237, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_EN", scope: !910, file: !154, line: 571, baseType: !237, size: 32, offset: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "HIGHSPEED", scope: !910, file: !154, line: 572, baseType: !237, size: 32, offset: 288)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_COUNT", scope: !910, file: !154, line: 573, baseType: !237, size: 32, offset: 320)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_POINT", scope: !910, file: !154, line: 574, baseType: !237, size: 32, offset: 352)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_REG", scope: !910, file: !154, line: 575, baseType: !241, size: 32, offset: 384)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "RATEFIX_AD", scope: !910, file: !154, line: 576, baseType: !237, size: 32, offset: 416)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUDSAMPLE", scope: !910, file: !154, line: 577, baseType: !237, size: 32, offset: 448)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "GUARD", scope: !910, file: !154, line: 578, baseType: !237, size: 32, offset: 480)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_DAT", scope: !910, file: !154, line: 579, baseType: !237, size: 32, offset: 512)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_EN", scope: !910, file: !154, line: 580, baseType: !237, size: 32, offset: 544)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP_EN", scope: !910, file: !154, line: 581, baseType: !237, size: 32, offset: 576)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "DMA_EN", scope: !910, file: !154, line: 582, baseType: !237, size: 32, offset: 608)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "RXTRI_AD", scope: !910, file: !154, line: 583, baseType: !237, size: 32, offset: 640)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_L", scope: !910, file: !154, line: 584, baseType: !237, size: 32, offset: 672)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_M", scope: !910, file: !154, line: 585, baseType: !237, size: 32, offset: 704)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "FCR_RD", scope: !910, file: !154, line: 586, baseType: !241, size: 32, offset: 736)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "TX_ACTIVE_EN", scope: !910, file: !154, line: 587, baseType: !237, size: 32, offset: 768)
!963 = !{!892, !964, !969, !975}
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "g_uart_port_to_pdn", scope: !894, file: !895, line: 54, type: !966, isLocal: false, isDefinition: true)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !967, size: 128, elements: !529)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_clock_cg_id", file: !15, line: 1237, baseType: !88)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(name: "g_uart_port_to_irq_num", scope: !894, file: !895, line: 55, type: !971, isLocal: false, isDefinition: true)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 128, elements: !529)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !154, line: 125, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !154, line: 123, baseType: !153)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler_name", scope: !894, file: !895, line: 57, type: !977, isLocal: false, isDefinition: true)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !978, size: 128, elements: !529)
!978 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 128, elements: !529)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(name: "g_i2c_tx_dma_channel", scope: !983, file: !984, line: 47, type: !1097, isLocal: false, isDefinition: true)
!983 = distinct !DICompileUnit(language: DW_LANG_C99, file: !984, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !985, globals: !1030, splitDebugInlining: false, nameTableKind: None)
!984 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_i2c_master_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!985 = !{!986, !88, !996, !1006, !1023}
!986 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !705, line: 137, baseType: !16, size: 32, elements: !987)
!987 = !{!988, !989, !990, !991, !992, !993, !994, !995}
!988 = !DIEnumerator(name: "PDMA_START_CHANNEL", value: 1)
!989 = !DIEnumerator(name: "PDMA_MSDC1", value: 1)
!990 = !DIEnumerator(name: "PDMA_MSDC2", value: 2)
!991 = !DIEnumerator(name: "PDMA_I2C0_TX", value: 3)
!992 = !DIEnumerator(name: "PDMA_I2C0_RX", value: 4)
!993 = !DIEnumerator(name: "PDMA_I2C1_TX", value: 5)
!994 = !DIEnumerator(name: "PDMA_I2C1_RX", value: 6)
!995 = !DIEnumerator(name: "PDMA_END_CHANNEL", value: 7)
!996 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !997, line: 132, baseType: !16, size: 32, elements: !998)
!997 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_i2c_master_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!998 = !{!999, !1000, !1001, !1002, !1003, !1004, !1005}
!999 = !DIEnumerator(name: "I2C_FREQUENCY_50K", value: 50)
!1000 = !DIEnumerator(name: "I2C_FREQUENCY_100K", value: 100)
!1001 = !DIEnumerator(name: "I2C_FREQUENCY_200K", value: 200)
!1002 = !DIEnumerator(name: "I2C_FREQUENCY_300K", value: 300)
!1003 = !DIEnumerator(name: "I2C_FREQUENCY_400K", value: 400)
!1004 = !DIEnumerator(name: "I2C_FREQUENCY_1M", value: 1000)
!1005 = !DIEnumerator(name: "I2C_FREQUENCY_MAX", value: 1001)
!1006 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !997, line: 142, baseType: !16, size: 32, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022}
!1008 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_POLLING", value: 0)
!1009 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_DMA", value: 1)
!1010 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_RECEIVE_POLLING", value: 2)
!1011 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_RECEIVE_DMA", value: 3)
!1012 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_TO_RECEIVE_POLLING", value: 4)
!1013 = !DIEnumerator(name: "I2C_TRANSACTION_PUSH_PULL_SEND_TO_RECEIVE_DMA", value: 5)
!1014 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_POLLING", value: 6)
!1015 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_DMA", value: 7)
!1016 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_RECEIVE_POLLING", value: 8)
!1017 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_RECEIVE_DMA", value: 9)
!1018 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_TO_RECEIVE_POLLING", value: 10)
!1019 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_TO_RECEIVE_DMA", value: 11)
!1020 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_DMA_EXTEND", value: 12)
!1021 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_RECEIVE_DMA_EXTEND", value: 13)
!1022 = !DIEnumerator(name: "I2C_TRANSACTION_OPEN_DRAIN_SEND_TO_RECEIVE_DMA_EXTEND", value: 14)
!1023 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !997, line: 162, baseType: !7, size: 32, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029}
!1025 = !DIEnumerator(name: "I2C_TRANSACTION_UNKNOWN_ERROR", value: -4)
!1026 = !DIEnumerator(name: "I2C_TRANSACTION_ACK_ERROR", value: -3)
!1027 = !DIEnumerator(name: "I2C_TRANSACTION_NACK_ERROR", value: -2)
!1028 = !DIEnumerator(name: "I2C_TRANSACTION_TIMEOUT_ERROR", value: -1)
!1029 = !DIEnumerator(name: "I2C_TRANSACTION_SUCCESS", value: 0)
!1030 = !{!1031, !981, !1095, !1100, !1102}
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "i2c_master_register", scope: !983, file: !984, line: 46, type: !1033, isLocal: false, isDefinition: true)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1034, size: 128, elements: !529)
!1034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "I2C_REGISTER_T", file: !154, line: 1885, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 1833, size: 960, elements: !1038)
!1038 = !{!1039, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "DATA_PORT", scope: !1037, file: !154, line: 1834, baseType: !1040, size: 16)
!1040 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !1041)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !62, line: 36, baseType: !1042)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !64, line: 57, baseType: !1043)
!1043 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !1037, file: !154, line: 1835, baseType: !1040, size: 16, offset: 16)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "SLAVE_ADDR", scope: !1037, file: !154, line: 1836, baseType: !1040, size: 16, offset: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1037, file: !154, line: 1837, baseType: !1040, size: 16, offset: 48)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "INTR_MASK", scope: !1037, file: !154, line: 1838, baseType: !1040, size: 16, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1037, file: !154, line: 1839, baseType: !1040, size: 16, offset: 80)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "INTR_STAT", scope: !1037, file: !154, line: 1840, baseType: !1040, size: 16, offset: 96)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1037, file: !154, line: 1841, baseType: !1040, size: 16, offset: 112)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "CONTROL", scope: !1037, file: !154, line: 1842, baseType: !1040, size: 16, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !1037, file: !154, line: 1843, baseType: !1040, size: 16, offset: 144)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "TRANSFER_LEN", scope: !1037, file: !154, line: 1844, baseType: !1040, size: 16, offset: 160)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !1037, file: !154, line: 1845, baseType: !1040, size: 16, offset: 176)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "TRANSAC_LEN", scope: !1037, file: !154, line: 1846, baseType: !1040, size: 16, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !1037, file: !154, line: 1847, baseType: !1040, size: 16, offset: 208)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "DELAY_LEN", scope: !1037, file: !154, line: 1848, baseType: !1040, size: 16, offset: 224)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !1037, file: !154, line: 1849, baseType: !1040, size: 16, offset: 240)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "TIMING", scope: !1037, file: !154, line: 1850, baseType: !1040, size: 16, offset: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !1037, file: !154, line: 1851, baseType: !1040, size: 16, offset: 272)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "START", scope: !1037, file: !154, line: 1852, baseType: !1040, size: 16, offset: 288)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !1037, file: !154, line: 1853, baseType: !1040, size: 16, offset: 304)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !1037, file: !154, line: 1854, baseType: !1064, size: 32, offset: 320)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 32, elements: !531)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "CLOCK_DIV", scope: !1037, file: !154, line: 1855, baseType: !1040, size: 16, offset: 352)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !1037, file: !154, line: 1856, baseType: !1040, size: 16, offset: 368)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "FIFO_STAT", scope: !1037, file: !154, line: 1857, baseType: !1040, size: 16, offset: 384)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !1037, file: !154, line: 1858, baseType: !1040, size: 16, offset: 400)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "FIFO_THRESH", scope: !1037, file: !154, line: 1859, baseType: !1040, size: 16, offset: 416)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED14", scope: !1037, file: !154, line: 1860, baseType: !1040, size: 16, offset: 432)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "FIFO_ADDR_CLR", scope: !1037, file: !154, line: 1861, baseType: !1040, size: 16, offset: 448)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED15", scope: !1037, file: !154, line: 1862, baseType: !1040, size: 16, offset: 464)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED16", scope: !1037, file: !154, line: 1863, baseType: !1064, size: 32, offset: 480)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "IO_CONFIG", scope: !1037, file: !154, line: 1864, baseType: !1040, size: 16, offset: 512)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED17", scope: !1037, file: !154, line: 1865, baseType: !1040, size: 16, offset: 528)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED18", scope: !1037, file: !154, line: 1866, baseType: !1064, size: 32, offset: 544)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "HS", scope: !1037, file: !154, line: 1867, baseType: !1040, size: 16, offset: 576)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED19", scope: !1037, file: !154, line: 1868, baseType: !1040, size: 16, offset: 592)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED20", scope: !1037, file: !154, line: 1869, baseType: !1064, size: 32, offset: 608)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "SOFTRESET", scope: !1037, file: !154, line: 1870, baseType: !1040, size: 16, offset: 640)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED21", scope: !1037, file: !154, line: 1871, baseType: !1040, size: 16, offset: 656)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED22", scope: !1037, file: !154, line: 1872, baseType: !1083, size: 96, offset: 672)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1040, size: 96, elements: !77)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "SPARE", scope: !1037, file: !154, line: 1873, baseType: !1040, size: 16, offset: 768)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED23", scope: !1037, file: !154, line: 1874, baseType: !1040, size: 16, offset: 784)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "DEBUGSTAT", scope: !1037, file: !154, line: 1875, baseType: !1040, size: 16, offset: 800)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED24", scope: !1037, file: !154, line: 1876, baseType: !1040, size: 16, offset: 816)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "DEBUGCTRL", scope: !1037, file: !154, line: 1877, baseType: !1040, size: 16, offset: 832)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED25", scope: !1037, file: !154, line: 1878, baseType: !1040, size: 16, offset: 848)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "TRANSFER_LEN_AUX", scope: !1037, file: !154, line: 1879, baseType: !1040, size: 16, offset: 864)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED26", scope: !1037, file: !154, line: 1880, baseType: !1040, size: 16, offset: 880)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED27", scope: !1037, file: !154, line: 1881, baseType: !1064, size: 32, offset: 896)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "TIMEOUT", scope: !1037, file: !154, line: 1882, baseType: !1040, size: 16, offset: 928)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED28", scope: !1037, file: !154, line: 1883, baseType: !1040, size: 16, offset: 944)
!1095 = !DIGlobalVariableExpression(var: !1096, expr: !DIExpression())
!1096 = distinct !DIGlobalVariable(name: "g_i2c_rx_dma_channel", scope: !983, file: !984, line: 48, type: !1097, isLocal: false, isDefinition: true)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1098, size: 128, elements: !529)
!1098 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1099)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "pdma_channel_t", file: !705, line: 147, baseType: !986)
!1100 = !DIGlobalVariableExpression(var: !1101, expr: !DIExpression())
!1101 = distinct !DIGlobalVariable(name: "g_i2c_pdn_table", scope: !983, file: !984, line: 49, type: !966, isLocal: false, isDefinition: true)
!1102 = !DIGlobalVariableExpression(var: !1103, expr: !DIExpression())
!1103 = distinct !DIGlobalVariable(name: "g_i2c_source_clock_table", scope: !983, file: !984, line: 52, type: !1104, isLocal: false, isDefinition: true)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 128, elements: !529)
!1105 = !DIGlobalVariableExpression(var: !1106, expr: !DIExpression())
!1106 = distinct !DIGlobalVariable(name: "EINT_REGISTER", scope: !1107, file: !1108, line: 55, type: !1198, isLocal: false, isDefinition: true)
!1107 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1108, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1109, retainedTypes: !1164, globals: !1170, splitDebugInlining: false, nameTableKind: None)
!1108 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_eint.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!1109 = !{!1110, !1117, !1152, !153, !1159}
!1110 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1111, line: 204, baseType: !7, size: 32, elements: !1112)
!1111 = !DIFile(filename: "../../../../../driver/chip/inc/hal_eint.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!1112 = !{!1113, !1114, !1115, !1116}
!1113 = !DIEnumerator(name: "HAL_EINT_STATUS_ERROR_EINT_NUMBER", value: -3)
!1114 = !DIEnumerator(name: "HAL_EINT_STATUS_INVALID_PARAMETER", value: -2)
!1115 = !DIEnumerator(name: "HAL_EINT_STATUS_ERROR", value: -1)
!1116 = !DIEnumerator(name: "HAL_EINT_STATUS_OK", value: 0)
!1117 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 787, baseType: !16, size: 32, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151}
!1119 = !DIEnumerator(name: "HAL_EINT_NUMBER_0", value: 0)
!1120 = !DIEnumerator(name: "HAL_EINT_NUMBER_1", value: 1)
!1121 = !DIEnumerator(name: "HAL_EINT_NUMBER_2", value: 2)
!1122 = !DIEnumerator(name: "HAL_EINT_NUMBER_3", value: 3)
!1123 = !DIEnumerator(name: "HAL_EINT_NUMBER_4", value: 4)
!1124 = !DIEnumerator(name: "HAL_EINT_NUMBER_5", value: 5)
!1125 = !DIEnumerator(name: "HAL_EINT_NUMBER_6", value: 6)
!1126 = !DIEnumerator(name: "HAL_EINT_NUMBER_7", value: 7)
!1127 = !DIEnumerator(name: "HAL_EINT_NUMBER_8", value: 8)
!1128 = !DIEnumerator(name: "HAL_EINT_NUMBER_9", value: 9)
!1129 = !DIEnumerator(name: "HAL_EINT_NUMBER_10", value: 10)
!1130 = !DIEnumerator(name: "HAL_EINT_NUMBER_11", value: 11)
!1131 = !DIEnumerator(name: "HAL_EINT_NUMBER_12", value: 12)
!1132 = !DIEnumerator(name: "HAL_EINT_NUMBER_13", value: 13)
!1133 = !DIEnumerator(name: "HAL_EINT_NUMBER_14", value: 14)
!1134 = !DIEnumerator(name: "HAL_EINT_NUMBER_15", value: 15)
!1135 = !DIEnumerator(name: "HAL_EINT_NUMBER_16", value: 16)
!1136 = !DIEnumerator(name: "HAL_EINT_NUMBER_17", value: 17)
!1137 = !DIEnumerator(name: "HAL_EINT_NUMBER_18", value: 18)
!1138 = !DIEnumerator(name: "HAL_EINT_NUMBER_19", value: 19)
!1139 = !DIEnumerator(name: "HAL_EINT_KEYPAD", value: 20)
!1140 = !DIEnumerator(name: "HAL_EINT_UART_0_RX", value: 21)
!1141 = !DIEnumerator(name: "HAL_EINT_UART_1_RX", value: 22)
!1142 = !DIEnumerator(name: "HAL_EINT_UART_2_RX", value: 23)
!1143 = !DIEnumerator(name: "HAL_EINT_UART_3_RX", value: 24)
!1144 = !DIEnumerator(name: "HAL_EINT_BTSYS", value: 25)
!1145 = !DIEnumerator(name: "HAL_EINT_BTSYS_BTIF", value: 26)
!1146 = !DIEnumerator(name: "HAL_EINT_USB", value: 27)
!1147 = !DIEnumerator(name: "HAL_EINT_ACCDET", value: 28)
!1148 = !DIEnumerator(name: "HAL_EINT_RTC", value: 29)
!1149 = !DIEnumerator(name: "HAL_EINT_PMIC", value: 30)
!1150 = !DIEnumerator(name: "HAL_EINT_GPCOUNTER", value: 31)
!1151 = !DIEnumerator(name: "HAL_EINT_NUMBER_MAX", value: 32)
!1152 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1111, line: 194, baseType: !16, size: 32, elements: !1153)
!1153 = !{!1154, !1155, !1156, !1157, !1158}
!1154 = !DIEnumerator(name: "HAL_EINT_LEVEL_LOW", value: 0)
!1155 = !DIEnumerator(name: "HAL_EINT_LEVEL_HIGH", value: 1)
!1156 = !DIEnumerator(name: "HAL_EINT_EDGE_FALLING", value: 2)
!1157 = !DIEnumerator(name: "HAL_EINT_EDGE_RISING", value: 3)
!1158 = !DIEnumerator(name: "HAL_EINT_EDGE_FALLING_AND_RISING", value: 4)
!1159 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1160, line: 59, baseType: !16, size: 32, elements: !1161)
!1160 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_eint_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/powerkey/GCC")
!1161 = !{!1162, !1163}
!1162 = !DIEnumerator(name: "EINT_DOMAIN_DISABLE", value: 0)
!1163 = !DIEnumerator(name: "EINT_DOMAIN_ENABLE", value: 1)
!1164 = !{!1165, !65, !1169}
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_isr_t", file: !787, line: 175, baseType: !1166)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 32)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{null, !973}
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_eint_number_t", file: !15, line: 821, baseType: !1117)
!1170 = !{!1105, !1171, !1190}
!1171 = !DIGlobalVariableExpression(var: !1172, expr: !DIExpression())
!1172 = distinct !DIGlobalVariable(name: "ini_state", scope: !1173, file: !1108, line: 134, type: !61, isLocal: true, isDefinition: true)
!1173 = distinct !DISubprogram(name: "hal_eint_init", scope: !1108, file: !1108, line: 130, type: !1174, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1107, retainedNodes: !1185)
!1174 = !DISubroutineType(types: !1175)
!1175 = !{!1176, !1169, !1177}
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_eint_status_t", file: !1111, line: 209, baseType: !1110)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 32)
!1178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1179)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_eint_config_t", file: !1111, line: 225, baseType: !1180)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1111, line: 222, size: 64, elements: !1181)
!1181 = !{!1182, !1184}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "trigger_mode", scope: !1180, file: !1111, line: 223, baseType: !1183, size: 32)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_eint_trigger_mode_t", file: !1111, line: 200, baseType: !1152)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "debounce_time", scope: !1180, file: !1111, line: 224, baseType: !61, size: 32, offset: 32)
!1185 = !{!1186, !1187, !1188, !1189}
!1186 = !DILocalVariable(name: "eint_number", arg: 1, scope: !1173, file: !1108, line: 130, type: !1169)
!1187 = !DILocalVariable(name: "eint_config", arg: 2, scope: !1173, file: !1108, line: 130, type: !1177)
!1188 = !DILocalVariable(name: "status", scope: !1173, file: !1108, line: 132, type: !1176)
!1189 = !DILocalVariable(name: "mask", scope: !1173, file: !1108, line: 133, type: !61)
!1190 = !DIGlobalVariableExpression(var: !1191, expr: !DIExpression())
!1191 = distinct !DIGlobalVariable(name: "eint_function_table", scope: !1107, file: !1108, line: 56, type: !1192, isLocal: true, isDefinition: true)
!1192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1193, size: 2048, elements: !294)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "eint_function_t", file: !1160, line: 44, baseType: !1194)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1160, line: 41, size: 64, elements: !1195)
!1195 = !{!1196, !1197}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "eint_callback", scope: !1194, file: !1160, line: 42, baseType: !67, size: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !1194, file: !1160, line: 43, baseType: !65, size: 32, offset: 32)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 32)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "EINT_REGISTER_T", file: !154, line: 2305, baseType: !1200)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !154, line: 2264, size: 4096, elements: !1201)
!1201 = !{!1202, !1203, !1204, !1205, !1206, !1207, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1246}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_STA", scope: !1200, file: !154, line: 2265, baseType: !241, size: 32)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1200, file: !154, line: 2266, baseType: !61, size: 32, offset: 32)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "EITN_INTACK", scope: !1200, file: !154, line: 2267, baseType: !237, size: 32, offset: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !1200, file: !154, line: 2268, baseType: !61, size: 32, offset: 96)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_EEVT", scope: !1200, file: !154, line: 2269, baseType: !241, size: 32, offset: 128)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1200, file: !154, line: 2270, baseType: !1208, size: 96, offset: 160)
!1208 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 96, elements: !1209)
!1209 = !{!1210}
!1210 = !DISubrange(count: 3)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_MASK", scope: !1200, file: !154, line: 2271, baseType: !241, size: 32, offset: 256)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1200, file: !154, line: 2272, baseType: !61, size: 32, offset: 288)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_MASK_SET", scope: !1200, file: !154, line: 2273, baseType: !237, size: 32, offset: 320)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1200, file: !154, line: 2274, baseType: !61, size: 32, offset: 352)
