; ModuleID = 'build/adafruit_trinket_m0/basic/sys_heap/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, i32, i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.sam0_eic_data = type { [1 x %struct.sam0_eic_port_data], [16 x %struct.anon.10] }
%struct.sam0_eic_port_data = type { void (i32, i8*)*, i8* }
%struct.anon.10 = type { i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.uart_sam0_dev_cfg = type { %struct.SercomUsart*, i32, i32, i8, i32, i16, void (%struct.device*)*, %struct.pinctrl_dev_config* }
%struct.SercomUsart = type { %union.PORT_DIR_Type, %union.PORT_DIR_Type, [4 x i8], %union.SERCOM_USART_BAUD_Type, %union.PORT_PMUX_Type, [5 x i8], %union.PORT_PMUX_Type, [1 x i8], %union.PORT_PMUX_Type, [1 x i8], %union.PORT_PMUX_Type, [1 x i8], %union.SERCOM_USART_BAUD_Type, %union.PORT_DIR_Type, [8 x i8], %union.SERCOM_USART_BAUD_Type, [6 x i8], %union.PORT_PMUX_Type }
%union.PORT_DIR_Type = type { %struct.z_heap_bucket }
%union.SERCOM_USART_BAUD_Type = type { %union.anon.2 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/basic/sys_heap/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/basic/sys_heap")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/basic/sys_heap")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "heap", scope: !27, file: !107, line: 13, type: !112, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/basic/sys_heap")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!105, !25}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "heap_mem", scope: !27, file: !107, line: 12, type: !108, isLocal: true, isDefinition: true)
!107 = !DIFile(filename: "zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 2048, elements: !110)
!109 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !{!111}
!111 = !DISubrange(count: 256)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !114)
!113 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!114 = !{!115, !118, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !112, file: !113, line: 57, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !113, line: 57, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !112, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !112, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !121, line: 214, baseType: !32)
!121 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "_char_out", scope: !124, file: !127, line: 54, type: !128, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !126, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/basic/sys_heap")
!126 = !{!122}
!127 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{!103, !103}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "state", scope: !133, file: !134, line: 227, type: !163, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "rand32", scope: !134, file: !134, line: 225, type: !135, scopeLine: 226, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !138, retainedNodes: !162)
!134 = !DIFile(filename: "zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!135 = !DISubroutineType(types: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !148, globals: !161, splitDebugInlining: false, nameTableKind: None)
!139 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/basic/sys_heap")
!140 = !{!30, !141}
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chunk_fields", file: !142, line: 54, baseType: !32, size: 32, elements: !143)
!142 = !DIFile(filename: "zephyr/lib/os/heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !145, !146, !147}
!144 = !DIEnumerator(name: "LEFT_SIZE", value: 0)
!145 = !DIEnumerator(name: "SIZE_AND_USED", value: 1)
!146 = !DIEnumerator(name: "FREE_PREV", value: 2)
!147 = !DIEnumerator(name: "FREE_NEXT", value: 3)
!148 = !{!102, !103, !149, !150, !137, !153}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !152)
!152 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk_unit_t", file: !142, line: 58, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 58, size: 64, elements: !156)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !155, file: !142, line: 58, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 64, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 8)
!161 = !{!131}
!162 = !{}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !164)
!164 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !167, file: !902, line: 202, type: !903, isLocal: true, isDefinition: true, align: 32)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !169, globals: !901, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_trinket_m0/basic/sys_heap")
!169 = !{!102, !103, !170, !296, !149, !635, !702}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !172, line: 335, baseType: !173)
!172 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 320, size: 288, elements: !174)
!174 = !{!175, !186, !196, !210, !221, !232, !236, !247, !248, !259, !260, !275, !276, !286}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !173, file: !172, line: 321, baseType: !176, size: 16)
!176 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !172, line: 50, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 43, size: 16, elements: !179)
!179 = !{!180, !185}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !178, file: !172, line: 48, baseType: !181, size: 16)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !178, file: !172, line: 44, size: 16, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !181, file: !172, line: 45, baseType: !151, size: 7, flags: DIFlagBitField, extraData: i64 0)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !181, file: !172, line: 47, baseType: !151, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !178, file: !172, line: 49, baseType: !151, size: 16)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !173, file: !172, line: 322, baseType: !187, size: 16, offset: 16)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 16, elements: !194)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !189, line: 52, baseType: !190)
!189 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21e18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !193)
!193 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!194 = !{!195}
!195 = !DISubrange(count: 2)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !173, file: !172, line: 323, baseType: !197, size: 32, offset: 32)
!197 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !172, line: 107, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 94, size: 32, elements: !200)
!200 = !{!201, !209}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !199, file: !172, line: 105, baseType: !202, size: 32)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !199, file: !172, line: 95, size: 32, elements: !203)
!203 = !{!204, !205, !206, !207, !208}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !202, file: !172, line: 97, baseType: !137, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !202, file: !172, line: 99, baseType: !137, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !202, file: !172, line: 100, baseType: !137, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !202, file: !172, line: 102, baseType: !137, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !202, file: !172, line: 103, baseType: !137, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !199, file: !172, line: 106, baseType: !137, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !173, file: !172, line: 324, baseType: !211, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !172, line: 155, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 148, size: 32, elements: !214)
!214 = !{!215, !220}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !213, file: !172, line: 153, baseType: !216, size: 32)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !213, file: !172, line: 149, size: 32, elements: !217)
!217 = !{!218, !219}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !216, file: !172, line: 150, baseType: !137, size: 16, flags: DIFlagBitField, extraData: i64 0)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !216, file: !172, line: 151, baseType: !137, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !213, file: !172, line: 154, baseType: !137, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !173, file: !172, line: 325, baseType: !222, size: 8, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !172, line: 194, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 187, size: 8, elements: !225)
!225 = !{!226, !231}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !224, file: !172, line: 192, baseType: !227, size: 8)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !224, file: !172, line: 188, size: 8, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !227, file: !172, line: 189, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !227, file: !172, line: 190, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !224, file: !172, line: 193, baseType: !192, size: 8)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !173, file: !172, line: 326, baseType: !233, size: 24, offset: 104)
!233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 24, elements: !234)
!234 = !{!235}
!235 = !DISubrange(count: 3)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !173, file: !172, line: 327, baseType: !237, size: 8, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !172, line: 215, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 208, size: 8, elements: !240)
!240 = !{!241, !246}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !239, file: !172, line: 213, baseType: !242, size: 8)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !239, file: !172, line: 209, size: 8, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !242, file: !172, line: 210, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !242, file: !172, line: 211, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !239, file: !172, line: 214, baseType: !192, size: 8)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !173, file: !172, line: 328, baseType: !233, size: 24, offset: 136)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !173, file: !172, line: 329, baseType: !249, size: 8, offset: 160)
!249 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !172, line: 236, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 229, size: 8, elements: !252)
!252 = !{!253, !258}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !251, file: !172, line: 234, baseType: !254, size: 8)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !251, file: !172, line: 230, size: 8, elements: !255)
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !254, file: !172, line: 231, baseType: !190, size: 1, flags: DIFlagBitField, extraData: i64 0)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !254, file: !172, line: 232, baseType: !190, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !251, file: !172, line: 235, baseType: !192, size: 8)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !173, file: !172, line: 330, baseType: !233, size: 24, offset: 168)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !173, file: !172, line: 331, baseType: !261, size: 16, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !172, line: 262, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 250, size: 16, elements: !264)
!264 = !{!265, !274}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !263, file: !172, line: 260, baseType: !266, size: 16)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !263, file: !172, line: 251, size: 16, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !273}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !266, file: !172, line: 252, baseType: !151, size: 1, flags: DIFlagBitField, extraData: i64 0)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !266, file: !172, line: 253, baseType: !151, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !266, file: !172, line: 254, baseType: !151, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !266, file: !172, line: 255, baseType: !151, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !266, file: !172, line: 256, baseType: !151, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !266, file: !172, line: 258, baseType: !151, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !263, file: !172, line: 261, baseType: !151, size: 16)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !173, file: !172, line: 332, baseType: !187, size: 16, offset: 208)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !173, file: !172, line: 333, baseType: !277, size: 32, offset: 224)
!277 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !278)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !172, line: 290, baseType: !279)
!279 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 284, size: 32, elements: !280)
!280 = !{!281, !285}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !279, file: !172, line: 288, baseType: !282, size: 32)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !279, file: !172, line: 285, size: 32, elements: !283)
!283 = !{!284}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !282, file: !172, line: 286, baseType: !137, size: 22, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !279, file: !172, line: 289, baseType: !137, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !173, file: !172, line: 334, baseType: !287, size: 16, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !172, line: 308, baseType: !289)
!289 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !172, line: 303, size: 16, elements: !290)
!290 = !{!291, !295}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !289, file: !172, line: 306, baseType: !292, size: 16)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !289, file: !172, line: 304, size: 16, elements: !293)
!293 = !{!294}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !292, file: !172, line: 305, baseType: !151, size: 16, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !289, file: !172, line: 307, baseType: !151, size: 16)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !298, line: 928, baseType: !299)
!298 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !298, line: 899, size: 672, elements: !300)
!300 = !{!301, !325, !349, !375, !400, !416, !417, !435, !436, !453, !464, !465, !480, !500, !501, !513, !525, !535, !536, !553, !557, !568, !569, !581, !593, !594, !605, !621}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !299, file: !298, line: 900, baseType: !302, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !298, line: 64, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 43, size: 32, elements: !305)
!305 = !{!306, !324}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !304, file: !298, line: 62, baseType: !307, size: 32)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !304, file: !298, line: 44, size: 32, elements: !308)
!308 = !{!309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !307, file: !298, line: 45, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !307, file: !298, line: 46, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !307, file: !298, line: 47, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !307, file: !298, line: 48, baseType: !137, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !307, file: !298, line: 49, baseType: !137, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !307, file: !298, line: 50, baseType: !137, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !307, file: !298, line: 51, baseType: !137, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !307, file: !298, line: 52, baseType: !137, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !307, file: !298, line: 53, baseType: !137, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !307, file: !298, line: 54, baseType: !137, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !307, file: !298, line: 55, baseType: !137, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !307, file: !298, line: 56, baseType: !137, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !307, file: !298, line: 58, baseType: !137, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !307, file: !298, line: 59, baseType: !137, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !307, file: !298, line: 60, baseType: !137, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !304, file: !298, line: 63, baseType: !137, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !299, file: !298, line: 901, baseType: !326, size: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !298, line: 125, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 104, size: 32, elements: !329)
!329 = !{!330, !348}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !328, file: !298, line: 123, baseType: !331, size: 32)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !298, line: 105, size: 32, elements: !332)
!332 = !{!333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !331, file: !298, line: 106, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !331, file: !298, line: 107, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !331, file: !298, line: 108, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !331, file: !298, line: 109, baseType: !137, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !331, file: !298, line: 110, baseType: !137, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !331, file: !298, line: 111, baseType: !137, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !331, file: !298, line: 112, baseType: !137, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !331, file: !298, line: 113, baseType: !137, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !331, file: !298, line: 114, baseType: !137, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !331, file: !298, line: 115, baseType: !137, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !331, file: !298, line: 116, baseType: !137, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !331, file: !298, line: 117, baseType: !137, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !331, file: !298, line: 119, baseType: !137, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !331, file: !298, line: 120, baseType: !137, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !331, file: !298, line: 121, baseType: !137, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !328, file: !298, line: 124, baseType: !137, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !299, file: !298, line: 902, baseType: !350, size: 32, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !298, line: 186, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 165, size: 32, elements: !353)
!353 = !{!354, !374}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !352, file: !298, line: 184, baseType: !355, size: 32)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !352, file: !298, line: 166, size: 32, elements: !356)
!356 = !{!357, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !355, file: !298, line: 167, baseType: !358, size: 1, flags: DIFlagBitField, extraData: i64 0)
!358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !137)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !355, file: !298, line: 168, baseType: !358, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !355, file: !298, line: 169, baseType: !358, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !355, file: !298, line: 170, baseType: !358, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !355, file: !298, line: 171, baseType: !358, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !355, file: !298, line: 172, baseType: !358, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !355, file: !298, line: 173, baseType: !358, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !355, file: !298, line: 174, baseType: !358, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !355, file: !298, line: 175, baseType: !358, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !355, file: !298, line: 176, baseType: !358, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !355, file: !298, line: 177, baseType: !358, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !355, file: !298, line: 178, baseType: !358, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !355, file: !298, line: 180, baseType: !358, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !355, file: !298, line: 181, baseType: !358, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !355, file: !298, line: 182, baseType: !358, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !352, file: !298, line: 185, baseType: !137, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !299, file: !298, line: 903, baseType: !376, size: 32, offset: 96)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !298, line: 247, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 226, size: 32, elements: !380)
!380 = !{!381, !399}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !379, file: !298, line: 245, baseType: !382, size: 32)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !379, file: !298, line: 227, size: 32, elements: !383)
!383 = !{!384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !382, file: !298, line: 228, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !382, file: !298, line: 229, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !382, file: !298, line: 230, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !382, file: !298, line: 231, baseType: !137, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !382, file: !298, line: 232, baseType: !137, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !382, file: !298, line: 233, baseType: !137, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !382, file: !298, line: 234, baseType: !137, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !382, file: !298, line: 235, baseType: !137, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !382, file: !298, line: 236, baseType: !137, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !382, file: !298, line: 237, baseType: !137, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !382, file: !298, line: 238, baseType: !137, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !382, file: !298, line: 239, baseType: !137, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !382, file: !298, line: 241, baseType: !137, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !382, file: !298, line: 242, baseType: !137, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !382, file: !298, line: 243, baseType: !137, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !379, file: !298, line: 246, baseType: !137, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !299, file: !298, line: 904, baseType: !401, size: 16, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !298, line: 300, baseType: !403)
!403 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 287, size: 16, elements: !404)
!404 = !{!405, !415}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !403, file: !298, line: 298, baseType: !406, size: 16)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !403, file: !298, line: 288, size: 16, elements: !407)
!407 = !{!408, !409, !410, !411, !412, !413, !414}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !406, file: !298, line: 290, baseType: !151, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !406, file: !298, line: 291, baseType: !151, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !406, file: !298, line: 293, baseType: !151, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !406, file: !298, line: 294, baseType: !151, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !406, file: !298, line: 295, baseType: !151, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !406, file: !298, line: 296, baseType: !151, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !406, file: !298, line: 297, baseType: !151, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !403, file: !298, line: 299, baseType: !151, size: 16)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !299, file: !298, line: 905, baseType: !187, size: 16, offset: 144)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !299, file: !298, line: 906, baseType: !418, size: 16, offset: 160)
!418 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !298, line: 352, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 336, size: 16, elements: !421)
!421 = !{!422, !434}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !420, file: !298, line: 350, baseType: !423, size: 16)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !420, file: !298, line: 337, size: 16, elements: !424)
!424 = !{!425, !426, !427, !428, !429, !430, !431, !432, !433}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !423, file: !298, line: 339, baseType: !151, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !423, file: !298, line: 340, baseType: !151, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !423, file: !298, line: 341, baseType: !151, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !423, file: !298, line: 342, baseType: !151, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !423, file: !298, line: 343, baseType: !151, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !423, file: !298, line: 344, baseType: !151, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !423, file: !298, line: 345, baseType: !151, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !423, file: !298, line: 346, baseType: !151, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !423, file: !298, line: 348, baseType: !151, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !420, file: !298, line: 351, baseType: !151, size: 16)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !299, file: !298, line: 907, baseType: !187, size: 16, offset: 176)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !299, file: !298, line: 908, baseType: !437, size: 32, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !298, line: 398, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 381, size: 32, elements: !440)
!440 = !{!441, !452}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !439, file: !298, line: 396, baseType: !442, size: 32)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !298, line: 382, size: 32, elements: !443)
!443 = !{!444, !445, !446, !447, !448, !449, !450, !451}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !442, file: !298, line: 384, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !442, file: !298, line: 385, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !442, file: !298, line: 386, baseType: !137, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !442, file: !298, line: 388, baseType: !137, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !442, file: !298, line: 389, baseType: !137, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !442, file: !298, line: 390, baseType: !137, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !442, file: !298, line: 392, baseType: !137, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !442, file: !298, line: 394, baseType: !137, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !439, file: !298, line: 397, baseType: !137, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !299, file: !298, line: 909, baseType: !454, size: 8, offset: 224)
!454 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !298, line: 433, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 426, size: 8, elements: !457)
!457 = !{!458, !463}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !456, file: !298, line: 431, baseType: !459, size: 8)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !456, file: !298, line: 427, size: 8, elements: !460)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !459, file: !298, line: 428, baseType: !192, size: 5, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !459, file: !298, line: 430, baseType: !192, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !456, file: !298, line: 432, baseType: !192, size: 8)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !299, file: !298, line: 910, baseType: !233, size: 24, offset: 232)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !299, file: !298, line: 911, baseType: !466, size: 32, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !298, line: 462, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 448, size: 32, elements: !469)
!469 = !{!470, !479}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !468, file: !298, line: 460, baseType: !471, size: 32)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !468, file: !298, line: 449, size: 32, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !471, file: !298, line: 451, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !471, file: !298, line: 453, baseType: !137, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !471, file: !298, line: 454, baseType: !137, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !471, file: !298, line: 455, baseType: !137, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !471, file: !298, line: 457, baseType: !137, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !471, file: !298, line: 459, baseType: !137, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !468, file: !298, line: 461, baseType: !137, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !299, file: !298, line: 912, baseType: !481, size: 16, offset: 288)
!481 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !298, line: 520, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 503, size: 16, elements: !484)
!484 = !{!485, !499}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !483, file: !298, line: 518, baseType: !486, size: 16)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !483, file: !298, line: 504, size: 16, elements: !487)
!487 = !{!488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !486, file: !298, line: 506, baseType: !151, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !486, file: !298, line: 507, baseType: !151, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !486, file: !298, line: 508, baseType: !151, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !486, file: !298, line: 509, baseType: !151, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !486, file: !298, line: 510, baseType: !151, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !486, file: !298, line: 511, baseType: !151, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !486, file: !298, line: 512, baseType: !151, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !486, file: !298, line: 513, baseType: !151, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !486, file: !298, line: 514, baseType: !151, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !486, file: !298, line: 515, baseType: !151, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !486, file: !298, line: 516, baseType: !151, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !483, file: !298, line: 519, baseType: !151, size: 16)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !299, file: !298, line: 913, baseType: !187, size: 16, offset: 304)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !299, file: !298, line: 914, baseType: !502, size: 32, offset: 320)
!502 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !298, line: 559, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 552, size: 32, elements: !505)
!505 = !{!506, !512}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !504, file: !298, line: 557, baseType: !507, size: 32)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !504, file: !298, line: 553, size: 32, elements: !508)
!508 = !{!509, !510, !511}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !507, file: !298, line: 554, baseType: !137, size: 10, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !507, file: !298, line: 555, baseType: !137, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !507, file: !298, line: 556, baseType: !137, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !504, file: !298, line: 558, baseType: !137, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !299, file: !298, line: 915, baseType: !514, size: 32, offset: 352)
!514 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !515)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !298, line: 585, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 578, size: 32, elements: !517)
!517 = !{!518, !524}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !516, file: !298, line: 583, baseType: !519, size: 32)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !516, file: !298, line: 579, size: 32, elements: !520)
!520 = !{!521, !522, !523}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !519, file: !298, line: 580, baseType: !137, size: 16, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !519, file: !298, line: 581, baseType: !137, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !519, file: !298, line: 582, baseType: !137, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !516, file: !298, line: 584, baseType: !137, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !299, file: !298, line: 916, baseType: !526, size: 8, offset: 384)
!526 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !527)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !298, line: 610, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 604, size: 8, elements: !529)
!529 = !{!530, !534}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !528, file: !298, line: 608, baseType: !531, size: 8)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !528, file: !298, line: 605, size: 8, elements: !532)
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !531, file: !298, line: 607, baseType: !192, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !528, file: !298, line: 609, baseType: !192, size: 8)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !299, file: !298, line: 917, baseType: !233, size: 24, offset: 392)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !299, file: !298, line: 918, baseType: !537, size: 32, offset: 416)
!537 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !298, line: 639, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 622, size: 32, elements: !540)
!540 = !{!541, !552}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !539, file: !298, line: 637, baseType: !542, size: 32)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !539, file: !298, line: 623, size: 32, elements: !543)
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !542, file: !298, line: 625, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !542, file: !298, line: 626, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !542, file: !298, line: 627, baseType: !137, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !542, file: !298, line: 629, baseType: !137, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !542, file: !298, line: 631, baseType: !137, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !542, file: !298, line: 632, baseType: !137, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !542, file: !298, line: 634, baseType: !137, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !542, file: !298, line: 635, baseType: !137, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !539, file: !298, line: 638, baseType: !137, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !299, file: !298, line: 919, baseType: !554, size: 32, offset: 448)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 32, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 4)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !299, file: !298, line: 920, baseType: !558, size: 16, offset: 480)
!558 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !559)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !298, line: 715, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 706, size: 16, elements: !561)
!561 = !{!562, !567}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !560, file: !298, line: 713, baseType: !563, size: 16)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !560, file: !298, line: 707, size: 16, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !563, file: !298, line: 709, baseType: !151, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !563, file: !298, line: 711, baseType: !151, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !560, file: !298, line: 714, baseType: !151, size: 16)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !299, file: !298, line: 921, baseType: !187, size: 16, offset: 496)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !299, file: !298, line: 922, baseType: !570, size: 32, offset: 512)
!570 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !298, line: 739, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 729, size: 32, elements: !573)
!573 = !{!574, !580}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !572, file: !298, line: 737, baseType: !575, size: 32)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !572, file: !298, line: 730, size: 32, elements: !576)
!576 = !{!577, !578, !579}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !575, file: !298, line: 732, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !575, file: !298, line: 733, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !575, file: !298, line: 735, baseType: !137, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !572, file: !298, line: 738, baseType: !137, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !299, file: !298, line: 923, baseType: !582, size: 8, offset: 544)
!582 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !298, line: 765, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 756, size: 8, elements: !585)
!585 = !{!586, !592}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !584, file: !298, line: 763, baseType: !587, size: 8)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !584, file: !298, line: 757, size: 8, elements: !588)
!588 = !{!589, !590, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !587, file: !298, line: 759, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !587, file: !298, line: 761, baseType: !192, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !587, file: !298, line: 762, baseType: !192, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !584, file: !298, line: 764, baseType: !192, size: 8)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !299, file: !298, line: 924, baseType: !233, size: 24, offset: 552)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !299, file: !298, line: 925, baseType: !595, size: 32, offset: 576)
!595 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !298, line: 789, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 781, size: 32, elements: !598)
!598 = !{!599, !604}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !597, file: !298, line: 787, baseType: !600, size: 32)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !597, file: !298, line: 782, size: 32, elements: !601)
!601 = !{!602, !603}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !600, file: !298, line: 783, baseType: !137, size: 12, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !600, file: !298, line: 785, baseType: !137, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !597, file: !298, line: 788, baseType: !137, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !299, file: !298, line: 926, baseType: !606, size: 32, offset: 608)
!606 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !298, line: 820, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 805, size: 32, elements: !609)
!609 = !{!610, !620}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !608, file: !298, line: 818, baseType: !611, size: 32)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !608, file: !298, line: 806, size: 32, elements: !612)
!612 = !{!613, !614, !615, !616, !617, !618, !619}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !611, file: !298, line: 807, baseType: !137, size: 2, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !611, file: !298, line: 808, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !611, file: !298, line: 809, baseType: !137, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !611, file: !298, line: 810, baseType: !137, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !611, file: !298, line: 812, baseType: !137, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !611, file: !298, line: 814, baseType: !137, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !611, file: !298, line: 816, baseType: !137, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !608, file: !298, line: 819, baseType: !137, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !299, file: !298, line: 927, baseType: !622, size: 8, offset: 640)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !298, line: 881, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !298, line: 872, size: 8, elements: !626)
!626 = !{!627, !634}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !625, file: !298, line: 879, baseType: !628, size: 8)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !625, file: !298, line: 873, size: 8, elements: !629)
!629 = !{!630, !631, !632, !633}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !628, file: !298, line: 874, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !628, file: !298, line: 875, baseType: !192, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !628, file: !298, line: 876, baseType: !192, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !628, file: !298, line: 877, baseType: !192, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !625, file: !298, line: 880, baseType: !192, size: 8)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !637, line: 290, baseType: !638)
!637 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !637, line: 284, size: 96, elements: !639)
!639 = !{!640, !650, !661, !674, !691}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !638, file: !637, line: 285, baseType: !641, size: 8)
!641 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !637, line: 49, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !637, line: 43, size: 8, elements: !644)
!644 = !{!645, !649}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !643, file: !637, line: 47, baseType: !646, size: 8)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !643, file: !637, line: 44, size: 8, elements: !647)
!647 = !{!648}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !646, file: !637, line: 45, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !643, file: !637, line: 48, baseType: !192, size: 8)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !638, file: !637, line: 286, baseType: !651, size: 8, offset: 8)
!651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !637, line: 67, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !637, line: 61, size: 8, elements: !655)
!655 = !{!656, !660}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !654, file: !637, line: 65, baseType: !657, size: 8)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !654, file: !637, line: 62, size: 8, elements: !658)
!658 = !{!659}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !657, file: !637, line: 64, baseType: !192, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !654, file: !637, line: 66, baseType: !192, size: 8)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !638, file: !637, line: 287, baseType: !662, size: 16, offset: 16)
!662 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !637, line: 89, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !637, line: 79, size: 16, elements: !665)
!665 = !{!666, !673}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !664, file: !637, line: 87, baseType: !667, size: 16)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !664, file: !637, line: 80, size: 16, elements: !668)
!668 = !{!669, !670, !671, !672}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !667, file: !637, line: 81, baseType: !151, size: 6, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !667, file: !637, line: 83, baseType: !151, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !667, file: !637, line: 85, baseType: !151, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !667, file: !637, line: 86, baseType: !151, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !664, file: !637, line: 88, baseType: !151, size: 16)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !638, file: !637, line: 288, baseType: !675, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !637, line: 214, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !637, line: 199, size: 32, elements: !678)
!678 = !{!679, !690}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !677, file: !637, line: 212, baseType: !680, size: 32)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !677, file: !637, line: 200, size: 32, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !687, !688, !689}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !680, file: !637, line: 201, baseType: !137, size: 4, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !680, file: !637, line: 203, baseType: !137, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !680, file: !637, line: 205, baseType: !137, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !680, file: !637, line: 206, baseType: !137, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !680, file: !637, line: 207, baseType: !137, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !680, file: !637, line: 208, baseType: !137, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !680, file: !637, line: 209, baseType: !137, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !680, file: !637, line: 210, baseType: !137, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !677, file: !637, line: 213, baseType: !137, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !638, file: !637, line: 289, baseType: !692, size: 32, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !637, line: 268, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !637, line: 260, size: 32, elements: !695)
!695 = !{!696, !701}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !694, file: !637, line: 266, baseType: !697, size: 32)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !694, file: !637, line: 261, size: 32, elements: !698)
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !697, file: !637, line: 262, baseType: !137, size: 4, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !697, file: !637, line: 264, baseType: !137, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !694, file: !637, line: 267, baseType: !137, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !704, line: 513, baseType: !705)
!704 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !704, line: 494, size: 480, elements: !706)
!706 = !{!707, !713, !723, !727, !737, !747, !757, !767, !769, !785, !801, !817, !847, !851, !861, !871, !881, !885}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !705, file: !704, line: 495, baseType: !708, size: 8)
!708 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !704, line: 45, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !704, line: 43, size: 8, elements: !711)
!711 = !{!712}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !710, file: !704, line: 44, baseType: !192, size: 8)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !705, file: !704, line: 496, baseType: !714, size: 8, offset: 8)
!714 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !715)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !704, line: 61, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !704, line: 55, size: 8, elements: !717)
!717 = !{!718, !722}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !716, file: !704, line: 59, baseType: !719, size: 8)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !716, file: !704, line: 56, size: 8, elements: !720)
!720 = !{!721}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !719, file: !704, line: 57, baseType: !192, size: 2, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !716, file: !704, line: 60, baseType: !192, size: 8)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !705, file: !704, line: 497, baseType: !724, size: 48, offset: 16)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 48, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 6)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !705, file: !704, line: 498, baseType: !728, size: 8, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !704, line: 86, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !704, line: 80, size: 8, elements: !731)
!731 = !{!732, !736}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !730, file: !704, line: 84, baseType: !733, size: 8)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !730, file: !704, line: 81, size: 8, elements: !734)
!734 = !{!735}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !733, file: !704, line: 82, baseType: !192, size: 3, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !730, file: !704, line: 85, baseType: !192, size: 8)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !705, file: !704, line: 499, baseType: !738, size: 8, offset: 72)
!738 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !704, line: 121, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !704, line: 115, size: 8, elements: !741)
!741 = !{!742, !746}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !740, file: !704, line: 119, baseType: !743, size: 8)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !740, file: !704, line: 116, size: 8, elements: !744)
!744 = !{!745}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !743, file: !704, line: 117, baseType: !192, size: 3, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !740, file: !704, line: 120, baseType: !192, size: 8)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !705, file: !704, line: 500, baseType: !748, size: 8, offset: 80)
!748 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !749)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !704, line: 156, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !704, line: 150, size: 8, elements: !751)
!751 = !{!752, !756}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !750, file: !704, line: 154, baseType: !753, size: 8)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !750, file: !704, line: 151, size: 8, elements: !754)
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !753, file: !704, line: 152, baseType: !192, size: 3, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !750, file: !704, line: 155, baseType: !192, size: 8)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !705, file: !704, line: 501, baseType: !758, size: 8, offset: 88)
!758 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !704, line: 191, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !704, line: 185, size: 8, elements: !761)
!761 = !{!762, !766}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !760, file: !704, line: 189, baseType: !763, size: 8)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !760, file: !704, line: 186, size: 8, elements: !764)
!764 = !{!765}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !763, file: !704, line: 187, baseType: !192, size: 3, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !760, file: !704, line: 190, baseType: !192, size: 8)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !705, file: !704, line: 502, baseType: !768, size: 64, offset: 96)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 64, elements: !159)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !705, file: !704, line: 503, baseType: !770, size: 32, offset: 160)
!770 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !704, line: 232, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !704, line: 220, size: 32, elements: !773)
!773 = !{!774, !784}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !772, file: !704, line: 230, baseType: !775, size: 32)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !772, file: !704, line: 221, size: 32, elements: !776)
!776 = !{!777, !778, !779, !780, !781, !782, !783}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !775, file: !704, line: 222, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !775, file: !704, line: 223, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !775, file: !704, line: 224, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !775, file: !704, line: 225, baseType: !137, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !775, file: !704, line: 226, baseType: !137, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !775, file: !704, line: 227, baseType: !137, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !775, file: !704, line: 228, baseType: !137, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !772, file: !704, line: 231, baseType: !137, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !705, file: !704, line: 504, baseType: !786, size: 32, offset: 192)
!786 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !704, line: 268, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !704, line: 256, size: 32, elements: !789)
!789 = !{!790, !800}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !788, file: !704, line: 266, baseType: !791, size: 32)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !788, file: !704, line: 257, size: 32, elements: !792)
!792 = !{!793, !794, !795, !796, !797, !798, !799}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !791, file: !704, line: 258, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !791, file: !704, line: 259, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !791, file: !704, line: 260, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !791, file: !704, line: 261, baseType: !137, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !791, file: !704, line: 262, baseType: !137, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_", scope: !791, file: !704, line: 263, baseType: !137, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "EIC_", scope: !791, file: !704, line: 264, baseType: !137, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !788, file: !704, line: 267, baseType: !137, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "APBBMASK", scope: !705, file: !704, line: 505, baseType: !802, size: 32, offset: 224)
!802 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBMASK_Type", file: !704, line: 304, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !704, line: 292, size: 32, elements: !805)
!805 = !{!806, !816}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !804, file: !704, line: 302, baseType: !807, size: 32)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !804, file: !704, line: 293, size: 32, elements: !808)
!808 = !{!809, !810, !811, !812, !813, !814, !815}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "PAC1_", scope: !807, file: !704, line: 294, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !807, file: !704, line: 295, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !807, file: !704, line: 296, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "PORT_", scope: !807, file: !704, line: 297, baseType: !137, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !807, file: !704, line: 298, baseType: !137, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !807, file: !704, line: 299, baseType: !137, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "HMATRIX_", scope: !807, file: !704, line: 300, baseType: !137, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !804, file: !704, line: 303, baseType: !137, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "APBCMASK", scope: !705, file: !704, line: 506, baseType: !818, size: 32, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCMASK_Type", file: !704, line: 354, baseType: !820)
!820 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !704, line: 328, size: 32, elements: !821)
!821 = !{!822, !846}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !820, file: !704, line: 352, baseType: !823, size: 32)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !820, file: !704, line: 329, size: 32, elements: !824)
!824 = !{!825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "PAC2_", scope: !823, file: !704, line: 330, baseType: !137, size: 1, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "EVSYS_", scope: !823, file: !704, line: 331, baseType: !137, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM0_", scope: !823, file: !704, line: 332, baseType: !137, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM1_", scope: !823, file: !704, line: 333, baseType: !137, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM2_", scope: !823, file: !704, line: 334, baseType: !137, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM3_", scope: !823, file: !704, line: 335, baseType: !137, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM4_", scope: !823, file: !704, line: 336, baseType: !137, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM5_", scope: !823, file: !704, line: 337, baseType: !137, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "TCC0_", scope: !823, file: !704, line: 338, baseType: !137, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "TCC1_", scope: !823, file: !704, line: 339, baseType: !137, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "TCC2_", scope: !823, file: !704, line: 340, baseType: !137, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "TC3_", scope: !823, file: !704, line: 341, baseType: !137, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "TC4_", scope: !823, file: !704, line: 342, baseType: !137, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "TC5_", scope: !823, file: !704, line: 343, baseType: !137, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "TC6_", scope: !823, file: !704, line: 344, baseType: !137, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "TC7_", scope: !823, file: !704, line: 345, baseType: !137, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_", scope: !823, file: !704, line: 346, baseType: !137, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "AC_", scope: !823, file: !704, line: 347, baseType: !137, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "DAC_", scope: !823, file: !704, line: 348, baseType: !137, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "PTC_", scope: !823, file: !704, line: 349, baseType: !137, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "I2S_", scope: !823, file: !704, line: 350, baseType: !137, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !820, file: !704, line: 353, baseType: !137, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !705, file: !704, line: 507, baseType: !848, size: 128, offset: 288)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 128, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 16)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !705, file: !704, line: 508, baseType: !852, size: 8, offset: 416)
!852 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !853)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENCLR_Type", file: !704, line: 412, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !704, line: 406, size: 8, elements: !855)
!855 = !{!856, !860}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !854, file: !704, line: 410, baseType: !857, size: 8)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !854, file: !704, line: 407, size: 8, elements: !858)
!858 = !{!859}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !857, file: !704, line: 408, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !854, file: !704, line: 411, baseType: !192, size: 8)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !705, file: !704, line: 509, baseType: !862, size: 8, offset: 424)
!862 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENSET_Type", file: !704, line: 430, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !704, line: 424, size: 8, elements: !865)
!865 = !{!866, !870}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !864, file: !704, line: 428, baseType: !867, size: 8)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !864, file: !704, line: 425, size: 8, elements: !868)
!868 = !{!869}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !867, file: !704, line: 426, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !864, file: !704, line: 429, baseType: !192, size: 8)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !705, file: !704, line: 510, baseType: !872, size: 8, offset: 432)
!872 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTFLAG_Type", file: !704, line: 448, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !704, line: 442, size: 8, elements: !875)
!875 = !{!876, !880}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !874, file: !704, line: 446, baseType: !877, size: 8)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !874, file: !704, line: 443, size: 8, elements: !878)
!878 = !{!879}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !877, file: !704, line: 444, baseType: !190, size: 1, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !874, file: !704, line: 447, baseType: !192, size: 8)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !705, file: !704, line: 511, baseType: !882, size: 8, offset: 440)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 8, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 1)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "RCAUSE", scope: !705, file: !704, line: 512, baseType: !886, size: 8, offset: 448)
!886 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_RCAUSE_Type", file: !704, line: 472, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !704, line: 460, size: 8, elements: !890)
!890 = !{!891, !900}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !889, file: !704, line: 470, baseType: !892, size: 8)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !889, file: !704, line: 461, size: 8, elements: !893)
!893 = !{!894, !895, !896, !897, !898, !899}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "POR", scope: !892, file: !704, line: 462, baseType: !192, size: 1, flags: DIFlagBitField, extraData: i64 0)
