; ModuleID = 'build/actinius_icarus/boards/nrf/system_off/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16*, %struct.pm_device* }
%struct.device_state = type { i8, i8 }
%struct.pm_device = type { %struct.device*, i32, i32, i32 (%struct.device*, i32)* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/nrf/system_off/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/nrf/system_off")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/nrf/system_off")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "__init_disable_ds_1", scope: !27, file: !191, line: 36, type: !192, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !154, globals: !190, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/boards/nrf/system_off/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/nrf/system_off")
!29 = !{!30, !38, !44, !50, !55, !66, !136, !140, !144}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_state", file: !31, line: 53, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/pm/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "PM_DEVICE_STATE_ACTIVE", value: 0)
!35 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDED", value: 1)
!36 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDING", value: 2)
!37 = !DIEnumerator(name: "PM_DEVICE_STATE_OFF", value: 3)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_action", file: !31, line: 75, baseType: !32, size: 32, elements: !39)
!39 = !{!40, !41, !42, !43}
!40 = !DIEnumerator(name: "PM_DEVICE_ACTION_SUSPEND", value: 0)
!41 = !DIEnumerator(name: "PM_DEVICE_ACTION_RESUME", value: 1)
!42 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_OFF", value: 2)
!43 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_ON", value: 3)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 102, baseType: !32, size: 32, elements: !46)
!45 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!46 = !{!47, !48, !49}
!47 = !DIEnumerator(name: "NRF_GPIO_PIN_NOPULL", value: 0)
!48 = !DIEnumerator(name: "NRF_GPIO_PIN_PULLDOWN", value: 1)
!49 = !DIEnumerator(name: "NRF_GPIO_PIN_PULLUP", value: 3)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 144, baseType: !32, size: 32, elements: !51)
!51 = !{!52, !53, !54}
!52 = !DIEnumerator(name: "NRF_GPIO_PIN_NOSENSE", value: 0)
!53 = !DIEnumerator(name: "NRF_GPIO_PIN_SENSE_LOW", value: 3)
!54 = !DIEnumerator(name: "NRF_GPIO_PIN_SENSE_HIGH", value: 2)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !56, line: 27, baseType: !32, size: 32, elements: !57)
!56 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!57 = !{!58, !59, !60, !61, !62, !63, !64, !65}
!58 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!59 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!60 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!61 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!62 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!63 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!64 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!65 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!66 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !67, line: 27, baseType: !32, size: 32, elements: !68)
!67 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!69 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!70 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!71 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!72 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!73 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!74 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!75 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!76 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!77 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!78 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!79 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!80 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!81 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!82 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!83 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!84 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!85 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!115 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!116 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!117 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!118 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!119 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!120 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!121 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!122 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!123 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!124 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!125 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!126 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!127 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!128 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!129 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!130 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!131 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!132 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!133 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!134 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!135 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!136 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 85, baseType: !32, size: 32, elements: !137)
!137 = !{!138, !139}
!138 = !DIEnumerator(name: "NRF_GPIO_PIN_DIR_INPUT", value: 0)
!139 = !DIEnumerator(name: "NRF_GPIO_PIN_DIR_OUTPUT", value: 1)
!140 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 92, baseType: !32, size: 32, elements: !141)
!141 = !{!142, !143}
!142 = !DIEnumerator(name: "NRF_GPIO_PIN_INPUT_CONNECT", value: 0)
!143 = !DIEnumerator(name: "NRF_GPIO_PIN_INPUT_DISCONNECT", value: 1)
!144 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !45, line: 110, baseType: !32, size: 32, elements: !145)
!145 = !{!146, !147, !148, !149, !150, !151, !152, !153}
!146 = !DIEnumerator(name: "NRF_GPIO_PIN_S0S1", value: 0)
!147 = !DIEnumerator(name: "NRF_GPIO_PIN_H0S1", value: 1)
!148 = !DIEnumerator(name: "NRF_GPIO_PIN_S0H1", value: 2)
!149 = !DIEnumerator(name: "NRF_GPIO_PIN_H0H1", value: 3)
!150 = !DIEnumerator(name: "NRF_GPIO_PIN_D0S1", value: 4)
!151 = !DIEnumerator(name: "NRF_GPIO_PIN_D0H1", value: 5)
!152 = !DIEnumerator(name: "NRF_GPIO_PIN_S0D1", value: 6)
!153 = !DIEnumerator(name: "NRF_GPIO_PIN_H0D1", value: 7)
!154 = !{!155, !159, !160, !161, !162, !188}
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !156, line: 46, baseType: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !158)
!158 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!160 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_GPIO_Type", file: !164, line: 2030, baseType: !165)
!164 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 2011, size: 5120, elements: !166)
!166 = !{!167, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !184}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !165, file: !164, line: 2012, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!169 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !161)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "OUT", scope: !165, file: !164, line: 2013, baseType: !169, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "OUTSET", scope: !165, file: !164, line: 2014, baseType: !169, size: 32, offset: 64)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "OUTCLR", scope: !165, file: !164, line: 2015, baseType: !169, size: 32, offset: 96)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "IN", scope: !165, file: !164, line: 2016, baseType: !168, size: 32, offset: 128)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "DIR", scope: !165, file: !164, line: 2017, baseType: !169, size: 32, offset: 160)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "DIRSET", scope: !165, file: !164, line: 2018, baseType: !169, size: 32, offset: 192)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "DIRCLR", scope: !165, file: !164, line: 2019, baseType: !169, size: 32, offset: 224)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "LATCH", scope: !165, file: !164, line: 2020, baseType: !169, size: 32, offset: 256)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "DETECTMODE", scope: !165, file: !164, line: 2023, baseType: !169, size: 32, offset: 288)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "DETECTMODE_SEC", scope: !165, file: !164, line: 2025, baseType: !169, size: 32, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !165, file: !164, line: 2027, baseType: !181, size: 3744, offset: 352)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 3744, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 117)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "PIN_CNF", scope: !165, file: !164, line: 2028, baseType: !185, size: 1024, offset: 4096)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 1024, elements: !186)
!186 = !{!187}
!187 = !DISubrange(count: 32)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !189)
!189 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!190 = !{!25}
!191 = !DIFile(filename: "zephyr/samples/boards/nrf/system_off/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !194, line: 51, size: 64, elements: !195)
!194 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!195 = !{!196, !242}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !193, file: !194, line: 60, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DISubroutineType(types: !199)
!199 = !{!160, !200}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !203, line: 378, size: 224, elements: !204)
!203 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !{!205, !209, !210, !211, !220, !221, !227}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !203, line: 380, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !202, file: !203, line: 382, baseType: !13, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !202, file: !203, line: 384, baseType: !13, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !202, file: !203, line: 386, baseType: !212, size: 32, offset: 96)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !203, line: 351, size: 16, elements: !214)
!214 = !{!215, !218}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !213, file: !203, line: 359, baseType: !216, size: 8)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !217)
!217 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !213, file: !203, line: 364, baseType: !219, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!219 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !202, file: !203, line: 388, baseType: !159, size: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !202, file: !203, line: 396, baseType: !222, size: 32, offset: 160)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !203, line: 43, baseType: !225)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !226)
!226 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !202, file: !203, line: 403, baseType: !228, size: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_device", file: !31, line: 121, size: 128, elements: !230)
!230 = !{!231, !232, !236, !237}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !229, file: !31, line: 136, baseType: !200, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !229, file: !31, line: 139, baseType: !233, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !234, line: 22, baseType: !235)
!234 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !229, file: !31, line: 141, baseType: !30, size: 32, offset: 64)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "action_cb", scope: !229, file: !31, line: 143, baseType: !238, size: 32, offset: 96)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_device_action_cb_t", file: !31, line: 104, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DISubroutineType(types: !241)
!241 = !{!160, !200, !38}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !193, file: !194, line: 65, baseType: !200, size: 32, offset: 32)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "_char_out", scope: !245, file: !250, line: 54, type: !251, isLocal: false, isDefinition: true)
!245 = distinct !DICompileUnit(language: DW_LANG_C99, file: !246, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !247, retainedTypes: !248, globals: !249, splitDebugInlining: false, nameTableKind: None)
!246 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/nrf/system_off")
!247 = !{!66}
!248 = !{!159, !160}
!249 = !{!243}
!250 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 32)
!252 = !DISubroutineType(types: !253)
!253 = !{!160, !160}
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !256, file: !314, line: 65, type: !315, isLocal: true, isDefinition: true, align: 32)
!256 = distinct !DICompileUnit(language: DW_LANG_C99, file: !257, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !247, retainedTypes: !258, globals: !307, splitDebugInlining: false, nameTableKind: None)
!257 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/nrf/system_off")
!258 = !{!159, !160, !259, !161, !270}
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !261, file: !260, line: 167, baseType: !269)
!260 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!261 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !260, file: !260, line: 134, type: !262, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !256, retainedNodes: !264)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !161}
!264 = !{!265, !266, !268}
!265 = !DILocalVariable(name: "time_us", arg: 1, scope: !261, file: !260, line: 134, type: !161)
!266 = !DILocalVariable(name: "delay_cycles", scope: !261, file: !260, line: 168, type: !267)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !259)
!268 = !DILocalVariable(name: "cycles", scope: !261, file: !260, line: 171, type: !161)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !164, line: 1928, baseType: !272)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 1909, size: 11360, elements: !273)
!273 = !{!274, !278, !279, !280, !281, !285, !286, !287, !288, !292, !293, !297, !298, !299, !300, !301, !305, !306}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !272, file: !164, line: 1910, baseType: !275, size: 8192)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 8192, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !272, file: !164, line: 1911, baseType: !168, size: 32, offset: 8192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !272, file: !164, line: 1912, baseType: !168, size: 32, offset: 8224)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !272, file: !164, line: 1913, baseType: !168, size: 32, offset: 8256)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !272, file: !164, line: 1914, baseType: !282, size: 1984, offset: 8288)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 1984, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 62)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !272, file: !164, line: 1915, baseType: !169, size: 32, offset: 10272)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !272, file: !164, line: 1916, baseType: !168, size: 32, offset: 10304)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !272, file: !164, line: 1917, baseType: !169, size: 32, offset: 10336)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !272, file: !164, line: 1918, baseType: !289, size: 96, offset: 10368)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 96, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 3)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !272, file: !164, line: 1919, baseType: !169, size: 32, offset: 10464)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !272, file: !164, line: 1920, baseType: !294, size: 256, offset: 10496)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 256, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 8)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !272, file: !164, line: 1921, baseType: !169, size: 32, offset: 10752)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !272, file: !164, line: 1922, baseType: !168, size: 32, offset: 10784)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !272, file: !164, line: 1923, baseType: !169, size: 32, offset: 10816)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !272, file: !164, line: 1924, baseType: !169, size: 32, offset: 10848)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !272, file: !164, line: 1925, baseType: !302, size: 416, offset: 10880)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 416, elements: !303)
!303 = !{!304}
!304 = !DISubrange(count: 13)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !272, file: !164, line: 1926, baseType: !169, size: 32, offset: 11296)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !272, file: !164, line: 1927, baseType: !169, size: 32, offset: 11328)
!307 = !{!254, !308}
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !261, file: !260, line: 161, type: !310, isLocal: true, isDefinition: true, align: 128)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 48, elements: !290)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !313)
!313 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!314 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !194, line: 51, size: 64, elements: !317)
!317 = !{!318, !325}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !316, file: !194, line: 60, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DISubroutineType(types: !321)
!321 = !{!160, !322}
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !324)
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !194, line: 48, flags: DIFlagFwdDecl)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !316, file: !194, line: 65, baseType: !322, size: 32, offset: 32)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !328, file: !352, line: 27, type: !385, isLocal: true, isDefinition: true)
!328 = distinct !DICompileUnit(language: DW_LANG_C99, file: !329, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !330, retainedTypes: !331, globals: !349, splitDebugInlining: false, nameTableKind: None)
!329 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/nrf/system_off")
!330 = !{!55, !30, !38, !66}
!331 = !{!159, !155, !160, !24, !332, !348, !161, !188}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !334, line: 54, size: 96, elements: !335)
!334 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = !{!336, !343, !347}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !333, file: !334, line: 55, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !338, line: 33, baseType: !339)
!338 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !338, line: 29, size: 32, elements: !340)
!340 = !{!341}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !339, file: !338, line: 30, baseType: !342, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !333, file: !334, line: 60, baseType: !344, size: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !55}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !333, file: !334, line: 65, baseType: !344, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!349 = !{!326, !350, !356, !358, !369, !371, !373, !377}
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !328, file: !352, line: 44, type: !353, isLocal: true, isDefinition: true)
!352 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !354, line: 43, elements: !355)
!354 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!355 = !{}
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !328, file: !352, line: 49, type: !353, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !328, file: !352, line: 36, type: !360, isLocal: true, isDefinition: true)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 128, elements: !367)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !56, line: 114, size: 128, elements: !362)
!362 = !{!363, !364, !365, !366}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !361, file: !56, line: 115, baseType: !55, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !361, file: !56, line: 141, baseType: !216, size: 8, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !361, file: !56, line: 149, baseType: !161, size: 32, offset: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !361, file: !56, line: 156, baseType: !161, size: 32, offset: 96)
!367 = !{!368}
!368 = !DISubrange(count: 1)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !328, file: !352, line: 40, type: !360, isLocal: true, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "z_cpus_active", scope: !328, file: !352, line: 47, type: !233, isLocal: true, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "num_susp", scope: !328, file: !352, line: 57, type: !375, isLocal: true, isDefinition: true)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !376, line: 214, baseType: !32)
!376 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !328, file: !352, line: 28, type: !379, isLocal: true, isDefinition: true)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !338, line: 40, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !338, line: 35, size: 64, elements: !381)
!381 = !{!382, !384}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !380, file: !338, line: 36, baseType: !383, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !380, file: !338, line: 37, baseType: !383, size: 32, offset: 32)
!385 = !DICompositeType(tag: DW_TAG_array_type, baseType: !233, size: 32, elements: !367)
!386 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!387 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !390, file: !418, line: 50, type: !405, isLocal: true, isDefinition: true)
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !392, retainedTypes: !393, globals: !415, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/nrf/system_off")
!392 = !{!55, !66}
!393 = !{!225, !155, !375, !160, !159, !161, !188, !394, !348, !405, !406}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !396, line: 45, size: 64, elements: !397)
!396 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!397 = !{!398, !404}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !395, file: !396, line: 46, baseType: !399, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !338, line: 33, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !338, line: 29, size: 32, elements: !401)
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !400, file: !338, line: 30, baseType: !403, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !395, file: !396, line: 48, baseType: !161, size: 32, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !160)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !396, line: 38, size: 64, elements: !408)
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !407, file: !396, line: 39, baseType: !399, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !407, file: !396, line: 41, baseType: !411, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !396, line: 35, baseType: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 32)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !405}
!415 = !{!416, !420, !428, !388, !430, !440}
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "latency_lock", scope: !390, file: !418, line: 44, type: !419, isLocal: true, isDefinition: true)
!418 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !354, line: 43, elements: !355)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !390, file: !418, line: 46, type: !422, isLocal: true, isDefinition: true)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !338, line: 40, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !338, line: 35, size: 64, elements: !424)
!424 = !{!425, !427}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !423, file: !338, line: 36, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !423, file: !338, line: 37, baseType: !426, size: 32, offset: 32)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "latency_subs", scope: !390, file: !418, line: 52, type: !422, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !390, file: !418, line: 39, type: !432, isLocal: true, isDefinition: true)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, elements: !438)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !418, line: 35, size: 96, elements: !434)
!434 = !{!435, !436, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !433, file: !418, line: 36, baseType: !55, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !433, file: !418, line: 37, baseType: !216, size: 8, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !433, file: !418, line: 38, baseType: !233, size: 32, offset: 64)
!438 = !{!439}
!439 = !DISubrange(count: 0)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !390, file: !418, line: 48, type: !405, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !444, file: !451, line: 47, type: !465, isLocal: true, isDefinition: true)
!444 = distinct !DICompileUnit(language: DW_LANG_C99, file: !445, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !446, retainedTypes: !447, globals: !448, splitDebugInlining: false, nameTableKind: None)
!445 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/nrf/system_off")
!446 = !{!55}
!447 = !{!375, !160}
!448 = !{!449, !442, !461}
!449 = !DIGlobalVariableExpression(var: !450, expr: !DIExpression())
!450 = distinct !DIGlobalVariable(name: "cpus_states", scope: !444, file: !451, line: 50, type: !452, isLocal: true, isDefinition: true)
!451 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !453, size: 32, elements: !367)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !56, line: 114, size: 128, elements: !456)
!456 = !{!457, !458, !459, !460}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !455, file: !56, line: 115, baseType: !55, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !455, file: !56, line: 141, baseType: !216, size: 8, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !455, file: !56, line: 149, baseType: !161, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !455, file: !56, line: 156, baseType: !161, size: 32, offset: 96)
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !444, file: !451, line: 55, type: !463, isLocal: true, isDefinition: true)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 8, elements: !367)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, elements: !438)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "action_target_state", scope: !468, file: !484, line: 14, type: !485, isLocal: true, isDefinition: true)
!468 = distinct !DICompileUnit(language: DW_LANG_C99, file: !469, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !470, retainedTypes: !480, globals: !481, splitDebugInlining: false, nameTableKind: None)
!469 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/device.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/nrf/system_off")
!470 = !{!30, !38, !471, !66}
!471 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_flag", file: !31, line: 30, baseType: !32, size: 32, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479}
!473 = !DIEnumerator(name: "PM_DEVICE_FLAG_BUSY", value: 0)
!474 = !DIEnumerator(name: "PM_DEVICE_FLAG_TURN_ON_FAILED", value: 1)
!475 = !DIEnumerator(name: "PM_DEVICE_FLAG_WS_CAPABLE", value: 2)
!476 = !DIEnumerator(name: "PM_DEVICE_FLAG_WS_ENABLED", value: 3)
!477 = !DIEnumerator(name: "PM_DEVICE_FLAG_RUNTIME_ENABLED", value: 4)
!478 = !DIEnumerator(name: "PM_DEVICE_FLAG_STATE_LOCKED", value: 5)
!479 = !DIEnumerator(name: "PM_DEVICE_FLAG_PD", value: 6)
!480 = !{!159, !160, !24, !375}
!481 = !{!466, !482}
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "action_expected_state", scope: !468, file: !484, line: 20, type: !485, isLocal: true, isDefinition: true)
!484 = !DIFile(filename: "zephyr/subsys/pm/device.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 128, elements: !487)
!486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!487 = !{!488}
!488 = !DISubrange(count: 4)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "static_regions", scope: !491, file: !498, line: 62, type: !630, isLocal: true, isDefinition: true)
!491 = distinct !DICompileUnit(language: DW_LANG_C99, file: !492, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !247, retainedTypes: !493, globals: !494, splitDebugInlining: false, nameTableKind: None)
!492 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/nrf/system_off")
!493 = !{!375, !160, !161, !159}
!494 = !{!495, !489}
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !497, file: !498, line: 198, type: !617, isLocal: true, isDefinition: true)
!497 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !498, file: !498, line: 175, type: !499, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !491, retainedNodes: !614)
!498 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!499 = !DISubroutineType(types: !500)
!500 = !{null, !501}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !503, line: 245, size: 1024, elements: !504)
!503 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!504 = !{!505, !570, !583, !584, !585, !586, !592, !609}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !502, file: !503, line: 247, baseType: !506, size: 384)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !503, line: 57, size: 384, elements: !507)
!507 = !{!508, !536, !544, !545, !546, !557, !558, !559}
!508 = !DIDerivedType(tag: DW_TAG_member, scope: !506, file: !503, line: 60, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !506, file: !503, line: 60, size: 64, elements: !510)
!510 = !{!511, !527}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !509, file: !503, line: 61, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !513, line: 49, baseType: !514)
!513 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !513, line: 37, size: 64, elements: !515)
!515 = !{!516, !522}
!516 = !DIDerivedType(tag: DW_TAG_member, scope: !514, file: !513, line: 38, baseType: !517, size: 32)
!517 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !514, file: !513, line: 38, size: 32, elements: !518)
!518 = !{!519, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !517, file: !513, line: 39, baseType: !520, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !517, file: !513, line: 40, baseType: !520, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, scope: !514, file: !513, line: 42, baseType: !523, size: 32, offset: 32)
!523 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !514, file: !513, line: 42, size: 32, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !523, file: !513, line: 43, baseType: !520, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !523, file: !513, line: 44, baseType: !520, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !509, file: !503, line: 62, baseType: !528, size: 64)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !529, line: 49, size: 64, elements: !530)
!529 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!530 = !{!531}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !528, file: !529, line: 50, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 64, elements: !534)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!534 = !{!535}
!535 = !DISubrange(count: 2)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !506, file: !503, line: 68, baseType: !537, size: 32, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !539, line: 233, baseType: !540)
!539 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 231, size: 64, elements: !541)
!541 = !{!542}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !540, file: !539, line: 232, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !513, line: 48, baseType: !514)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !506, file: !503, line: 71, baseType: !216, size: 8, offset: 96)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !506, file: !503, line: 74, baseType: !216, size: 8, offset: 104)
!546 = !DIDerivedType(tag: DW_TAG_member, scope: !506, file: !503, line: 90, baseType: !547, size: 16, offset: 112)
!547 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !506, file: !503, line: 90, size: 16, elements: !548)
!548 = !{!549, !556}
!549 = !DIDerivedType(tag: DW_TAG_member, scope: !547, file: !503, line: 91, baseType: !550, size: 16)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !547, file: !503, line: 91, size: 16, elements: !551)
!551 = !{!552, !555}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !550, file: !503, line: 96, baseType: !553, size: 8)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !554)
!554 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !550, file: !503, line: 97, baseType: !216, size: 8, offset: 8)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !547, file: !503, line: 100, baseType: !312, size: 16)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !506, file: !503, line: 107, baseType: !161, size: 32, offset: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !506, file: !503, line: 127, baseType: !159, size: 32, offset: 160)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !506, file: !503, line: 131, baseType: !560, size: 192, offset: 192)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !539, line: 244, size: 192, elements: !561)
!561 = !{!562, !563, !569}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !560, file: !539, line: 245, baseType: !512, size: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !560, file: !539, line: 246, baseType: !564, size: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !539, line: 242, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!566 = !DISubroutineType(types: !567)
!567 = !{null, !568}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !560, file: !539, line: 249, baseType: !157, size: 64, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !502, file: !503, line: 250, baseType: !571, size: 288, offset: 384)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !572, line: 25, size: 288, elements: !573)
!572 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!573 = !{!574, !575, !576, !577, !578, !579, !580, !581, !582}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !571, file: !572, line: 26, baseType: !161, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !571, file: !572, line: 27, baseType: !161, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !571, file: !572, line: 28, baseType: !161, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !571, file: !572, line: 29, baseType: !161, size: 32, offset: 96)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !571, file: !572, line: 30, baseType: !161, size: 32, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !571, file: !572, line: 31, baseType: !161, size: 32, offset: 160)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !571, file: !572, line: 32, baseType: !161, size: 32, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !571, file: !572, line: 33, baseType: !161, size: 32, offset: 224)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !571, file: !572, line: 34, baseType: !161, size: 32, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !502, file: !503, line: 253, baseType: !159, size: 32, offset: 672)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !502, file: !503, line: 256, baseType: !538, size: 64, offset: 704)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !502, file: !503, line: 294, baseType: !160, size: 32, offset: 768)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !502, file: !503, line: 300, baseType: !587, size: 96, offset: 800)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !503, line: 149, size: 96, elements: !588)
!588 = !{!589, !590, !591}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !587, file: !503, line: 153, baseType: !22, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !587, file: !503, line: 162, baseType: !375, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !587, file: !503, line: 168, baseType: !375, size: 32, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !502, file: !503, line: 325, baseType: !593, size: 32, offset: 896)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !595, line: 5073, size: 160, elements: !596)
!595 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!596 = !{!597, !606, !607}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !594, file: !595, line: 5074, baseType: !598, size: 96)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !599, line: 56, size: 96, elements: !600)
!599 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!600 = !{!601, !604, !605}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !598, file: !599, line: 57, baseType: !602, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !599, line: 57, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !598, file: !599, line: 58, baseType: !159, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !598, file: !599, line: 59, baseType: !375, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !594, file: !595, line: 5075, baseType: !538, size: 64, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !594, file: !595, line: 5076, baseType: !608, offset: 160)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !354, line: 43, elements: !355)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !502, file: !503, line: 343, baseType: !610, size: 64, offset: 928)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !572, line: 60, size: 64, elements: !611)
!611 = !{!612, !613}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !610, file: !572, line: 63, baseType: !161, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !610, file: !572, line: 66, baseType: !161, size: 32, offset: 32)
!614 = !{!615, !616}
!615 = !DILocalVariable(name: "thread", arg: 1, scope: !497, file: !498, line: 175, type: !501)
!616 = !DILocalVariable(name: "region_num", scope: !497, file: !498, line: 200, type: !216)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, elements: !438)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !619, line: 52, size: 96, elements: !620)
!619 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!620 = !{!621, !622, !623}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !618, file: !619, line: 53, baseType: !22, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !618, file: !619, line: 54, baseType: !375, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !618, file: !619, line: 55, baseType: !624, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !625, line: 304, baseType: !626)
!625 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !625, line: 301, size: 32, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !626, file: !625, line: 302, baseType: !312, size: 16)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !626, file: !625, line: 303, baseType: !312, size: 16, offset: 16)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 96, elements: !367)
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !618)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !634, file: !688, line: 39, type: !216, isLocal: true, isDefinition: true)
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !635, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !247, retainedTypes: !636, globals: !679, splitDebugInlining: false, nameTableKind: None)
!635 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/nrf/system_off")
!636 = !{!637, !159, !160, !665}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !639, line: 1495, baseType: !640)
!639 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !639, line: 1474, size: 448, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !655}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !640, file: !639, line: 1476, baseType: !168, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !640, file: !639, line: 1477, baseType: !169, size: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !640, file: !639, line: 1478, baseType: !169, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !640, file: !639, line: 1479, baseType: !169, size: 32, offset: 96)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !640, file: !639, line: 1480, baseType: !169, size: 32, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !640, file: !639, line: 1481, baseType: !169, size: 32, offset: 160)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !640, file: !639, line: 1482, baseType: !169, size: 32, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !640, file: !639, line: 1483, baseType: !169, size: 32, offset: 224)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !640, file: !639, line: 1484, baseType: !169, size: 32, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !640, file: !639, line: 1485, baseType: !169, size: 32, offset: 288)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !640, file: !639, line: 1486, baseType: !169, size: 32, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !640, file: !639, line: 1487, baseType: !654, size: 32, offset: 352)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 32, elements: !367)
!655 = !DIDerivedType(tag: DW_TAG_member, scope: !640, file: !639, line: 1488, baseType: !656, size: 64, offset: 384)
!656 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !640, file: !639, line: 1488, size: 64, elements: !657)
!657 = !{!658, !660}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !656, file: !639, line: 1489, baseType: !659, size: 64)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 64, elements: !534)
!660 = !DIDerivedType(tag: DW_TAG_member, scope: !656, file: !639, line: 1490, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !656, file: !639, line: 1490, size: 64, elements: !662)
!662 = !{!663, !664}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !661, file: !639, line: 1491, baseType: !169, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !661, file: !639, line: 1492, baseType: !169, size: 32, offset: 32)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !668, line: 27, size: 128, elements: !669)
!668 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!669 = !{!670, !671, !672}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !667, file: !668, line: 29, baseType: !161, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !667, file: !668, line: 31, baseType: !206, size: 32, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !667, file: !668, line: 37, baseType: !673, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !625, line: 298, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !625, line: 289, size: 64, elements: !675)
!675 = !{!676, !677, !678}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !674, file: !625, line: 291, baseType: !216, size: 5, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !674, file: !625, line: 293, baseType: !216, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !674, file: !625, line: 295, baseType: !161, size: 32, offset: 32)
!679 = !{!632, !680}
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !634, file: !682, line: 31, type: !683, isLocal: true, isDefinition: true)
!682 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 160, elements: !367)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !682, line: 21, size: 160, elements: !685)
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !684, file: !682, line: 22, baseType: !160, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !684, file: !682, line: 23, baseType: !667, size: 128, offset: 32)
!688 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !691, file: !698, line: 21, type: !251, isLocal: true, isDefinition: true)
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !692, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !247, retainedTypes: !693, globals: !697, splitDebugInlining: false, nameTableKind: None)
!692 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/nrf/system_off")
!693 = !{!694, !160, !159}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !696, line: 22, baseType: !160)
!696 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!697 = !{!689}
!698 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !701, file: !706, line: 13, type: !725, isLocal: true, isDefinition: true)
!701 = distinct !DICompileUnit(language: DW_LANG_C99, file: !702, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !703, splitDebugInlining: false, nameTableKind: None)
!702 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/nrf/system_off")
!703 = !{!704, !699}
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "mpu_config", scope: !701, file: !706, line: 37, type: !707, isLocal: false, isDefinition: true)
!706 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !668, line: 41, size: 64, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !708, file: !668, line: 43, baseType: !161, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !708, file: !668, line: 45, baseType: !712, size: 32, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !668, line: 27, size: 128, elements: !715)
!715 = !{!716, !717, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !714, file: !668, line: 29, baseType: !161, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !714, file: !668, line: 31, baseType: !206, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !714, file: !668, line: 37, baseType: !719, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !625, line: 298, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !625, line: 289, size: 64, elements: !721)
!721 = !{!722, !723, !724}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !720, file: !625, line: 291, baseType: !216, size: 5, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !720, file: !625, line: 293, baseType: !216, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !720, file: !625, line: 295, baseType: !161, size: 32, offset: 32)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 256, elements: !534)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "__device_dts_ord_65", scope: !728, file: !932, line: 733, type: !1035, isLocal: false, isDefinition: true, align: 32)
!728 = distinct !DICompileUnit(language: DW_LANG_C99, file: !729, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !730, retainedTypes: !848, globals: !928, splitDebugInlining: false, nameTableKind: None)
!729 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus/boards/nrf/system_off")
!730 = !{!731, !737, !66, !742, !747, !751, !755, !759, !765, !769, !813, !820, !839}
!731 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !732, line: 23, baseType: !32, size: 32, elements: !733)
!732 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!733 = !{!734, !735, !736}
!734 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!735 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!736 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!737 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !732, line: 48, baseType: !32, size: 32, elements: !738)
!738 = !{!739, !740, !741}
!739 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!740 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!741 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!742 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !743, line: 167, baseType: !32, size: 32, elements: !744)
!743 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!744 = !{!745, !746}
!745 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!746 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!747 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !743, line: 107, baseType: !32, size: 32, elements: !748)
!748 = !{!749, !750}
!749 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!750 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!751 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !743, line: 208, baseType: !32, size: 32, elements: !752)
!752 = !{!753, !754}
!753 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!754 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!755 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !743, line: 261, baseType: !32, size: 32, elements: !756)
!756 = !{!757, !758}
!757 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!758 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!759 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !743, line: 237, baseType: !32, size: 32, elements: !760)
!760 = !{!761, !762, !763, !764}
!761 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!762 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!763 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!764 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!765 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !743, line: 152, baseType: !32, size: 32, elements: !766)
!766 = !{!767, !768}
!767 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!768 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!769 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !164, line: 71, baseType: !160, size: 32, elements: !770)
!770 = !{!771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812}
!771 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!772 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!773 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!774 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!775 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!776 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!777 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!778 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!779 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!780 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!781 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!782 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!783 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!784 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!785 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!786 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!787 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!788 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!789 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!790 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!791 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!792 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!793 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!794 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!795 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!796 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!797 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!798 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!799 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!800 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!801 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!802 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!803 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!804 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!805 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!806 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!807 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!808 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!809 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!810 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!811 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!812 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!813 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !814, line: 44, baseType: !32, size: 32, elements: !815)
!814 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!815 = !{!816, !817, !818, !819}
!816 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!817 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!818 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!819 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!820 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !821, line: 54, baseType: !32, size: 32, elements: !822)
!821 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838}
!823 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!824 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!825 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!826 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!827 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!828 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!829 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!830 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!831 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!832 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!833 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!834 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!835 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!836 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!837 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!838 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!839 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !840, line: 53, baseType: !32, size: 32, elements: !841)
!840 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!841 = !{!842, !843, !844, !845, !846, !847}
!842 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!843 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!844 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!845 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!846 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!847 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!848 = !{!731, !159, !160, !849, !891, !892, !893, !894, !155, !161, !188, !219, !895, !896, !405, !897, !927, !375}
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !164, line: 923, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 883, size: 10464, elements: !852)
!852 = !{!853, !854, !855, !856, !857, !861, !862, !863, !864, !865, !866, !867, !868, !872, !873, !874, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !851, file: !164, line: 884, baseType: !169, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !851, file: !164, line: 885, baseType: !169, size: 32, offset: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !851, file: !164, line: 886, baseType: !169, size: 32, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !851, file: !164, line: 887, baseType: !169, size: 32, offset: 96)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !851, file: !164, line: 888, baseType: !858, size: 896, offset: 128)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 896, elements: !859)
!859 = !{!860}
!860 = !DISubrange(count: 28)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !851, file: !164, line: 889, baseType: !169, size: 32, offset: 1024)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !851, file: !164, line: 890, baseType: !169, size: 32, offset: 1056)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !851, file: !164, line: 891, baseType: !169, size: 32, offset: 1088)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !851, file: !164, line: 892, baseType: !169, size: 32, offset: 1120)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !851, file: !164, line: 893, baseType: !858, size: 896, offset: 1152)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !851, file: !164, line: 894, baseType: !169, size: 32, offset: 2048)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !851, file: !164, line: 895, baseType: !169, size: 32, offset: 2080)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !851, file: !164, line: 896, baseType: !869, size: 960, offset: 2112)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 960, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 30)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !851, file: !164, line: 897, baseType: !169, size: 32, offset: 3072)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !851, file: !164, line: 898, baseType: !169, size: 32, offset: 3104)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !851, file: !164, line: 899, baseType: !875, size: 3008, offset: 3136)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 3008, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 94)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !851, file: !164, line: 900, baseType: !169, size: 32, offset: 6144)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !851, file: !164, line: 901, baseType: !169, size: 32, offset: 6176)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !851, file: !164, line: 902, baseType: !169, size: 32, offset: 6208)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !851, file: !164, line: 903, baseType: !168, size: 32, offset: 6240)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !851, file: !164, line: 904, baseType: !282, size: 1984, offset: 6272)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !851, file: !164, line: 905, baseType: !168, size: 32, offset: 8256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !851, file: !164, line: 907, baseType: !168, size: 32, offset: 8288)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !851, file: !164, line: 910, baseType: !168, size: 32, offset: 8320)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !851, file: !164, line: 911, baseType: !168, size: 32, offset: 8352)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !851, file: !164, line: 913, baseType: !168, size: 32, offset: 8384)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !851, file: !164, line: 917, baseType: !168, size: 32, offset: 8416)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !851, file: !164, line: 919, baseType: !282, size: 1984, offset: 8448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !851, file: !164, line: 920, baseType: !169, size: 32, offset: 10432)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !743, line: 146, baseType: !747)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !743, line: 164, baseType: !765)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !639, line: 485, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !639, line: 468, size: 28704, elements: !900)
!900 = !{!901, !905, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !922, !926}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !899, file: !639, line: 470, baseType: !902, size: 512)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 512, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 16)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !899, file: !639, line: 471, baseType: !906, size: 512, offset: 512)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 512, elements: !903)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !899, file: !639, line: 472, baseType: !902, size: 512, offset: 1024)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !899, file: !639, line: 473, baseType: !906, size: 512, offset: 1536)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !899, file: !639, line: 474, baseType: !902, size: 512, offset: 2048)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !899, file: !639, line: 475, baseType: !906, size: 512, offset: 2560)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !899, file: !639, line: 476, baseType: !902, size: 512, offset: 3072)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !899, file: !639, line: 477, baseType: !906, size: 512, offset: 3584)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !899, file: !639, line: 478, baseType: !902, size: 512, offset: 4096)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !899, file: !639, line: 479, baseType: !906, size: 512, offset: 4608)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !899, file: !639, line: 480, baseType: !902, size: 512, offset: 5120)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !899, file: !639, line: 481, baseType: !906, size: 512, offset: 5632)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !899, file: !639, line: 482, baseType: !918, size: 3968, offset: 6144)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !919, size: 3968, elements: !920)
!919 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !216)
!920 = !{!921}
!921 = !DISubrange(count: 496)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !899, file: !639, line: 483, baseType: !923, size: 18560, offset: 10112)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 18560, elements: !924)
!924 = !{!925}
!925 = !DISubrange(count: 580)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !899, file: !639, line: 484, baseType: !169, size: 32, offset: 28672)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !814, line: 56, baseType: !159)
!928 = !{!929, !979, !1020, !726, !1025, !1053, !1055, !1072, !1074, !1084, !1087, !1102, !1140, !1154}
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(name: "on", scope: !931, file: !932, line: 549, type: !233, isLocal: true, isDefinition: true)
!931 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !932, file: !932, line: 547, type: !933, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !728, retainedNodes: !935)
!932 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!933 = !DISubroutineType(types: !934)
!934 = !{null, !737}
!935 = !{!936, !937, !940}
!936 = !DILocalVariable(name: "start_mode", arg: 1, scope: !931, file: !932, line: 547, type: !737)
!937 = !DILocalVariable(name: "err", scope: !938, file: !932, line: 553, type: !160)
!938 = distinct !DILexicalBlock(scope: !939, file: !932, line: 552, column: 31)
!939 = distinct !DILexicalBlock(scope: !931, file: !932, line: 552, column: 6)
!940 = !DILocalVariable(name: "mgr", scope: !938, file: !932, line: 554, type: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !943, line: 154, size: 224, elements: !944)
!943 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!944 = !{!945, !957, !958, !974, !976, !977, !978}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !942, file: !943, line: 158, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !338, line: 40, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !338, line: 35, size: 64, elements: !948)
!948 = !{!949, !956}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !947, file: !338, line: 36, baseType: !950, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !338, line: 33, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !338, line: 29, size: 32, elements: !953)
!953 = !{!954}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !952, file: !338, line: 30, baseType: !955, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !947, file: !338, line: 37, baseType: !950, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !942, file: !943, line: 163, baseType: !946, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !942, file: !943, line: 166, baseType: !959, size: 32, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !961)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !943, line: 133, size: 96, elements: !962)
!962 = !{!963, !972, !973}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !961, file: !943, line: 135, baseType: !964, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !943, line: 129, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = !DISubroutineType(types: !967)
!967 = !{null, !941, !968}
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !943, line: 101, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DISubroutineType(types: !971)
!971 = !{null, !941, !160}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !961, file: !943, line: 138, baseType: !964, size: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !961, file: !943, line: 143, baseType: !964, size: 32, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !942, file: !943, line: 169, baseType: !975, offset: 160)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !354, line: 43, elements: !355)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !942, file: !943, line: 172, baseType: !160, size: 32, offset: 160)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !942, file: !943, line: 175, baseType: !312, size: 16, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !942, file: !943, line: 178, baseType: !312, size: 16, offset: 208)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(name: "cli", scope: !931, file: !932, line: 550, type: !981, isLocal: true, isDefinition: true)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !943, line: 273, size: 128, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !981, file: !943, line: 280, baseType: !951, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !981, file: !943, line: 283, baseType: !985, size: 96, offset: 32)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !986, line: 138, size: 96, elements: !987)
!986 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!987 = !{!988, !1017, !1018}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !985, file: !986, line: 149, baseType: !989, size: 32)
!989 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !986, line: 139, size: 32, elements: !990)
!990 = !{!991, !1012}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !989, file: !986, line: 145, baseType: !992, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !595, line: 5397, size: 128, elements: !994)
!994 = !{!995, !1010, !1011}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !993, file: !595, line: 5399, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !513, line: 48, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !513, line: 37, size: 64, elements: !998)
!998 = !{!999, !1005}
!999 = !DIDerivedType(tag: DW_TAG_member, scope: !997, file: !513, line: 38, baseType: !1000, size: 32)
!1000 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !997, file: !513, line: 38, size: 32, elements: !1001)
!1001 = !{!1002, !1004}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1000, file: !513, line: 39, baseType: !1003, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1000, file: !513, line: 40, baseType: !1003, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, scope: !997, file: !513, line: 42, baseType: !1006, size: 32, offset: 32)
!1006 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !997, file: !513, line: 42, size: 32, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1006, file: !513, line: 43, baseType: !1003, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1006, file: !513, line: 44, baseType: !1003, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !993, file: !595, line: 5405, baseType: !32, size: 32, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !993, file: !595, line: 5408, baseType: !160, size: 32, offset: 96)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !989, file: !986, line: 148, baseType: !1013, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !986, line: 98, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 32)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{null, null}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !985, file: !986, line: 165, baseType: !169, size: 32, offset: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !985, file: !986, line: 174, baseType: !1019, size: 32, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !160)
!1020 = !DIGlobalVariableExpression(var: !1021, expr: !DIExpression())
!1021 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_65", scope: !728, file: !932, line: 733, type: !1022, isLocal: false, isDefinition: true, align: 16)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 80, elements: !1023)
!1023 = !{!1024}
!1024 = !DISubrange(count: 5)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_65", scope: !728, file: !932, line: 733, type: !1027, isLocal: true, isDefinition: true, align: 32)
!1027 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !194, line: 51, size: 64, elements: !1029)
!1029 = !{!1030, !1052}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1028, file: !194, line: 60, baseType: !1031, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 32)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!160, !1034}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !203, line: 378, size: 224, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1041, !1047, !1048, !1049}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1036, file: !203, line: 380, baseType: !206, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1036, file: !203, line: 382, baseType: !13, size: 32, offset: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1036, file: !203, line: 384, baseType: !13, size: 32, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1036, file: !203, line: 386, baseType: !1042, size: 32, offset: 96)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 32)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !203, line: 351, size: 16, elements: !1044)
!1044 = !{!1045, !1046}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1043, file: !203, line: 359, baseType: !216, size: 8)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1043, file: !203, line: 364, baseType: !219, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1036, file: !203, line: 388, baseType: !159, size: 32, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1036, file: !203, line: 396, baseType: !222, size: 32, offset: 160)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !1036, file: !203, line: 403, baseType: !1050, size: 32, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 32)
!1051 = !DICompositeType(tag: DW_TAG_structure_type, name: "pm_device", file: !203, line: 367, flags: DIFlagFwdDecl)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1028, file: !194, line: 65, baseType: !1034, size: 32, offset: 32)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
