; ModuleID = 'build/96b_carbon_nrf51/synchronization/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/synchronization/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/synchronization")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 38, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/synchronization")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1664, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 26)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 832, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "threadA_sem", scope: !27, file: !116, line: 72, type: !117, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/synchronization")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !106, !107, !109, !110, !111}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !103, line: 46, baseType: !104)
!103 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !105)
!105 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 214, baseType: !32)
!108 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!25, !114, !143, !153, !251, !253}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "threadB_sem", scope: !27, file: !116, line: 73, type: !117, isLocal: false, isDefinition: true, align: 32)
!116 = !DIFile(filename: "zephyr/samples/synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !118, line: 2909, size: 128, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120, !141, !142}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !117, file: !118, line: 2910, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !123, file: !122, line: 232, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !129)
!129 = !{!130, !136}
!130 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 38, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 38, size: 32, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !127, line: 39, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !127, line: 40, baseType: !134, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 42, baseType: !137, size: 32, offset: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 42, size: 32, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !137, file: !127, line: 43, baseType: !134, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !127, line: 44, baseType: !134, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !117, file: !118, line: 2911, baseType: !32, size: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !117, file: !118, line: 2912, baseType: !32, size: 32, offset: 96)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "threadA_stack_area", scope: !27, file: !116, line: 88, type: !145, isLocal: false, isDefinition: true, align: 64)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 8192, elements: !151)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !147, line: 47, size: 8, elements: !148)
!147 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !147, line: 48, baseType: !150, size: 8)
!150 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!151 = !{!152}
!152 = !DISubrange(count: 1024)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "threadA_data", scope: !27, file: !116, line: 89, type: !155, isLocal: true, isDefinition: true)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !156, line: 245, size: 1216, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{!158, !208, !221, !222, !223, !227, !228, !246}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !155, file: !156, line: 247, baseType: !159, size: 448)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !156, line: 57, size: 448, elements: !160)
!160 = !{!161, !175, !177, !180, !181, !194, !195, !196, !197}
!161 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 60, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 60, size: 64, elements: !163)
!163 = !{!164, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !162, file: !156, line: 61, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !162, file: !156, line: 62, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 49, size: 64, elements: !169)
!168 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !167, file: !168, line: 50, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!173 = !{!174}
!174 = !DISubrange(count: 2)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !159, file: !156, line: 68, baseType: !176, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !159, file: !156, line: 71, baseType: !178, size: 8, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !179)
!179 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !159, file: !156, line: 74, baseType: !178, size: 8, offset: 104)
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 90, baseType: !182, size: 16, offset: 112)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 90, size: 16, elements: !183)
!183 = !{!184, !191}
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !182, file: !156, line: 91, baseType: !185, size: 16)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !182, file: !156, line: 91, size: 16, elements: !186)
!186 = !{!187, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !185, file: !156, line: 96, baseType: !188, size: 8)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !189)
!189 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !185, file: !156, line: 97, baseType: !178, size: 8, offset: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !182, file: !156, line: 100, baseType: !192, size: 16)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !193)
!193 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !159, file: !156, line: 107, baseType: !110, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_mask", scope: !159, file: !156, line: 123, baseType: !178, size: 8, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !159, file: !156, line: 127, baseType: !106, size: 32, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !159, file: !156, line: 131, baseType: !198, size: 192, offset: 256)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !199)
!199 = !{!200, !201, !207}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !198, file: !122, line: 245, baseType: !165, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !198, file: !122, line: 246, baseType: !202, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !198, file: !122, line: 249, baseType: !104, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !155, file: !156, line: 250, baseType: !209, size: 288, offset: 448)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !210, line: 25, size: 288, elements: !211)
!210 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !209, file: !210, line: 26, baseType: !110, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !209, file: !210, line: 27, baseType: !110, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !209, file: !210, line: 28, baseType: !110, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !209, file: !210, line: 29, baseType: !110, size: 32, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !209, file: !210, line: 30, baseType: !110, size: 32, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !209, file: !210, line: 31, baseType: !110, size: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !209, file: !210, line: 32, baseType: !110, size: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !209, file: !210, line: 33, baseType: !110, size: 32, offset: 224)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !209, file: !210, line: 34, baseType: !110, size: 32, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !155, file: !156, line: 253, baseType: !106, size: 32, offset: 736)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !155, file: !156, line: 256, baseType: !121, size: 64, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !155, file: !156, line: 279, baseType: !224, size: 256, offset: 832)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !155, file: !156, line: 294, baseType: !109, size: 32, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !155, file: !156, line: 325, baseType: !229, size: 32, offset: 1120)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 160, elements: !231)
!231 = !{!232, !241, !242}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !230, file: !118, line: 5074, baseType: !233, size: 96)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !234, line: 56, size: 96, elements: !235)
!234 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = !{!236, !239, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !233, file: !234, line: 57, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !234, line: 57, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !233, file: !234, line: 58, baseType: !106, size: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !233, file: !234, line: 59, baseType: !107, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !230, file: !118, line: 5075, baseType: !121, size: 64, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !230, file: !118, line: 5076, baseType: !243, offset: 160)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !244, line: 43, elements: !245)
!244 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!245 = !{}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !155, file: !156, line: 343, baseType: !247, size: 64, offset: 1152)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !210, line: 60, size: 64, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !247, file: !210, line: 63, baseType: !110, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !247, file: !210, line: 66, baseType: !110, size: 32, offset: 32)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "threadB_stack_area", scope: !27, file: !116, line: 91, type: !145, isLocal: false, isDefinition: true, align: 64)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "threadB_data", scope: !27, file: !116, line: 92, type: !155, isLocal: true, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "_char_out", scope: !257, file: !261, line: 54, type: !262, isLocal: false, isDefinition: true)
!257 = distinct !DICompileUnit(language: DW_LANG_C99, file: !258, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !259, globals: !260, splitDebugInlining: false, nameTableKind: None)
!258 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/synchronization")
!259 = !{!106, !109}
!260 = !{!255}
!261 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DISubroutineType(types: !264)
!264 = !{!109, !109}
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !267, file: !302, line: 27, type: !327, isLocal: true, isDefinition: true)
!267 = distinct !DICompileUnit(language: DW_LANG_C99, file: !268, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, retainedTypes: !281, globals: !299, splitDebugInlining: false, nameTableKind: None)
!268 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/synchronization")
!269 = !{!270, !30}
!270 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !271, line: 27, baseType: !32, size: 32, elements: !272)
!271 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280}
!273 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!274 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!275 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!276 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!277 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!278 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!279 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!280 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!281 = !{!106, !102, !109, !24, !282, !298, !110, !111}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !284, line: 54, size: 96, elements: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !{!286, !293, !297}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !283, file: !284, line: 55, baseType: !287, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !288, line: 33, baseType: !289)
!288 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !288, line: 29, size: 32, elements: !290)
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !289, file: !288, line: 30, baseType: !292, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !283, file: !284, line: 60, baseType: !294, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !270}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !283, file: !284, line: 65, baseType: !294, size: 32, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!299 = !{!265, !300, !304, !306, !317, !319}
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !267, file: !302, line: 44, type: !303, isLocal: true, isDefinition: true)
!302 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !244, line: 43, elements: !245)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !267, file: !302, line: 49, type: !303, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !267, file: !302, line: 36, type: !308, isLocal: true, isDefinition: true)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 128, elements: !315)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !271, line: 114, size: 128, elements: !310)
!310 = !{!311, !312, !313, !314}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !309, file: !271, line: 115, baseType: !270, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !309, file: !271, line: 141, baseType: !178, size: 8, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !309, file: !271, line: 149, baseType: !110, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !309, file: !271, line: 156, baseType: !110, size: 32, offset: 96)
!315 = !{!316}
!316 = !DISubrange(count: 1)
!317 = !DIGlobalVariableExpression(var: !318, expr: !DIExpression())
!318 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !267, file: !302, line: 40, type: !308, isLocal: true, isDefinition: true)
!319 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression())
!320 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !267, file: !302, line: 28, type: !321, isLocal: true, isDefinition: true)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !288, line: 40, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !288, line: 35, size: 64, elements: !323)
!323 = !{!324, !326}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !322, file: !288, line: 36, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !322, file: !288, line: 37, baseType: !325, size: 32, offset: 32)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 32, elements: !315)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !329, line: 22, baseType: !330)
!329 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!330 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!331 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!332 = !DIGlobalVariableExpression(var: !320, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !335, file: !364, line: 50, type: !351, isLocal: true, isDefinition: true)
!335 = distinct !DICompileUnit(language: DW_LANG_C99, file: !336, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !269, retainedTypes: !337, globals: !361, splitDebugInlining: false, nameTableKind: None)
!336 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/synchronization")
!337 = !{!338, !102, !107, !109, !106, !110, !111, !340, !298, !351, !352}
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !339)
!339 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 32)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !342, line: 45, size: 64, elements: !343)
!342 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!343 = !{!344, !350}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !341, file: !342, line: 46, baseType: !345, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !288, line: 33, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !288, line: 29, size: 32, elements: !347)
!347 = !{!348}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !346, file: !288, line: 30, baseType: !349, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !341, file: !342, line: 48, baseType: !110, size: 32, offset: 32)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !109)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !342, line: 38, size: 64, elements: !354)
!354 = !{!355, !356}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !353, file: !342, line: 39, baseType: !345, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !353, file: !342, line: 41, baseType: !357, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !342, line: 35, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !351}
!361 = !{!362, !366, !374, !333, !376, !386}
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "latency_lock", scope: !335, file: !364, line: 44, type: !365, isLocal: true, isDefinition: true)
!364 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !244, line: 43, elements: !245)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !335, file: !364, line: 46, type: !368, isLocal: true, isDefinition: true)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !288, line: 40, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !288, line: 35, size: 64, elements: !370)
!370 = !{!371, !373}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !369, file: !288, line: 36, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !369, file: !288, line: 37, baseType: !372, size: 32, offset: 32)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "latency_subs", scope: !335, file: !364, line: 52, type: !368, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !335, file: !364, line: 39, type: !378, isLocal: true, isDefinition: true)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, elements: !384)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !364, line: 35, size: 96, elements: !380)
!380 = !{!381, !382, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !379, file: !364, line: 36, baseType: !270, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !379, file: !364, line: 37, baseType: !178, size: 8, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !379, file: !364, line: 38, baseType: !328, size: 32, offset: 64)
!384 = !{!385}
!385 = !DISubrange(count: 0)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !335, file: !364, line: 48, type: !351, isLocal: true, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !390, file: !397, line: 47, type: !411, isLocal: true, isDefinition: true)
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !392, retainedTypes: !393, globals: !394, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/synchronization")
!392 = !{!270}
!393 = !{!107, !109}
!394 = !{!395, !388, !407}
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "cpus_states", scope: !390, file: !397, line: 50, type: !398, isLocal: true, isDefinition: true)
!397 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 32, elements: !315)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !271, line: 114, size: 128, elements: !402)
!402 = !{!403, !404, !405, !406}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !401, file: !271, line: 115, baseType: !270, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !401, file: !271, line: 141, baseType: !178, size: 8, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !401, file: !271, line: 149, baseType: !110, size: 32, offset: 64)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !401, file: !271, line: 156, baseType: !110, size: 32, offset: 96)
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !390, file: !397, line: 55, type: !409, isLocal: true, isDefinition: true)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !410, size: 8, elements: !315)
!410 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, elements: !384)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !414, file: !421, line: 21, type: !262, isLocal: true, isDefinition: true)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !416, globals: !420, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/synchronization")
!416 = !{!417, !109, !106}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !419, line: 22, baseType: !109)
!419 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!420 = !{!412}
!421 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf51_init", scope: !424, file: !525, line: 71, type: !526, isLocal: true, isDefinition: true, align: 32)
!424 = distinct !DICompileUnit(language: DW_LANG_C99, file: !425, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !426, globals: !520, splitDebugInlining: false, nameTableKind: None)
!425 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/synchronization")
!426 = !{!427, !178, !106, !109, !493, !494, !509, !110}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !429, line: 247, baseType: !430)
!429 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf51.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !429, line: 216, size: 20576, elements: !431)
!431 = !{!432, !438, !439, !440, !444, !445, !449, !450, !451, !455, !456, !460, !461, !465, !466, !470, !471, !473, !474, !475, !476, !480, !481, !482, !483, !487, !488, !492}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !430, file: !429, line: 217, baseType: !433, size: 960)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 960, elements: !436)
!434 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!436 = !{!437}
!437 = !DISubrange(count: 30)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !430, file: !429, line: 218, baseType: !435, size: 32, offset: 960)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !430, file: !429, line: 219, baseType: !435, size: 32, offset: 992)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !430, file: !429, line: 220, baseType: !441, size: 1088, offset: 1024)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 1088, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 34)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !430, file: !429, line: 221, baseType: !435, size: 32, offset: 2112)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !430, file: !429, line: 222, baseType: !446, size: 4032, offset: 2144)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 4032, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 126)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !430, file: !429, line: 223, baseType: !435, size: 32, offset: 6176)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !430, file: !429, line: 224, baseType: !435, size: 32, offset: 6208)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !430, file: !429, line: 225, baseType: !452, size: 1952, offset: 6240)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 1952, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 61)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !430, file: !429, line: 226, baseType: !435, size: 32, offset: 8192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !430, file: !429, line: 227, baseType: !457, size: 288, offset: 8224)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 288, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 9)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !430, file: !429, line: 228, baseType: !434, size: 32, offset: 8512)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !430, file: !429, line: 229, baseType: !462, size: 1696, offset: 8544)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 1696, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 53)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !430, file: !429, line: 230, baseType: !435, size: 32, offset: 10240)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !430, file: !429, line: 231, baseType: !467, size: 96, offset: 10272)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 96, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 3)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !430, file: !429, line: 232, baseType: !435, size: 32, offset: 10368)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !430, file: !429, line: 233, baseType: !472, size: 64, offset: 10400)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 64, elements: !173)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !430, file: !429, line: 234, baseType: !435, size: 32, offset: 10464)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !430, file: !429, line: 236, baseType: !434, size: 32, offset: 10496)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !430, file: !429, line: 237, baseType: !435, size: 32, offset: 10528)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !430, file: !429, line: 238, baseType: !477, size: 224, offset: 10560)
!477 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 224, elements: !478)
!478 = !{!479}
!479 = !DISubrange(count: 7)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "RESET", scope: !430, file: !429, line: 239, baseType: !435, size: 32, offset: 10784)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !430, file: !429, line: 241, baseType: !467, size: 96, offset: 10816)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !430, file: !429, line: 242, baseType: !435, size: 32, offset: 10912)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !430, file: !429, line: 243, baseType: !484, size: 256, offset: 10944)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 256, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 8)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !430, file: !429, line: 244, baseType: !435, size: 32, offset: 11200)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !430, file: !429, line: 245, baseType: !489, size: 9312, offset: 11232)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 9312, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 291)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCFORCE", scope: !430, file: !429, line: 246, baseType: !435, size: 32, offset: 20544)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !496, line: 352, baseType: !497)
!496 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !496, line: 341, size: 320, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !508}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !497, file: !496, line: 343, baseType: !434, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !497, file: !496, line: 344, baseType: !435, size: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !497, file: !496, line: 345, baseType: !110, size: 32, offset: 64)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !497, file: !496, line: 346, baseType: !435, size: 32, offset: 96)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !497, file: !496, line: 347, baseType: !435, size: 32, offset: 128)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !497, file: !496, line: 348, baseType: !435, size: 32, offset: 160)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !497, file: !496, line: 349, baseType: !110, size: 32, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !497, file: !496, line: 350, baseType: !507, size: 64, offset: 224)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 64, elements: !173)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !497, file: !496, line: 351, baseType: !435, size: 32, offset: 288)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !511, file: !510, line: 167, baseType: !519)
!510 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!511 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !510, file: !510, line: 134, type: !512, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !424, retainedNodes: !514)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !110}
!514 = !{!515, !516, !518}
!515 = !DILocalVariable(name: "time_us", arg: 1, scope: !511, file: !510, line: 134, type: !110)
!516 = !DILocalVariable(name: "delay_cycles", scope: !511, file: !510, line: 168, type: !517)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!518 = !DILocalVariable(name: "cycles", scope: !511, file: !510, line: 171, type: !110)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 32)
!520 = !{!422, !521}
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !511, file: !510, line: 161, type: !523, isLocal: true, isDefinition: true, align: 128)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !524, size: 48, elements: !468)
!524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!525 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !528, line: 51, size: 64, elements: !529)
!528 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!529 = !{!530, !537}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !527, file: !528, line: 60, baseType: !531, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 32)
!532 = !DISubroutineType(types: !533)
!533 = !{!109, !534}
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !528, line: 48, flags: DIFlagFwdDecl)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !527, file: !528, line: 65, baseType: !534, size: 32, offset: 32)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "__device_dts_ord_23", scope: !540, file: !739, line: 733, type: !843, isLocal: false, isDefinition: true, align: 32)
!540 = distinct !DICompileUnit(language: DW_LANG_C99, file: !541, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !542, retainedTypes: !657, globals: !735, splitDebugInlining: false, nameTableKind: None)
!541 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/synchronization")
!542 = !{!543, !549, !30, !554, !559, !564, !570, !576, !585, !589, !622, !629, !648}
!543 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !544, line: 23, baseType: !32, size: 32, elements: !545)
!544 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!545 = !{!546, !547, !548}
!546 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!547 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!548 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!549 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !544, line: 48, baseType: !32, size: 32, elements: !550)
!550 = !{!551, !552, !553}
!551 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!552 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!553 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!554 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !555, line: 167, baseType: !32, size: 32, elements: !556)
!555 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!556 = !{!557, !558}
!557 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!558 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!559 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !555, line: 107, baseType: !32, size: 32, elements: !560)
!560 = !{!561, !562, !563}
!561 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!562 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!563 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!564 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !555, line: 208, baseType: !32, size: 32, elements: !565)
!565 = !{!566, !567, !568, !569}
!566 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!567 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!568 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!569 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!570 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !555, line: 261, baseType: !32, size: 32, elements: !571)
!571 = !{!572, !573, !574, !575}
!572 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!573 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!574 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!575 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!576 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !555, line: 237, baseType: !32, size: 32, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584}
!578 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!579 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!580 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!581 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!582 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!583 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!584 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!585 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !555, line: 152, baseType: !32, size: 32, elements: !586)
!586 = !{!587, !588}
!587 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!588 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!589 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !429, line: 71, baseType: !109, size: 32, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!591 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!592 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!593 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!594 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!595 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!596 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!597 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!598 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!599 = !DIEnumerator(name: "UART0_IRQn", value: 2)
!600 = !DIEnumerator(name: "SPI0_TWI0_IRQn", value: 3)
!601 = !DIEnumerator(name: "SPI1_TWI1_IRQn", value: 4)
!602 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!603 = !DIEnumerator(name: "ADC_IRQn", value: 7)
!604 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!605 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!606 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!607 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!608 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!609 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!610 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!611 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!612 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!613 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!614 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!615 = !DIEnumerator(name: "LPCOMP_IRQn", value: 19)
!616 = !DIEnumerator(name: "SWI0_IRQn", value: 20)
!617 = !DIEnumerator(name: "SWI1_IRQn", value: 21)
!618 = !DIEnumerator(name: "SWI2_IRQn", value: 22)
!619 = !DIEnumerator(name: "SWI3_IRQn", value: 23)
!620 = !DIEnumerator(name: "SWI4_IRQn", value: 24)
!621 = !DIEnumerator(name: "SWI5_IRQn", value: 25)
!622 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !623, line: 44, baseType: !32, size: 32, elements: !624)
!623 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!624 = !{!625, !626, !627, !628}
!625 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!626 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!627 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!628 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!629 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !630, line: 54, baseType: !32, size: 32, elements: !631)
!630 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!631 = !{!632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!632 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!633 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!634 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!635 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!636 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!637 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!638 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!639 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!640 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!641 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!642 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!643 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!644 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!645 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!646 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!647 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!648 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !649, line: 53, baseType: !32, size: 32, elements: !650)
!649 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!650 = !{!651, !652, !653, !654, !655, !656}
!651 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!652 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!653 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!654 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!655 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!656 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!657 = !{!543, !106, !109, !658, !706, !707, !708, !709, !102, !110, !111, !710, !493, !711, !351, !712, !734, !107}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !429, line: 291, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !429, line: 260, size: 10912, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669, !673, !674, !675, !676, !677, !678, !682, !683, !684, !688, !689, !690, !691, !692, !693, !694, !698, !699, !700, !701, !705}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !660, file: !429, line: 261, baseType: !435, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !660, file: !429, line: 262, baseType: !435, size: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !660, file: !429, line: 263, baseType: !435, size: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !660, file: !429, line: 264, baseType: !435, size: 32, offset: 96)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !660, file: !429, line: 265, baseType: !435, size: 32, offset: 128)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !660, file: !429, line: 266, baseType: !435, size: 32, offset: 160)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !660, file: !429, line: 267, baseType: !435, size: 32, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !660, file: !429, line: 268, baseType: !670, size: 1824, offset: 224)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 1824, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 57)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !660, file: !429, line: 269, baseType: !435, size: 32, offset: 2048)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !660, file: !429, line: 270, baseType: !435, size: 32, offset: 2080)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !660, file: !429, line: 271, baseType: !434, size: 32, offset: 2112)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !660, file: !429, line: 272, baseType: !435, size: 32, offset: 2144)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !660, file: !429, line: 273, baseType: !435, size: 32, offset: 2176)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !660, file: !429, line: 274, baseType: !679, size: 3968, offset: 2208)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 3968, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 124)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !660, file: !429, line: 275, baseType: !435, size: 32, offset: 6176)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !660, file: !429, line: 276, baseType: !435, size: 32, offset: 6208)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !660, file: !429, line: 277, baseType: !685, size: 2016, offset: 6240)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 2016, elements: !686)
!686 = !{!687}
!687 = !DISubrange(count: 63)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !660, file: !429, line: 278, baseType: !434, size: 32, offset: 8256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !660, file: !429, line: 279, baseType: !434, size: 32, offset: 8288)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !660, file: !429, line: 280, baseType: !434, size: 32, offset: 8320)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !660, file: !429, line: 281, baseType: !434, size: 32, offset: 8352)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !660, file: !429, line: 282, baseType: !434, size: 32, offset: 8384)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !660, file: !429, line: 283, baseType: !434, size: 32, offset: 8416)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !660, file: !429, line: 285, baseType: !695, size: 1984, offset: 8448)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 1984, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 62)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !660, file: !429, line: 286, baseType: !435, size: 32, offset: 10432)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !660, file: !429, line: 287, baseType: !477, size: 224, offset: 10464)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !660, file: !429, line: 288, baseType: !435, size: 32, offset: 10688)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !660, file: !429, line: 289, baseType: !702, size: 160, offset: 10720)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 160, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 5)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "XTALFREQ", scope: !660, file: !429, line: 290, baseType: !435, size: 32, offset: 10880)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !555, line: 146, baseType: !559)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !555, line: 164, baseType: !585)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 32)
!710 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !496, line: 326, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !496, line: 314, size: 6400, elements: !715)
!715 = !{!716, !718, !722, !723, !724, !725, !726, !727, !728, !732}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !714, file: !496, line: 316, baseType: !717, size: 32)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 32, elements: !315)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !714, file: !496, line: 317, baseType: !719, size: 992, offset: 32)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 992, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 31)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !714, file: !496, line: 318, baseType: !717, size: 32, offset: 1024)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !714, file: !496, line: 319, baseType: !719, size: 992, offset: 1056)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !714, file: !496, line: 320, baseType: !717, size: 32, offset: 2048)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !714, file: !496, line: 321, baseType: !719, size: 992, offset: 2080)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !714, file: !496, line: 322, baseType: !717, size: 32, offset: 3072)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !714, file: !496, line: 323, baseType: !719, size: 992, offset: 3104)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !714, file: !496, line: 324, baseType: !729, size: 2048, offset: 4096)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 2048, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !714, file: !496, line: 325, baseType: !733, size: 256, offset: 6144)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 256, elements: !485)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !623, line: 56, baseType: !106)
!735 = !{!736, !786, !827, !538, !833, !861, !863, !880, !882, !892, !895, !910, !948, !962}
!736 = !DIGlobalVariableExpression(var: !737, expr: !DIExpression())
!737 = distinct !DIGlobalVariable(name: "on", scope: !738, file: !739, line: 549, type: !328, isLocal: true, isDefinition: true)
!738 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !739, file: !739, line: 547, type: !740, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !540, retainedNodes: !742)
!739 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!740 = !DISubroutineType(types: !741)
!741 = !{null, !549}
!742 = !{!743, !744, !747}
!743 = !DILocalVariable(name: "start_mode", arg: 1, scope: !738, file: !739, line: 547, type: !549)
!744 = !DILocalVariable(name: "err", scope: !745, file: !739, line: 553, type: !109)
!745 = distinct !DILexicalBlock(scope: !746, file: !739, line: 552, column: 31)
!746 = distinct !DILexicalBlock(scope: !738, file: !739, line: 552, column: 6)
!747 = !DILocalVariable(name: "mgr", scope: !745, file: !739, line: 554, type: !748)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !750, line: 154, size: 224, elements: !751)
!750 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!751 = !{!752, !764, !765, !781, !783, !784, !785}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !749, file: !750, line: 158, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !288, line: 40, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !288, line: 35, size: 64, elements: !755)
!755 = !{!756, !763}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !754, file: !288, line: 36, baseType: !757, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !288, line: 33, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !288, line: 29, size: 32, elements: !760)
!760 = !{!761}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !759, file: !288, line: 30, baseType: !762, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !754, file: !288, line: 37, baseType: !757, size: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !749, file: !750, line: 163, baseType: !753, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !749, file: !750, line: 166, baseType: !766, size: 32, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !750, line: 133, size: 96, elements: !769)
!769 = !{!770, !779, !780}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !768, file: !750, line: 135, baseType: !771, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !750, line: 129, baseType: !772)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!773 = !DISubroutineType(types: !774)
!774 = !{null, !748, !775}
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !750, line: 101, baseType: !776)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!777 = !DISubroutineType(types: !778)
!778 = !{null, !748, !109}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !768, file: !750, line: 138, baseType: !771, size: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !768, file: !750, line: 143, baseType: !771, size: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !749, file: !750, line: 169, baseType: !782, offset: 160)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !244, line: 43, elements: !245)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !749, file: !750, line: 172, baseType: !109, size: 32, offset: 160)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !749, file: !750, line: 175, baseType: !192, size: 16, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !749, file: !750, line: 178, baseType: !192, size: 16, offset: 208)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "cli", scope: !738, file: !739, line: 550, type: !788, isLocal: true, isDefinition: true)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !750, line: 273, size: 128, elements: !789)
!789 = !{!790, !791}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !788, file: !750, line: 280, baseType: !758, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !788, file: !750, line: 283, baseType: !792, size: 96, offset: 32)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !793, line: 138, size: 96, elements: !794)
!793 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!794 = !{!795, !824, !825}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !792, file: !793, line: 149, baseType: !796, size: 32)
!796 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !793, line: 139, size: 32, elements: !797)
!797 = !{!798, !819}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !796, file: !793, line: 145, baseType: !799, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !118, line: 5397, size: 128, elements: !801)
!801 = !{!802, !817, !818}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !800, file: !118, line: 5399, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !805)
!805 = !{!806, !812}
!806 = !DIDerivedType(tag: DW_TAG_member, scope: !804, file: !127, line: 38, baseType: !807, size: 32)
!807 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !804, file: !127, line: 38, size: 32, elements: !808)
!808 = !{!809, !811}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !807, file: !127, line: 39, baseType: !810, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !807, file: !127, line: 40, baseType: !810, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, scope: !804, file: !127, line: 42, baseType: !813, size: 32, offset: 32)
!813 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !804, file: !127, line: 42, size: 32, elements: !814)
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !813, file: !127, line: 43, baseType: !810, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !813, file: !127, line: 44, baseType: !810, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !800, file: !118, line: 5405, baseType: !32, size: 32, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !800, file: !118, line: 5408, baseType: !109, size: 32, offset: 96)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !796, file: !793, line: 148, baseType: !820, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !793, line: 98, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DISubroutineType(types: !823)
!823 = !{null, null}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !792, file: !793, line: 165, baseType: !435, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !792, file: !793, line: 174, baseType: !826, size: 32, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !109)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !540, file: !739, line: 733, type: !829, isLocal: false, isDefinition: true, align: 16)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 80, elements: !703)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !832, line: 43, baseType: !338)
!832 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_23", scope: !540, file: !739, line: 733, type: !835, isLocal: true, isDefinition: true, align: 32)
!835 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !528, line: 51, size: 64, elements: !837)
!837 = !{!838, !860}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !836, file: !528, line: 60, baseType: !839, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 32)
!840 = !DISubroutineType(types: !841)
!841 = !{!109, !842}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !832, line: 378, size: 192, elements: !845)
!845 = !{!846, !849, !850, !851, !857, !858}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !844, file: !832, line: 380, baseType: !847, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !844, file: !832, line: 382, baseType: !13, size: 32, offset: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !844, file: !832, line: 384, baseType: !13, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !844, file: !832, line: 386, baseType: !852, size: 32, offset: 96)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 32)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !832, line: 351, size: 16, elements: !854)
!854 = !{!855, !856}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !853, file: !832, line: 359, baseType: !178, size: 8)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !853, file: !832, line: 364, baseType: !710, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !844, file: !832, line: 388, baseType: !106, size: 32, offset: 128)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !844, file: !832, line: 396, baseType: !859, size: 32, offset: 160)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !836, file: !528, line: 65, baseType: !842, size: 32, offset: 32)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !540, file: !739, line: 79, type: !328, isLocal: true, isDefinition: true)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "data", scope: !540, file: !739, line: 702, type: !865, isLocal: true, isDefinition: true)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !739, line: 69, size: 640, elements: !866)
!866 = !{!867, !869}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !865, file: !739, line: 70, baseType: !868, size: 448)
!868 = !DICompositeType(tag: DW_TAG_array_type, baseType: !749, size: 448, elements: !173)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !865, file: !739, line: 71, baseType: !870, size: 192, offset: 448)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !871, size: 192, elements: !173)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !739, line: 52, size: 96, elements: !872)
!872 = !{!873, !878, !879}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !871, file: !739, line: 53, baseType: !874, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !623, line: 72, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!876 = !DISubroutineType(types: !877)
!877 = !{null, !842, !734, !106}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !871, file: !739, line: 54, baseType: !106, size: 32, offset: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !871, file: !739, line: 55, baseType: !110, size: 32, offset: 64)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_23", scope: !540, file: !739, line: 733, type: !853, isLocal: true, isDefinition: true, align: 8)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "d", scope: !884, file: !739, line: 476, type: !890, isLocal: true, isDefinition: true)
!884 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !739, file: !739, line: 474, type: !740, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !540, retainedNodes: !885)
!885 = !{!886, !887, !888, !889}
!886 = !DILocalVariable(name: "mode", arg: 1, scope: !884, file: !739, line: 474, type: !549)
!887 = !DILocalVariable(name: "type", scope: !884, file: !739, line: 486, type: !706)
!888 = !DILocalVariable(name: "isr_mode", scope: !884, file: !739, line: 500, type: !710)
!889 = !DILocalVariable(name: "key", scope: !884, file: !739, line: 501, type: !109)
!890 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_domain_t", file: !555, line: 177, baseType: !554)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "target_type", scope: !884, file: !739, line: 477, type: !894, isLocal: true, isDefinition: true)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !706)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "config", scope: !540, file: !739, line: 704, type: !897, isLocal: true, isDefinition: true)
!897 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_config", file: !739, line: 74, size: 128, elements: !899)
!899 = !{!900}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !898, file: !739, line: 76, baseType: !901, size: 128)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 128, elements: !173)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_config", file: !739, line: 61, size: 64, elements: !903)
!903 = !{!904, !909}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !902, file: !739, line: 62, baseType: !905, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "clk_ctrl_func_t", file: !739, line: 58, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 32)
!907 = !DISubroutineType(types: !908)
!908 = !{null}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !902, file: !739, line: 63, baseType: !905, size: 32, offset: 32)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(name: "clock_control_api", scope: !540, file: !739, line: 695, type: !912, isLocal: true, isDefinition: true)
!912 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !623, line: 100, size: 224, elements: !914)
!914 = !{!915, !920, !921, !926, !932, !937, !943}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !913, file: !623, line: 101, baseType: !916, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !623, line: 76, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = !DISubroutineType(types: !919)
!919 = !{!109, !842, !734}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !913, file: !623, line: 102, baseType: !916, size: 32, offset: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !913, file: !623, line: 103, baseType: !922, size: 32, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !623, line: 83, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 32)
!924 = !DISubroutineType(types: !925)
!925 = !{!109, !842, !734, !874, !106}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !913, file: !623, line: 104, baseType: !927, size: 32, offset: 96)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !623, line: 79, baseType: !928)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 32)
!929 = !DISubroutineType(types: !930)
!930 = !{!109, !842, !734, !931}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !913, file: !623, line: 105, baseType: !933, size: 32, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !623, line: 88, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DISubroutineType(types: !936)
!936 = !{!622, !842, !734}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !913, file: !623, line: 106, baseType: !938, size: 32, offset: 160)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !623, line: 92, baseType: !939)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = !DISubroutineType(types: !941)
!941 = !{!109, !842, !734, !942}
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !623, line: 64, baseType: !106)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !913, file: !623, line: 107, baseType: !944, size: 32, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !623, line: 96, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!946 = !DISubroutineType(types: !947)
!947 = !{!109, !842, !734, !106}
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(name: "transitions", scope: !950, file: !739, line: 655, type: !767, isLocal: true, isDefinition: true)
!950 = distinct !DISubprogram(name: "clk_init", scope: !739, file: !739, line: 651, type: !840, scopeLine: 652, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !540, retainedNodes: !951)
!951 = !{!952, !953, !955, !956, !958}
!952 = !DILocalVariable(name: "dev", arg: 1, scope: !950, file: !739, line: 651, type: !842)
!953 = !DILocalVariable(name: "nrfx_err", scope: !950, file: !739, line: 653, type: !954)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrfx_err_t", file: !630, line: 72, baseType: !629)
!955 = !DILocalVariable(name: "err", scope: !950, file: !739, line: 654, type: !109)
!956 = !DILocalVariable(name: "i", scope: !957, file: !739, line: 678, type: !543)
!957 = distinct !DILexicalBlock(scope: !950, file: !739, line: 678, column: 2)
!958 = !DILocalVariable(name: "subdata", scope: !959, file: !739, line: 680, type: !961)
!959 = distinct !DILexicalBlock(scope: !960, file: !739, line: 679, column: 42)
!960 = distinct !DILexicalBlock(scope: !957, file: !739, line: 678, column: 2)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "__isr_nrfx_isr_irq_0", scope: !950, file: !739, line: 660, type: !964, isLocal: true, isDefinition: true, align: 32)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !965)
!965 = !{!966, !967, !968, !969}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !964, file: !10, line: 55, baseType: !351, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !964, file: !10, line: 57, baseType: !351, size: 32, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !964, file: !10, line: 59, baseType: !106, size: 32, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !964, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !972, file: !977, line: 7, type: !978, isLocal: false, isDefinition: true, align: 16)
!972 = distinct !DICompileUnit(language: DW_LANG_C99, file: !973, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !974, splitDebugInlining: false, nameTableKind: None)
!973 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/synchronization/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/synchronization")
!974 = !{!970, !975, !979}
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !972, file: !977, line: 12, type: !978, isLocal: false, isDefinition: true, align: 16)
!977 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/synchronization")
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 48, elements: !468)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_49", scope: !972, file: !977, line: 17, type: !978, isLocal: false, isDefinition: true, align: 16)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !983, file: !1040, line: 603, type: !1042, isLocal: true, isDefinition: true, align: 32)
!983 = distinct !DICompileUnit(language: DW_LANG_C99, file: !984, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !985, globals: !1037, splitDebugInlining: false, nameTableKind: None)
!984 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/synchronization")
!985 = !{!106, !109, !986}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !989, line: 336, size: 160, elements: !990)
!989 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!990 = !{!991, !1011, !1015, !1019, !1032}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !988, file: !989, line: 365, baseType: !992, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DISubroutineType(types: !994)
!994 = !{!109, !995, !1010}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !832, line: 378, size: 192, elements: !998)
!998 = !{!999, !1000, !1001, !1002, !1008, !1009}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !997, file: !832, line: 380, baseType: !847, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !997, file: !832, line: 382, baseType: !13, size: 32, offset: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !997, file: !832, line: 384, baseType: !13, size: 32, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !997, file: !832, line: 386, baseType: !1003, size: 32, offset: 96)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 32)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !832, line: 351, size: 16, elements: !1005)
!1005 = !{!1006, !1007}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1004, file: !832, line: 359, baseType: !178, size: 8)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1004, file: !832, line: 364, baseType: !710, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !997, file: !832, line: 388, baseType: !106, size: 32, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !997, file: !832, line: 396, baseType: !859, size: 32, offset: 160)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !988, file: !989, line: 366, baseType: !1012, size: 32, offset: 32)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 32)
!1013 = !DISubroutineType(types: !1014)
!1014 = !{null, !995, !179}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !988, file: !989, line: 374, baseType: !1016, size: 32, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 32)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!109, !995}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !988, file: !989, line: 377, baseType: !1020, size: 32, offset: 96)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 32)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!109, !995, !1023}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !989, line: 122, size: 64, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030, !1031}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !1025, file: !989, line: 123, baseType: !110, size: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !1025, file: !989, line: 124, baseType: !178, size: 8, offset: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !1025, file: !989, line: 125, baseType: !178, size: 8, offset: 40)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !1025, file: !989, line: 126, baseType: !178, size: 8, offset: 48)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !1025, file: !989, line: 127, baseType: !178, size: 8, offset: 56)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !988, file: !989, line: 379, baseType: !1033, size: 32, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 32)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!109, !995, !1036}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 32)
!1037 = !{!981, !1038}
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !983, file: !1040, line: 38, type: !1041, isLocal: true, isDefinition: true)
!1040 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !528, line: 51, size: 64, elements: !1044)
!1044 = !{!1045, !1046}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1043, file: !528, line: 60, baseType: !1016, size: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1043, file: !528, line: 65, baseType: !995, size: 32, offset: 32)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(name: "gpio_nrfx_p0_cfg", scope: !1049, file: !1214, line: 424, type: !1255, isLocal: true, isDefinition: true)
!1049 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1050, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1051, retainedTypes: !1108, globals: !1211, splitDebugInlining: false, nameTableKind: None)
!1050 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_nrfx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/synchronization")
!1051 = !{!1052, !1058, !629, !1063, !1073, !1079, !1089, !1093, !1100, !1104}
!1052 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !1053, line: 506, baseType: !32, size: 32, elements: !1054)
!1053 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1054 = !{!1055, !1056, !1057}
!1055 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!1056 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!1057 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!1058 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !1053, line: 512, baseType: !32, size: 32, elements: !1059)
!1059 = !{!1060, !1061, !1062}
!1060 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!1061 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!1062 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!1063 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1064, line: 56, baseType: !32, size: 32, elements: !1065)
!1064 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_gpiote.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1065 = !{!1066, !1067, !1068, !1069, !1070, !1071, !1072}
