; ModuleID = 'build/96b_neonkey/sys_heap/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, i32, i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %struct.z_heap_bucket, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 98, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5504, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 86)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2752, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "heap", scope: !27, file: !107, line: 13, type: !112, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!105, !25}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "heap_mem", scope: !27, file: !107, line: 12, type: !108, isLocal: true, isDefinition: true)
!107 = !DIFile(filename: "zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 2048, elements: !110)
!109 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !{!111}
!111 = !DISubrange(count: 256)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !114)
!113 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!114 = !{!115, !118, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !112, file: !113, line: 57, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !113, line: 57, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !112, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !112, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !121, line: 214, baseType: !32)
!121 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "_char_out", scope: !124, file: !127, line: 54, type: !128, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !126, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap")
!126 = !{!122}
!127 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{!103, !103}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "state", scope: !133, file: !134, line: 227, type: !163, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "rand32", scope: !134, file: !134, line: 225, type: !135, scopeLine: 226, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !138, retainedNodes: !162)
!134 = !DIFile(filename: "zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!135 = !DISubroutineType(types: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !148, globals: !161, splitDebugInlining: false, nameTableKind: None)
!139 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap")
!140 = !{!30, !141}
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chunk_fields", file: !142, line: 54, baseType: !32, size: 32, elements: !143)
!142 = !DIFile(filename: "zephyr/lib/os/heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !145, !146, !147}
!144 = !DIEnumerator(name: "LEFT_SIZE", value: 0)
!145 = !DIEnumerator(name: "SIZE_AND_USED", value: 1)
!146 = !DIEnumerator(name: "FREE_PREV", value: 2)
!147 = !DIEnumerator(name: "FREE_NEXT", value: 3)
!148 = !{!102, !103, !149, !150, !137, !153}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !152)
!152 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk_unit_t", file: !142, line: 58, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 58, size: 64, elements: !156)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !155, file: !142, line: 58, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 64, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 8)
!161 = !{!131}
!162 = !{}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !164)
!164 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !167, file: !184, line: 56, type: !185, isLocal: true, isDefinition: true, align: 32)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !169, globals: !183, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !172, line: 259, baseType: !173)
!172 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f411xe.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 250, size: 224, elements: !174)
!174 = !{!175, !177, !178, !179, !180, !181, !182}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !173, file: !172, line: 252, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !137)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !173, file: !172, line: 253, baseType: !176, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !173, file: !172, line: 254, baseType: !176, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !173, file: !172, line: 255, baseType: !176, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !173, file: !172, line: 256, baseType: !176, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !173, file: !172, line: 257, baseType: !176, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !173, file: !172, line: 258, baseType: !176, size: 32, offset: 192)
!183 = !{!165}
!184 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !188)
!187 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!188 = !{!189, !219}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !186, file: !187, line: 60, baseType: !190, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DISubroutineType(types: !192)
!192 = !{!103, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !197)
!196 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!197 = !{!198, !201, !202, !203, !212, !213}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !196, line: 380, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !195, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !195, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !195, file: !196, line: 386, baseType: !204, size: 32, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !206)
!206 = !{!207, !210}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !205, file: !196, line: 359, baseType: !208, size: 8)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !209)
!209 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !205, file: !196, line: 364, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!211 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !195, file: !196, line: 388, baseType: !102, size: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !195, file: !196, line: 396, baseType: !214, size: 32, offset: 160)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !196, line: 43, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !218)
!218 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !186, file: !187, line: 65, baseType: !193, size: 32, offset: 32)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !222, file: !225, line: 71, type: !226, isLocal: true, isDefinition: true, align: 32)
!222 = distinct !DICompileUnit(language: DW_LANG_C99, file: !223, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !224, splitDebugInlining: false, nameTableKind: None)
!223 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap")
!224 = !{!220}
!225 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !228)
!228 = !{!229, !248}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !227, file: !187, line: 60, baseType: !230, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DISubroutineType(types: !232)
!232 = !{!103, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !236)
!236 = !{!237, !238, !239, !240, !246, !247}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !235, file: !196, line: 380, baseType: !199, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !235, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !235, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !235, file: !196, line: 386, baseType: !241, size: 32, offset: 96)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !242, file: !196, line: 359, baseType: !208, size: 8)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !242, file: !196, line: 364, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !235, file: !196, line: 388, baseType: !102, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !235, file: !196, line: 396, baseType: !214, size: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !227, file: !187, line: 65, baseType: !233, size: 32, offset: 32)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "static_regions", scope: !251, file: !258, line: 62, type: !393, isLocal: true, isDefinition: true)
!251 = distinct !DICompileUnit(language: DW_LANG_C99, file: !252, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !253, globals: !254, splitDebugInlining: false, nameTableKind: None)
!252 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap")
!253 = !{!120, !103, !137, !102}
!254 = !{!255, !249}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !257, file: !258, line: 198, type: !379, isLocal: true, isDefinition: true)
!257 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !258, file: !258, line: 175, type: !259, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !251, retainedNodes: !374)
!258 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!259 = !DISubroutineType(types: !260)
!260 = !{null, !261}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !263, line: 245, size: 1024, elements: !264)
!263 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!264 = !{!265, !332, !345, !346, !347, !348, !354, !369}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !262, file: !263, line: 247, baseType: !266, size: 384)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !263, line: 57, size: 384, elements: !267)
!267 = !{!268, !296, !304, !305, !306, !317, !318, !319}
!268 = !DIDerivedType(tag: DW_TAG_member, scope: !266, file: !263, line: 60, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !263, line: 60, size: 64, elements: !270)
!270 = !{!271, !287}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !269, file: !263, line: 61, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !273, line: 49, baseType: !274)
!273 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !273, line: 37, size: 64, elements: !275)
!275 = !{!276, !282}
!276 = !DIDerivedType(tag: DW_TAG_member, scope: !274, file: !273, line: 38, baseType: !277, size: 32)
!277 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !274, file: !273, line: 38, size: 32, elements: !278)
!278 = !{!279, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !277, file: !273, line: 39, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !273, line: 40, baseType: !280, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, scope: !274, file: !273, line: 42, baseType: !283, size: 32, offset: 32)
!283 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !274, file: !273, line: 42, size: 32, elements: !284)
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !283, file: !273, line: 43, baseType: !280, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !283, file: !273, line: 44, baseType: !280, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !269, file: !263, line: 62, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !289, line: 49, size: 64, elements: !290)
!289 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !288, file: !289, line: 50, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 64, elements: !294)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!294 = !{!295}
!295 = !DISubrange(count: 2)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !266, file: !263, line: 68, baseType: !297, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !299, line: 233, baseType: !300)
!299 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !299, line: 231, size: 64, elements: !301)
!301 = !{!302}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !300, file: !299, line: 232, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !273, line: 48, baseType: !274)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !266, file: !263, line: 71, baseType: !208, size: 8, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !266, file: !263, line: 74, baseType: !208, size: 8, offset: 104)
!306 = !DIDerivedType(tag: DW_TAG_member, scope: !266, file: !263, line: 90, baseType: !307, size: 16, offset: 112)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !263, line: 90, size: 16, elements: !308)
!308 = !{!309, !316}
!309 = !DIDerivedType(tag: DW_TAG_member, scope: !307, file: !263, line: 91, baseType: !310, size: 16)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !307, file: !263, line: 91, size: 16, elements: !311)
!311 = !{!312, !315}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !310, file: !263, line: 96, baseType: !313, size: 8)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !314)
!314 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !310, file: !263, line: 97, baseType: !208, size: 8, offset: 8)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !307, file: !263, line: 100, baseType: !151, size: 16)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !266, file: !263, line: 107, baseType: !137, size: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !266, file: !263, line: 127, baseType: !102, size: 32, offset: 160)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !266, file: !263, line: 131, baseType: !320, size: 192, offset: 192)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !299, line: 244, size: 192, elements: !321)
!321 = !{!322, !323, !329}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !320, file: !299, line: 245, baseType: !272, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !320, file: !299, line: 246, baseType: !324, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !299, line: 242, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !328}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !320, file: !299, line: 249, baseType: !330, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !331)
!331 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !262, file: !263, line: 250, baseType: !333, size: 288, offset: 384)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !334, line: 25, size: 288, elements: !335)
!334 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !333, file: !334, line: 26, baseType: !137, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !333, file: !334, line: 27, baseType: !137, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !333, file: !334, line: 28, baseType: !137, size: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !333, file: !334, line: 29, baseType: !137, size: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !333, file: !334, line: 30, baseType: !137, size: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !333, file: !334, line: 31, baseType: !137, size: 32, offset: 160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !333, file: !334, line: 32, baseType: !137, size: 32, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !333, file: !334, line: 33, baseType: !137, size: 32, offset: 224)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !333, file: !334, line: 34, baseType: !137, size: 32, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !262, file: !263, line: 253, baseType: !102, size: 32, offset: 672)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !262, file: !263, line: 256, baseType: !298, size: 64, offset: 704)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !262, file: !263, line: 294, baseType: !103, size: 32, offset: 768)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !262, file: !263, line: 300, baseType: !349, size: 96, offset: 800)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !263, line: 149, size: 96, elements: !350)
!350 = !{!351, !352, !353}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !349, file: !263, line: 153, baseType: !22, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !349, file: !263, line: 162, baseType: !120, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !349, file: !263, line: 168, baseType: !120, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !262, file: !263, line: 325, baseType: !355, size: 32, offset: 896)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !357, line: 5073, size: 160, elements: !358)
!357 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!358 = !{!359, !365, !366}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !356, file: !357, line: 5074, baseType: !360, size: 96)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !361)
!361 = !{!362, !363, !364}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !360, file: !113, line: 57, baseType: !116, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !360, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !360, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !356, file: !357, line: 5075, baseType: !298, size: 64, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !356, file: !357, line: 5076, baseType: !367, offset: 160)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !368, line: 43, elements: !162)
!368 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!369 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !262, file: !263, line: 343, baseType: !370, size: 64, offset: 928)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !334, line: 60, size: 64, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !370, file: !334, line: 63, baseType: !137, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !370, file: !334, line: 66, baseType: !137, size: 32, offset: 32)
!374 = !{!375, !376, !377, !378}
!375 = !DILocalVariable(name: "thread", arg: 1, scope: !257, file: !258, line: 175, type: !261)
!376 = !DILocalVariable(name: "region_num", scope: !257, file: !258, line: 200, type: !208)
!377 = !DILocalVariable(name: "guard_start", scope: !257, file: !258, line: 265, type: !22)
!378 = !DILocalVariable(name: "guard_size", scope: !257, file: !258, line: 266, type: !120)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 96, elements: !391)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !381, line: 52, size: 96, elements: !382)
!381 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!382 = !{!383, !384, !385}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !380, file: !381, line: 53, baseType: !22, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !380, file: !381, line: 54, baseType: !120, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !380, file: !381, line: 55, baseType: !386, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !387, line: 151, baseType: !388)
!387 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 149, size: 32, elements: !389)
!389 = !{!390}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !388, file: !387, line: 150, baseType: !137, size: 32)
!391 = !{!392}
!392 = !DISubrange(count: 1)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 96, elements: !391)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !380)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !397, file: !430, line: 39, type: !208, isLocal: true, isDefinition: true)
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !399, globals: !429, splitDebugInlining: false, nameTableKind: None)
!398 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap")
!399 = !{!400, !102, !103, !417, !208}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !402, line: 1226, baseType: !403)
!402 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !402, line: 1213, size: 352, elements: !404)
!404 = !{!405, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !403, file: !402, line: 1215, baseType: !406, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !403, file: !402, line: 1216, baseType: !176, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !403, file: !402, line: 1217, baseType: !176, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !403, file: !402, line: 1218, baseType: !176, size: 32, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !403, file: !402, line: 1219, baseType: !176, size: 32, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !403, file: !402, line: 1220, baseType: !176, size: 32, offset: 160)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !403, file: !402, line: 1221, baseType: !176, size: 32, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !403, file: !402, line: 1222, baseType: !176, size: 32, offset: 224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !403, file: !402, line: 1223, baseType: !176, size: 32, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !403, file: !402, line: 1224, baseType: !176, size: 32, offset: 288)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !403, file: !402, line: 1225, baseType: !176, size: 32, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !420, line: 27, size: 96, elements: !421)
!420 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!421 = !{!422, !423, !424}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !419, file: !420, line: 29, baseType: !137, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !419, file: !420, line: 31, baseType: !199, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !419, file: !420, line: 37, baseType: !425, size: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !387, line: 146, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !387, line: 141, size: 32, elements: !427)
!427 = !{!428}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !426, file: !387, line: 143, baseType: !137, size: 32)
!429 = !{!395}
!430 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !433, file: !440, line: 21, type: !128, isLocal: true, isDefinition: true)
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !435, globals: !439, splitDebugInlining: false, nameTableKind: None)
!434 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap")
!435 = !{!436, !103, !102}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !438, line: 22, baseType: !103)
!438 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!439 = !{!431}
!440 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !443, file: !448, line: 13, type: !465, isLocal: true, isDefinition: true)
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !445, splitDebugInlining: false, nameTableKind: None)
!444 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap")
!445 = !{!446, !441}
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "mpu_config", scope: !443, file: !448, line: 37, type: !449, isLocal: false, isDefinition: true)
!448 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !420, line: 41, size: 64, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !450, file: !420, line: 43, baseType: !137, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !450, file: !420, line: 45, baseType: !454, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !420, line: 27, size: 96, elements: !457)
!457 = !{!458, !459, !460}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !456, file: !420, line: 29, baseType: !137, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !456, file: !420, line: 31, baseType: !199, size: 32, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !456, file: !420, line: 37, baseType: !461, size: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !387, line: 146, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !387, line: 141, size: 32, elements: !463)
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !462, file: !387, line: 143, baseType: !137, size: 32)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 192, elements: !294)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !468, file: !552, line: 72, type: !636, isLocal: true, isDefinition: true)
!468 = distinct !DICompileUnit(language: DW_LANG_C99, file: !469, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !470, retainedTypes: !538, globals: !549, splitDebugInlining: false, nameTableKind: None)
!469 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap")
!470 = !{!30, !471}
!471 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !172, line: 65, baseType: !103, size: 32, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537}
!473 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!474 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!475 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!476 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!477 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!478 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!479 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!480 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!481 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!482 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!483 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!484 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!485 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!486 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!487 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!488 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!489 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!490 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!491 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!492 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!493 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!494 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!495 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!496 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!497 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!498 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!499 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!500 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!501 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!502 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!503 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!504 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!505 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!506 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!507 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!508 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!509 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!510 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!511 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!512 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!513 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!514 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!515 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!516 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!517 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!518 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!519 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!520 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!521 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!522 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!523 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!524 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!525 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!526 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!527 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!528 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!529 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!530 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!531 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!532 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!533 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!534 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!535 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!536 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!537 = !DIEnumerator(name: "SPI5_IRQn", value: 85)
!538 = !{!120, !103, !102, !539}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !172, line: 244, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 236, size: 192, elements: !542)
!542 = !{!543, !544, !545, !546, !547, !548}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !541, file: !172, line: 238, baseType: !176, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !541, file: !172, line: 239, baseType: !176, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !541, file: !172, line: 240, baseType: !176, size: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !541, file: !172, line: 241, baseType: !176, size: 32, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !541, file: !172, line: 242, baseType: !176, size: 32, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !541, file: !172, line: 243, baseType: !176, size: 32, offset: 160)
!549 = !{!550, !556, !572, !583, !600, !466, !602, !616, !618, !620, !622, !624, !626, !628, !630, !632, !634}
!550 = !DIGlobalVariableExpression(var: !551, expr: !DIExpression())
!551 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !468, file: !552, line: 424, type: !553, isLocal: false, isDefinition: true, align: 16)
!552 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 64, elements: !554)
!554 = !{!555}
!555 = !DISubrange(count: 4)
!556 = !DIGlobalVariableExpression(var: !557, expr: !DIExpression())
!557 = distinct !DIGlobalVariable(name: "__device_dts_ord_39", scope: !468, file: !552, line: 424, type: !558, isLocal: false, isDefinition: true, align: 32)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !560)
!560 = !{!561, !562, !563, !564, !570, !571}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !559, file: !196, line: 380, baseType: !199, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !559, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !559, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !559, file: !196, line: 386, baseType: !565, size: 32, offset: 96)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !566, file: !196, line: 359, baseType: !208, size: 8)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !566, file: !196, line: 364, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !559, file: !196, line: 388, baseType: !102, size: 32, offset: 128)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !559, file: !196, line: 396, baseType: !214, size: 32, offset: 160)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_39", scope: !468, file: !552, line: 424, type: !574, isLocal: true, isDefinition: true, align: 32)
!574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !576)
!576 = !{!577, !582}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !575, file: !187, line: 60, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!579 = !DISubroutineType(types: !580)
!580 = !{!103, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !575, file: !187, line: 65, baseType: !581, size: 32, offset: 32)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "exti_data", scope: !468, file: !552, line: 423, type: !585, isLocal: true, isDefinition: true)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !552, line: 107, size: 1472, elements: !586)
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !585, file: !552, line: 109, baseType: !588, size: 1472)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 1472, elements: !598)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !552, line: 101, size: 64, elements: !590)
!590 = !{!591, !597}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !589, file: !552, line: 102, baseType: !592, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !593, line: 63, baseType: !594)
!593 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !103, !102}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !589, file: !552, line: 103, baseType: !102, size: 32, offset: 32)
!598 = !{!599}
!599 = !DISubrange(count: 23)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_39", scope: !468, file: !552, line: 424, type: !566, isLocal: true, isDefinition: true, align: 8)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !604, file: !552, line: 493, type: !609, isLocal: true, isDefinition: true, align: 32)
!604 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !552, file: !552, line: 460, type: !605, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !468, retainedNodes: !607)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !581}
!607 = !{!608}
!608 = !DILocalVariable(name: "dev", arg: 1, scope: !604, file: !552, line: 460, type: !581)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !610)
!610 = !{!611, !613, !614, !615}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !609, file: !10, line: 55, baseType: !612, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !609, file: !10, line: 57, baseType: !612, size: 32, offset: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !609, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !609, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !604, file: !552, line: 497, type: !609, isLocal: true, isDefinition: true, align: 32)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !604, file: !552, line: 507, type: !609, isLocal: true, isDefinition: true, align: 32)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !604, file: !552, line: 512, type: !609, isLocal: true, isDefinition: true, align: 32)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !604, file: !552, line: 516, type: !609, isLocal: true, isDefinition: true, align: 32)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !604, file: !552, line: 523, type: !609, isLocal: true, isDefinition: true, align: 32)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !604, file: !552, line: 527, type: !609, isLocal: true, isDefinition: true, align: 32)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !604, file: !552, line: 581, type: !609, isLocal: true, isDefinition: true, align: 32)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !604, file: !552, line: 586, type: !609, isLocal: true, isDefinition: true, align: 32)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !604, file: !552, line: 591, type: !609, isLocal: true, isDefinition: true, align: 32)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !604, file: !552, line: 595, type: !609, isLocal: true, isDefinition: true, align: 32)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 736, elements: !598)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !172, line: 134, baseType: !471)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !641, file: !646, line: 22, type: !668, isLocal: false, isDefinition: true, align: 16)
!641 = distinct !DICompileUnit(language: DW_LANG_C99, file: !642, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !643, splitDebugInlining: false, nameTableKind: None)
!642 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap")
!643 = !{!644, !639, !650, !652, !654, !656, !658, !660, !662, !664, !666}
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !641, file: !646, line: 17, type: !647, isLocal: false, isDefinition: true, align: 16)
!646 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap")
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 192, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 12)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_73", scope: !641, file: !646, line: 29, type: !553, isLocal: false, isDefinition: true, align: 16)
!652 = !DIGlobalVariableExpression(var: !653, expr: !DIExpression())
!653 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_72", scope: !641, file: !646, line: 36, type: !553, isLocal: false, isDefinition: true, align: 16)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_71", scope: !641, file: !646, line: 43, type: !553, isLocal: false, isDefinition: true, align: 16)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_70", scope: !641, file: !646, line: 50, type: !553, isLocal: false, isDefinition: true, align: 16)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_69", scope: !641, file: !646, line: 57, type: !553, isLocal: false, isDefinition: true, align: 16)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_68", scope: !641, file: !646, line: 64, type: !553, isLocal: false, isDefinition: true, align: 16)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !641, file: !646, line: 71, type: !553, isLocal: false, isDefinition: true, align: 16)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_67", scope: !641, file: !646, line: 78, type: !553, isLocal: false, isDefinition: true, align: 16)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_45", scope: !641, file: !646, line: 85, type: !553, isLocal: false, isDefinition: true, align: 16)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 48, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 3)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !673, file: !736, line: 398, type: !769, isLocal: true, isDefinition: true)
!673 = distinct !DICompileUnit(language: DW_LANG_C99, file: !674, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !675, retainedTypes: !688, globals: !733, splitDebugInlining: false, nameTableKind: None)
!674 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap")
!675 = !{!676, !30, !681}
!676 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !677, line: 197, baseType: !32, size: 32, elements: !678)
!677 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!678 = !{!679, !680}
!679 = !DIEnumerator(name: "SUCCESS", value: 0)
!680 = !DIEnumerator(name: "ERROR", value: 1)
!681 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !682, line: 44, baseType: !32, size: 32, elements: !683)
!682 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!683 = !{!684, !685, !686, !687}
!684 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!685 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!686 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!687 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!688 = !{!102, !103, !137, !689, !727, !149}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !172, line: 370, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 336, size: 1152, elements: !692)
!692 = !{!693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !726}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !691, file: !172, line: 338, baseType: !176, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !691, file: !172, line: 339, baseType: !176, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !691, file: !172, line: 340, baseType: !176, size: 32, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !691, file: !172, line: 341, baseType: !176, size: 32, offset: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !691, file: !172, line: 342, baseType: !176, size: 32, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !691, file: !172, line: 343, baseType: !176, size: 32, offset: 160)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !691, file: !172, line: 344, baseType: !176, size: 32, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !691, file: !172, line: 345, baseType: !137, size: 32, offset: 224)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !691, file: !172, line: 346, baseType: !176, size: 32, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !691, file: !172, line: 347, baseType: !176, size: 32, offset: 288)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !691, file: !172, line: 348, baseType: !704, size: 64, offset: 320)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 64, elements: !294)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !691, file: !172, line: 349, baseType: !176, size: 32, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !691, file: !172, line: 350, baseType: !176, size: 32, offset: 416)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !691, file: !172, line: 351, baseType: !176, size: 32, offset: 448)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !691, file: !172, line: 352, baseType: !137, size: 32, offset: 480)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !691, file: !172, line: 353, baseType: !176, size: 32, offset: 512)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !691, file: !172, line: 354, baseType: !176, size: 32, offset: 544)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !691, file: !172, line: 355, baseType: !704, size: 64, offset: 576)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !691, file: !172, line: 356, baseType: !176, size: 32, offset: 640)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !691, file: !172, line: 357, baseType: !176, size: 32, offset: 672)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !691, file: !172, line: 358, baseType: !176, size: 32, offset: 704)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !691, file: !172, line: 359, baseType: !137, size: 32, offset: 736)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !691, file: !172, line: 360, baseType: !176, size: 32, offset: 768)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !691, file: !172, line: 361, baseType: !176, size: 32, offset: 800)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !691, file: !172, line: 362, baseType: !704, size: 64, offset: 832)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !691, file: !172, line: 363, baseType: !176, size: 32, offset: 896)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !691, file: !172, line: 364, baseType: !176, size: 32, offset: 928)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !691, file: !172, line: 365, baseType: !704, size: 64, offset: 960)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !691, file: !172, line: 366, baseType: !176, size: 32, offset: 1024)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !691, file: !172, line: 367, baseType: !176, size: 32, offset: 1056)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !691, file: !172, line: 368, baseType: !725, size: 32, offset: 1088)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 32, elements: !391)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !691, file: !172, line: 369, baseType: !176, size: 32, offset: 1120)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !729, line: 343, size: 64, elements: !730)
!729 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !728, file: !729, line: 344, baseType: !137, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !728, file: !729, line: 345, baseType: !137, size: 32, offset: 32)
!733 = !{!734, !740, !756, !767, !671}
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !673, file: !736, line: 752, type: !737, isLocal: false, isDefinition: true, align: 16)
!736 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 704, elements: !738)
!738 = !{!739}
!739 = !DISubrange(count: 44)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "__device_dts_ord_8", scope: !673, file: !736, line: 752, type: !742, isLocal: false, isDefinition: true, align: 32)
!742 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !744)
!744 = !{!745, !746, !747, !748, !754, !755}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !743, file: !196, line: 380, baseType: !199, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !743, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !743, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !743, file: !196, line: 386, baseType: !749, size: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 32)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !751)
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !750, file: !196, line: 359, baseType: !208, size: 8)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !750, file: !196, line: 364, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !743, file: !196, line: 388, baseType: !102, size: 32, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !743, file: !196, line: 396, baseType: !214, size: 32, offset: 160)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_8", scope: !673, file: !736, line: 752, type: !758, isLocal: true, isDefinition: true, align: 32)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !760)
!760 = !{!761, !766}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !759, file: !187, line: 60, baseType: !762, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!763 = !DISubroutineType(types: !764)
!764 = !{!103, !765}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !759, file: !187, line: 65, baseType: !765, size: 32, offset: 32)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_8", scope: !673, file: !736, line: 752, type: !750, isLocal: true, isDefinition: true, align: 8)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !682, line: 100, size: 224, elements: !770)
!770 = !{!771, !777, !778, !787, !792, !797, !803}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !769, file: !682, line: 101, baseType: !772, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !682, line: 76, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = !DISubroutineType(types: !775)
!775 = !{!103, !765, !776}
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !682, line: 56, baseType: !102)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !769, file: !682, line: 102, baseType: !772, size: 32, offset: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !769, file: !682, line: 103, baseType: !779, size: 32, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !682, line: 83, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DISubroutineType(types: !782)
!782 = !{!103, !765, !776, !783, !102}
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !682, line: 72, baseType: !784)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !765, !776, !102}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !769, file: !682, line: 104, baseType: !788, size: 32, offset: 96)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !682, line: 79, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 32)
!790 = !DISubroutineType(types: !791)
!791 = !{!103, !765, !776, !149}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !769, file: !682, line: 105, baseType: !793, size: 32, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !682, line: 88, baseType: !794)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = !DISubroutineType(types: !796)
!796 = !{!681, !765, !776}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !769, file: !682, line: 106, baseType: !798, size: 32, offset: 160)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !682, line: 92, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DISubroutineType(types: !801)
!801 = !{!103, !765, !776, !802}
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !682, line: 64, baseType: !102)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !769, file: !682, line: 107, baseType: !804, size: 32, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !682, line: 96, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!806 = !DISubroutineType(types: !807)
!807 = !{!103, !765, !776, !102}
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !810, file: !867, line: 603, type: !869, isLocal: true, isDefinition: true, align: 32)
!810 = distinct !DICompileUnit(language: DW_LANG_C99, file: !811, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !812, globals: !864, splitDebugInlining: false, nameTableKind: None)
!811 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap")
!812 = !{!102, !103, !813}
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !816, line: 336, size: 160, elements: !817)
!816 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!817 = !{!818, !838, !842, !846, !859}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !815, file: !816, line: 365, baseType: !819, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = !DISubroutineType(types: !821)
!821 = !{!103, !822, !837}
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 32)
!823 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !824)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !825)
!825 = !{!826, !827, !828, !829, !835, !836}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !824, file: !196, line: 380, baseType: !199, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !824, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !824, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !824, file: !196, line: 386, baseType: !830, size: 32, offset: 96)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !831, file: !196, line: 359, baseType: !208, size: 8)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !831, file: !196, line: 364, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !824, file: !196, line: 388, baseType: !102, size: 32, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !824, file: !196, line: 396, baseType: !214, size: 32, offset: 160)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !815, file: !816, line: 366, baseType: !839, size: 32, offset: 32)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 32)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !822, !209}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !815, file: !816, line: 374, baseType: !843, size: 32, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DISubroutineType(types: !845)
!845 = !{!103, !822}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !815, file: !816, line: 377, baseType: !847, size: 32, offset: 96)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DISubroutineType(types: !849)
!849 = !{!103, !822, !850}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !816, line: 122, size: 64, elements: !853)
!853 = !{!854, !855, !856, !857, !858}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !852, file: !816, line: 123, baseType: !137, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !852, file: !816, line: 124, baseType: !208, size: 8, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !852, file: !816, line: 125, baseType: !208, size: 8, offset: 40)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !852, file: !816, line: 126, baseType: !208, size: 8, offset: 48)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !852, file: !816, line: 127, baseType: !208, size: 8, offset: 56)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !815, file: !816, line: 379, baseType: !860, size: 32, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DISubroutineType(types: !862)
!862 = !{!103, !822, !863}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 32)
!864 = !{!808, !865}
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !810, file: !867, line: 38, type: !868, isLocal: true, isDefinition: true)
!867 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!868 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!869 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !870, file: !187, line: 60, baseType: !843, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !870, file: !187, line: 65, baseType: !822, size: 32, offset: 32)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !876, file: !1046, line: 762, type: !1155, isLocal: true, isDefinition: true)
!876 = distinct !DICompileUnit(language: DW_LANG_C99, file: !877, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !878, retainedTypes: !896, globals: !1043, splitDebugInlining: false, nameTableKind: None)
!877 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/sys_heap")
!878 = !{!30, !879, !885, !890, !681}
!879 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !880, line: 506, baseType: !32, size: 32, elements: !881)
!880 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!881 = !{!882, !883, !884}
!882 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!883 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!884 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!885 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !880, line: 512, baseType: !32, size: 32, elements: !886)
!886 = !{!887, !888, !889}
!887 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!888 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!889 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!890 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !593, line: 43, baseType: !32, size: 32, elements: !891)
!891 = !{!892, !893, !894, !895}
!892 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!893 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!894 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!895 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!896 = !{!102, !103, !897, !967, !972, !932, !885, !879, !977, !978, !137, !992, !947, !1002, !1003, !1004}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !880, line: 523, size: 288, elements: !900)
!900 = !{!901, !922, !928, !933, !937, !938, !939, !943, !963}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !899, file: !880, line: 524, baseType: !902, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = !DISubroutineType(types: !904)
!904 = !{!103, !905, !920, !921}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !908)
!908 = !{!909, !910, !911, !912, !918, !919}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !907, file: !196, line: 380, baseType: !199, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !907, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !907, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !907, file: !196, line: 386, baseType: !913, size: 32, offset: 96)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !915)
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !914, file: !196, line: 359, baseType: !208, size: 8)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !914, file: !196, line: 364, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !907, file: !196, line: 388, baseType: !102, size: 32, offset: 128)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !907, file: !196, line: 396, baseType: !214, size: 32, offset: 160)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !880, line: 237, baseType: !208)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !880, line: 257, baseType: !137)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !899, file: !880, line: 530, baseType: !923, size: 32, offset: 32)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 32)
!924 = !DISubroutineType(types: !925)
!925 = !{!103, !905, !926}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !880, line: 229, baseType: !137)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !899, file: !880, line: 532, baseType: !929, size: 32, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = !DISubroutineType(types: !931)
!931 = !{!103, !905, !932, !927}
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !880, line: 216, baseType: !137)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !899, file: !880, line: 535, baseType: !934, size: 32, offset: 96)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DISubroutineType(types: !936)
!936 = !{!103, !905, !932}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !899, file: !880, line: 537, baseType: !934, size: 32, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !899, file: !880, line: 539, baseType: !934, size: 32, offset: 160)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !899, file: !880, line: 541, baseType: !940, size: 32, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DISubroutineType(types: !942)
!942 = !{!103, !905, !920, !879, !885}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !899, file: !880, line: 544, baseType: !944, size: 32, offset: 224)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = !DISubroutineType(types: !946)
!946 = !{!103, !905, !947, !211}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 32)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !880, line: 478, size: 96, elements: !949)
!949 = !{!950, !957, !962}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !948, file: !880, line: 482, baseType: !951, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !952, line: 33, baseType: !953)
!952 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !952, line: 29, size: 32, elements: !954)
!954 = !{!955}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !953, file: !952, line: 30, baseType: !956, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !948, file: !880, line: 485, baseType: !958, size: 32, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !880, line: 464, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!960 = !DISubroutineType(types: !961)
!961 = !{null, !905, !947, !932}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !948, file: !880, line: 493, baseType: !932, size: 32, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !899, file: !880, line: 547, baseType: !964, size: 32, offset: 256)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = !DISubroutineType(types: !966)
!966 = !{!137, !905}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !880, line: 428, size: 32, elements: !970)
!970 = !{!971}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !969, file: !880, line: 434, baseType: !932, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !974)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !880, line: 441, size: 32, elements: !975)
!975 = !{!976}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !974, file: !880, line: 447, baseType: !932, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !172, line: 276, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 265, size: 320, elements: !981)
!981 = !{!982, !983, !984, !985, !986, !987, !988, !989, !990}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !980, file: !172, line: 267, baseType: !176, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !980, file: !172, line: 268, baseType: !176, size: 32, offset: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !980, file: !172, line: 269, baseType: !176, size: 32, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !980, file: !172, line: 270, baseType: !176, size: 32, offset: 96)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !980, file: !172, line: 271, baseType: !176, size: 32, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !980, file: !172, line: 272, baseType: !176, size: 32, offset: 160)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !980, file: !172, line: 273, baseType: !176, size: 32, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !980, file: !172, line: 274, baseType: !176, size: 32, offset: 224)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !980, file: !172, line: 275, baseType: !991, size: 64, offset: 256)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 64, elements: !294)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !172, line: 289, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 282, size: 288, elements: !995)
!995 = !{!996, !997, !998, !1000, !1001}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !994, file: !172, line: 284, baseType: !176, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !994, file: !172, line: 285, baseType: !176, size: 32, offset: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !994, file: !172, line: 286, baseType: !999, size: 128, offset: 64)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 128, elements: !554)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !994, file: !172, line: 287, baseType: !704, size: 64, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !994, file: !172, line: 288, baseType: !176, size: 32, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !682, line: 100, size: 224, elements: !1007)
!1007 = !{!1008, !1013, !1014, !1023, !1028, !1033, !1038}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !1006, file: !682, line: 101, baseType: !1009, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !682, line: 76, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 32)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!103, !905, !776}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !1006, file: !682, line: 102, baseType: !1009, size: 32, offset: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !1006, file: !682, line: 103, baseType: !1015, size: 32, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !682, line: 83, baseType: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 32)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!103, !905, !776, !1019, !102}
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !682, line: 72, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 32)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{null, !905, !776, !102}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !1006, file: !682, line: 104, baseType: !1024, size: 32, offset: 96)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !682, line: 79, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 32)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!103, !905, !776, !149}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !1006, file: !682, line: 105, baseType: !1029, size: 32, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !682, line: 88, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 32)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!681, !905, !776}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !1006, file: !682, line: 106, baseType: !1034, size: 32, offset: 160)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !682, line: 92, baseType: !1035)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 32)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!103, !905, !776, !802}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !1006, file: !682, line: 107, baseType: !1039, size: 32, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !682, line: 96, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 32)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!103, !905, !776, !102}
!1043 = !{!1044, !1050, !1052, !1062, !1067, !1069, !1071, !1073, !1075, !1077, !1079, !1081, !1083, !1085, !1087, !1089, !1091, !1093, !1095, !1097, !1099, !1101, !1103, !1105, !1107, !1121, !1123, !1125, !1127, !1129, !1131, !1133, !1135, !1137, !1139, !1141, !1143, !1145, !1147, !1149, !874, !1151, !1153, !1166, !1168, !1170, !1172, !1174, !1176}
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_67", scope: !876, file: !1046, line: 762, type: !1047, isLocal: false, isDefinition: true, align: 16)
!1046 = !DIFile(filename: "zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 80, elements: !1048)
!1048 = !{!1049}
!1049 = !DISubrange(count: 5)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
