; ModuleID = 'build/96b_wistrio/out_of_tree_driver/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.15 }
%union.anon.15 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.15 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.stm32_exti_data = type { [16 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %union.anon.15, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "dev", scope: !27, file: !106, line: 11, type: !107, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !102, globals: !105, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/application_development/out_of_tree_driver/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_HELLO_WORLD", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_LAST", value: 67)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !{!25}
!106 = !DIFile(filename: "zephyr/samples/application_development/out_of_tree_driver/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !111)
!110 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !{!112, !116, !117, !118, !127, !128}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !109, file: !110, line: 380, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !109, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !109, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !109, file: !110, line: 386, baseType: !119, size: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !121)
!121 = !{!122, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !120, file: !110, line: 359, baseType: !123, size: 8)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !124)
!124 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !120, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!126 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !109, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !110, line: 43, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !133)
!133 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "_char_out", scope: !136, file: !139, line: 54, type: !140, isLocal: false, isDefinition: true)
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !102, globals: !138, splitDebugInlining: false, nameTableKind: None)
!137 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver")
!138 = !{!134}
!139 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DISubroutineType(types: !142)
!142 = !{!104, !104}
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "__init_stm32l1_init", scope: !145, file: !176, line: 60, type: !177, isLocal: true, isDefinition: true, align: 32)
!145 = distinct !DICompileUnit(language: DW_LANG_C99, file: !146, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !147, globals: !175, splitDebugInlining: false, nameTableKind: None)
!146 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver")
!147 = !{!148, !169}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !150, line: 386, baseType: !151)
!150 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l151xba.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 370, size: 448, elements: !152)
!152 = !{!153, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !151, file: !150, line: 372, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !151, file: !150, line: 373, baseType: !154, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !151, file: !150, line: 374, baseType: !154, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !151, file: !150, line: 375, baseType: !154, size: 32, offset: 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !151, file: !150, line: 376, baseType: !154, size: 32, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !151, file: !150, line: 377, baseType: !154, size: 32, offset: 160)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !151, file: !150, line: 378, baseType: !154, size: 32, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !151, file: !150, line: 379, baseType: !154, size: 32, offset: 224)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !151, file: !150, line: 380, baseType: !154, size: 32, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !151, file: !150, line: 381, baseType: !154, size: 32, offset: 288)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !151, file: !150, line: 382, baseType: !154, size: 32, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !151, file: !150, line: 383, baseType: !154, size: 32, offset: 352)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !151, file: !150, line: 384, baseType: !154, size: 32, offset: 384)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !151, file: !150, line: 385, baseType: !154, size: 32, offset: 416)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !150, line: 364, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 360, size: 64, elements: !172)
!172 = !{!173, !174}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !171, file: !150, line: 362, baseType: !154, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !171, file: !150, line: 363, baseType: !154, size: 32, offset: 32)
!175 = !{!143}
!176 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !179, line: 51, size: 64, elements: !180)
!179 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!180 = !{!181, !200}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !178, file: !179, line: 60, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DISubroutineType(types: !184)
!184 = !{!104, !185}
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !188)
!188 = !{!189, !190, !191, !192, !198, !199}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !110, line: 380, baseType: !113, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !187, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !187, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !187, file: !110, line: 386, baseType: !193, size: 32, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !195)
!195 = !{!196, !197}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !194, file: !110, line: 359, baseType: !123, size: 8)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !194, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !187, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !187, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !178, file: !179, line: 65, baseType: !185, size: 32, offset: 32)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !203, file: !206, line: 71, type: !207, isLocal: true, isDefinition: true, align: 32)
!203 = distinct !DICompileUnit(language: DW_LANG_C99, file: !204, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !205, splitDebugInlining: false, nameTableKind: None)
!204 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver")
!205 = !{!201}
!206 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !179, line: 51, size: 64, elements: !209)
!209 = !{!210, !229}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !208, file: !179, line: 60, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = !DISubroutineType(types: !213)
!213 = !{!104, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !217)
!217 = !{!218, !219, !220, !221, !227, !228}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !216, file: !110, line: 380, baseType: !113, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !216, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !216, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !216, file: !110, line: 386, baseType: !222, size: 32, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !223, file: !110, line: 359, baseType: !123, size: 8)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !223, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !216, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !216, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !208, file: !179, line: 65, baseType: !214, size: 32, offset: 32)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "static_regions", scope: !232, file: !241, line: 62, type: !382, isLocal: true, isDefinition: true)
!232 = distinct !DICompileUnit(language: DW_LANG_C99, file: !233, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !234, globals: !237, splitDebugInlining: false, nameTableKind: None)
!233 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver")
!234 = !{!235, !104, !155, !103}
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !236, line: 214, baseType: !32)
!236 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!237 = !{!238, !230}
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !240, file: !241, line: 198, type: !368, isLocal: true, isDefinition: true)
!240 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !241, file: !241, line: 175, type: !242, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !232, retainedNodes: !363)
!241 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!242 = !DISubroutineType(types: !243)
!243 = !{null, !244}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !246, line: 245, size: 1024, elements: !247)
!246 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!247 = !{!248, !317, !330, !331, !332, !333, !339, !358}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !245, file: !246, line: 247, baseType: !249, size: 384)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !246, line: 57, size: 384, elements: !250)
!250 = !{!251, !279, !287, !288, !289, !302, !303, !304}
!251 = !DIDerivedType(tag: DW_TAG_member, scope: !249, file: !246, line: 60, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !249, file: !246, line: 60, size: 64, elements: !253)
!253 = !{!254, !270}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !252, file: !246, line: 61, baseType: !255, size: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !256, line: 49, baseType: !257)
!256 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !256, line: 37, size: 64, elements: !258)
!258 = !{!259, !265}
!259 = !DIDerivedType(tag: DW_TAG_member, scope: !257, file: !256, line: 38, baseType: !260, size: 32)
!260 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !257, file: !256, line: 38, size: 32, elements: !261)
!261 = !{!262, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !260, file: !256, line: 39, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !256, line: 40, baseType: !263, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, scope: !257, file: !256, line: 42, baseType: !266, size: 32, offset: 32)
!266 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !257, file: !256, line: 42, size: 32, elements: !267)
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !266, file: !256, line: 43, baseType: !263, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !266, file: !256, line: 44, baseType: !263, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !252, file: !246, line: 62, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !272, line: 49, size: 64, elements: !273)
!272 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!273 = !{!274}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !271, file: !272, line: 50, baseType: !275, size: 64)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !276, size: 64, elements: !277)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!277 = !{!278}
!278 = !DISubrange(count: 2)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !249, file: !246, line: 68, baseType: !280, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !282, line: 233, baseType: !283)
!282 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !282, line: 231, size: 64, elements: !284)
!284 = !{!285}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !283, file: !282, line: 232, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !256, line: 48, baseType: !257)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !249, file: !246, line: 71, baseType: !123, size: 8, offset: 96)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !249, file: !246, line: 74, baseType: !123, size: 8, offset: 104)
!289 = !DIDerivedType(tag: DW_TAG_member, scope: !249, file: !246, line: 90, baseType: !290, size: 16, offset: 112)
!290 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !249, file: !246, line: 90, size: 16, elements: !291)
!291 = !{!292, !299}
!292 = !DIDerivedType(tag: DW_TAG_member, scope: !290, file: !246, line: 91, baseType: !293, size: 16)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !290, file: !246, line: 91, size: 16, elements: !294)
!294 = !{!295, !298}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !293, file: !246, line: 96, baseType: !296, size: 8)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !297)
!297 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !293, file: !246, line: 97, baseType: !123, size: 8, offset: 8)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !290, file: !246, line: 100, baseType: !300, size: 16)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !301)
!301 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !249, file: !246, line: 107, baseType: !155, size: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !249, file: !246, line: 127, baseType: !103, size: 32, offset: 160)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !249, file: !246, line: 131, baseType: !305, size: 192, offset: 192)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !282, line: 244, size: 192, elements: !306)
!306 = !{!307, !308, !314}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !305, file: !282, line: 245, baseType: !255, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !305, file: !282, line: 246, baseType: !309, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !282, line: 242, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !313}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !305, file: !282, line: 249, baseType: !315, size: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !316)
!316 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !245, file: !246, line: 250, baseType: !318, size: 288, offset: 384)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !319, line: 25, size: 288, elements: !320)
!319 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!320 = !{!321, !322, !323, !324, !325, !326, !327, !328, !329}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !318, file: !319, line: 26, baseType: !155, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !318, file: !319, line: 27, baseType: !155, size: 32, offset: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !318, file: !319, line: 28, baseType: !155, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !318, file: !319, line: 29, baseType: !155, size: 32, offset: 96)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !318, file: !319, line: 30, baseType: !155, size: 32, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !318, file: !319, line: 31, baseType: !155, size: 32, offset: 160)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !318, file: !319, line: 32, baseType: !155, size: 32, offset: 192)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !318, file: !319, line: 33, baseType: !155, size: 32, offset: 224)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !318, file: !319, line: 34, baseType: !155, size: 32, offset: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !245, file: !246, line: 253, baseType: !103, size: 32, offset: 672)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !245, file: !246, line: 256, baseType: !281, size: 64, offset: 704)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !245, file: !246, line: 294, baseType: !104, size: 32, offset: 768)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !245, file: !246, line: 300, baseType: !334, size: 96, offset: 800)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !246, line: 149, size: 96, elements: !335)
!335 = !{!336, !337, !338}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !334, file: !246, line: 153, baseType: !22, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !334, file: !246, line: 162, baseType: !235, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !334, file: !246, line: 168, baseType: !235, size: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !245, file: !246, line: 325, baseType: !340, size: 32, offset: 896)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 32)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !342, line: 5073, size: 160, elements: !343)
!342 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!343 = !{!344, !353, !354}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !341, file: !342, line: 5074, baseType: !345, size: 96)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !346, line: 56, size: 96, elements: !347)
!346 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!347 = !{!348, !351, !352}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !345, file: !346, line: 57, baseType: !349, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 32)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !346, line: 57, flags: DIFlagFwdDecl)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !345, file: !346, line: 58, baseType: !103, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !345, file: !346, line: 59, baseType: !235, size: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !341, file: !342, line: 5075, baseType: !281, size: 64, offset: 96)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !341, file: !342, line: 5076, baseType: !355, offset: 160)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !356, line: 43, elements: !357)
!356 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!357 = !{}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !245, file: !246, line: 343, baseType: !359, size: 64, offset: 928)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !319, line: 60, size: 64, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !359, file: !319, line: 63, baseType: !155, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !359, file: !319, line: 66, baseType: !155, size: 32, offset: 32)
!363 = !{!364, !365, !366, !367}
!364 = !DILocalVariable(name: "thread", arg: 1, scope: !240, file: !241, line: 175, type: !244)
!365 = !DILocalVariable(name: "region_num", scope: !240, file: !241, line: 200, type: !123)
!366 = !DILocalVariable(name: "guard_start", scope: !240, file: !241, line: 265, type: !22)
!367 = !DILocalVariable(name: "guard_size", scope: !240, file: !241, line: 266, type: !235)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 96, elements: !380)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !370, line: 52, size: 96, elements: !371)
!370 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!371 = !{!372, !373, !374}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !369, file: !370, line: 53, baseType: !22, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !369, file: !370, line: 54, baseType: !235, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !369, file: !370, line: 55, baseType: !375, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !376, line: 151, baseType: !377)
!376 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 149, size: 32, elements: !378)
!378 = !{!379}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !377, file: !376, line: 150, baseType: !155, size: 32)
!380 = !{!381}
!381 = !DISubrange(count: 1)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 96, elements: !380)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !386, file: !419, line: 39, type: !123, isLocal: true, isDefinition: true)
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !388, globals: !418, splitDebugInlining: false, nameTableKind: None)
!387 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver")
!388 = !{!389, !103, !104, !406, !123}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !391, line: 1168, baseType: !392)
!391 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 1155, size: 352, elements: !393)
!393 = !{!394, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !392, file: !391, line: 1157, baseType: !395, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !392, file: !391, line: 1158, baseType: !154, size: 32, offset: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !392, file: !391, line: 1159, baseType: !154, size: 32, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !392, file: !391, line: 1160, baseType: !154, size: 32, offset: 96)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !392, file: !391, line: 1161, baseType: !154, size: 32, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !392, file: !391, line: 1162, baseType: !154, size: 32, offset: 160)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !392, file: !391, line: 1163, baseType: !154, size: 32, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !392, file: !391, line: 1164, baseType: !154, size: 32, offset: 224)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !392, file: !391, line: 1165, baseType: !154, size: 32, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !392, file: !391, line: 1166, baseType: !154, size: 32, offset: 288)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !392, file: !391, line: 1167, baseType: !154, size: 32, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !409, line: 27, size: 96, elements: !410)
!409 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!410 = !{!411, !412, !413}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !408, file: !409, line: 29, baseType: !155, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !408, file: !409, line: 31, baseType: !113, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !408, file: !409, line: 37, baseType: !414, size: 32, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !376, line: 146, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !376, line: 141, size: 32, elements: !416)
!416 = !{!417}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !415, file: !376, line: 143, baseType: !155, size: 32)
!418 = !{!384}
!419 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !422, file: !429, line: 21, type: !140, isLocal: true, isDefinition: true)
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !424, globals: !428, splitDebugInlining: false, nameTableKind: None)
!423 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver")
!424 = !{!425, !104, !103}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !427, line: 22, baseType: !104)
!427 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!428 = !{!420}
!429 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !432, file: !437, line: 13, type: !454, isLocal: true, isDefinition: true)
!432 = distinct !DICompileUnit(language: DW_LANG_C99, file: !433, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !434, splitDebugInlining: false, nameTableKind: None)
!433 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver")
!434 = !{!435, !430}
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "mpu_config", scope: !432, file: !437, line: 37, type: !438, isLocal: false, isDefinition: true)
!437 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !409, line: 41, size: 64, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !439, file: !409, line: 43, baseType: !155, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !439, file: !409, line: 45, baseType: !443, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !409, line: 27, size: 96, elements: !446)
!446 = !{!447, !448, !449}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !445, file: !409, line: 29, baseType: !155, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !445, file: !409, line: 31, baseType: !113, size: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !445, file: !409, line: 37, baseType: !450, size: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !376, line: 146, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !376, line: 141, size: 32, elements: !452)
!452 = !{!453}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !451, file: !376, line: 143, baseType: !155, size: 32)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !444, size: 192, elements: !277)
!455 = !DIGlobalVariableExpression(var: !456, expr: !DIExpression())
!456 = distinct !DIGlobalVariable(name: "__init_rf_init", scope: !457, file: !554, line: 36, type: !555, isLocal: true, isDefinition: true, align: 32)
!457 = distinct !DICompileUnit(language: DW_LANG_C99, file: !458, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !459, retainedTypes: !471, globals: !553, splitDebugInlining: false, nameTableKind: None)
!458 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver")
!459 = !{!460, !466}
!460 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !461, line: 506, baseType: !32, size: 32, elements: !462)
!461 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!462 = !{!463, !464, !465}
!463 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!464 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!465 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!466 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !461, line: 512, baseType: !32, size: 32, elements: !467)
!467 = !{!468, !469, !470}
!468 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!469 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!470 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!471 = !{!472, !542, !547, !507, !466, !460, !552, !103}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !461, line: 523, size: 288, elements: !475)
!475 = !{!476, !497, !503, !508, !512, !513, !514, !518, !538}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !474, file: !461, line: 524, baseType: !477, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 32)
!478 = !DISubroutineType(types: !479)
!479 = !{!104, !480, !495, !496}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !483)
!483 = !{!484, !485, !486, !487, !493, !494}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !482, file: !110, line: 380, baseType: !113, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !482, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !482, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !482, file: !110, line: 386, baseType: !488, size: 32, offset: 96)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !490)
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !489, file: !110, line: 359, baseType: !123, size: 8)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !489, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !482, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !482, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !461, line: 237, baseType: !123)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !461, line: 257, baseType: !155)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !474, file: !461, line: 530, baseType: !498, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 32)
!499 = !DISubroutineType(types: !500)
!500 = !{!104, !480, !501}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !461, line: 229, baseType: !155)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !474, file: !461, line: 532, baseType: !504, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = !DISubroutineType(types: !506)
!506 = !{!104, !480, !507, !502}
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !461, line: 216, baseType: !155)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !474, file: !461, line: 535, baseType: !509, size: 32, offset: 96)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!510 = !DISubroutineType(types: !511)
!511 = !{!104, !480, !507}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !474, file: !461, line: 537, baseType: !509, size: 32, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !474, file: !461, line: 539, baseType: !509, size: 32, offset: 160)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !474, file: !461, line: 541, baseType: !515, size: 32, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = !DISubroutineType(types: !517)
!517 = !{!104, !480, !495, !460, !466}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !474, file: !461, line: 544, baseType: !519, size: 32, offset: 224)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 32)
!520 = !DISubroutineType(types: !521)
!521 = !{!104, !480, !522, !126}
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !461, line: 478, size: 96, elements: !524)
!524 = !{!525, !532, !537}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !523, file: !461, line: 482, baseType: !526, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !527, line: 33, baseType: !528)
!527 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !527, line: 29, size: 32, elements: !529)
!529 = !{!530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !528, file: !527, line: 30, baseType: !531, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !523, file: !461, line: 485, baseType: !533, size: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !461, line: 464, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DISubroutineType(types: !536)
!536 = !{null, !480, !522, !507}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !523, file: !461, line: 493, baseType: !507, size: 32, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !474, file: !461, line: 547, baseType: !539, size: 32, offset: 256)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DISubroutineType(types: !541)
!541 = !{!155, !480}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !461, line: 428, size: 32, elements: !545)
!545 = !{!546}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !544, file: !461, line: 434, baseType: !507, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !461, line: 441, size: 32, elements: !550)
!550 = !{!551}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !549, file: !461, line: 447, baseType: !507, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!553 = !{!455}
!554 = !DIFile(filename: "zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !179, line: 51, size: 64, elements: !557)
!557 = !{!558, !562}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !556, file: !179, line: 60, baseType: !559, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DISubroutineType(types: !561)
!561 = !{!104, !480}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !556, file: !179, line: 65, baseType: !480, size: 32, offset: 32)
!563 = !DIGlobalVariableExpression(var: !564, expr: !DIExpression())
!564 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !565, file: !637, line: 48, type: !713, isLocal: true, isDefinition: true)
!565 = distinct !DICompileUnit(language: DW_LANG_C99, file: !566, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !567, retainedTypes: !623, globals: !634, splitDebugInlining: false, nameTableKind: None)
!566 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver")
!567 = !{!30, !568}
!568 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !150, line: 69, baseType: !104, size: 32, elements: !569)
!569 = !{!570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622}
!570 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!571 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!572 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!573 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!574 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!575 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!576 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!577 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!578 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!579 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!580 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!581 = !DIEnumerator(name: "TAMPER_STAMP_IRQn", value: 2)
!582 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!583 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!584 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!585 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!586 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!587 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!588 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!589 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!590 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!591 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!592 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!593 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!594 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!595 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!596 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!597 = !DIEnumerator(name: "ADC1_IRQn", value: 18)
!598 = !DIEnumerator(name: "USB_HP_IRQn", value: 19)
!599 = !DIEnumerator(name: "USB_LP_IRQn", value: 20)
!600 = !DIEnumerator(name: "DAC_IRQn", value: 21)
!601 = !DIEnumerator(name: "COMP_IRQn", value: 22)
!602 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!603 = !DIEnumerator(name: "TIM9_IRQn", value: 25)
!604 = !DIEnumerator(name: "TIM10_IRQn", value: 26)
!605 = !DIEnumerator(name: "TIM11_IRQn", value: 27)
!606 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!607 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!608 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!609 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!610 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!611 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!612 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!613 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!614 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!615 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!616 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!617 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!618 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!619 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!620 = !DIEnumerator(name: "USB_FS_WKUP_IRQn", value: 42)
!621 = !DIEnumerator(name: "TIM6_IRQn", value: 43)
!622 = !DIEnumerator(name: "TIM7_IRQn", value: 44)
!623 = !{!235, !104, !103, !624}
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !150, line: 270, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 262, size: 192, elements: !627)
!627 = !{!628, !629, !630, !631, !632, !633}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !626, file: !150, line: 264, baseType: !154, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !626, file: !150, line: 265, baseType: !154, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !626, file: !150, line: 266, baseType: !154, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !626, file: !150, line: 267, baseType: !154, size: 32, offset: 96)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !626, file: !150, line: 268, baseType: !154, size: 32, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !626, file: !150, line: 269, baseType: !154, size: 32, offset: 160)
!634 = !{!635, !641, !657, !668, !685, !563, !687, !701, !703, !705, !707, !709, !711}
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !565, file: !637, line: 424, type: !638, isLocal: false, isDefinition: true, align: 16)
!637 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 64, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 4)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "__device_dts_ord_32", scope: !565, file: !637, line: 424, type: !643, isLocal: false, isDefinition: true, align: 32)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !645)
!645 = !{!646, !647, !648, !649, !655, !656}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !644, file: !110, line: 380, baseType: !113, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !644, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !644, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !644, file: !110, line: 386, baseType: !650, size: 32, offset: 96)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !652)
!652 = !{!653, !654}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !651, file: !110, line: 359, baseType: !123, size: 8)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !651, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !644, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !644, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_32", scope: !565, file: !637, line: 424, type: !659, isLocal: true, isDefinition: true, align: 32)
!659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !660)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !179, line: 51, size: 64, elements: !661)
!661 = !{!662, !667}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !660, file: !179, line: 60, baseType: !663, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 32)
!664 = !DISubroutineType(types: !665)
!665 = !{!104, !666}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !660, file: !179, line: 65, baseType: !666, size: 32, offset: 32)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "exti_data", scope: !565, file: !637, line: 423, type: !670, isLocal: true, isDefinition: true)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !637, line: 107, size: 1024, elements: !671)
!671 = !{!672}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !670, file: !637, line: 109, baseType: !673, size: 1024)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 1024, elements: !683)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !637, line: 101, size: 64, elements: !675)
!675 = !{!676, !682}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !674, file: !637, line: 102, baseType: !677, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !678, line: 63, baseType: !679)
!678 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!680 = !DISubroutineType(types: !681)
!681 = !{null, !104, !103}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !674, file: !637, line: 103, baseType: !103, size: 32, offset: 32)
!683 = !{!684}
!684 = !DISubrange(count: 16)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_32", scope: !565, file: !637, line: 424, type: !651, isLocal: true, isDefinition: true, align: 8)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !689, file: !637, line: 493, type: !694, isLocal: true, isDefinition: true, align: 32)
!689 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !637, file: !637, line: 460, type: !690, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !565, retainedNodes: !692)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !666}
!692 = !{!693}
!693 = !DILocalVariable(name: "dev", arg: 1, scope: !689, file: !637, line: 460, type: !666)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !695)
!695 = !{!696, !698, !699, !700}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !694, file: !10, line: 55, baseType: !697, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !104)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !694, file: !10, line: 57, baseType: !697, size: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !694, file: !10, line: 59, baseType: !103, size: 32, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !694, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !689, file: !637, line: 497, type: !694, isLocal: true, isDefinition: true, align: 32)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !689, file: !637, line: 507, type: !694, isLocal: true, isDefinition: true, align: 32)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !689, file: !637, line: 512, type: !694, isLocal: true, isDefinition: true, align: 32)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !689, file: !637, line: 516, type: !694, isLocal: true, isDefinition: true, align: 32)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !689, file: !637, line: 523, type: !694, isLocal: true, isDefinition: true, align: 32)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !689, file: !637, line: 527, type: !694, isLocal: true, isDefinition: true, align: 32)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 512, elements: !683)
!714 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !715)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !150, line: 127, baseType: !568)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !718, file: !723, line: 21, type: !741, isLocal: false, isDefinition: true, align: 16)
!718 = distinct !DICompileUnit(language: DW_LANG_C99, file: !719, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !720, splitDebugInlining: false, nameTableKind: None)
!719 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver")
!720 = !{!721, !716, !727, !729, !731, !733, !735, !737, !739, !744, !746}
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !718, file: !723, line: 16, type: !724, isLocal: false, isDefinition: true, align: 16)
!723 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver")
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 176, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 11)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_17", scope: !718, file: !723, line: 28, type: !638, isLocal: false, isDefinition: true, align: 16)
!729 = !DIGlobalVariableExpression(var: !730, expr: !DIExpression())
!730 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !718, file: !723, line: 35, type: !638, isLocal: false, isDefinition: true, align: 16)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_53", scope: !718, file: !723, line: 42, type: !638, isLocal: false, isDefinition: true, align: 16)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_59", scope: !718, file: !723, line: 49, type: !638, isLocal: false, isDefinition: true, align: 16)
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_15", scope: !718, file: !723, line: 56, type: !638, isLocal: false, isDefinition: true, align: 16)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !718, file: !723, line: 63, type: !638, isLocal: false, isDefinition: true, align: 16)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "__devicehdl_hello_world", scope: !718, file: !723, line: 68, type: !741, isLocal: false, isDefinition: true, align: 16)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 48, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 3)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !718, file: !723, line: 75, type: !638, isLocal: false, isDefinition: true, align: 16)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !718, file: !723, line: 82, type: !638, isLocal: false, isDefinition: true, align: 16)
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !750, file: !794, line: 398, type: !827, isLocal: true, isDefinition: true)
!750 = distinct !DICompileUnit(language: DW_LANG_C99, file: !751, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !752, retainedTypes: !765, globals: !791, splitDebugInlining: false, nameTableKind: None)
!751 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver")
!752 = !{!753, !30, !758}
!753 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !754, line: 190, baseType: !32, size: 32, elements: !755)
!754 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l1xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!755 = !{!756, !757}
!756 = !DIEnumerator(name: "SUCCESS", value: 0)
!757 = !DIEnumerator(name: "ERROR", value: 1)
!758 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !759, line: 44, baseType: !32, size: 32, elements: !760)
!759 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!760 = !{!761, !762, !763, !764}
!761 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!762 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!763 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!764 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!765 = !{!103, !104, !155, !766, !784, !790}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !150, line: 386, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 370, size: 448, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !768, file: !150, line: 372, baseType: !154, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !768, file: !150, line: 373, baseType: !154, size: 32, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !768, file: !150, line: 374, baseType: !154, size: 32, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !768, file: !150, line: 375, baseType: !154, size: 32, offset: 96)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !768, file: !150, line: 376, baseType: !154, size: 32, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !768, file: !150, line: 377, baseType: !154, size: 32, offset: 160)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !768, file: !150, line: 378, baseType: !154, size: 32, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !768, file: !150, line: 379, baseType: !154, size: 32, offset: 224)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !768, file: !150, line: 380, baseType: !154, size: 32, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !768, file: !150, line: 381, baseType: !154, size: 32, offset: 288)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !768, file: !150, line: 382, baseType: !154, size: 32, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !768, file: !150, line: 383, baseType: !154, size: 32, offset: 352)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !768, file: !150, line: 384, baseType: !154, size: 32, offset: 384)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !768, file: !150, line: 385, baseType: !154, size: 32, offset: 416)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 32)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !786, line: 343, size: 64, elements: !787)
!786 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!787 = !{!788, !789}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !785, file: !786, line: 344, baseType: !155, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !785, file: !786, line: 345, baseType: !155, size: 32, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!791 = !{!792, !798, !814, !825, !748}
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !750, file: !794, line: 752, type: !795, isLocal: false, isDefinition: true, align: 16)
!794 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 512, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 32)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !750, file: !794, line: 752, type: !800, isLocal: false, isDefinition: true, align: 32)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !802)
!802 = !{!803, !804, !805, !806, !812, !813}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !801, file: !110, line: 380, baseType: !113, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !801, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !801, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !801, file: !110, line: 386, baseType: !807, size: 32, offset: 96)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !808, file: !110, line: 359, baseType: !123, size: 8)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !808, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !801, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !801, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !750, file: !794, line: 752, type: !816, isLocal: true, isDefinition: true, align: 32)
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !179, line: 51, size: 64, elements: !818)
!818 = !{!819, !824}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !817, file: !179, line: 60, baseType: !820, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = !DISubroutineType(types: !822)
!822 = !{!104, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !817, file: !179, line: 65, baseType: !823, size: 32, offset: 32)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !750, file: !794, line: 752, type: !808, isLocal: true, isDefinition: true, align: 8)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !759, line: 100, size: 224, elements: !828)
!828 = !{!829, !835, !836, !845, !850, !855, !861}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !827, file: !759, line: 101, baseType: !830, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !759, line: 76, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 32)
!832 = !DISubroutineType(types: !833)
!833 = !{!104, !823, !834}
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !759, line: 56, baseType: !103)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !827, file: !759, line: 102, baseType: !830, size: 32, offset: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !827, file: !759, line: 103, baseType: !837, size: 32, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !759, line: 83, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!839 = !DISubroutineType(types: !840)
!840 = !{!104, !823, !834, !841, !103}
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !759, line: 72, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 32)
!843 = !DISubroutineType(types: !844)
!844 = !{null, !823, !834, !103}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !827, file: !759, line: 104, baseType: !846, size: 32, offset: 96)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !759, line: 79, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DISubroutineType(types: !849)
!849 = !{!104, !823, !834, !790}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !827, file: !759, line: 105, baseType: !851, size: 32, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !759, line: 88, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 32)
!853 = !DISubroutineType(types: !854)
!854 = !{!758, !823, !834}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !827, file: !759, line: 106, baseType: !856, size: 32, offset: 160)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !759, line: 92, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = !DISubroutineType(types: !859)
!859 = !{!104, !823, !834, !860}
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !759, line: 64, baseType: !103)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !827, file: !759, line: 107, baseType: !862, size: 32, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !759, line: 96, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 32)
!864 = !DISubroutineType(types: !865)
!865 = !{!104, !823, !834, !103}
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !868, file: !925, line: 603, type: !927, isLocal: true, isDefinition: true, align: 32)
!868 = distinct !DICompileUnit(language: DW_LANG_C99, file: !869, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !870, globals: !922, splitDebugInlining: false, nameTableKind: None)
!869 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver")
!870 = !{!103, !104, !871}
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !874, line: 336, size: 160, elements: !875)
!874 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!875 = !{!876, !896, !900, !904, !917}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !873, file: !874, line: 365, baseType: !877, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!878 = !DISubroutineType(types: !879)
!879 = !{!104, !880, !895}
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !883)
!883 = !{!884, !885, !886, !887, !893, !894}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !882, file: !110, line: 380, baseType: !113, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !882, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !882, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !882, file: !110, line: 386, baseType: !888, size: 32, offset: 96)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !890)
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !889, file: !110, line: 359, baseType: !123, size: 8)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !889, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !882, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !882, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !873, file: !874, line: 366, baseType: !897, size: 32, offset: 32)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DISubroutineType(types: !899)
!899 = !{null, !880, !124}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !873, file: !874, line: 374, baseType: !901, size: 32, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DISubroutineType(types: !903)
!903 = !{!104, !880}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !873, file: !874, line: 377, baseType: !905, size: 32, offset: 96)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = !DISubroutineType(types: !907)
!907 = !{!104, !880, !908}
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !874, line: 122, size: 64, elements: !911)
!911 = !{!912, !913, !914, !915, !916}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !910, file: !874, line: 123, baseType: !155, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !910, file: !874, line: 124, baseType: !123, size: 8, offset: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !910, file: !874, line: 125, baseType: !123, size: 8, offset: 40)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !910, file: !874, line: 126, baseType: !123, size: 8, offset: 48)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !910, file: !874, line: 127, baseType: !123, size: 8, offset: 56)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !873, file: !874, line: 379, baseType: !918, size: 32, offset: 128)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 32)
!919 = !DISubroutineType(types: !920)
!920 = !{!104, !880, !921}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!922 = !{!866, !923}
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !868, file: !925, line: 38, type: !926, isLocal: true, isDefinition: true)
!925 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !880)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !179, line: 51, size: 64, elements: !929)
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !928, file: !179, line: 60, baseType: !901, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !928, file: !179, line: 65, baseType: !880, size: 32, offset: 32)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !934, file: !1085, line: 762, type: !1183, isLocal: true, isDefinition: true)
!934 = distinct !DICompileUnit(language: DW_LANG_C99, file: !935, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !936, retainedTypes: !943, globals: !1082, splitDebugInlining: false, nameTableKind: None)
!935 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/out_of_tree_driver")
!936 = !{!30, !460, !466, !937, !758}
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !678, line: 43, baseType: !32, size: 32, elements: !938)
!938 = !{!939, !940, !941, !942}
!939 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!940 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!941 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!942 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!943 = !{!103, !104, !944, !1008, !1013, !507, !466, !460, !1018, !1019, !155, !1033, !989, !1041, !1042, !1043}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !461, line: 523, size: 288, elements: !947)
!947 = !{!948, !967, !971, !975, !979, !980, !981, !985, !1004}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !946, file: !461, line: 524, baseType: !949, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 32)
!950 = !DISubroutineType(types: !951)
!951 = !{!104, !952, !495, !496}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !955)
!955 = !{!956, !957, !958, !959, !965, !966}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !954, file: !110, line: 380, baseType: !113, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !954, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !954, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !954, file: !110, line: 386, baseType: !960, size: 32, offset: 96)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !962)
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !961, file: !110, line: 359, baseType: !123, size: 8)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !961, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !954, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !954, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !946, file: !461, line: 530, baseType: !968, size: 32, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!969 = !DISubroutineType(types: !970)
!970 = !{!104, !952, !501}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !946, file: !461, line: 532, baseType: !972, size: 32, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = !DISubroutineType(types: !974)
!974 = !{!104, !952, !507, !502}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !946, file: !461, line: 535, baseType: !976, size: 32, offset: 96)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!977 = !DISubroutineType(types: !978)
!978 = !{!104, !952, !507}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !946, file: !461, line: 537, baseType: !976, size: 32, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !946, file: !461, line: 539, baseType: !976, size: 32, offset: 160)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !946, file: !461, line: 541, baseType: !982, size: 32, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 32)
!983 = !DISubroutineType(types: !984)
!984 = !{!104, !952, !495, !460, !466}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !946, file: !461, line: 544, baseType: !986, size: 32, offset: 224)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DISubroutineType(types: !988)
!988 = !{!104, !952, !989, !126}
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 32)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !461, line: 478, size: 96, elements: !991)
!991 = !{!992, !998, !1003}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !990, file: !461, line: 482, baseType: !993, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !527, line: 33, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !527, line: 29, size: 32, elements: !995)
!995 = !{!996}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !994, file: !527, line: 30, baseType: !997, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !990, file: !461, line: 485, baseType: !999, size: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !461, line: 464, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{null, !952, !989, !507}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !990, file: !461, line: 493, baseType: !507, size: 32, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !946, file: !461, line: 547, baseType: !1005, size: 32, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 32)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!155, !952}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !461, line: 428, size: 32, elements: !1011)
!1011 = !{!1012}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !1010, file: !461, line: 434, baseType: !507, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !461, line: 441, size: 32, elements: !1016)
!1016 = !{!1017}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1015, file: !461, line: 447, baseType: !507, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !150, line: 314, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 303, size: 320, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !1021, file: !150, line: 305, baseType: !154, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !1021, file: !150, line: 306, baseType: !154, size: 32, offset: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !1021, file: !150, line: 307, baseType: !154, size: 32, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !1021, file: !150, line: 308, baseType: !154, size: 32, offset: 96)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !1021, file: !150, line: 309, baseType: !154, size: 32, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !1021, file: !150, line: 310, baseType: !154, size: 32, offset: 160)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !1021, file: !150, line: 311, baseType: !154, size: 32, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !1021, file: !150, line: 312, baseType: !154, size: 32, offset: 224)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !1021, file: !150, line: 313, baseType: !1032, size: 64, offset: 256)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 64, elements: !277)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 32)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !150, line: 325, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 320, size: 192, elements: !1036)
!1036 = !{!1037, !1038, !1039}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !1035, file: !150, line: 322, baseType: !154, size: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !1035, file: !150, line: 323, baseType: !154, size: 32, offset: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !1035, file: !150, line: 324, baseType: !1040, size: 128, offset: 64)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 128, elements: !639)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !759, line: 100, size: 224, elements: !1046)
!1046 = !{!1047, !1052, !1053, !1062, !1067, !1072, !1077}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !1045, file: !759, line: 101, baseType: !1048, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !759, line: 76, baseType: !1049)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 32)
!1050 = !DISubroutineType(types: !1051)
!1051 = !{!104, !952, !834}
