; ModuleID = 'build/96b_wistrio/synchronization/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/synchronization/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/synchronization")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/synchronization")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "threadA_sem", scope: !27, file: !116, line: 72, type: !117, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/synchronization")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !106, !107, !109, !110, !111}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !103, line: 46, baseType: !104)
!103 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !105)
!105 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 214, baseType: !32)
!108 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!25, !114, !143, !153, !257, !259}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "threadB_sem", scope: !27, file: !116, line: 73, type: !117, isLocal: false, isDefinition: true, align: 32)
!116 = !DIFile(filename: "zephyr/samples/synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !118, line: 2909, size: 128, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120, !141, !142}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !117, file: !118, line: 2910, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !123, file: !122, line: 232, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !129)
!129 = !{!130, !136}
!130 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 38, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 38, size: 32, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !127, line: 39, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !127, line: 40, baseType: !134, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 42, baseType: !137, size: 32, offset: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 42, size: 32, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !137, file: !127, line: 43, baseType: !134, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !127, line: 44, baseType: !134, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !117, file: !118, line: 2911, baseType: !32, size: 32, offset: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !117, file: !118, line: 2912, baseType: !32, size: 32, offset: 96)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "threadA_stack_area", scope: !27, file: !116, line: 88, type: !145, isLocal: false, isDefinition: true, align: 512)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 8704, elements: !151)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !147, line: 47, size: 8, elements: !148)
!147 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !147, line: 48, baseType: !150, size: 8)
!150 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!151 = !{!152}
!152 = !DISubrange(count: 1088)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "threadA_data", scope: !27, file: !116, line: 89, type: !155, isLocal: true, isDefinition: true)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !156, line: 245, size: 1344, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{!158, !208, !221, !222, !223, !227, !228, !234, !252}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !155, file: !156, line: 247, baseType: !159, size: 448)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !156, line: 57, size: 448, elements: !160)
!160 = !{!161, !175, !177, !180, !181, !194, !195, !196, !197}
!161 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 60, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 60, size: 64, elements: !163)
!163 = !{!164, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !162, file: !156, line: 61, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !162, file: !156, line: 62, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 49, size: 64, elements: !169)
!168 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !167, file: !168, line: 50, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!173 = !{!174}
!174 = !DISubrange(count: 2)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !159, file: !156, line: 68, baseType: !176, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !159, file: !156, line: 71, baseType: !178, size: 8, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !179)
!179 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !159, file: !156, line: 74, baseType: !178, size: 8, offset: 104)
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 90, baseType: !182, size: 16, offset: 112)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 90, size: 16, elements: !183)
!183 = !{!184, !191}
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !182, file: !156, line: 91, baseType: !185, size: 16)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !182, file: !156, line: 91, size: 16, elements: !186)
!186 = !{!187, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !185, file: !156, line: 96, baseType: !188, size: 8)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !189)
!189 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !185, file: !156, line: 97, baseType: !178, size: 8, offset: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !182, file: !156, line: 100, baseType: !192, size: 16)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !193)
!193 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !159, file: !156, line: 107, baseType: !110, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_mask", scope: !159, file: !156, line: 123, baseType: !178, size: 8, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !159, file: !156, line: 127, baseType: !106, size: 32, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !159, file: !156, line: 131, baseType: !198, size: 192, offset: 256)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !199)
!199 = !{!200, !201, !207}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !198, file: !122, line: 245, baseType: !165, size: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !198, file: !122, line: 246, baseType: !202, size: 32, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !206}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !198, file: !122, line: 249, baseType: !104, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !155, file: !156, line: 250, baseType: !209, size: 288, offset: 448)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !210, line: 25, size: 288, elements: !211)
!210 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !209, file: !210, line: 26, baseType: !110, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !209, file: !210, line: 27, baseType: !110, size: 32, offset: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !209, file: !210, line: 28, baseType: !110, size: 32, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !209, file: !210, line: 29, baseType: !110, size: 32, offset: 96)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !209, file: !210, line: 30, baseType: !110, size: 32, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !209, file: !210, line: 31, baseType: !110, size: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !209, file: !210, line: 32, baseType: !110, size: 32, offset: 192)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !209, file: !210, line: 33, baseType: !110, size: 32, offset: 224)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !209, file: !210, line: 34, baseType: !110, size: 32, offset: 256)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !155, file: !156, line: 253, baseType: !106, size: 32, offset: 736)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !155, file: !156, line: 256, baseType: !121, size: 64, offset: 768)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !155, file: !156, line: 279, baseType: !224, size: 256, offset: 832)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !155, file: !156, line: 294, baseType: !109, size: 32, offset: 1088)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !155, file: !156, line: 300, baseType: !229, size: 96, offset: 1120)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !156, line: 149, size: 96, elements: !230)
!230 = !{!231, !232, !233}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !229, file: !156, line: 153, baseType: !22, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !229, file: !156, line: 162, baseType: !107, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !229, file: !156, line: 168, baseType: !107, size: 32, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !155, file: !156, line: 325, baseType: !235, size: 32, offset: 1216)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 160, elements: !237)
!237 = !{!238, !247, !248}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !236, file: !118, line: 5074, baseType: !239, size: 96)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !{!242, !245, !246}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !239, file: !240, line: 57, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !240, line: 57, flags: DIFlagFwdDecl)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !239, file: !240, line: 58, baseType: !106, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !239, file: !240, line: 59, baseType: !107, size: 32, offset: 64)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !236, file: !118, line: 5075, baseType: !121, size: 64, offset: 96)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !236, file: !118, line: 5076, baseType: !249, offset: 160)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!250 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !{}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !155, file: !156, line: 343, baseType: !253, size: 64, offset: 1248)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !210, line: 60, size: 64, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !253, file: !210, line: 63, baseType: !110, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !253, file: !210, line: 66, baseType: !110, size: 32, offset: 32)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "threadB_stack_area", scope: !27, file: !116, line: 91, type: !145, isLocal: false, isDefinition: true, align: 512)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "threadB_data", scope: !27, file: !116, line: 92, type: !155, isLocal: true, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "_char_out", scope: !263, file: !267, line: 54, type: !268, isLocal: false, isDefinition: true)
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !265, globals: !266, splitDebugInlining: false, nameTableKind: None)
!264 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/synchronization")
!265 = !{!106, !109}
!266 = !{!261}
!267 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DISubroutineType(types: !270)
!270 = !{!109, !109}
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "__init_stm32l1_init", scope: !273, file: !303, line: 60, type: !304, isLocal: true, isDefinition: true, align: 32)
!273 = distinct !DICompileUnit(language: DW_LANG_C99, file: !274, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !275, globals: !302, splitDebugInlining: false, nameTableKind: None)
!274 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/synchronization")
!275 = !{!276, !296}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !278, line: 386, baseType: !279)
!278 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l151xba.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 370, size: 448, elements: !280)
!280 = !{!281, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !279, file: !278, line: 372, baseType: !282, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !279, file: !278, line: 373, baseType: !282, size: 32, offset: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !279, file: !278, line: 374, baseType: !282, size: 32, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !279, file: !278, line: 375, baseType: !282, size: 32, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !279, file: !278, line: 376, baseType: !282, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !279, file: !278, line: 377, baseType: !282, size: 32, offset: 160)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !279, file: !278, line: 378, baseType: !282, size: 32, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !279, file: !278, line: 379, baseType: !282, size: 32, offset: 224)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !279, file: !278, line: 380, baseType: !282, size: 32, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !279, file: !278, line: 381, baseType: !282, size: 32, offset: 288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !279, file: !278, line: 382, baseType: !282, size: 32, offset: 320)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !279, file: !278, line: 383, baseType: !282, size: 32, offset: 352)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !279, file: !278, line: 384, baseType: !282, size: 32, offset: 384)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !279, file: !278, line: 385, baseType: !282, size: 32, offset: 416)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !278, line: 364, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 360, size: 64, elements: !299)
!299 = !{!300, !301}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !298, file: !278, line: 362, baseType: !282, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !298, file: !278, line: 363, baseType: !282, size: 32, offset: 32)
!302 = !{!271}
!303 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !305)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !306, line: 51, size: 64, elements: !307)
!306 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = !{!308, !336}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !305, file: !306, line: 60, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = !DISubroutineType(types: !311)
!311 = !{!109, !312}
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !315, line: 378, size: 192, elements: !316)
!315 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!316 = !{!317, !320, !321, !322, !329, !330}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !314, file: !315, line: 380, baseType: !318, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !314, file: !315, line: 382, baseType: !13, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !314, file: !315, line: 384, baseType: !13, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !314, file: !315, line: 386, baseType: !323, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !315, line: 351, size: 16, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !324, file: !315, line: 359, baseType: !178, size: 8)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !324, file: !315, line: 364, baseType: !328, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!328 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !314, file: !315, line: 388, baseType: !106, size: 32, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !314, file: !315, line: 396, baseType: !331, size: 32, offset: 160)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !315, line: 43, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !335)
!335 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !305, file: !306, line: 65, baseType: !312, size: 32, offset: 32)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !339, file: !342, line: 71, type: !343, isLocal: true, isDefinition: true, align: 32)
!339 = distinct !DICompileUnit(language: DW_LANG_C99, file: !340, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !341, splitDebugInlining: false, nameTableKind: None)
!340 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/synchronization")
!341 = !{!337}
!342 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !306, line: 51, size: 64, elements: !345)
!345 = !{!346, !365}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !344, file: !306, line: 60, baseType: !347, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!348 = !DISubroutineType(types: !349)
!349 = !{!109, !350}
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !315, line: 378, size: 192, elements: !353)
!353 = !{!354, !355, !356, !357, !363, !364}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !352, file: !315, line: 380, baseType: !318, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !352, file: !315, line: 382, baseType: !13, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !352, file: !315, line: 384, baseType: !13, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !352, file: !315, line: 386, baseType: !358, size: 32, offset: 96)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !315, line: 351, size: 16, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !359, file: !315, line: 359, baseType: !178, size: 8)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !359, file: !315, line: 364, baseType: !328, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !352, file: !315, line: 388, baseType: !106, size: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !352, file: !315, line: 396, baseType: !331, size: 32, offset: 160)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !344, file: !306, line: 65, baseType: !350, size: 32, offset: 32)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "static_regions", scope: !368, file: !375, line: 62, type: !499, isLocal: true, isDefinition: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !370, globals: !371, splitDebugInlining: false, nameTableKind: None)
!369 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/synchronization")
!370 = !{!107, !109, !110, !106}
!371 = !{!372, !366}
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !374, file: !375, line: 198, type: !485, isLocal: true, isDefinition: true)
!374 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !375, file: !375, line: 175, type: !376, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !368, retainedNodes: !480)
!375 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!376 = !DISubroutineType(types: !377)
!377 = !{null, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 32)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !156, line: 245, size: 1344, elements: !380)
!380 = !{!381, !440, !452, !453, !454, !455, !456, !462, !475}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !379, file: !156, line: 247, baseType: !382, size: 448)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !156, line: 57, size: 448, elements: !383)
!383 = !{!384, !408, !415, !416, !417, !426, !427, !428, !429}
!384 = !DIDerivedType(tag: DW_TAG_member, scope: !382, file: !156, line: 60, baseType: !385, size: 64)
!385 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !382, file: !156, line: 60, size: 64, elements: !386)
!386 = !{!387, !402}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !385, file: !156, line: 61, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !390)
!390 = !{!391, !397}
!391 = !DIDerivedType(tag: DW_TAG_member, scope: !389, file: !127, line: 38, baseType: !392, size: 32)
!392 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !389, file: !127, line: 38, size: 32, elements: !393)
!393 = !{!394, !396}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !392, file: !127, line: 39, baseType: !395, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !392, file: !127, line: 40, baseType: !395, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, scope: !389, file: !127, line: 42, baseType: !398, size: 32, offset: 32)
!398 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !389, file: !127, line: 42, size: 32, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !398, file: !127, line: 43, baseType: !395, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !398, file: !127, line: 44, baseType: !395, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !385, file: !156, line: 62, baseType: !403, size: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 49, size: 64, elements: !404)
!404 = !{!405}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !403, file: !168, line: 50, baseType: !406, size: 64)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 64, elements: !173)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !382, file: !156, line: 68, baseType: !409, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !412)
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !411, file: !122, line: 232, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !389)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !382, file: !156, line: 71, baseType: !178, size: 8, offset: 96)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !382, file: !156, line: 74, baseType: !178, size: 8, offset: 104)
!417 = !DIDerivedType(tag: DW_TAG_member, scope: !382, file: !156, line: 90, baseType: !418, size: 16, offset: 112)
!418 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !382, file: !156, line: 90, size: 16, elements: !419)
!419 = !{!420, !425}
!420 = !DIDerivedType(tag: DW_TAG_member, scope: !418, file: !156, line: 91, baseType: !421, size: 16)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !418, file: !156, line: 91, size: 16, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !421, file: !156, line: 96, baseType: !188, size: 8)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !421, file: !156, line: 97, baseType: !178, size: 8, offset: 8)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !418, file: !156, line: 100, baseType: !192, size: 16)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !382, file: !156, line: 107, baseType: !110, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_mask", scope: !382, file: !156, line: 123, baseType: !178, size: 8, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !382, file: !156, line: 127, baseType: !106, size: 32, offset: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !382, file: !156, line: 131, baseType: !430, size: 192, offset: 256)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !431)
!431 = !{!432, !433, !439}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !430, file: !122, line: 245, baseType: !388, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !430, file: !122, line: 246, baseType: !434, size: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !435)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 32)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !438}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !430, file: !122, line: 249, baseType: !104, size: 64, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !379, file: !156, line: 250, baseType: !441, size: 288, offset: 448)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !210, line: 25, size: 288, elements: !442)
!442 = !{!443, !444, !445, !446, !447, !448, !449, !450, !451}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !441, file: !210, line: 26, baseType: !110, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !441, file: !210, line: 27, baseType: !110, size: 32, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !441, file: !210, line: 28, baseType: !110, size: 32, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !441, file: !210, line: 29, baseType: !110, size: 32, offset: 96)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !441, file: !210, line: 30, baseType: !110, size: 32, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !441, file: !210, line: 31, baseType: !110, size: 32, offset: 160)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !441, file: !210, line: 32, baseType: !110, size: 32, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !441, file: !210, line: 33, baseType: !110, size: 32, offset: 224)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !441, file: !210, line: 34, baseType: !110, size: 32, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !379, file: !156, line: 253, baseType: !106, size: 32, offset: 736)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !379, file: !156, line: 256, baseType: !410, size: 64, offset: 768)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !379, file: !156, line: 279, baseType: !224, size: 256, offset: 832)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !379, file: !156, line: 294, baseType: !109, size: 32, offset: 1088)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !379, file: !156, line: 300, baseType: !457, size: 96, offset: 1120)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !156, line: 149, size: 96, elements: !458)
!458 = !{!459, !460, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !457, file: !156, line: 153, baseType: !22, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !457, file: !156, line: 162, baseType: !107, size: 32, offset: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !457, file: !156, line: 168, baseType: !107, size: 32, offset: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !379, file: !156, line: 325, baseType: !463, size: 32, offset: 1216)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 32)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 160, elements: !465)
!465 = !{!466, !472, !473}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !464, file: !118, line: 5074, baseType: !467, size: 96)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !240, line: 56, size: 96, elements: !468)
!468 = !{!469, !470, !471}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !467, file: !240, line: 57, baseType: !243, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !467, file: !240, line: 58, baseType: !106, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !467, file: !240, line: 59, baseType: !107, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !464, file: !118, line: 5075, baseType: !410, size: 64, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !464, file: !118, line: 5076, baseType: !474, offset: 160)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !250, line: 43, elements: !251)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !379, file: !156, line: 343, baseType: !476, size: 64, offset: 1248)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !210, line: 60, size: 64, elements: !477)
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !476, file: !210, line: 63, baseType: !110, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !476, file: !210, line: 66, baseType: !110, size: 32, offset: 32)
!480 = !{!481, !482, !483, !484}
!481 = !DILocalVariable(name: "thread", arg: 1, scope: !374, file: !375, line: 175, type: !378)
!482 = !DILocalVariable(name: "region_num", scope: !374, file: !375, line: 200, type: !178)
!483 = !DILocalVariable(name: "guard_start", scope: !374, file: !375, line: 265, type: !22)
!484 = !DILocalVariable(name: "guard_size", scope: !374, file: !375, line: 266, type: !107)
!485 = !DICompositeType(tag: DW_TAG_array_type, baseType: !486, size: 96, elements: !497)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !487, line: 52, size: 96, elements: !488)
!487 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!488 = !{!489, !490, !491}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !486, file: !487, line: 53, baseType: !22, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !486, file: !487, line: 54, baseType: !107, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !486, file: !487, line: 55, baseType: !492, size: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !493, line: 151, baseType: !494)
!493 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !493, line: 149, size: 32, elements: !495)
!495 = !{!496}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !494, file: !493, line: 150, baseType: !110, size: 32)
!497 = !{!498}
!498 = !DISubrange(count: 1)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 96, elements: !497)
!500 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !486)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !503, file: !536, line: 39, type: !178, isLocal: true, isDefinition: true)
!503 = distinct !DICompileUnit(language: DW_LANG_C99, file: !504, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !505, globals: !535, splitDebugInlining: false, nameTableKind: None)
!504 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/synchronization")
!505 = !{!506, !106, !109, !523, !178}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !508, line: 1168, baseType: !509)
!508 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !508, line: 1155, size: 352, elements: !510)
!510 = !{!511, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !509, file: !508, line: 1157, baseType: !512, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !282)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !509, file: !508, line: 1158, baseType: !282, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !509, file: !508, line: 1159, baseType: !282, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !509, file: !508, line: 1160, baseType: !282, size: 32, offset: 96)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !509, file: !508, line: 1161, baseType: !282, size: 32, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !509, file: !508, line: 1162, baseType: !282, size: 32, offset: 160)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !509, file: !508, line: 1163, baseType: !282, size: 32, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !509, file: !508, line: 1164, baseType: !282, size: 32, offset: 224)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !509, file: !508, line: 1165, baseType: !282, size: 32, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !509, file: !508, line: 1166, baseType: !282, size: 32, offset: 288)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !509, file: !508, line: 1167, baseType: !282, size: 32, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !526, line: 27, size: 96, elements: !527)
!526 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!527 = !{!528, !529, !530}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !525, file: !526, line: 29, baseType: !110, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !525, file: !526, line: 31, baseType: !318, size: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !525, file: !526, line: 37, baseType: !531, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !493, line: 146, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !493, line: 141, size: 32, elements: !533)
!533 = !{!534}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !532, file: !493, line: 143, baseType: !110, size: 32)
!535 = !{!501}
!536 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !539, file: !546, line: 21, type: !268, isLocal: true, isDefinition: true)
!539 = distinct !DICompileUnit(language: DW_LANG_C99, file: !540, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !541, globals: !545, splitDebugInlining: false, nameTableKind: None)
!540 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/synchronization")
!541 = !{!542, !109, !106}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !544, line: 22, baseType: !109)
!544 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!545 = !{!537}
!546 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !549, file: !554, line: 13, type: !571, isLocal: true, isDefinition: true)
!549 = distinct !DICompileUnit(language: DW_LANG_C99, file: !550, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !551, splitDebugInlining: false, nameTableKind: None)
!550 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/synchronization")
!551 = !{!552, !547}
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "mpu_config", scope: !549, file: !554, line: 37, type: !555, isLocal: false, isDefinition: true)
!554 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!555 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !526, line: 41, size: 64, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !556, file: !526, line: 43, baseType: !110, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !556, file: !526, line: 45, baseType: !560, size: 32, offset: 32)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !526, line: 27, size: 96, elements: !563)
!563 = !{!564, !565, !566}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !562, file: !526, line: 29, baseType: !110, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !562, file: !526, line: 31, baseType: !318, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !562, file: !526, line: 37, baseType: !567, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !493, line: 146, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !493, line: 141, size: 32, elements: !569)
!569 = !{!570}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !568, file: !493, line: 143, baseType: !110, size: 32)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 192, elements: !173)
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "__init_rf_init", scope: !574, file: !671, line: 36, type: !672, isLocal: true, isDefinition: true, align: 32)
!574 = distinct !DICompileUnit(language: DW_LANG_C99, file: !575, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !576, retainedTypes: !588, globals: !670, splitDebugInlining: false, nameTableKind: None)
!575 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/synchronization")
!576 = !{!577, !583}
!577 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !578, line: 506, baseType: !32, size: 32, elements: !579)
!578 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!579 = !{!580, !581, !582}
!580 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!581 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!582 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!583 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !578, line: 512, baseType: !32, size: 32, elements: !584)
!584 = !{!585, !586, !587}
!585 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!586 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!587 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!588 = !{!589, !659, !664, !624, !583, !577, !669, !106}
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !578, line: 523, size: 288, elements: !592)
!592 = !{!593, !614, !620, !625, !629, !630, !631, !635, !655}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !591, file: !578, line: 524, baseType: !594, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DISubroutineType(types: !596)
!596 = !{!109, !597, !612, !613}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !315, line: 378, size: 192, elements: !600)
!600 = !{!601, !602, !603, !604, !610, !611}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !599, file: !315, line: 380, baseType: !318, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !599, file: !315, line: 382, baseType: !13, size: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !599, file: !315, line: 384, baseType: !13, size: 32, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !599, file: !315, line: 386, baseType: !605, size: 32, offset: 96)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !315, line: 351, size: 16, elements: !607)
!607 = !{!608, !609}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !606, file: !315, line: 359, baseType: !178, size: 8)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !606, file: !315, line: 364, baseType: !328, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !599, file: !315, line: 388, baseType: !106, size: 32, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !599, file: !315, line: 396, baseType: !331, size: 32, offset: 160)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !578, line: 237, baseType: !178)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !578, line: 257, baseType: !110)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !591, file: !578, line: 530, baseType: !615, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 32)
!616 = !DISubroutineType(types: !617)
!617 = !{!109, !597, !618}
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !578, line: 229, baseType: !110)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !591, file: !578, line: 532, baseType: !621, size: 32, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!622 = !DISubroutineType(types: !623)
!623 = !{!109, !597, !624, !619}
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !578, line: 216, baseType: !110)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !591, file: !578, line: 535, baseType: !626, size: 32, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 32)
!627 = !DISubroutineType(types: !628)
!628 = !{!109, !597, !624}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !591, file: !578, line: 537, baseType: !626, size: 32, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !591, file: !578, line: 539, baseType: !626, size: 32, offset: 160)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !591, file: !578, line: 541, baseType: !632, size: 32, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = !DISubroutineType(types: !634)
!634 = !{!109, !597, !612, !577, !583}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !591, file: !578, line: 544, baseType: !636, size: 32, offset: 224)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 32)
!637 = !DISubroutineType(types: !638)
!638 = !{!109, !597, !639, !328}
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !578, line: 478, size: 96, elements: !641)
!641 = !{!642, !649, !654}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !640, file: !578, line: 482, baseType: !643, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !644, line: 33, baseType: !645)
!644 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !644, line: 29, size: 32, elements: !646)
!646 = !{!647}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !645, file: !644, line: 30, baseType: !648, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !640, file: !578, line: 485, baseType: !650, size: 32, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !578, line: 464, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 32)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !597, !639, !624}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !640, file: !578, line: 493, baseType: !624, size: 32, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !591, file: !578, line: 547, baseType: !656, size: 32, offset: 256)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 32)
!657 = !DISubroutineType(types: !658)
!658 = !{!110, !597}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !578, line: 428, size: 32, elements: !662)
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !661, file: !578, line: 434, baseType: !624, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !578, line: 441, size: 32, elements: !667)
!667 = !{!668}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !666, file: !578, line: 447, baseType: !624, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!670 = !{!572}
!671 = !DIFile(filename: "zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !306, line: 51, size: 64, elements: !674)
!674 = !{!675, !679}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !673, file: !306, line: 60, baseType: !676, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!677 = !DISubroutineType(types: !678)
!678 = !{!109, !597}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !673, file: !306, line: 65, baseType: !597, size: 32, offset: 32)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !682, file: !754, line: 48, type: !830, isLocal: true, isDefinition: true)
!682 = distinct !DICompileUnit(language: DW_LANG_C99, file: !683, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !684, retainedTypes: !740, globals: !751, splitDebugInlining: false, nameTableKind: None)
!683 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/synchronization")
!684 = !{!30, !685}
!685 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !278, line: 69, baseType: !109, size: 32, elements: !686)
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739}
!687 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!688 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!689 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!690 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!691 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!692 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!693 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!694 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!695 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!696 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!697 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!698 = !DIEnumerator(name: "TAMPER_STAMP_IRQn", value: 2)
!699 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!700 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!701 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!702 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!703 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!704 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!705 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!706 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!707 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!708 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!709 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!710 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!711 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!712 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!713 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!714 = !DIEnumerator(name: "ADC1_IRQn", value: 18)
!715 = !DIEnumerator(name: "USB_HP_IRQn", value: 19)
!716 = !DIEnumerator(name: "USB_LP_IRQn", value: 20)
!717 = !DIEnumerator(name: "DAC_IRQn", value: 21)
!718 = !DIEnumerator(name: "COMP_IRQn", value: 22)
!719 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!720 = !DIEnumerator(name: "TIM9_IRQn", value: 25)
!721 = !DIEnumerator(name: "TIM10_IRQn", value: 26)
!722 = !DIEnumerator(name: "TIM11_IRQn", value: 27)
!723 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!724 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!725 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!726 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!727 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!728 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!729 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!730 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!731 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!732 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!733 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!734 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!735 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!736 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!737 = !DIEnumerator(name: "USB_FS_WKUP_IRQn", value: 42)
!738 = !DIEnumerator(name: "TIM6_IRQn", value: 43)
!739 = !DIEnumerator(name: "TIM7_IRQn", value: 44)
!740 = !{!107, !109, !106, !741}
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !278, line: 270, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 262, size: 192, elements: !744)
!744 = !{!745, !746, !747, !748, !749, !750}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !743, file: !278, line: 264, baseType: !282, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !743, file: !278, line: 265, baseType: !282, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !743, file: !278, line: 266, baseType: !282, size: 32, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !743, file: !278, line: 267, baseType: !282, size: 32, offset: 96)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !743, file: !278, line: 268, baseType: !282, size: 32, offset: 128)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !743, file: !278, line: 269, baseType: !282, size: 32, offset: 160)
!751 = !{!752, !758, !774, !785, !802, !680, !804, !818, !820, !822, !824, !826, !828}
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !682, file: !754, line: 424, type: !755, isLocal: false, isDefinition: true, align: 16)
!754 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 64, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 4)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "__device_dts_ord_32", scope: !682, file: !754, line: 424, type: !760, isLocal: false, isDefinition: true, align: 32)
!760 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !315, line: 378, size: 192, elements: !762)
!762 = !{!763, !764, !765, !766, !772, !773}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !761, file: !315, line: 380, baseType: !318, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !761, file: !315, line: 382, baseType: !13, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !761, file: !315, line: 384, baseType: !13, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !761, file: !315, line: 386, baseType: !767, size: 32, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 32)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !315, line: 351, size: 16, elements: !769)
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !768, file: !315, line: 359, baseType: !178, size: 8)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !768, file: !315, line: 364, baseType: !328, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !761, file: !315, line: 388, baseType: !106, size: 32, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !761, file: !315, line: 396, baseType: !331, size: 32, offset: 160)
!774 = !DIGlobalVariableExpression(var: !775, expr: !DIExpression())
!775 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_32", scope: !682, file: !754, line: 424, type: !776, isLocal: true, isDefinition: true, align: 32)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !306, line: 51, size: 64, elements: !778)
!778 = !{!779, !784}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !777, file: !306, line: 60, baseType: !780, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DISubroutineType(types: !782)
!782 = !{!109, !783}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !777, file: !306, line: 65, baseType: !783, size: 32, offset: 32)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "exti_data", scope: !682, file: !754, line: 423, type: !787, isLocal: true, isDefinition: true)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !754, line: 107, size: 1024, elements: !788)
!788 = !{!789}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !787, file: !754, line: 109, baseType: !790, size: 1024)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !791, size: 1024, elements: !800)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !754, line: 101, size: 64, elements: !792)
!792 = !{!793, !799}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !791, file: !754, line: 102, baseType: !794, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !795, line: 63, baseType: !796)
!795 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 32)
!797 = !DISubroutineType(types: !798)
!798 = !{null, !109, !106}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !791, file: !754, line: 103, baseType: !106, size: 32, offset: 32)
!800 = !{!801}
!801 = !DISubrange(count: 16)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_32", scope: !682, file: !754, line: 424, type: !768, isLocal: true, isDefinition: true, align: 8)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !806, file: !754, line: 493, type: !811, isLocal: true, isDefinition: true, align: 32)
!806 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !754, file: !754, line: 460, type: !807, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !682, retainedNodes: !809)
!807 = !DISubroutineType(types: !808)
!808 = !{null, !783}
!809 = !{!810}
!810 = !DILocalVariable(name: "dev", arg: 1, scope: !806, file: !754, line: 460, type: !783)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !812)
!812 = !{!813, !815, !816, !817}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !811, file: !10, line: 55, baseType: !814, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !109)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !811, file: !10, line: 57, baseType: !814, size: 32, offset: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !811, file: !10, line: 59, baseType: !106, size: 32, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !811, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !806, file: !754, line: 497, type: !811, isLocal: true, isDefinition: true, align: 32)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !806, file: !754, line: 507, type: !811, isLocal: true, isDefinition: true, align: 32)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !806, file: !754, line: 512, type: !811, isLocal: true, isDefinition: true, align: 32)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !806, file: !754, line: 516, type: !811, isLocal: true, isDefinition: true, align: 32)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !806, file: !754, line: 523, type: !811, isLocal: true, isDefinition: true, align: 32)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !806, file: !754, line: 527, type: !811, isLocal: true, isDefinition: true, align: 32)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !831, size: 512, elements: !800)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !278, line: 127, baseType: !685)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !835, file: !840, line: 21, type: !860, isLocal: false, isDefinition: true, align: 16)
!835 = distinct !DICompileUnit(language: DW_LANG_C99, file: !836, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !837, splitDebugInlining: false, nameTableKind: None)
!836 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/synchronization/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/synchronization")
!837 = !{!838, !833, !844, !846, !848, !850, !852, !854, !856, !858}
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !835, file: !840, line: 16, type: !841, isLocal: false, isDefinition: true, align: 16)
!840 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/synchronization")
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 176, elements: !842)
!842 = !{!843}
!843 = !DISubrange(count: 11)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_17", scope: !835, file: !840, line: 28, type: !755, isLocal: false, isDefinition: true, align: 16)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !835, file: !840, line: 35, type: !755, isLocal: false, isDefinition: true, align: 16)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_53", scope: !835, file: !840, line: 42, type: !755, isLocal: false, isDefinition: true, align: 16)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_59", scope: !835, file: !840, line: 49, type: !755, isLocal: false, isDefinition: true, align: 16)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_15", scope: !835, file: !840, line: 56, type: !755, isLocal: false, isDefinition: true, align: 16)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !835, file: !840, line: 63, type: !755, isLocal: false, isDefinition: true, align: 16)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !835, file: !840, line: 70, type: !755, isLocal: false, isDefinition: true, align: 16)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !835, file: !840, line: 77, type: !755, isLocal: false, isDefinition: true, align: 16)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 48, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 3)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !865, file: !909, line: 398, type: !940, isLocal: true, isDefinition: true)
!865 = distinct !DICompileUnit(language: DW_LANG_C99, file: !866, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !867, retainedTypes: !880, globals: !906, splitDebugInlining: false, nameTableKind: None)
!866 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/synchronization")
!867 = !{!868, !30, !873}
!868 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !869, line: 190, baseType: !32, size: 32, elements: !870)
!869 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l1xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!870 = !{!871, !872}
!871 = !DIEnumerator(name: "SUCCESS", value: 0)
!872 = !DIEnumerator(name: "ERROR", value: 1)
!873 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !874, line: 44, baseType: !32, size: 32, elements: !875)
!874 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!875 = !{!876, !877, !878, !879}
!876 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!877 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!878 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!879 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!880 = !{!106, !109, !110, !881, !899, !905}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !278, line: 386, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 370, size: 448, elements: !884)
!884 = !{!885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !883, file: !278, line: 372, baseType: !282, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !883, file: !278, line: 373, baseType: !282, size: 32, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !883, file: !278, line: 374, baseType: !282, size: 32, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !883, file: !278, line: 375, baseType: !282, size: 32, offset: 96)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !883, file: !278, line: 376, baseType: !282, size: 32, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !883, file: !278, line: 377, baseType: !282, size: 32, offset: 160)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !883, file: !278, line: 378, baseType: !282, size: 32, offset: 192)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !883, file: !278, line: 379, baseType: !282, size: 32, offset: 224)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !883, file: !278, line: 380, baseType: !282, size: 32, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !883, file: !278, line: 381, baseType: !282, size: 32, offset: 288)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !883, file: !278, line: 382, baseType: !282, size: 32, offset: 320)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !883, file: !278, line: 383, baseType: !282, size: 32, offset: 352)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !883, file: !278, line: 384, baseType: !282, size: 32, offset: 384)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !883, file: !278, line: 385, baseType: !282, size: 32, offset: 416)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 32)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !901, line: 343, size: 64, elements: !902)
!901 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!902 = !{!903, !904}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !900, file: !901, line: 344, baseType: !110, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !900, file: !901, line: 345, baseType: !110, size: 32, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!906 = !{!907, !911, !927, !938, !863}
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !865, file: !909, line: 752, type: !910, isLocal: false, isDefinition: true, align: 16)
!909 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 512, elements: !225)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !865, file: !909, line: 752, type: !913, isLocal: false, isDefinition: true, align: 32)
!913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !914)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !315, line: 378, size: 192, elements: !915)
!915 = !{!916, !917, !918, !919, !925, !926}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !914, file: !315, line: 380, baseType: !318, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !914, file: !315, line: 382, baseType: !13, size: 32, offset: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !914, file: !315, line: 384, baseType: !13, size: 32, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !914, file: !315, line: 386, baseType: !920, size: 32, offset: 96)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 32)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !315, line: 351, size: 16, elements: !922)
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !921, file: !315, line: 359, baseType: !178, size: 8)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !921, file: !315, line: 364, baseType: !328, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !914, file: !315, line: 388, baseType: !106, size: 32, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !914, file: !315, line: 396, baseType: !331, size: 32, offset: 160)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !865, file: !909, line: 752, type: !929, isLocal: true, isDefinition: true, align: 32)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !306, line: 51, size: 64, elements: !931)
!931 = !{!932, !937}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !930, file: !306, line: 60, baseType: !933, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 32)
!934 = !DISubroutineType(types: !935)
!935 = !{!109, !936}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !930, file: !306, line: 65, baseType: !936, size: 32, offset: 32)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !865, file: !909, line: 752, type: !921, isLocal: true, isDefinition: true, align: 8)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !874, line: 100, size: 224, elements: !941)
!941 = !{!942, !948, !949, !958, !963, !968, !974}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !940, file: !874, line: 101, baseType: !943, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !874, line: 76, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = !DISubroutineType(types: !946)
!946 = !{!109, !936, !947}
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !874, line: 56, baseType: !106)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !940, file: !874, line: 102, baseType: !943, size: 32, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !940, file: !874, line: 103, baseType: !950, size: 32, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !874, line: 83, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = !DISubroutineType(types: !953)
!953 = !{!109, !936, !947, !954, !106}
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !874, line: 72, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !936, !947, !106}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !940, file: !874, line: 104, baseType: !959, size: 32, offset: 96)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !874, line: 79, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = !DISubroutineType(types: !962)
!962 = !{!109, !936, !947, !905}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !940, file: !874, line: 105, baseType: !964, size: 32, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !874, line: 88, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = !DISubroutineType(types: !967)
!967 = !{!873, !936, !947}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !940, file: !874, line: 106, baseType: !969, size: 32, offset: 160)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !874, line: 92, baseType: !970)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!971 = !DISubroutineType(types: !972)
!972 = !{!109, !936, !947, !973}
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !874, line: 64, baseType: !106)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !940, file: !874, line: 107, baseType: !975, size: 32, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !874, line: 96, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!977 = !DISubroutineType(types: !978)
!978 = !{!109, !936, !947, !106}
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !981, file: !1038, line: 603, type: !1040, isLocal: true, isDefinition: true, align: 32)
!981 = distinct !DICompileUnit(language: DW_LANG_C99, file: !982, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !983, globals: !1035, splitDebugInlining: false, nameTableKind: None)
!982 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/synchronization")
!983 = !{!106, !109, !984}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !987, line: 336, size: 160, elements: !988)
!987 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!988 = !{!989, !1009, !1013, !1017, !1030}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !986, file: !987, line: 365, baseType: !990, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = !DISubroutineType(types: !992)
!992 = !{!109, !993, !1008}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !315, line: 378, size: 192, elements: !996)
!996 = !{!997, !998, !999, !1000, !1006, !1007}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !995, file: !315, line: 380, baseType: !318, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !995, file: !315, line: 382, baseType: !13, size: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !995, file: !315, line: 384, baseType: !13, size: 32, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !995, file: !315, line: 386, baseType: !1001, size: 32, offset: 96)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 32)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !315, line: 351, size: 16, elements: !1003)
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1002, file: !315, line: 359, baseType: !178, size: 8)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1002, file: !315, line: 364, baseType: !328, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !995, file: !315, line: 388, baseType: !106, size: 32, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !995, file: !315, line: 396, baseType: !331, size: 32, offset: 160)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !986, file: !987, line: 366, baseType: !1010, size: 32, offset: 32)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 32)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{null, !993, !179}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !986, file: !987, line: 374, baseType: !1014, size: 32, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 32)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!109, !993}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !986, file: !987, line: 377, baseType: !1018, size: 32, offset: 96)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 32)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!109, !993, !1021}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !987, line: 122, size: 64, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !1023, file: !987, line: 123, baseType: !110, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !1023, file: !987, line: 124, baseType: !178, size: 8, offset: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !1023, file: !987, line: 125, baseType: !178, size: 8, offset: 40)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !1023, file: !987, line: 126, baseType: !178, size: 8, offset: 48)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !1023, file: !987, line: 127, baseType: !178, size: 8, offset: 56)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !986, file: !987, line: 379, baseType: !1031, size: 32, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 32)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!109, !993, !1034}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 32)
!1035 = !{!979, !1036}
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !981, file: !1038, line: 38, type: !1039, isLocal: true, isDefinition: true)
