; ModuleID = 'build/actinius_icarus/crypto/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.mode_test = type { i8*, void (%struct.device*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.ccm_params }
%struct.ccm_params = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/crypto/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/crypto")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/crypto")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !294, line: 18, type: !371, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !123, globals: !290, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/crypto/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/crypto")
!29 = !{!30, !39, !42, !46, !116}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_mode", file: !31, line: 44, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/crypto/cipher.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38}
!34 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_ECB", value: 1)
!35 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CBC", value: 2)
!36 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CTR", value: 3)
!37 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CCM", value: 4)
!38 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_GCM", value: 5)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_algo", file: !31, line: 29, baseType: !32, size: 32, elements: !40)
!40 = !{!41}
!41 = !DIEnumerator(name: "CRYPTO_CIPHER_ALGO_AES", value: 1)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_op", file: !31, line: 34, baseType: !32, size: 32, elements: !43)
!43 = !{!44, !45}
!44 = !DIEnumerator(name: "CRYPTO_CIPHER_OP_DECRYPT", value: 0)
!45 = !DIEnumerator(name: "CRYPTO_CIPHER_OP_ENCRYPT", value: 1)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !47, line: 27, baseType: !32, size: 32, elements: !48)
!47 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!49 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!50 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!51 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!52 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!53 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!54 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!55 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!56 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!57 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!58 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!59 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!60 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!61 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!62 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!63 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!64 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!65 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!115 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hash_algo", file: !117, line: 26, baseType: !32, size: 32, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/crypto/hash.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !120, !121, !122}
!119 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA224", value: 1)
!120 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA256", value: 2)
!121 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA384", value: 3)
!122 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA512", value: 4)
!123 = !{!124, !125, !126}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!125 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_driver_api", file: !128, line: 65, size: 224, elements: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/crypto/crypto.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = !{!130, !161, !241, !245, !253, !278, !282}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "query_hw_caps", scope: !127, file: !128, line: 66, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!132 = !DISubroutineType(types: !133)
!133 = !{!125, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = !{!139, !143, !144, !145, !154, !155}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !136, file: !137, line: 380, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !136, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !136, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !136, file: !137, line: 386, baseType: !146, size: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !137, line: 351, size: 16, elements: !148)
!148 = !{!149, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !147, file: !137, line: 359, baseType: !150, size: 8)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !151)
!151 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !147, file: !137, line: 364, baseType: !153, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!153 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !136, file: !137, line: 388, baseType: !124, size: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !136, file: !137, line: 396, baseType: !156, size: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !137, line: 43, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !160)
!160 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_begin_session", scope: !127, file: !128, line: 69, baseType: !162, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DISubroutineType(types: !164)
!164 = !{!125, !134, !165, !39, !30, !42}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ctx", file: !31, line: 110, size: 256, elements: !167)
!167 = !{!168, !212, !217, !218, !219, !220, !239, !240}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !166, file: !31, line: 116, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ops", file: !31, line: 74, size: 64, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_mode", scope: !169, file: !31, line: 76, baseType: !30, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !169, file: !31, line: 78, baseType: !173, size: 32, offset: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !31, line: 78, size: 32, elements: !174)
!174 = !{!175, !190, !195, !197, !210}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "block_crypt_hndlr", scope: !173, file: !31, line: 79, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_op_t", file: !31, line: 57, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DISubroutineType(types: !179)
!179 = !{!125, !165, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_pkt", file: !31, line: 180, size: 192, elements: !182)
!182 = !{!183, !185, !186, !187, !188, !189}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !181, file: !31, line: 183, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !181, file: !31, line: 186, baseType: !125, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !181, file: !31, line: 192, baseType: !184, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf_max", scope: !181, file: !31, line: 197, baseType: !125, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "out_len", scope: !181, file: !31, line: 202, baseType: !125, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !181, file: !31, line: 208, baseType: !165, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cbc_crypt_hndlr", scope: !173, file: !31, line: 80, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "cbc_op_t", file: !31, line: 62, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DISubroutineType(types: !194)
!194 = !{!125, !165, !180, !184}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_crypt_hndlr", scope: !173, file: !31, line: 81, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ctr_op_t", file: !31, line: 65, baseType: !192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_crypt_hndlr", scope: !173, file: !31, line: 82, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ccm_op_t", file: !31, line: 68, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!125, !165, !202, !184}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_aead_pkt", file: !31, line: 217, size: 128, elements: !204)
!204 = !{!205, !206, !207, !209}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pkt", scope: !203, file: !31, line: 219, baseType: !180, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !203, file: !31, line: 224, baseType: !184, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ad_len", scope: !203, file: !31, line: 227, baseType: !208, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !203, file: !31, line: 233, baseType: !184, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_crypt_hndlr", scope: !173, file: !31, line: 83, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcm_op_t", file: !31, line: 71, baseType: !199)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !166, file: !31, line: 126, baseType: !213, size: 32, offset: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !31, line: 119, size: 32, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "bit_stream", scope: !213, file: !31, line: 121, baseType: !184, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !213, file: !31, line: 125, baseType: !124, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !166, file: !31, line: 131, baseType: !134, size: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !166, file: !31, line: 140, baseType: !124, size: 32, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "app_sessn_state", scope: !166, file: !31, line: 146, baseType: !124, size: 32, offset: 160)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mode_params", scope: !166, file: !31, line: 156, baseType: !221, size: 32, offset: 192)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !31, line: 152, size: 32, elements: !222)
!222 = !{!223, !230, !234}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_info", scope: !221, file: !31, line: 153, baseType: !224, size: 32)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ccm_params", file: !31, line: 87, size: 32, elements: !225)
!225 = !{!226, !229}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !224, file: !31, line: 88, baseType: !227, size: 16)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !228)
!228 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !224, file: !31, line: 89, baseType: !227, size: 16, offset: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_info", scope: !221, file: !31, line: 154, baseType: !231, size: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctr_params", file: !31, line: 92, size: 32, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_len", scope: !231, file: !31, line: 96, baseType: !208, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_info", scope: !221, file: !31, line: 155, baseType: !235, size: 32)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gcm_params", file: !31, line: 99, size: 32, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !235, file: !31, line: 100, baseType: !227, size: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !235, file: !31, line: 101, baseType: !227, size: 16, offset: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !166, file: !31, line: 161, baseType: !227, size: 16, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !166, file: !31, line: 169, baseType: !227, size: 16, offset: 240)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_free_session", scope: !127, file: !128, line: 74, baseType: !242, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DISubroutineType(types: !244)
!244 = !{!125, !134, !165}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_async_callback_set", scope: !127, file: !128, line: 77, baseType: !246, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DISubroutineType(types: !248)
!248 = !{!125, !134, !249}
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "cipher_completion_cb", file: !31, line: 242, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !180, !125}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "hash_begin_session", scope: !127, file: !128, line: 81, baseType: !254, size: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DISubroutineType(types: !256)
!256 = !{!125, !134, !257, !116}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_ctx", file: !117, line: 47, size: 128, elements: !259)
!259 = !{!260, !261, !262, !276, !277}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !258, file: !117, line: 51, baseType: !134, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !258, file: !117, line: 60, baseType: !124, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "hash_hndlr", scope: !258, file: !117, line: 65, baseType: !263, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_op_t", file: !117, line: 38, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DISubroutineType(types: !266)
!266 = !{!125, !257, !267, !153}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_pkt", file: !117, line: 88, size: 128, elements: !269)
!269 = !{!270, !271, !274, !275}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !268, file: !117, line: 91, baseType: !184, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !268, file: !117, line: 94, baseType: !272, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !273, line: 214, baseType: !32)
!273 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !268, file: !117, line: 101, baseType: !184, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !268, file: !117, line: 107, baseType: !257, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "started", scope: !258, file: !117, line: 70, baseType: !153, size: 8, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !258, file: !117, line: 78, baseType: !227, size: 16, offset: 112)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "hash_free_session", scope: !127, file: !128, line: 84, baseType: !279, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DISubroutineType(types: !281)
!281 = !{!125, !134, !257}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "hash_async_callback_set", scope: !127, file: !128, line: 86, baseType: !283, size: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DISubroutineType(types: !285)
!285 = !{!125, !134, !286}
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_completion_cb", file: !117, line: 114, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !267, !125}
!290 = !{!25, !291, !314, !316, !318, !320, !324, !327, !329, !334, !339, !344, !349, !351, !356, !361, !366}
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "iv", scope: !293, file: !294, line: 227, type: !311, isLocal: true, isDefinition: true)
!293 = distinct !DISubprogram(name: "cbc_mode", scope: !294, file: !294, line: 205, type: !295, scopeLine: 206, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !297)
!294 = !DIFile(filename: "zephyr/samples/drivers/crypto/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!295 = !DISubroutineType(types: !296)
!296 = !{null, !134}
!297 = !{!298, !299, !303, !307, !308, !309, !310}
!298 = !DILocalVariable(name: "dev", arg: 1, scope: !293, file: !294, line: 205, type: !134)
!299 = !DILocalVariable(name: "encrypted", scope: !293, file: !294, line: 207, type: !300)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 640, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 80)
!303 = !DILocalVariable(name: "decrypted", scope: !293, file: !294, line: 208, type: !304)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 512, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 64)
!307 = !DILocalVariable(name: "ini", scope: !293, file: !294, line: 209, type: !166)
!308 = !DILocalVariable(name: "encrypt", scope: !293, file: !294, line: 214, type: !181)
!309 = !DILocalVariable(name: "decrypt", scope: !293, file: !294, line: 220, type: !181)
!310 = !DILabel(scope: !293, name: "out", file: !294, line: 279)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 128, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 16)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "cap_flags", scope: !27, file: !294, line: 48, type: !208, isLocal: false, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "key", scope: !27, file: !294, line: 34, type: !311, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "plaintext", scope: !27, file: !294, line: 39, type: !304, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "cbc_ciphertext", scope: !27, file: !294, line: 195, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 640, elements: !301)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "ctr_ciphertext", scope: !27, file: !294, line: 283, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 512, elements: !305)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "ccm_key", scope: !27, file: !294, line: 373, type: !311, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "ccm_data", scope: !27, file: !294, line: 384, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 184, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 23)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "ccm_hdr", scope: !27, file: !294, line: 381, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 64, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 8)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "ccm_nonce", scope: !27, file: !294, line: 377, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 104, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 13)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "ccm_expected", scope: !27, file: !294, line: 388, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 248, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 31)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "gcm_key", scope: !27, file: !294, line: 485, type: !311, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "gcm_data", scope: !27, file: !294, line: 496, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 336, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 42)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "gcm_hdr", scope: !27, file: !294, line: 492, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 160, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 20)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "gcm_nonce", scope: !27, file: !294, line: 489, type: !363, isLocal: true, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 96, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 12)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "gcm_expected", scope: !27, file: !294, line: 502, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 464, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 58)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !374)
!373 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !372, file: !373, line: 17, baseType: !140, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !372, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !379, file: !395, line: 18, type: !396, isLocal: false, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !381, globals: !394, splitDebugInlining: false, nameTableKind: None)
!380 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/crypto")
!381 = !{!22, !124, !24, !382, !384, !386, !272, !125, !387, !388, !390, !392, !393, !184, !227, !140}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!394 = !{!377}
!395 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !397, file: !373, line: 17, baseType: !140, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !397, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "_char_out", scope: !403, file: !408, line: 54, type: !409, isLocal: false, isDefinition: true)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !406, globals: !407, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/crypto")
!405 = !{!46}
!406 = !{!124, !125}
!407 = !{!401}
!408 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DISubroutineType(types: !411)
!411 = !{!125, !125}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !414, file: !467, line: 35, type: !484, isLocal: false, isDefinition: true)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !416, globals: !464, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/crypto")
!416 = !{!124, !125, !417, !208, !428}
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !419, file: !418, line: 167, baseType: !427)
!418 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!419 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !418, file: !418, line: 134, type: !420, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !414, retainedNodes: !422)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !208}
!422 = !{!423, !424, !426}
!423 = !DILocalVariable(name: "time_us", arg: 1, scope: !419, file: !418, line: 134, type: !208)
!424 = !DILocalVariable(name: "delay_cycles", scope: !419, file: !418, line: 168, type: !425)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!426 = !DILocalVariable(name: "cycles", scope: !419, file: !418, line: 171, type: !208)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !430, line: 1928, baseType: !431)
!430 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !430, line: 1909, size: 11360, elements: !432)
!432 = !{!433, !439, !440, !441, !442, !446, !447, !448, !449, !453, !454, !456, !457, !458, !459, !460, !462, !463}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !431, file: !430, line: 1910, baseType: !434, size: 8192)
!434 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 8192, elements: !437)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!436 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !208)
!437 = !{!438}
!438 = !DISubrange(count: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !431, file: !430, line: 1911, baseType: !435, size: 32, offset: 8192)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !431, file: !430, line: 1912, baseType: !435, size: 32, offset: 8224)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !431, file: !430, line: 1913, baseType: !435, size: 32, offset: 8256)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !431, file: !430, line: 1914, baseType: !443, size: 1984, offset: 8288)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 1984, elements: !444)
!444 = !{!445}
!445 = !DISubrange(count: 62)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !431, file: !430, line: 1915, baseType: !436, size: 32, offset: 10272)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !431, file: !430, line: 1916, baseType: !435, size: 32, offset: 10304)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !431, file: !430, line: 1917, baseType: !436, size: 32, offset: 10336)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !431, file: !430, line: 1918, baseType: !450, size: 96, offset: 10368)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 96, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 3)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !431, file: !430, line: 1919, baseType: !436, size: 32, offset: 10464)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !431, file: !430, line: 1920, baseType: !455, size: 256, offset: 10496)
!455 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 256, elements: !337)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !431, file: !430, line: 1921, baseType: !436, size: 32, offset: 10752)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !431, file: !430, line: 1922, baseType: !435, size: 32, offset: 10784)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !431, file: !430, line: 1923, baseType: !436, size: 32, offset: 10816)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !431, file: !430, line: 1924, baseType: !436, size: 32, offset: 10848)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !431, file: !430, line: 1925, baseType: !461, size: 416, offset: 10880)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 416, elements: !342)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !431, file: !430, line: 1926, baseType: !436, size: 32, offset: 11296)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !431, file: !430, line: 1927, baseType: !436, size: 32, offset: 11328)
!464 = !{!412, !465, !480}
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !414, file: !467, line: 65, type: !468, isLocal: true, isDefinition: true, align: 32)
!467 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !470, line: 51, size: 64, elements: !471)
!470 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!471 = !{!472, !479}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !469, file: !470, line: 60, baseType: !473, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!474 = !DISubroutineType(types: !475)
!475 = !{!125, !476}
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!478 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !470, line: 48, flags: DIFlagFwdDecl)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !469, file: !470, line: 65, baseType: !476, size: 32, offset: 32)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !419, file: !418, line: 161, type: !482, isLocal: true, isDefinition: true, align: 128)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 48, elements: !451)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !485, file: !373, line: 17, baseType: !140, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !485, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !491, file: !530, line: 22, type: !562, isLocal: false, isDefinition: true)
!491 = distinct !DICompileUnit(language: DW_LANG_C99, file: !492, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !493, retainedTypes: !505, globals: !527, splitDebugInlining: false, nameTableKind: None)
!492 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/crypto")
!493 = !{!494, !46}
!494 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !495, line: 27, baseType: !32, size: 32, elements: !496)
!495 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504}
!497 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!498 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!499 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!500 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!501 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!502 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!503 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!504 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!505 = !{!124, !506, !125, !24, !509, !393, !208, !525}
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !507, line: 46, baseType: !508)
!507 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !391)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !511, line: 54, size: 96, elements: !512)
!511 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!512 = !{!513, !520, !524}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !510, file: !511, line: 55, baseType: !514, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !515, line: 33, baseType: !516)
!515 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !515, line: 29, size: 32, elements: !517)
!517 = !{!518}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !516, file: !515, line: 30, baseType: !519, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !510, file: !511, line: 60, baseType: !521, size: 32, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 32)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !494}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !510, file: !511, line: 65, baseType: !521, size: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !526)
!526 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!527 = !{!489, !528, !536, !541, !543, !552, !554}
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !491, file: !530, line: 27, type: !531, isLocal: true, isDefinition: true)
!530 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 32, elements: !534)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !533, line: 22, baseType: !389)
!533 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!534 = !{!535}
!535 = !DISubrange(count: 1)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !491, file: !530, line: 44, type: !538, isLocal: true, isDefinition: true)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !539, line: 43, elements: !540)
!539 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!540 = !{}
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !491, file: !530, line: 49, type: !538, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !491, file: !530, line: 36, type: !545, isLocal: true, isDefinition: true)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 128, elements: !534)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !495, line: 114, size: 128, elements: !547)
!547 = !{!548, !549, !550, !551}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !546, file: !495, line: 115, baseType: !494, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !546, file: !495, line: 141, baseType: !150, size: 8, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !546, file: !495, line: 149, baseType: !208, size: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !546, file: !495, line: 156, baseType: !208, size: 32, offset: 96)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !491, file: !530, line: 40, type: !545, isLocal: true, isDefinition: true)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !491, file: !530, line: 28, type: !556, isLocal: true, isDefinition: true)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !515, line: 40, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !515, line: 35, size: 64, elements: !558)
!558 = !{!559, !561}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !557, file: !515, line: 36, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !557, file: !515, line: 37, baseType: !560, size: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !563, file: !373, line: 17, baseType: !140, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !563, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!567 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!568 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !571, file: !598, line: 50, type: !585, isLocal: true, isDefinition: true)
!571 = distinct !DICompileUnit(language: DW_LANG_C99, file: !572, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !493, retainedTypes: !573, globals: !595, splitDebugInlining: false, nameTableKind: None)
!572 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/crypto")
!573 = !{!159, !506, !272, !125, !124, !208, !525, !574, !393, !585, !586}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !576, line: 45, size: 64, elements: !577)
!576 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!577 = !{!578, !584}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !575, file: !576, line: 46, baseType: !579, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !515, line: 33, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !515, line: 29, size: 32, elements: !581)
!581 = !{!582}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !580, file: !515, line: 30, baseType: !583, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !575, file: !576, line: 48, baseType: !208, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !125)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 32)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !576, line: 38, size: 64, elements: !588)
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !587, file: !576, line: 39, baseType: !579, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !587, file: !576, line: 41, baseType: !591, size: 32, offset: 32)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !576, line: 35, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !585}
!595 = !{!596, !600, !608, !569, !610, !620}
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "latency_lock", scope: !571, file: !598, line: 44, type: !599, isLocal: true, isDefinition: true)
!598 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !539, line: 43, elements: !540)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !571, file: !598, line: 46, type: !602, isLocal: true, isDefinition: true)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !515, line: 40, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !515, line: 35, size: 64, elements: !604)
!604 = !{!605, !607}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !603, file: !515, line: 36, baseType: !606, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !603, file: !515, line: 37, baseType: !606, size: 32, offset: 32)
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "latency_subs", scope: !571, file: !598, line: 52, type: !602, isLocal: true, isDefinition: true)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !571, file: !598, line: 39, type: !612, isLocal: true, isDefinition: true)
!612 = !DICompositeType(tag: DW_TAG_array_type, baseType: !613, elements: !618)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !598, line: 35, size: 96, elements: !614)
!614 = !{!615, !616, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !613, file: !598, line: 36, baseType: !494, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !613, file: !598, line: 37, baseType: !150, size: 8, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !613, file: !598, line: 38, baseType: !532, size: 32, offset: 64)
!618 = !{!619}
!619 = !DISubrange(count: 0)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !571, file: !598, line: 48, type: !585, isLocal: true, isDefinition: true)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !624, file: !631, line: 47, type: !644, isLocal: true, isDefinition: true)
!624 = distinct !DICompileUnit(language: DW_LANG_C99, file: !625, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !626, retainedTypes: !627, globals: !628, splitDebugInlining: false, nameTableKind: None)
!625 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/crypto")
!626 = !{!494}
!627 = !{!272, !125}
!628 = !{!629, !622, !641}
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "cpus_states", scope: !624, file: !631, line: 50, type: !632, isLocal: true, isDefinition: true)
!631 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 32, elements: !534)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !495, line: 114, size: 128, elements: !636)
!636 = !{!637, !638, !639, !640}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !635, file: !495, line: 115, baseType: !494, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !635, file: !495, line: 141, baseType: !150, size: 8, offset: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !635, file: !495, line: 149, baseType: !208, size: 32, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !635, file: !495, line: 156, baseType: !208, size: 32, offset: 96)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !624, file: !631, line: 55, type: !643, isLocal: true, isDefinition: true)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 8, elements: !534)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, elements: !618)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "inv_sbox", scope: !647, file: !661, line: 37, type: !662, isLocal: true, isDefinition: true)
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !649, globals: !660, splitDebugInlining: false, nameTableKind: None)
!648 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/modules/crypto/tinycrypt/lib/source/aes_decrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/crypto")
!649 = !{!184, !650, !651, !150}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCAesKeySched_t", file: !652, line: 66, baseType: !653)
!652 = !DIFile(filename: "modules/crypto/tinycrypt/lib/include/tinycrypt/aes.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 32)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tc_aes_key_sched_struct", file: !652, line: 64, size: 1408, elements: !655)
!655 = !{!656}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !654, file: !652, line: 65, baseType: !657, size: 1408)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1408, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 44)
!660 = !{!645}
!661 = !DIFile(filename: "modules/crypto/tinycrypt/lib/source/aes_decrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 2048, elements: !437)
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "sbox", scope: !665, file: !674, line: 37, type: !662, isLocal: true, isDefinition: true)
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !667, globals: !673, splitDebugInlining: false, nameTableKind: None)
!666 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/modules/crypto/tinycrypt/lib/source/aes_encrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/crypto")
!667 = !{!668, !650, !184, !150}
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCAesKeySched_t", file: !652, line: 66, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tc_aes_key_sched_struct", file: !652, line: 64, size: 1408, elements: !671)
!671 = !{!672}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !670, file: !652, line: 65, baseType: !657, size: 1408)
!673 = !{!663}
!674 = !DIFile(filename: "modules/crypto/tinycrypt/lib/source/aes_encrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !677, file: !684, line: 17, type: !820, isLocal: false, isDefinition: true)
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !678, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !679, globals: !680, splitDebugInlining: false, nameTableKind: None)
!678 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/crypto")
!679 = !{!272, !125, !208, !124}
!680 = !{!675, !681, !816}
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !683, file: !684, line: 198, type: !803, isLocal: true, isDefinition: true)
!683 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !684, file: !684, line: 175, type: !685, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !677, retainedNodes: !800)
!684 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!685 = !DISubroutineType(types: !686)
!686 = !{null, !687}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !689, line: 245, size: 1024, elements: !690)
!689 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!690 = !{!691, !756, !769, !770, !771, !772, !778, !795}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !688, file: !689, line: 247, baseType: !692, size: 384)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !689, line: 57, size: 384, elements: !693)
!693 = !{!694, !722, !730, !731, !732, !743, !744, !745}
!694 = !DIDerivedType(tag: DW_TAG_member, scope: !692, file: !689, line: 60, baseType: !695, size: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !692, file: !689, line: 60, size: 64, elements: !696)
!696 = !{!697, !713}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !695, file: !689, line: 61, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !699, line: 49, baseType: !700)
!699 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !699, line: 37, size: 64, elements: !701)
!701 = !{!702, !708}
!702 = !DIDerivedType(tag: DW_TAG_member, scope: !700, file: !699, line: 38, baseType: !703, size: 32)
!703 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !700, file: !699, line: 38, size: 32, elements: !704)
!704 = !{!705, !707}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !703, file: !699, line: 39, baseType: !706, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !703, file: !699, line: 40, baseType: !706, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, scope: !700, file: !699, line: 42, baseType: !709, size: 32, offset: 32)
!709 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !700, file: !699, line: 42, size: 32, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !709, file: !699, line: 43, baseType: !706, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !709, file: !699, line: 44, baseType: !706, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !695, file: !689, line: 62, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !715, line: 49, size: 64, elements: !716)
!715 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!716 = !{!717}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !714, file: !715, line: 50, baseType: !718, size: 64)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !719, size: 64, elements: !720)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 32)
!720 = !{!721}
!721 = !DISubrange(count: 2)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !692, file: !689, line: 68, baseType: !723, size: 32, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !725, line: 233, baseType: !726)
!725 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !725, line: 231, size: 64, elements: !727)
!727 = !{!728}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !726, file: !725, line: 232, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !699, line: 48, baseType: !700)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !692, file: !689, line: 71, baseType: !150, size: 8, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !692, file: !689, line: 74, baseType: !150, size: 8, offset: 104)
!732 = !DIDerivedType(tag: DW_TAG_member, scope: !692, file: !689, line: 90, baseType: !733, size: 16, offset: 112)
!733 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !692, file: !689, line: 90, size: 16, elements: !734)
!734 = !{!735, !742}
!735 = !DIDerivedType(tag: DW_TAG_member, scope: !733, file: !689, line: 91, baseType: !736, size: 16)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !733, file: !689, line: 91, size: 16, elements: !737)
!737 = !{!738, !741}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !736, file: !689, line: 96, baseType: !739, size: 8)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !740)
!740 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !736, file: !689, line: 97, baseType: !150, size: 8, offset: 8)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !733, file: !689, line: 100, baseType: !227, size: 16)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !692, file: !689, line: 107, baseType: !208, size: 32, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !692, file: !689, line: 127, baseType: !124, size: 32, offset: 160)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !692, file: !689, line: 131, baseType: !746, size: 192, offset: 192)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !725, line: 244, size: 192, elements: !747)
!747 = !{!748, !749, !755}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !746, file: !725, line: 245, baseType: !698, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !746, file: !725, line: 246, baseType: !750, size: 32, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !725, line: 242, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!752 = !DISubroutineType(types: !753)
!753 = !{null, !754}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !746, file: !725, line: 249, baseType: !508, size: 64, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !688, file: !689, line: 250, baseType: !757, size: 288, offset: 384)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !758, line: 25, size: 288, elements: !759)
!758 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!759 = !{!760, !761, !762, !763, !764, !765, !766, !767, !768}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !757, file: !758, line: 26, baseType: !208, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !757, file: !758, line: 27, baseType: !208, size: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !757, file: !758, line: 28, baseType: !208, size: 32, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !757, file: !758, line: 29, baseType: !208, size: 32, offset: 96)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !757, file: !758, line: 30, baseType: !208, size: 32, offset: 128)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !757, file: !758, line: 31, baseType: !208, size: 32, offset: 160)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !757, file: !758, line: 32, baseType: !208, size: 32, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !757, file: !758, line: 33, baseType: !208, size: 32, offset: 224)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !757, file: !758, line: 34, baseType: !208, size: 32, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !688, file: !689, line: 253, baseType: !124, size: 32, offset: 672)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !688, file: !689, line: 256, baseType: !724, size: 64, offset: 704)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !688, file: !689, line: 294, baseType: !125, size: 32, offset: 768)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !688, file: !689, line: 300, baseType: !773, size: 96, offset: 800)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !689, line: 149, size: 96, elements: !774)
!774 = !{!775, !776, !777}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !773, file: !689, line: 153, baseType: !22, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !773, file: !689, line: 162, baseType: !272, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !773, file: !689, line: 168, baseType: !272, size: 32, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !688, file: !689, line: 325, baseType: !779, size: 32, offset: 896)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 32)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !781, line: 5073, size: 160, elements: !782)
!781 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!782 = !{!783, !792, !793}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !780, file: !781, line: 5074, baseType: !784, size: 96)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !785, line: 56, size: 96, elements: !786)
!785 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!786 = !{!787, !790, !791}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !784, file: !785, line: 57, baseType: !788, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 32)
!789 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !785, line: 57, flags: DIFlagFwdDecl)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !784, file: !785, line: 58, baseType: !124, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !784, file: !785, line: 59, baseType: !272, size: 32, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !780, file: !781, line: 5075, baseType: !724, size: 64, offset: 96)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !780, file: !781, line: 5076, baseType: !794, offset: 160)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !539, line: 43, elements: !540)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !688, file: !689, line: 343, baseType: !796, size: 64, offset: 928)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !758, line: 60, size: 64, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !796, file: !758, line: 63, baseType: !208, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !796, file: !758, line: 66, baseType: !208, size: 32, offset: 32)
!800 = !{!801, !802}
!801 = !DILocalVariable(name: "thread", arg: 1, scope: !683, file: !684, line: 175, type: !687)
!802 = !DILocalVariable(name: "region_num", scope: !683, file: !684, line: 200, type: !150)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !804, elements: !618)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !805, line: 52, size: 96, elements: !806)
!805 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!806 = !{!807, !808, !809}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !804, file: !805, line: 53, baseType: !22, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !804, file: !805, line: 54, baseType: !272, size: 32, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !804, file: !805, line: 55, baseType: !810, size: 32, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !811, line: 304, baseType: !812)
!811 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !811, line: 301, size: 32, elements: !813)
!813 = !{!814, !815}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !812, file: !811, line: 302, baseType: !227, size: 16)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !812, file: !811, line: 303, baseType: !227, size: 16, offset: 16)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "static_regions", scope: !677, file: !684, line: 62, type: !818, isLocal: true, isDefinition: true)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !819, size: 96, elements: !534)
!819 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !804)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !822)
!822 = !{!823, !824}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !821, file: !373, line: 17, baseType: !140, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !821, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !827, file: !881, line: 39, type: !150, isLocal: true, isDefinition: true)
!827 = distinct !DICompileUnit(language: DW_LANG_C99, file: !828, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !829, globals: !872, splitDebugInlining: false, nameTableKind: None)
!828 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/crypto")
!829 = !{!830, !124, !125, !858}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !832, line: 1495, baseType: !833)
!832 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !832, line: 1474, size: 448, elements: !834)
!834 = !{!835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !848}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !833, file: !832, line: 1476, baseType: !435, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !833, file: !832, line: 1477, baseType: !436, size: 32, offset: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !833, file: !832, line: 1478, baseType: !436, size: 32, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !833, file: !832, line: 1479, baseType: !436, size: 32, offset: 96)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !833, file: !832, line: 1480, baseType: !436, size: 32, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !833, file: !832, line: 1481, baseType: !436, size: 32, offset: 160)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !833, file: !832, line: 1482, baseType: !436, size: 32, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !833, file: !832, line: 1483, baseType: !436, size: 32, offset: 224)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !833, file: !832, line: 1484, baseType: !436, size: 32, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !833, file: !832, line: 1485, baseType: !436, size: 32, offset: 288)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !833, file: !832, line: 1486, baseType: !436, size: 32, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !833, file: !832, line: 1487, baseType: !847, size: 32, offset: 352)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 32, elements: !534)
!848 = !DIDerivedType(tag: DW_TAG_member, scope: !833, file: !832, line: 1488, baseType: !849, size: 64, offset: 384)
!849 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !833, file: !832, line: 1488, size: 64, elements: !850)
!850 = !{!851, !853}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !849, file: !832, line: 1489, baseType: !852, size: 64)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !436, size: 64, elements: !720)
!853 = !DIDerivedType(tag: DW_TAG_member, scope: !849, file: !832, line: 1490, baseType: !854, size: 64)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !849, file: !832, line: 1490, size: 64, elements: !855)
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !854, file: !832, line: 1491, baseType: !436, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !854, file: !832, line: 1492, baseType: !436, size: 32, offset: 32)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !861, line: 27, size: 128, elements: !862)
!861 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!862 = !{!863, !864, !865}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !860, file: !861, line: 29, baseType: !208, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !860, file: !861, line: 31, baseType: !140, size: 32, offset: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !860, file: !861, line: 37, baseType: !866, size: 64, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !811, line: 298, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !811, line: 289, size: 64, elements: !868)
!868 = !{!869, !870, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !867, file: !811, line: 291, baseType: !150, size: 5, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !867, file: !811, line: 293, baseType: !150, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !867, file: !811, line: 295, baseType: !208, size: 32, offset: 32)
!872 = !{!825, !873}
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !827, file: !875, line: 31, type: !876, isLocal: true, isDefinition: true)
!875 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !877, size: 160, elements: !534)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !875, line: 21, size: 160, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !877, file: !875, line: 22, baseType: !125, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !877, file: !875, line: 23, baseType: !860, size: 128, offset: 32)
!881 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !884, file: !891, line: 21, type: !409, isLocal: true, isDefinition: true)
!884 = distinct !DICompileUnit(language: DW_LANG_C99, file: !885, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !886, globals: !890, splitDebugInlining: false, nameTableKind: None)
!885 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/crypto")
!886 = !{!887, !125, !124}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !889, line: 22, baseType: !125)
!889 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!890 = !{!882}
!891 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !894, file: !899, line: 13, type: !918, isLocal: true, isDefinition: true)
!894 = distinct !DICompileUnit(language: DW_LANG_C99, file: !895, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !896, splitDebugInlining: false, nameTableKind: None)
!895 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/crypto")
!896 = !{!897, !892}
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "mpu_config", scope: !894, file: !899, line: 37, type: !900, isLocal: false, isDefinition: true)
!899 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!900 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !861, line: 41, size: 64, elements: !902)
!902 = !{!903, !904}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !901, file: !861, line: 43, baseType: !208, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !901, file: !861, line: 45, baseType: !905, size: 32, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !861, line: 27, size: 128, elements: !908)
!908 = !{!909, !910, !911}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !907, file: !861, line: 29, baseType: !208, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !907, file: !861, line: 31, baseType: !140, size: 32, offset: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !907, file: !861, line: 37, baseType: !912, size: 64, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !811, line: 298, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !811, line: 289, size: 64, elements: !914)
!914 = !{!915, !916, !917}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !913, file: !811, line: 291, baseType: !150, size: 5, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !913, file: !811, line: 293, baseType: !150, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !913, file: !811, line: 295, baseType: !208, size: 32, offset: 32)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 256, elements: !720)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(name: "log_const_clock_control", scope: !921, file: !1122, line: 18, type: !1352, isLocal: false, isDefinition: true)
!921 = distinct !DICompileUnit(language: DW_LANG_C99, file: !922, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !923, retainedTypes: !1041, globals: !1118, splitDebugInlining: false, nameTableKind: None)
!922 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/crypto")
!923 = !{!924, !930, !46, !935, !940, !944, !948, !952, !958, !962, !1006, !1013, !1032}
!924 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !925, line: 23, baseType: !32, size: 32, elements: !926)
!925 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!926 = !{!927, !928, !929}
!927 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!928 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!929 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!930 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !925, line: 48, baseType: !32, size: 32, elements: !931)
!931 = !{!932, !933, !934}
!932 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!933 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!934 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!935 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !936, line: 167, baseType: !32, size: 32, elements: !937)
!936 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!937 = !{!938, !939}
!938 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!939 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!940 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !936, line: 107, baseType: !32, size: 32, elements: !941)
!941 = !{!942, !943}
!942 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!943 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!944 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !936, line: 208, baseType: !32, size: 32, elements: !945)
!945 = !{!946, !947}
!946 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!947 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!948 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !936, line: 261, baseType: !32, size: 32, elements: !949)
!949 = !{!950, !951}
!950 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!951 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!952 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !936, line: 237, baseType: !32, size: 32, elements: !953)
!953 = !{!954, !955, !956, !957}
!954 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!955 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!956 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!957 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!958 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !936, line: 152, baseType: !32, size: 32, elements: !959)
!959 = !{!960, !961}
!960 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!961 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!962 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !430, line: 71, baseType: !125, size: 32, elements: !963)
!963 = !{!964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005}
!964 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!965 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!966 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!967 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!968 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!969 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!970 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!971 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!972 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!973 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!974 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!975 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!976 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!977 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!978 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!979 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!980 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!981 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!982 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!983 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!984 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!985 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!986 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!987 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!988 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!989 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!990 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!991 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!992 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!993 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!994 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!995 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!996 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!997 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!998 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!999 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!1000 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!1001 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!1002 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!1003 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!1004 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!1005 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!1006 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !1007, line: 44, baseType: !32, size: 32, elements: !1008)
!1007 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1008 = !{!1009, !1010, !1011, !1012}
!1009 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!1010 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!1011 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!1012 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!1013 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1014, line: 54, baseType: !32, size: 32, elements: !1015)
!1014 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1015 = !{!1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031}
!1016 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!1017 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!1018 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!1019 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!1020 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!1021 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!1022 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!1023 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!1024 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!1025 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!1026 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!1027 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!1028 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!1029 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!1030 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!1031 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!1032 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1033, line: 53, baseType: !32, size: 32, elements: !1034)
!1033 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1034 = !{!1035, !1036, !1037, !1038, !1039, !1040}
!1035 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!1036 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!1037 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!1038 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!1039 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!1040 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!1041 = !{!924, !124, !125, !1042, !1084, !1085, !1086, !1087, !506, !208, !525, !153, !1088, !184, !585, !1089, !1117, !272}
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !430, line: 923, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !430, line: 883, size: 10464, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1049, !1050, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1065, !1066, !1067, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !1044, file: !430, line: 884, baseType: !436, size: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !1044, file: !430, line: 885, baseType: !436, size: 32, offset: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !1044, file: !430, line: 886, baseType: !436, size: 32, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !1044, file: !430, line: 887, baseType: !436, size: 32, offset: 96)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !1044, file: !430, line: 888, baseType: !1051, size: 896, offset: 128)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 896, elements: !1052)
!1052 = !{!1053}
!1053 = !DISubrange(count: 28)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !1044, file: !430, line: 889, baseType: !436, size: 32, offset: 1024)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !1044, file: !430, line: 890, baseType: !436, size: 32, offset: 1056)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !1044, file: !430, line: 891, baseType: !436, size: 32, offset: 1088)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !1044, file: !430, line: 892, baseType: !436, size: 32, offset: 1120)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !1044, file: !430, line: 893, baseType: !1051, size: 896, offset: 1152)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !1044, file: !430, line: 894, baseType: !436, size: 32, offset: 2048)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !1044, file: !430, line: 895, baseType: !436, size: 32, offset: 2080)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1044, file: !430, line: 896, baseType: !1062, size: 960, offset: 2112)
!1062 = !DICompositeType(tag: DW_TAG_array_type, baseType: !435, size: 960, elements: !1063)
!1063 = !{!1064}
!1064 = !DISubrange(count: 30)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !1044, file: !430, line: 897, baseType: !436, size: 32, offset: 3072)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !1044, file: !430, line: 898, baseType: !436, size: 32, offset: 3104)
