; ModuleID = 'build/actinius_icarus_bee_ns/button/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.gpio_callback = type { %struct._snode, {}*, i32 }
%struct._snode = type { %struct._snode* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/button/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/button")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/button")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "button", scope: !27, file: !218, line: 24, type: !229, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !112, globals: !215, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/basic/button/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/button")
!29 = !{!30, !101, !107}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !102, line: 506, baseType: !32, size: 32, elements: !103)
!102 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!105 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!106 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !102, line: 512, baseType: !32, size: 32, elements: !108)
!108 = !{!109, !110, !111}
!109 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!110 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!111 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!112 = !{!113, !114, !115, !198, !203, !163, !107, !101, !208, !209, !152, !213}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!114 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !102, line: 523, size: 288, elements: !118)
!118 = !{!119, !153, !159, !164, !168, !169, !170, !174, !194}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !117, file: !102, line: 524, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!121 = !DISubroutineType(types: !122)
!122 = !{!114, !123, !150, !151}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !126, line: 378, size: 192, elements: !127)
!126 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!127 = !{!128, !132, !133, !134, !143, !144}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !125, file: !126, line: 380, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !125, file: !126, line: 382, baseType: !13, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !125, file: !126, line: 384, baseType: !13, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !125, file: !126, line: 386, baseType: !135, size: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !126, line: 351, size: 16, elements: !137)
!137 = !{!138, !141}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !136, file: !126, line: 359, baseType: !139, size: 8)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !140)
!140 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !136, file: !126, line: 364, baseType: !142, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!142 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !125, file: !126, line: 388, baseType: !113, size: 32, offset: 128)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !125, file: !126, line: 396, baseType: !145, size: 32, offset: 160)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !126, line: 43, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !149)
!149 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !102, line: 237, baseType: !139)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !102, line: 257, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !117, file: !102, line: 530, baseType: !154, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DISubroutineType(types: !156)
!156 = !{!114, !123, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !102, line: 229, baseType: !152)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !117, file: !102, line: 532, baseType: !160, size: 32, offset: 64)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DISubroutineType(types: !162)
!162 = !{!114, !123, !163, !158}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !102, line: 216, baseType: !152)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !117, file: !102, line: 535, baseType: !165, size: 32, offset: 96)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = !DISubroutineType(types: !167)
!167 = !{!114, !123, !163}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !117, file: !102, line: 537, baseType: !165, size: 32, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !117, file: !102, line: 539, baseType: !165, size: 32, offset: 160)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !117, file: !102, line: 541, baseType: !171, size: 32, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DISubroutineType(types: !173)
!173 = !{!114, !123, !150, !101, !107}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !117, file: !102, line: 544, baseType: !175, size: 32, offset: 224)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!176 = !DISubroutineType(types: !177)
!177 = !{!114, !123, !178, !142}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !102, line: 478, size: 96, elements: !180)
!180 = !{!181, !188, !193}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !179, file: !102, line: 482, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !183, line: 33, baseType: !184)
!183 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !183, line: 29, size: 32, elements: !185)
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !184, file: !183, line: 30, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !179, file: !102, line: 485, baseType: !189, size: 32, offset: 32)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !102, line: 464, baseType: !190)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DISubroutineType(types: !192)
!192 = !{null, !123, !178, !163}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !179, file: !102, line: 493, baseType: !163, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !117, file: !102, line: 547, baseType: !195, size: 32, offset: 256)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 32)
!196 = !DISubroutineType(types: !197)
!197 = !{!152, !123}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !102, line: 428, size: 32, elements: !201)
!201 = !{!202}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !200, file: !102, line: 434, baseType: !163, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !102, line: 441, size: 32, elements: !206)
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !205, file: !102, line: 447, baseType: !163, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !210, line: 46, baseType: !211)
!210 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !212)
!212 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !214)
!214 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!215 = !{!216, !25, !219}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "button_cb_data", scope: !27, file: !218, line: 26, type: !179, isLocal: true, isDefinition: true)
!218 = !DIFile(filename: "zephyr/samples/basic/button/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!219 = !DIGlobalVariableExpression(var: !220, expr: !DIExpression())
!220 = distinct !DIGlobalVariable(name: "led", scope: !27, file: !218, line: 32, type: !221, isLocal: true, isDefinition: true)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_dt_spec", file: !102, line: 271, size: 64, elements: !222)
!222 = !{!223, !224, !225}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !221, file: !102, line: 273, baseType: !123, size: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !221, file: !102, line: 275, baseType: !150, size: 8, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "dt_flags", scope: !221, file: !102, line: 277, baseType: !226, size: 16, offset: 48)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_dt_flags_t", file: !102, line: 249, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !228)
!228 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "_char_out", scope: !232, file: !237, line: 54, type: !238, isLocal: false, isDefinition: true)
!232 = distinct !DICompileUnit(language: DW_LANG_C99, file: !233, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !234, retainedTypes: !235, globals: !236, splitDebugInlining: false, nameTableKind: None)
!233 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/button")
!234 = !{!30}
!235 = !{!113, !114}
!236 = !{!230}
!237 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = !DISubroutineType(types: !240)
!240 = !{!114, !114}
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !243, file: !302, line: 65, type: !303, isLocal: true, isDefinition: true, align: 32)
!243 = distinct !DICompileUnit(language: DW_LANG_C99, file: !244, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !234, retainedTypes: !245, globals: !297, splitDebugInlining: false, nameTableKind: None)
!244 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/button")
!245 = !{!113, !114, !246, !152, !257}
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !248, file: !247, line: 167, baseType: !256)
!247 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !247, file: !247, line: 134, type: !249, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !243, retainedNodes: !251)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !152}
!251 = !{!252, !253, !255}
!252 = !DILocalVariable(name: "time_us", arg: 1, scope: !248, file: !247, line: 134, type: !152)
!253 = !DILocalVariable(name: "delay_cycles", scope: !248, file: !247, line: 168, type: !254)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !246)
!255 = !DILocalVariable(name: "cycles", scope: !248, file: !247, line: 171, type: !152)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !259, line: 1928, baseType: !260)
!259 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !259, line: 1909, size: 11360, elements: !261)
!261 = !{!262, !268, !269, !270, !271, !275, !276, !277, !278, !282, !283, !287, !288, !289, !290, !291, !295, !296}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !260, file: !259, line: 1910, baseType: !263, size: 8192)
!263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 8192, elements: !266)
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!265 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !152)
!266 = !{!267}
!267 = !DISubrange(count: 256)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !260, file: !259, line: 1911, baseType: !264, size: 32, offset: 8192)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !260, file: !259, line: 1912, baseType: !264, size: 32, offset: 8224)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !260, file: !259, line: 1913, baseType: !264, size: 32, offset: 8256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !260, file: !259, line: 1914, baseType: !272, size: 1984, offset: 8288)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 1984, elements: !273)
!273 = !{!274}
!274 = !DISubrange(count: 62)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !260, file: !259, line: 1915, baseType: !265, size: 32, offset: 10272)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !260, file: !259, line: 1916, baseType: !264, size: 32, offset: 10304)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !260, file: !259, line: 1917, baseType: !265, size: 32, offset: 10336)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !260, file: !259, line: 1918, baseType: !279, size: 96, offset: 10368)
!279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 96, elements: !280)
!280 = !{!281}
!281 = !DISubrange(count: 3)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !260, file: !259, line: 1919, baseType: !265, size: 32, offset: 10464)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !260, file: !259, line: 1920, baseType: !284, size: 256, offset: 10496)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 256, elements: !285)
!285 = !{!286}
!286 = !DISubrange(count: 8)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !260, file: !259, line: 1921, baseType: !265, size: 32, offset: 10752)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !260, file: !259, line: 1922, baseType: !264, size: 32, offset: 10784)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !260, file: !259, line: 1923, baseType: !265, size: 32, offset: 10816)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !260, file: !259, line: 1924, baseType: !265, size: 32, offset: 10848)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !260, file: !259, line: 1925, baseType: !292, size: 416, offset: 10880)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 416, elements: !293)
!293 = !{!294}
!294 = !DISubrange(count: 13)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !260, file: !259, line: 1926, baseType: !265, size: 32, offset: 11296)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !260, file: !259, line: 1927, baseType: !265, size: 32, offset: 11328)
!297 = !{!241, !298}
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !248, file: !247, line: 161, type: !300, isLocal: true, isDefinition: true, align: 128)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 48, elements: !280)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!302 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !305, line: 51, size: 64, elements: !306)
!305 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!306 = !{!307, !314}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !304, file: !305, line: 60, baseType: !308, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = !DISubroutineType(types: !310)
!310 = !{!114, !311}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !313)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !305, line: 48, flags: DIFlagFwdDecl)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !304, file: !305, line: 65, baseType: !311, size: 32, offset: 32)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !317, file: !351, line: 27, type: !378, isLocal: true, isDefinition: true)
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !319, retainedTypes: !331, globals: !348, splitDebugInlining: false, nameTableKind: None)
!318 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/button")
!319 = !{!320, !30}
!320 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !321, line: 27, baseType: !32, size: 32, elements: !322)
!321 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = !{!323, !324, !325, !326, !327, !328, !329, !330}
!323 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!324 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!325 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!326 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!327 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!328 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!329 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!330 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!331 = !{!113, !209, !114, !24, !332, !347, !152, !213}
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !334, line: 54, size: 96, elements: !335)
!334 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = !{!336, !342, !346}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !333, file: !334, line: 55, baseType: !337, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !183, line: 33, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !183, line: 29, size: 32, elements: !339)
!339 = !{!340}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !338, file: !183, line: 30, baseType: !341, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !333, file: !334, line: 60, baseType: !343, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 32)
!344 = !DISubroutineType(types: !345)
!345 = !{null, !320}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !333, file: !334, line: 65, baseType: !343, size: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!348 = !{!315, !349, !355, !357, !368, !370}
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !317, file: !351, line: 44, type: !352, isLocal: true, isDefinition: true)
!351 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !353, line: 43, elements: !354)
!353 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!354 = !{}
!355 = !DIGlobalVariableExpression(var: !356, expr: !DIExpression())
!356 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !317, file: !351, line: 49, type: !352, isLocal: true, isDefinition: true)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !317, file: !351, line: 36, type: !359, isLocal: true, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 128, elements: !366)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !321, line: 114, size: 128, elements: !361)
!361 = !{!362, !363, !364, !365}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !360, file: !321, line: 115, baseType: !320, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !360, file: !321, line: 141, baseType: !139, size: 8, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !360, file: !321, line: 149, baseType: !152, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !360, file: !321, line: 156, baseType: !152, size: 32, offset: 96)
!366 = !{!367}
!367 = !DISubrange(count: 1)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !317, file: !351, line: 40, type: !359, isLocal: true, isDefinition: true)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !317, file: !351, line: 28, type: !372, isLocal: true, isDefinition: true)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !183, line: 40, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !183, line: 35, size: 64, elements: !374)
!374 = !{!375, !377}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !373, file: !183, line: 36, baseType: !376, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !373, file: !183, line: 37, baseType: !376, size: 32, offset: 32)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !379, size: 32, elements: !366)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !380, line: 22, baseType: !381)
!380 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!381 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!382 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!383 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !386, file: !415, line: 50, type: !402, isLocal: true, isDefinition: true)
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !319, retainedTypes: !388, globals: !412, splitDebugInlining: false, nameTableKind: None)
!387 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/button")
!388 = !{!148, !209, !389, !114, !113, !152, !213, !391, !347, !402, !403}
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !390, line: 214, baseType: !32)
!390 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !393, line: 45, size: 64, elements: !394)
!393 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!394 = !{!395, !401}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !392, file: !393, line: 46, baseType: !396, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !183, line: 33, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !183, line: 29, size: 32, elements: !398)
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !397, file: !183, line: 30, baseType: !400, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !392, file: !393, line: 48, baseType: !152, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !114)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !393, line: 38, size: 64, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !404, file: !393, line: 39, baseType: !396, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !404, file: !393, line: 41, baseType: !408, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !393, line: 35, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !402}
!412 = !{!413, !417, !425, !384, !427, !437}
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "latency_lock", scope: !386, file: !415, line: 44, type: !416, isLocal: true, isDefinition: true)
!415 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !353, line: 43, elements: !354)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !386, file: !415, line: 46, type: !419, isLocal: true, isDefinition: true)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !183, line: 40, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !183, line: 35, size: 64, elements: !421)
!421 = !{!422, !424}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !420, file: !183, line: 36, baseType: !423, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !420, file: !183, line: 37, baseType: !423, size: 32, offset: 32)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "latency_subs", scope: !386, file: !415, line: 52, type: !419, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !386, file: !415, line: 39, type: !429, isLocal: true, isDefinition: true)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, elements: !435)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !415, line: 35, size: 96, elements: !431)
!431 = !{!432, !433, !434}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !430, file: !415, line: 36, baseType: !320, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !430, file: !415, line: 37, baseType: !139, size: 8, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !430, file: !415, line: 38, baseType: !379, size: 32, offset: 64)
!435 = !{!436}
!436 = !DISubrange(count: 0)
!437 = !DIGlobalVariableExpression(var: !438, expr: !DIExpression())
!438 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !386, file: !415, line: 48, type: !402, isLocal: true, isDefinition: true)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !441, file: !448, line: 47, type: !462, isLocal: true, isDefinition: true)
!441 = distinct !DICompileUnit(language: DW_LANG_C99, file: !442, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !443, retainedTypes: !444, globals: !445, splitDebugInlining: false, nameTableKind: None)
!442 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/button")
!443 = !{!320}
!444 = !{!389, !114}
!445 = !{!446, !439, !458}
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "cpus_states", scope: !441, file: !448, line: 50, type: !449, isLocal: true, isDefinition: true)
!448 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !450, size: 32, elements: !366)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !321, line: 114, size: 128, elements: !453)
!453 = !{!454, !455, !456, !457}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !452, file: !321, line: 115, baseType: !320, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !452, file: !321, line: 141, baseType: !139, size: 8, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !452, file: !321, line: 149, baseType: !152, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !452, file: !321, line: 156, baseType: !152, size: 32, offset: 96)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !441, file: !448, line: 55, type: !460, isLocal: true, isDefinition: true)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 8, elements: !366)
!461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, elements: !435)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "static_regions", scope: !465, file: !472, line: 62, type: !604, isLocal: true, isDefinition: true)
!465 = distinct !DICompileUnit(language: DW_LANG_C99, file: !466, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !234, retainedTypes: !467, globals: !468, splitDebugInlining: false, nameTableKind: None)
!466 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/button")
!467 = !{!389, !114, !152, !113}
!468 = !{!469, !463}
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !471, file: !472, line: 198, type: !591, isLocal: true, isDefinition: true)
!471 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !472, file: !472, line: 175, type: !473, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !465, retainedNodes: !588)
!472 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!473 = !DISubroutineType(types: !474)
!474 = !{null, !475}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !477, line: 245, size: 1024, elements: !478)
!477 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!478 = !{!479, !544, !557, !558, !559, !560, !566, !583}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !476, file: !477, line: 247, baseType: !480, size: 384)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !477, line: 57, size: 384, elements: !481)
!481 = !{!482, !510, !518, !519, !520, !531, !532, !533}
!482 = !DIDerivedType(tag: DW_TAG_member, scope: !480, file: !477, line: 60, baseType: !483, size: 64)
!483 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !480, file: !477, line: 60, size: 64, elements: !484)
!484 = !{!485, !501}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !483, file: !477, line: 61, baseType: !486, size: 64)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !487, line: 49, baseType: !488)
!487 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !487, line: 37, size: 64, elements: !489)
!489 = !{!490, !496}
!490 = !DIDerivedType(tag: DW_TAG_member, scope: !488, file: !487, line: 38, baseType: !491, size: 32)
!491 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !488, file: !487, line: 38, size: 32, elements: !492)
!492 = !{!493, !495}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !491, file: !487, line: 39, baseType: !494, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !491, file: !487, line: 40, baseType: !494, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, scope: !488, file: !487, line: 42, baseType: !497, size: 32, offset: 32)
!497 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !488, file: !487, line: 42, size: 32, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !497, file: !487, line: 43, baseType: !494, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !497, file: !487, line: 44, baseType: !494, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !483, file: !477, line: 62, baseType: !502, size: 64)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !503, line: 49, size: 64, elements: !504)
!503 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!504 = !{!505}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !502, file: !503, line: 50, baseType: !506, size: 64)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 64, elements: !508)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!508 = !{!509}
!509 = !DISubrange(count: 2)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !480, file: !477, line: 68, baseType: !511, size: 32, offset: 64)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !513, line: 233, baseType: !514)
!513 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 231, size: 64, elements: !515)
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !514, file: !513, line: 232, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !487, line: 48, baseType: !488)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !480, file: !477, line: 71, baseType: !139, size: 8, offset: 96)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !480, file: !477, line: 74, baseType: !139, size: 8, offset: 104)
!520 = !DIDerivedType(tag: DW_TAG_member, scope: !480, file: !477, line: 90, baseType: !521, size: 16, offset: 112)
!521 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !480, file: !477, line: 90, size: 16, elements: !522)
!522 = !{!523, !530}
!523 = !DIDerivedType(tag: DW_TAG_member, scope: !521, file: !477, line: 91, baseType: !524, size: 16)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !521, file: !477, line: 91, size: 16, elements: !525)
!525 = !{!526, !529}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !524, file: !477, line: 96, baseType: !527, size: 8)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !528)
!528 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !524, file: !477, line: 97, baseType: !139, size: 8, offset: 8)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !521, file: !477, line: 100, baseType: !227, size: 16)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !480, file: !477, line: 107, baseType: !152, size: 32, offset: 128)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !480, file: !477, line: 127, baseType: !113, size: 32, offset: 160)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !480, file: !477, line: 131, baseType: !534, size: 192, offset: 192)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !513, line: 244, size: 192, elements: !535)
!535 = !{!536, !537, !543}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !534, file: !513, line: 245, baseType: !486, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !534, file: !513, line: 246, baseType: !538, size: 32, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !513, line: 242, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !542}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !534, file: !513, line: 249, baseType: !211, size: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !476, file: !477, line: 250, baseType: !545, size: 288, offset: 384)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !546, line: 25, size: 288, elements: !547)
!546 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!547 = !{!548, !549, !550, !551, !552, !553, !554, !555, !556}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !545, file: !546, line: 26, baseType: !152, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !545, file: !546, line: 27, baseType: !152, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !545, file: !546, line: 28, baseType: !152, size: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !545, file: !546, line: 29, baseType: !152, size: 32, offset: 96)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !545, file: !546, line: 30, baseType: !152, size: 32, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !545, file: !546, line: 31, baseType: !152, size: 32, offset: 160)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !545, file: !546, line: 32, baseType: !152, size: 32, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !545, file: !546, line: 33, baseType: !152, size: 32, offset: 224)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !545, file: !546, line: 34, baseType: !152, size: 32, offset: 256)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !476, file: !477, line: 253, baseType: !113, size: 32, offset: 672)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !476, file: !477, line: 256, baseType: !512, size: 64, offset: 704)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !476, file: !477, line: 294, baseType: !114, size: 32, offset: 768)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !476, file: !477, line: 300, baseType: !561, size: 96, offset: 800)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !477, line: 149, size: 96, elements: !562)
!562 = !{!563, !564, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !561, file: !477, line: 153, baseType: !22, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !561, file: !477, line: 162, baseType: !389, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !561, file: !477, line: 168, baseType: !389, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !476, file: !477, line: 325, baseType: !567, size: 32, offset: 896)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !569, line: 5073, size: 160, elements: !570)
!569 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!570 = !{!571, !580, !581}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !568, file: !569, line: 5074, baseType: !572, size: 96)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !573, line: 56, size: 96, elements: !574)
!573 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!574 = !{!575, !578, !579}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !572, file: !573, line: 57, baseType: !576, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !573, line: 57, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !572, file: !573, line: 58, baseType: !113, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !572, file: !573, line: 59, baseType: !389, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !568, file: !569, line: 5075, baseType: !512, size: 64, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !568, file: !569, line: 5076, baseType: !582, offset: 160)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !353, line: 43, elements: !354)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !476, file: !477, line: 343, baseType: !584, size: 64, offset: 928)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !546, line: 60, size: 64, elements: !585)
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !584, file: !546, line: 63, baseType: !152, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !584, file: !546, line: 66, baseType: !152, size: 32, offset: 32)
!588 = !{!589, !590}
!589 = !DILocalVariable(name: "thread", arg: 1, scope: !471, file: !472, line: 175, type: !475)
!590 = !DILocalVariable(name: "region_num", scope: !471, file: !472, line: 200, type: !139)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, elements: !435)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !593, line: 52, size: 96, elements: !594)
!593 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!594 = !{!595, !596, !597}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !592, file: !593, line: 53, baseType: !22, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !592, file: !593, line: 54, baseType: !389, size: 32, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !592, file: !593, line: 55, baseType: !598, size: 32, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !599, line: 304, baseType: !600)
!599 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !599, line: 301, size: 32, elements: !601)
!601 = !{!602, !603}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !600, file: !599, line: 302, baseType: !227, size: 16)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !600, file: !599, line: 303, baseType: !227, size: 16, offset: 16)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 96, elements: !366)
!605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !592)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !608, file: !662, line: 39, type: !139, isLocal: true, isDefinition: true)
!608 = distinct !DICompileUnit(language: DW_LANG_C99, file: !609, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !234, retainedTypes: !610, globals: !653, splitDebugInlining: false, nameTableKind: None)
!609 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/button")
!610 = !{!611, !113, !114, !639}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !613, line: 1495, baseType: !614)
!613 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !613, line: 1474, size: 448, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !629}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !614, file: !613, line: 1476, baseType: !264, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !614, file: !613, line: 1477, baseType: !265, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !614, file: !613, line: 1478, baseType: !265, size: 32, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !614, file: !613, line: 1479, baseType: !265, size: 32, offset: 96)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !614, file: !613, line: 1480, baseType: !265, size: 32, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !614, file: !613, line: 1481, baseType: !265, size: 32, offset: 160)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !614, file: !613, line: 1482, baseType: !265, size: 32, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !614, file: !613, line: 1483, baseType: !265, size: 32, offset: 224)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !614, file: !613, line: 1484, baseType: !265, size: 32, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !614, file: !613, line: 1485, baseType: !265, size: 32, offset: 288)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !614, file: !613, line: 1486, baseType: !265, size: 32, offset: 320)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !614, file: !613, line: 1487, baseType: !628, size: 32, offset: 352)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 32, elements: !366)
!629 = !DIDerivedType(tag: DW_TAG_member, scope: !614, file: !613, line: 1488, baseType: !630, size: 64, offset: 384)
!630 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !614, file: !613, line: 1488, size: 64, elements: !631)
!631 = !{!632, !634}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !630, file: !613, line: 1489, baseType: !633, size: 64)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 64, elements: !508)
!634 = !DIDerivedType(tag: DW_TAG_member, scope: !630, file: !613, line: 1490, baseType: !635, size: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !630, file: !613, line: 1490, size: 64, elements: !636)
!636 = !{!637, !638}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !635, file: !613, line: 1491, baseType: !265, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !635, file: !613, line: 1492, baseType: !265, size: 32, offset: 32)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !642, line: 27, size: 128, elements: !643)
!642 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!643 = !{!644, !645, !646}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !641, file: !642, line: 29, baseType: !152, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !641, file: !642, line: 31, baseType: !129, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !641, file: !642, line: 37, baseType: !647, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !599, line: 298, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !599, line: 289, size: 64, elements: !649)
!649 = !{!650, !651, !652}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !648, file: !599, line: 291, baseType: !139, size: 5, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !648, file: !599, line: 293, baseType: !139, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !648, file: !599, line: 295, baseType: !152, size: 32, offset: 32)
!653 = !{!606, !654}
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !608, file: !656, line: 31, type: !657, isLocal: true, isDefinition: true)
!656 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 160, elements: !366)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !656, line: 21, size: 160, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !658, file: !656, line: 22, baseType: !114, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !658, file: !656, line: 23, baseType: !641, size: 128, offset: 32)
!662 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !665, file: !672, line: 21, type: !238, isLocal: true, isDefinition: true)
!665 = distinct !DICompileUnit(language: DW_LANG_C99, file: !666, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !234, retainedTypes: !667, globals: !671, splitDebugInlining: false, nameTableKind: None)
!666 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/button")
!667 = !{!668, !114, !113}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !670, line: 22, baseType: !114)
!670 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!671 = !{!663}
!672 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !675, file: !680, line: 13, type: !699, isLocal: true, isDefinition: true)
!675 = distinct !DICompileUnit(language: DW_LANG_C99, file: !676, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !677, splitDebugInlining: false, nameTableKind: None)
!676 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/button")
!677 = !{!678, !673}
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "mpu_config", scope: !675, file: !680, line: 37, type: !681, isLocal: false, isDefinition: true)
!680 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !642, line: 41, size: 64, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !682, file: !642, line: 43, baseType: !152, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !682, file: !642, line: 45, baseType: !686, size: 32, offset: 32)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !642, line: 27, size: 128, elements: !689)
!689 = !{!690, !691, !692}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !688, file: !642, line: 29, baseType: !152, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !688, file: !642, line: 31, baseType: !129, size: 32, offset: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !688, file: !642, line: 37, baseType: !693, size: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !599, line: 298, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !599, line: 289, size: 64, elements: !695)
!695 = !{!696, !697, !698}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !694, file: !599, line: 291, baseType: !139, size: 5, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !694, file: !599, line: 293, baseType: !139, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !694, file: !599, line: 295, baseType: !152, size: 32, offset: 32)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !687, size: 256, elements: !508)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "__init_board_actinius_icarus_bee_init", scope: !702, file: !782, line: 39, type: !783, isLocal: true, isDefinition: true, align: 32)
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !704, retainedTypes: !705, globals: !781, splitDebugInlining: false, nameTableKind: None)
!703 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/actinius_icarus_bee/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/button")
!704 = !{!101, !107}
!705 = !{!706, !770, !775, !163, !107, !101, !780, !113}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !102, line: 523, size: 288, elements: !709)
!709 = !{!710, !729, !733, !737, !741, !742, !743, !747, !766}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !708, file: !102, line: 524, baseType: !711, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = !DISubroutineType(types: !713)
!713 = !{!114, !714, !150, !151}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !126, line: 378, size: 192, elements: !717)
!717 = !{!718, !719, !720, !721, !727, !728}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !716, file: !126, line: 380, baseType: !129, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !716, file: !126, line: 382, baseType: !13, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !716, file: !126, line: 384, baseType: !13, size: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !716, file: !126, line: 386, baseType: !722, size: 32, offset: 96)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 32)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !126, line: 351, size: 16, elements: !724)
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !723, file: !126, line: 359, baseType: !139, size: 8)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !723, file: !126, line: 364, baseType: !142, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !716, file: !126, line: 388, baseType: !113, size: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !716, file: !126, line: 396, baseType: !145, size: 32, offset: 160)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !708, file: !102, line: 530, baseType: !730, size: 32, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!731 = !DISubroutineType(types: !732)
!732 = !{!114, !714, !157}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !708, file: !102, line: 532, baseType: !734, size: 32, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = !DISubroutineType(types: !736)
!736 = !{!114, !714, !163, !158}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !708, file: !102, line: 535, baseType: !738, size: 32, offset: 96)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!739 = !DISubroutineType(types: !740)
!740 = !{!114, !714, !163}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !708, file: !102, line: 537, baseType: !738, size: 32, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !708, file: !102, line: 539, baseType: !738, size: 32, offset: 160)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !708, file: !102, line: 541, baseType: !744, size: 32, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DISubroutineType(types: !746)
!746 = !{!114, !714, !150, !101, !107}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !708, file: !102, line: 544, baseType: !748, size: 32, offset: 224)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!749 = !DISubroutineType(types: !750)
!750 = !{!114, !714, !751, !142}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !102, line: 478, size: 96, elements: !753)
!753 = !{!754, !760, !765}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !752, file: !102, line: 482, baseType: !755, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !183, line: 33, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !183, line: 29, size: 32, elements: !757)
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !756, file: !183, line: 30, baseType: !759, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !752, file: !102, line: 485, baseType: !761, size: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !102, line: 464, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !714, !751, !163}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !752, file: !102, line: 493, baseType: !163, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !708, file: !102, line: 547, baseType: !767, size: 32, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 32)
!768 = !DISubroutineType(types: !769)
!769 = !{!152, !714}
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !102, line: 428, size: 32, elements: !773)
!773 = !{!774}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !772, file: !102, line: 434, baseType: !163, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !102, line: 441, size: 32, elements: !778)
!778 = !{!779}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !777, file: !102, line: 447, baseType: !163, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!781 = !{!700}
!782 = !DIFile(filename: "zephyr/boards/arm/actinius_icarus_bee/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!783 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !305, line: 51, size: 64, elements: !785)
!785 = !{!786, !790}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !784, file: !305, line: 60, baseType: !787, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DISubroutineType(types: !789)
!789 = !{!114, !714}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !784, file: !305, line: 65, baseType: !714, size: 32, offset: 32)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "__device_dts_ord_48", scope: !793, file: !997, line: 733, type: !1100, isLocal: false, isDefinition: true, align: 32)
!793 = distinct !DICompileUnit(language: DW_LANG_C99, file: !794, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !795, retainedTypes: !913, globals: !993, splitDebugInlining: false, nameTableKind: None)
!794 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/button")
!795 = !{!796, !802, !30, !807, !812, !816, !820, !824, !830, !834, !878, !885, !904}
!796 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !797, line: 23, baseType: !32, size: 32, elements: !798)
!797 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!798 = !{!799, !800, !801}
!799 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!800 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!801 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!802 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !797, line: 48, baseType: !32, size: 32, elements: !803)
!803 = !{!804, !805, !806}
!804 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!805 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!806 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!807 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !808, line: 167, baseType: !32, size: 32, elements: !809)
!808 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!809 = !{!810, !811}
!810 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!811 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!812 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !808, line: 107, baseType: !32, size: 32, elements: !813)
!813 = !{!814, !815}
!814 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!815 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!816 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !808, line: 208, baseType: !32, size: 32, elements: !817)
!817 = !{!818, !819}
!818 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!819 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!820 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !808, line: 261, baseType: !32, size: 32, elements: !821)
!821 = !{!822, !823}
!822 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!823 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!824 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !808, line: 237, baseType: !32, size: 32, elements: !825)
!825 = !{!826, !827, !828, !829}
!826 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!827 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!828 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!829 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!830 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !808, line: 152, baseType: !32, size: 32, elements: !831)
!831 = !{!832, !833}
!832 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!833 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!834 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !259, line: 71, baseType: !114, size: 32, elements: !835)
!835 = !{!836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!836 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!837 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!838 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!839 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!840 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!841 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!842 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!843 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!844 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!845 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!846 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!847 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!848 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!849 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!850 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!851 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!852 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!853 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!854 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!855 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!856 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!857 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!858 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!859 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!860 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!861 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!862 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!863 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!864 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!865 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!866 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!867 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!868 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!869 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!870 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!871 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!872 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!873 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!874 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!875 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!876 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!877 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!878 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !879, line: 44, baseType: !32, size: 32, elements: !880)
!879 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!880 = !{!881, !882, !883, !884}
!881 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!882 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!883 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!884 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!885 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !886, line: 54, baseType: !32, size: 32, elements: !887)
!886 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!887 = !{!888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903}
!888 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!889 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!890 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!891 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!892 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!893 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!894 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!895 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!896 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!897 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!898 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!899 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!900 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!901 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!902 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!903 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!904 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !905, line: 53, baseType: !32, size: 32, elements: !906)
!905 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!906 = !{!907, !908, !909, !910, !911, !912}
!907 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!908 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!909 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!910 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!911 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!912 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!913 = !{!796, !113, !114, !914, !956, !957, !958, !959, !209, !152, !213, !142, !960, !961, !402, !962, !992, !389}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !259, line: 923, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !259, line: 883, size: 10464, elements: !917)
!917 = !{!918, !919, !920, !921, !922, !926, !927, !928, !929, !930, !931, !932, !933, !937, !938, !939, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !916, file: !259, line: 884, baseType: !265, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !916, file: !259, line: 885, baseType: !265, size: 32, offset: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !916, file: !259, line: 886, baseType: !265, size: 32, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !916, file: !259, line: 887, baseType: !265, size: 32, offset: 96)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !916, file: !259, line: 888, baseType: !923, size: 896, offset: 128)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 896, elements: !924)
!924 = !{!925}
!925 = !DISubrange(count: 28)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !916, file: !259, line: 889, baseType: !265, size: 32, offset: 1024)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !916, file: !259, line: 890, baseType: !265, size: 32, offset: 1056)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !916, file: !259, line: 891, baseType: !265, size: 32, offset: 1088)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !916, file: !259, line: 892, baseType: !265, size: 32, offset: 1120)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !916, file: !259, line: 893, baseType: !923, size: 896, offset: 1152)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !916, file: !259, line: 894, baseType: !265, size: 32, offset: 2048)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !916, file: !259, line: 895, baseType: !265, size: 32, offset: 2080)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !916, file: !259, line: 896, baseType: !934, size: 960, offset: 2112)
!934 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 960, elements: !935)
!935 = !{!936}
!936 = !DISubrange(count: 30)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !916, file: !259, line: 897, baseType: !265, size: 32, offset: 3072)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !916, file: !259, line: 898, baseType: !265, size: 32, offset: 3104)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !916, file: !259, line: 899, baseType: !940, size: 3008, offset: 3136)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 3008, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 94)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !916, file: !259, line: 900, baseType: !265, size: 32, offset: 6144)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !916, file: !259, line: 901, baseType: !265, size: 32, offset: 6176)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !916, file: !259, line: 902, baseType: !265, size: 32, offset: 6208)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !916, file: !259, line: 903, baseType: !264, size: 32, offset: 6240)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !916, file: !259, line: 904, baseType: !272, size: 1984, offset: 6272)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !916, file: !259, line: 905, baseType: !264, size: 32, offset: 8256)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !916, file: !259, line: 907, baseType: !264, size: 32, offset: 8288)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !916, file: !259, line: 910, baseType: !264, size: 32, offset: 8320)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !916, file: !259, line: 911, baseType: !264, size: 32, offset: 8352)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !916, file: !259, line: 913, baseType: !264, size: 32, offset: 8384)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !916, file: !259, line: 917, baseType: !264, size: 32, offset: 8416)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !916, file: !259, line: 919, baseType: !272, size: 1984, offset: 8448)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !916, file: !259, line: 920, baseType: !265, size: 32, offset: 10432)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !808, line: 146, baseType: !812)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !808, line: 164, baseType: !830)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !613, line: 485, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !613, line: 468, size: 28704, elements: !965)
!965 = !{!966, !970, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !987, !991}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !964, file: !613, line: 470, baseType: !967, size: 512)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 512, elements: !968)
!968 = !{!969}
!969 = !DISubrange(count: 16)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !964, file: !613, line: 471, baseType: !971, size: 512, offset: 512)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 512, elements: !968)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !964, file: !613, line: 472, baseType: !967, size: 512, offset: 1024)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !964, file: !613, line: 473, baseType: !971, size: 512, offset: 1536)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !964, file: !613, line: 474, baseType: !967, size: 512, offset: 2048)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !964, file: !613, line: 475, baseType: !971, size: 512, offset: 2560)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !964, file: !613, line: 476, baseType: !967, size: 512, offset: 3072)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !964, file: !613, line: 477, baseType: !971, size: 512, offset: 3584)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !964, file: !613, line: 478, baseType: !967, size: 512, offset: 4096)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !964, file: !613, line: 479, baseType: !971, size: 512, offset: 4608)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !964, file: !613, line: 480, baseType: !967, size: 512, offset: 5120)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !964, file: !613, line: 481, baseType: !971, size: 512, offset: 5632)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !964, file: !613, line: 482, baseType: !983, size: 3968, offset: 6144)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 3968, elements: !985)
!984 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !139)
!985 = !{!986}
!986 = !DISubrange(count: 496)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !964, file: !613, line: 483, baseType: !988, size: 18560, offset: 10112)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 18560, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 580)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !964, file: !613, line: 484, baseType: !265, size: 32, offset: 28672)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !879, line: 56, baseType: !113)
!993 = !{!994, !1044, !1085, !791, !1090, !1115, !1117, !1134, !1136, !1146, !1149, !1164, !1202, !1216}
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(name: "on", scope: !996, file: !997, line: 549, type: !379, isLocal: true, isDefinition: true)
!996 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !997, file: !997, line: 547, type: !998, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !793, retainedNodes: !1000)
!997 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!998 = !DISubroutineType(types: !999)
!999 = !{null, !802}
!1000 = !{!1001, !1002, !1005}
!1001 = !DILocalVariable(name: "start_mode", arg: 1, scope: !996, file: !997, line: 547, type: !802)
!1002 = !DILocalVariable(name: "err", scope: !1003, file: !997, line: 553, type: !114)
!1003 = distinct !DILexicalBlock(scope: !1004, file: !997, line: 552, column: 31)
!1004 = distinct !DILexicalBlock(scope: !996, file: !997, line: 552, column: 6)
!1005 = !DILocalVariable(name: "mgr", scope: !1003, file: !997, line: 554, type: !1006)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 32)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !1008, line: 154, size: 224, elements: !1009)
!1008 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1009 = !{!1010, !1022, !1023, !1039, !1041, !1042, !1043}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !1007, file: !1008, line: 158, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !183, line: 40, baseType: !1012)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !183, line: 35, size: 64, elements: !1013)
!1013 = !{!1014, !1021}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1012, file: !183, line: 36, baseType: !1015, size: 32)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !183, line: 33, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !183, line: 29, size: 32, elements: !1018)
!1018 = !{!1019}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1017, file: !183, line: 30, baseType: !1020, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1012, file: !183, line: 37, baseType: !1015, size: 32, offset: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !1007, file: !1008, line: 163, baseType: !1011, size: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !1007, file: !1008, line: 166, baseType: !1024, size: 32, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !1008, line: 133, size: 96, elements: !1027)
!1027 = !{!1028, !1037, !1038}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1026, file: !1008, line: 135, baseType: !1029, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !1008, line: 129, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 32)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{null, !1006, !1033}
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !1008, line: 101, baseType: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 32)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{null, !1006, !114}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1026, file: !1008, line: 138, baseType: !1029, size: 32, offset: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !1026, file: !1008, line: 143, baseType: !1029, size: 32, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !1007, file: !1008, line: 169, baseType: !1040, offset: 160)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !353, line: 43, elements: !354)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !1007, file: !1008, line: 172, baseType: !114, size: 32, offset: 160)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1007, file: !1008, line: 175, baseType: !227, size: 16, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !1007, file: !1008, line: 178, baseType: !227, size: 16, offset: 208)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(name: "cli", scope: !996, file: !997, line: 550, type: !1046, isLocal: true, isDefinition: true)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !1008, line: 273, size: 128, elements: !1047)
!1047 = !{!1048, !1049}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1046, file: !1008, line: 280, baseType: !1016, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !1046, file: !1008, line: 283, baseType: !1050, size: 96, offset: 32)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !1051, line: 138, size: 96, elements: !1052)
!1051 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1052 = !{!1053, !1082, !1083}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !1050, file: !1051, line: 149, baseType: !1054, size: 32)
!1054 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !1051, line: 139, size: 32, elements: !1055)
!1055 = !{!1056, !1077}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !1054, file: !1051, line: 145, baseType: !1057, size: 32)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 32)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !569, line: 5397, size: 128, elements: !1059)
!1059 = !{!1060, !1075, !1076}
