; ModuleID = 'build/96b_meerkat96/dyn_channel/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type { i32 }
%struct.zbus_channel = type { i8*, i16, i8*, i8*, i1 (i8*, i32)*, %struct.k_mutex*, %struct.zbus_observer** }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.k_spinlock] }
%struct._thread_arch = type { i32, i32 }
%struct.zbus_observer = type { i8, %struct.k_msgq*, {}* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/dyn_channel/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/dyn_channel")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/dyn_channel")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_consumer_sub", scope: !27, file: !117, line: 13, type: !126, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !114, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/dyn_channel/src/consumer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/dyn_channel")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !104, !108, !111, !112}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !107)
!107 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !113)
!113 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!114 = !{!25, !115, !289, !320, !324, !329, !334}
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "consumer_sub", scope: !27, file: !117, line: 13, type: !118, isLocal: false, isDefinition: true, align: 32)
!117 = !DIFile(filename: "zephyr/samples/subsys/zbus/dyn_channel/src/consumer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !119, line: 85, size: 96, elements: !120)
!119 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = !{!121, !123, !168}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !118, file: !119, line: 91, baseType: !122, size: 8)
!122 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !118, file: !119, line: 93, baseType: !124, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !127, line: 4204, size: 352, elements: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !{!129, !150, !155, !158, !159, !161, !162, !163, !164, !165}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !126, file: !127, line: 4206, baseType: !130, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !131, line: 233, baseType: !132)
!131 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 231, size: 64, elements: !133)
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !132, file: !131, line: 232, baseType: !135, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !136, line: 48, baseType: !137)
!136 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !136, line: 37, size: 64, elements: !138)
!138 = !{!139, !145}
!139 = !DIDerivedType(tag: DW_TAG_member, scope: !137, file: !136, line: 38, baseType: !140, size: 32)
!140 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !137, file: !136, line: 38, size: 32, elements: !141)
!141 = !{!142, !144}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !140, file: !136, line: 39, baseType: !143, size: 32)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !140, file: !136, line: 40, baseType: !143, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, scope: !137, file: !136, line: 42, baseType: !146, size: 32, offset: 32)
!146 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !137, file: !136, line: 42, size: 32, elements: !147)
!147 = !{!148, !149}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !146, file: !136, line: 43, baseType: !143, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !146, file: !136, line: 44, baseType: !143, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !126, file: !127, line: 4208, baseType: !151, size: 32, offset: 64)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !152, line: 43, size: 32, elements: !153)
!152 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!153 = !{!154}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !151, file: !152, line: 52, baseType: !22, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !126, file: !127, line: 4210, baseType: !156, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !157, line: 214, baseType: !32)
!157 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!158 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !126, file: !127, line: 4212, baseType: !111, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !126, file: !127, line: 4214, baseType: !160, size: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !126, file: !127, line: 4216, baseType: !160, size: 32, offset: 192)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !126, file: !127, line: 4218, baseType: !160, size: 32, offset: 224)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !126, file: !127, line: 4220, baseType: !160, size: 32, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !126, file: !127, line: 4222, baseType: !111, size: 32, offset: 288)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !126, file: !127, line: 4227, baseType: !166, size: 8, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !167)
!167 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !118, file: !119, line: 96, baseType: !169, size: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !170)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DISubroutineType(types: !172)
!172 = !{null, !173}
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !119, line: 29, size: 224, elements: !176)
!176 = !{!177, !179, !183, !185, !186, !191, !284}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !175, file: !119, line: 32, baseType: !178, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !175, file: !119, line: 35, baseType: !180, size: 16, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !182)
!182 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !175, file: !119, line: 40, baseType: !184, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !175, file: !119, line: 45, baseType: !184, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !175, file: !119, line: 51, baseType: !187, size: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DISubroutineType(types: !190)
!190 = !{!122, !13, !156}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !175, file: !119, line: 56, baseType: !192, size: 32, offset: 160)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !127, line: 2720, size: 160, elements: !194)
!194 = !{!195, !196, !282, !283}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !193, file: !127, line: 2722, baseType: !130, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !193, file: !127, line: 2724, baseType: !197, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !199, line: 245, size: 896, elements: !200)
!199 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!200 = !{!201, !246, !259, !260, !261, !262, !277}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !198, file: !199, line: 247, baseType: !202, size: 384)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !199, line: 57, size: 384, elements: !203)
!203 = !{!204, !218, !220, !221, !222, !233, !234, !235}
!204 = !DIDerivedType(tag: DW_TAG_member, scope: !202, file: !199, line: 60, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !202, file: !199, line: 60, size: 64, elements: !206)
!206 = !{!207, !209}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !205, file: !199, line: 61, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !136, line: 49, baseType: !137)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !205, file: !199, line: 62, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !211, line: 49, size: 64, elements: !212)
!211 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !{!213}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !210, file: !211, line: 50, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 64, elements: !216)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!216 = !{!217}
!217 = !DISubrange(count: 2)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !202, file: !199, line: 68, baseType: !219, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !202, file: !199, line: 71, baseType: !166, size: 8, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !202, file: !199, line: 74, baseType: !166, size: 8, offset: 104)
!222 = !DIDerivedType(tag: DW_TAG_member, scope: !202, file: !199, line: 90, baseType: !223, size: 16, offset: 112)
!223 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !202, file: !199, line: 90, size: 16, elements: !224)
!224 = !{!225, !232}
!225 = !DIDerivedType(tag: DW_TAG_member, scope: !223, file: !199, line: 91, baseType: !226, size: 16)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !223, file: !199, line: 91, size: 16, elements: !227)
!227 = !{!228, !231}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !226, file: !199, line: 96, baseType: !229, size: 8)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !230)
!230 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !226, file: !199, line: 97, baseType: !166, size: 8, offset: 8)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !223, file: !199, line: 100, baseType: !181, size: 16)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !202, file: !199, line: 107, baseType: !111, size: 32, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !202, file: !199, line: 127, baseType: !102, size: 32, offset: 160)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !202, file: !199, line: 131, baseType: !236, size: 192, offset: 192)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !131, line: 244, size: 192, elements: !237)
!237 = !{!238, !239, !245}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !236, file: !131, line: 245, baseType: !208, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !236, file: !131, line: 246, baseType: !240, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !131, line: 242, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !244}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !236, file: !131, line: 249, baseType: !106, size: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !198, file: !199, line: 250, baseType: !247, size: 288, offset: 384)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !248, line: 25, size: 288, elements: !249)
!248 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!249 = !{!250, !251, !252, !253, !254, !255, !256, !257, !258}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !247, file: !248, line: 26, baseType: !111, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !247, file: !248, line: 27, baseType: !111, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !247, file: !248, line: 28, baseType: !111, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !247, file: !248, line: 29, baseType: !111, size: 32, offset: 96)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !247, file: !248, line: 30, baseType: !111, size: 32, offset: 128)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !247, file: !248, line: 31, baseType: !111, size: 32, offset: 160)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !247, file: !248, line: 32, baseType: !111, size: 32, offset: 192)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !247, file: !248, line: 33, baseType: !111, size: 32, offset: 224)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !247, file: !248, line: 34, baseType: !111, size: 32, offset: 256)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !198, file: !199, line: 253, baseType: !102, size: 32, offset: 672)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !198, file: !199, line: 256, baseType: !130, size: 64, offset: 704)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !198, file: !199, line: 294, baseType: !103, size: 32, offset: 768)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !198, file: !199, line: 325, baseType: !263, size: 32, offset: 800)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !127, line: 5073, size: 192, elements: !265)
!265 = !{!266, !275, !276}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !264, file: !127, line: 5074, baseType: !267, size: 96)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !268, line: 56, size: 96, elements: !269)
!268 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !{!270, !273, !274}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !267, file: !268, line: 57, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !268, line: 57, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !267, file: !268, line: 58, baseType: !102, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !267, file: !268, line: 59, baseType: !156, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !264, file: !127, line: 5075, baseType: !130, size: 64, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !264, file: !127, line: 5076, baseType: !151, size: 32, offset: 160)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !198, file: !199, line: 343, baseType: !278, size: 64, offset: 832)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !248, line: 60, size: 64, elements: !279)
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !278, file: !248, line: 63, baseType: !111, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !278, file: !248, line: 66, baseType: !111, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !193, file: !127, line: 2727, baseType: !111, size: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !193, file: !127, line: 2730, baseType: !103, size: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !175, file: !119, line: 67, baseType: !285, size: 32, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "_k_thread_data_consumer_thread_id", scope: !27, file: !117, line: 44, type: !291, isLocal: false, isDefinition: true, align: 32)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !127, line: 620, size: 384, elements: !292)
!292 = !{!293, !294, !302, !303, !308, !309, !310, !311, !312, !313, !315, !319}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !291, file: !127, line: 621, baseType: !197, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !291, file: !127, line: 622, baseType: !295, size: 32, offset: 32)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !297, line: 44, baseType: !298)
!297 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !299, line: 47, size: 8, elements: !300)
!299 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!300 = !{!301}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !298, file: !299, line: 48, baseType: !110, size: 8)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !291, file: !127, line: 623, baseType: !32, size: 32, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !291, file: !127, line: 624, baseType: !304, size: 32, offset: 96)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !297, line: 46, baseType: !305)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DISubroutineType(types: !307)
!307 = !{null, !102, !102, !102}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !291, file: !127, line: 625, baseType: !102, size: 32, offset: 128)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !291, file: !127, line: 626, baseType: !102, size: 32, offset: 160)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !291, file: !127, line: 627, baseType: !102, size: 32, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !291, file: !127, line: 628, baseType: !103, size: 32, offset: 224)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !291, file: !127, line: 629, baseType: !111, size: 32, offset: 256)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !291, file: !127, line: 630, baseType: !314, size: 32, offset: 288)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !291, file: !127, line: 631, baseType: !316, size: 32, offset: 320)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = !DISubroutineType(types: !318)
!318 = !{null}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !291, file: !127, line: 632, baseType: !108, size: 32, offset: 352)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "consumer_thread_id", scope: !27, file: !117, line: 44, type: !322, isLocal: false, isDefinition: true)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !199, line: 347, baseType: !197)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_consumer_sub", scope: !27, file: !117, line: 13, type: !326, isLocal: true, isDefinition: true, align: 32)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 128, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 16)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "_k_thread_stack_consumer_thread_id", scope: !27, file: !117, line: 44, type: !331, isLocal: false, isDefinition: true, align: 64)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 8192, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 1024)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "_k_thread_obj_consumer_thread_id", scope: !27, file: !117, line: 44, type: !198, isLocal: false, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "_zbus_mutex_pkt_chan", scope: !338, file: !344, line: 15, type: !355, isLocal: true, isDefinition: true, align: 32)
!338 = distinct !DICompileUnit(language: DW_LANG_C99, file: !339, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !340, globals: !341, splitDebugInlining: false, nameTableKind: None)
!339 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/dyn_channel/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/dyn_channel")
!340 = !{!102, !103}
!341 = !{!336, !342, !486, !488, !490, !492, !494, !496, !498, !500, !507, !510, !517, !522, !527, !529, !531}
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "pkt_chan", scope: !338, file: !344, line: 15, type: !345, isLocal: false, isDefinition: true, align: 32)
!344 = !DIFile(filename: "zephyr/samples/subsys/zbus/dyn_channel/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !119, line: 29, size: 224, elements: !347)
!347 = !{!348, !349, !350, !351, !352, !353, !457}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !346, file: !119, line: 32, baseType: !178, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !346, file: !119, line: 35, baseType: !180, size: 16, offset: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !346, file: !119, line: 40, baseType: !184, size: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !346, file: !119, line: 45, baseType: !184, size: 32, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !346, file: !119, line: 51, baseType: !187, size: 32, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !346, file: !119, line: 56, baseType: !354, size: 32, offset: 160)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !127, line: 2720, size: 160, elements: !356)
!356 = !{!357, !376, !455, !456}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !355, file: !127, line: 2722, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !131, line: 233, baseType: !359)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 231, size: 64, elements: !360)
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !359, file: !131, line: 232, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !136, line: 48, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !136, line: 37, size: 64, elements: !364)
!364 = !{!365, !371}
!365 = !DIDerivedType(tag: DW_TAG_member, scope: !363, file: !136, line: 38, baseType: !366, size: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !363, file: !136, line: 38, size: 32, elements: !367)
!367 = !{!368, !370}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !366, file: !136, line: 39, baseType: !369, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !366, file: !136, line: 40, baseType: !369, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, scope: !363, file: !136, line: 42, baseType: !372, size: 32, offset: 32)
!372 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !363, file: !136, line: 42, size: 32, elements: !373)
!373 = !{!374, !375}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !372, file: !136, line: 43, baseType: !369, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !372, file: !136, line: 44, baseType: !369, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !355, file: !127, line: 2724, baseType: !377, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !199, line: 245, size: 896, elements: !379)
!379 = !{!380, !420, !432, !433, !434, !435, !450}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !378, file: !199, line: 247, baseType: !381, size: 384)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !199, line: 57, size: 384, elements: !382)
!382 = !{!383, !394, !396, !397, !398, !407, !408, !409}
!383 = !DIDerivedType(tag: DW_TAG_member, scope: !381, file: !199, line: 60, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !381, file: !199, line: 60, size: 64, elements: !385)
!385 = !{!386, !388}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !384, file: !199, line: 61, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !136, line: 49, baseType: !363)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !384, file: !199, line: 62, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !211, line: 49, size: 64, elements: !390)
!390 = !{!391}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !389, file: !211, line: 50, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 64, elements: !216)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !381, file: !199, line: 68, baseType: !395, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !381, file: !199, line: 71, baseType: !166, size: 8, offset: 96)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !381, file: !199, line: 74, baseType: !166, size: 8, offset: 104)
!398 = !DIDerivedType(tag: DW_TAG_member, scope: !381, file: !199, line: 90, baseType: !399, size: 16, offset: 112)
!399 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !381, file: !199, line: 90, size: 16, elements: !400)
!400 = !{!401, !406}
!401 = !DIDerivedType(tag: DW_TAG_member, scope: !399, file: !199, line: 91, baseType: !402, size: 16)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !399, file: !199, line: 91, size: 16, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !402, file: !199, line: 96, baseType: !229, size: 8)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !402, file: !199, line: 97, baseType: !166, size: 8, offset: 8)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !399, file: !199, line: 100, baseType: !181, size: 16)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !381, file: !199, line: 107, baseType: !111, size: 32, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !381, file: !199, line: 127, baseType: !102, size: 32, offset: 160)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !381, file: !199, line: 131, baseType: !410, size: 192, offset: 192)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !131, line: 244, size: 192, elements: !411)
!411 = !{!412, !413, !419}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !410, file: !131, line: 245, baseType: !387, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !410, file: !131, line: 246, baseType: !414, size: 32, offset: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !131, line: 242, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !410, file: !131, line: 249, baseType: !106, size: 64, offset: 128)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !378, file: !199, line: 250, baseType: !421, size: 288, offset: 384)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !248, line: 25, size: 288, elements: !422)
!422 = !{!423, !424, !425, !426, !427, !428, !429, !430, !431}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !421, file: !248, line: 26, baseType: !111, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !421, file: !248, line: 27, baseType: !111, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !421, file: !248, line: 28, baseType: !111, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !421, file: !248, line: 29, baseType: !111, size: 32, offset: 96)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !421, file: !248, line: 30, baseType: !111, size: 32, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !421, file: !248, line: 31, baseType: !111, size: 32, offset: 160)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !421, file: !248, line: 32, baseType: !111, size: 32, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !421, file: !248, line: 33, baseType: !111, size: 32, offset: 224)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !421, file: !248, line: 34, baseType: !111, size: 32, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !378, file: !199, line: 253, baseType: !102, size: 32, offset: 672)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !378, file: !199, line: 256, baseType: !358, size: 64, offset: 704)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !378, file: !199, line: 294, baseType: !103, size: 32, offset: 768)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !378, file: !199, line: 325, baseType: !436, size: 32, offset: 800)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !127, line: 5073, size: 192, elements: !438)
!438 = !{!439, !445, !446}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !437, file: !127, line: 5074, baseType: !440, size: 96)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !268, line: 56, size: 96, elements: !441)
!441 = !{!442, !443, !444}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !440, file: !268, line: 57, baseType: !271, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !440, file: !268, line: 58, baseType: !102, size: 32, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !440, file: !268, line: 59, baseType: !156, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !437, file: !127, line: 5075, baseType: !358, size: 64, offset: 96)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !437, file: !127, line: 5076, baseType: !447, size: 32, offset: 160)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !152, line: 43, size: 32, elements: !448)
!448 = !{!449}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !447, file: !152, line: 52, baseType: !22, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !378, file: !199, line: 343, baseType: !451, size: 64, offset: 832)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !248, line: 60, size: 64, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !451, file: !248, line: 63, baseType: !111, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !451, file: !248, line: 66, baseType: !111, size: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !355, file: !127, line: 2727, baseType: !111, size: 32, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !355, file: !127, line: 2730, baseType: !103, size: 32, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !346, file: !119, line: 67, baseType: !458, size: 32, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !119, line: 85, size: 96, elements: !463)
!463 = !{!464, !465, !480}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !462, file: !119, line: 91, baseType: !122, size: 8)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !462, file: !119, line: 93, baseType: !466, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !127, line: 4204, size: 352, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477, !478, !479}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !468, file: !127, line: 4206, baseType: !358, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !468, file: !127, line: 4208, baseType: !447, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !468, file: !127, line: 4210, baseType: !156, size: 32, offset: 96)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !468, file: !127, line: 4212, baseType: !111, size: 32, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !468, file: !127, line: 4214, baseType: !160, size: 32, offset: 160)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !468, file: !127, line: 4216, baseType: !160, size: 32, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !468, file: !127, line: 4218, baseType: !160, size: 32, offset: 224)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !468, file: !127, line: 4220, baseType: !160, size: 32, offset: 256)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !468, file: !127, line: 4222, baseType: !111, size: 32, offset: 288)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !468, file: !127, line: 4227, baseType: !166, size: 8, offset: 320)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !462, file: !119, line: 96, baseType: !481, size: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !485}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 32)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "_zbus_mutex_version_chan", scope: !338, file: !344, line: 24, type: !355, isLocal: true, isDefinition: true, align: 32)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "version_chan", scope: !338, file: !344, line: 24, type: !345, isLocal: false, isDefinition: true, align: 32)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "_zbus_mutex_data_ready_chan", scope: !338, file: !344, line: 33, type: !355, isLocal: true, isDefinition: true, align: 32)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "data_ready_chan", scope: !338, file: !344, line: 33, type: !345, isLocal: false, isDefinition: true, align: 32)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "_zbus_mutex_ack", scope: !338, file: !344, line: 42, type: !355, isLocal: true, isDefinition: true, align: 32)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "ack", scope: !338, file: !344, line: 42, type: !345, isLocal: false, isDefinition: true, align: 32)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "filter_lis", scope: !338, file: !344, line: 73, type: !462, isLocal: false, isDefinition: true, align: 32)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "_zbus_message_pkt_chan", scope: !338, file: !344, line: 15, type: !502, isLocal: true, isDefinition: true)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "external_data_msg", file: !503, line: 16, size: 64, elements: !504)
!503 = !DIFile(filename: "zephyr/samples/subsys/zbus/dyn_channel/src/messages.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!504 = !{!505, !506}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !502, file: !503, line: 17, baseType: !102, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !502, file: !503, line: 18, baseType: !156, size: 32, offset: 32)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "_zbus_observers_pkt_chan", scope: !338, file: !344, line: 15, type: !509, isLocal: true, isDefinition: true)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 64, elements: !216)
!510 = !DIGlobalVariableExpression(var: !511, expr: !DIExpression())
!511 = distinct !DIGlobalVariable(name: "_zbus_message_version_chan", scope: !338, file: !344, line: 24, type: !512, isLocal: true, isDefinition: true)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "version_msg", file: !503, line: 10, size: 32, elements: !513)
!513 = !{!514, !515, !516}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !512, file: !503, line: 11, baseType: !166, size: 8)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !512, file: !503, line: 12, baseType: !166, size: 8, offset: 8)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "build", scope: !512, file: !503, line: 13, baseType: !181, size: 16, offset: 16)
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "_zbus_observers_version_chan", scope: !338, file: !344, line: 24, type: !519, isLocal: true, isDefinition: true)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 32, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 1)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "_zbus_message_data_ready_chan", scope: !338, file: !344, line: 33, type: !524, isLocal: true, isDefinition: true)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ack_msg", file: !503, line: 21, size: 8, elements: !525)
!525 = !{!526}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !524, file: !503, line: 22, baseType: !166, size: 8)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "_zbus_observers_data_ready_chan", scope: !338, file: !344, line: 33, type: !509, isLocal: true, isDefinition: true)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "_zbus_message_ack", scope: !338, file: !344, line: 42, type: !524, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "_zbus_observers_ack", scope: !338, file: !344, line: 42, type: !509, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_producer_sub", scope: !535, file: !542, line: 13, type: !549, isLocal: false, isDefinition: true, align: 32)
!535 = distinct !DICompileUnit(language: DW_LANG_C99, file: !536, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !537, globals: !539, splitDebugInlining: false, nameTableKind: None)
!536 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/dyn_channel/src/producer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/dyn_channel")
!537 = !{!102, !103, !538, !104, !111, !112}
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!539 = !{!533, !540, !684, !705, !709, !711, !714}
!540 = !DIGlobalVariableExpression(var: !541, expr: !DIExpression())
!541 = distinct !DIGlobalVariable(name: "producer_sub", scope: !535, file: !542, line: 13, type: !543, isLocal: false, isDefinition: true, align: 32)
!542 = !DIFile(filename: "zephyr/samples/subsys/zbus/dyn_channel/src/producer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !119, line: 85, size: 96, elements: !544)
!544 = !{!545, !546, !582}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !543, file: !119, line: 91, baseType: !122, size: 8)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !543, file: !119, line: 93, baseType: !547, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !127, line: 4204, size: 352, elements: !550)
!550 = !{!551, !570, !574, !575, !576, !577, !578, !579, !580, !581}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !549, file: !127, line: 4206, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !131, line: 233, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !131, line: 231, size: 64, elements: !554)
!554 = !{!555}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !553, file: !131, line: 232, baseType: !556, size: 64)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !136, line: 48, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !136, line: 37, size: 64, elements: !558)
!558 = !{!559, !565}
!559 = !DIDerivedType(tag: DW_TAG_member, scope: !557, file: !136, line: 38, baseType: !560, size: 32)
!560 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !557, file: !136, line: 38, size: 32, elements: !561)
!561 = !{!562, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !560, file: !136, line: 39, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !560, file: !136, line: 40, baseType: !563, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, scope: !557, file: !136, line: 42, baseType: !566, size: 32, offset: 32)
!566 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !557, file: !136, line: 42, size: 32, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !566, file: !136, line: 43, baseType: !563, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !566, file: !136, line: 44, baseType: !563, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !549, file: !127, line: 4208, baseType: !571, size: 32, offset: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !152, line: 43, size: 32, elements: !572)
!572 = !{!573}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !571, file: !152, line: 52, baseType: !22, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !549, file: !127, line: 4210, baseType: !156, size: 32, offset: 96)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !549, file: !127, line: 4212, baseType: !111, size: 32, offset: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !549, file: !127, line: 4214, baseType: !160, size: 32, offset: 160)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !549, file: !127, line: 4216, baseType: !160, size: 32, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !549, file: !127, line: 4218, baseType: !160, size: 32, offset: 224)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !549, file: !127, line: 4220, baseType: !160, size: 32, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !549, file: !127, line: 4222, baseType: !111, size: 32, offset: 288)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !549, file: !127, line: 4227, baseType: !166, size: 8, offset: 320)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !543, file: !119, line: 96, baseType: !583, size: 32, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 32)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !119, line: 29, size: 224, elements: !590)
!590 = !{!591, !592, !593, !594, !595, !596, !679}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !589, file: !119, line: 32, baseType: !178, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !589, file: !119, line: 35, baseType: !180, size: 16, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !589, file: !119, line: 40, baseType: !184, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !589, file: !119, line: 45, baseType: !184, size: 32, offset: 96)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !589, file: !119, line: 51, baseType: !187, size: 32, offset: 128)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !589, file: !119, line: 56, baseType: !597, size: 32, offset: 160)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !127, line: 2720, size: 160, elements: !599)
!599 = !{!600, !601, !677, !678}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !598, file: !127, line: 2722, baseType: !552, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !598, file: !127, line: 2724, baseType: !602, size: 32, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !199, line: 245, size: 896, elements: !604)
!604 = !{!605, !645, !657, !658, !659, !660, !672}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !603, file: !199, line: 247, baseType: !606, size: 384)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !199, line: 57, size: 384, elements: !607)
!607 = !{!608, !619, !621, !622, !623, !632, !633, !634}
!608 = !DIDerivedType(tag: DW_TAG_member, scope: !606, file: !199, line: 60, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !606, file: !199, line: 60, size: 64, elements: !610)
!610 = !{!611, !613}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !609, file: !199, line: 61, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !136, line: 49, baseType: !557)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !609, file: !199, line: 62, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !211, line: 49, size: 64, elements: !615)
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !614, file: !211, line: 50, baseType: !617, size: 64)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !618, size: 64, elements: !216)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !606, file: !199, line: 68, baseType: !620, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !606, file: !199, line: 71, baseType: !166, size: 8, offset: 96)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !606, file: !199, line: 74, baseType: !166, size: 8, offset: 104)
!623 = !DIDerivedType(tag: DW_TAG_member, scope: !606, file: !199, line: 90, baseType: !624, size: 16, offset: 112)
!624 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !606, file: !199, line: 90, size: 16, elements: !625)
!625 = !{!626, !631}
!626 = !DIDerivedType(tag: DW_TAG_member, scope: !624, file: !199, line: 91, baseType: !627, size: 16)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !624, file: !199, line: 91, size: 16, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !627, file: !199, line: 96, baseType: !229, size: 8)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !627, file: !199, line: 97, baseType: !166, size: 8, offset: 8)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !624, file: !199, line: 100, baseType: !181, size: 16)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !606, file: !199, line: 107, baseType: !111, size: 32, offset: 128)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !606, file: !199, line: 127, baseType: !102, size: 32, offset: 160)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !606, file: !199, line: 131, baseType: !635, size: 192, offset: 192)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !131, line: 244, size: 192, elements: !636)
!636 = !{!637, !638, !644}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !635, file: !131, line: 245, baseType: !612, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !635, file: !131, line: 246, baseType: !639, size: 32, offset: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !131, line: 242, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 32)
!641 = !DISubroutineType(types: !642)
!642 = !{null, !643}
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !635, file: !131, line: 249, baseType: !106, size: 64, offset: 128)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !603, file: !199, line: 250, baseType: !646, size: 288, offset: 384)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !248, line: 25, size: 288, elements: !647)
!647 = !{!648, !649, !650, !651, !652, !653, !654, !655, !656}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !646, file: !248, line: 26, baseType: !111, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !646, file: !248, line: 27, baseType: !111, size: 32, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !646, file: !248, line: 28, baseType: !111, size: 32, offset: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !646, file: !248, line: 29, baseType: !111, size: 32, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !646, file: !248, line: 30, baseType: !111, size: 32, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !646, file: !248, line: 31, baseType: !111, size: 32, offset: 160)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !646, file: !248, line: 32, baseType: !111, size: 32, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !646, file: !248, line: 33, baseType: !111, size: 32, offset: 224)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !646, file: !248, line: 34, baseType: !111, size: 32, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !603, file: !199, line: 253, baseType: !102, size: 32, offset: 672)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !603, file: !199, line: 256, baseType: !552, size: 64, offset: 704)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !603, file: !199, line: 294, baseType: !103, size: 32, offset: 768)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !603, file: !199, line: 325, baseType: !661, size: 32, offset: 800)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !127, line: 5073, size: 192, elements: !663)
!663 = !{!664, !670, !671}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !662, file: !127, line: 5074, baseType: !665, size: 96)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !268, line: 56, size: 96, elements: !666)
!666 = !{!667, !668, !669}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !665, file: !268, line: 57, baseType: !271, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !665, file: !268, line: 58, baseType: !102, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !665, file: !268, line: 59, baseType: !156, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !662, file: !127, line: 5075, baseType: !552, size: 64, offset: 96)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !662, file: !127, line: 5076, baseType: !571, size: 32, offset: 160)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !603, file: !199, line: 343, baseType: !673, size: 64, offset: 832)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !248, line: 60, size: 64, elements: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !673, file: !248, line: 63, baseType: !111, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !673, file: !248, line: 66, baseType: !111, size: 32, offset: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !598, file: !127, line: 2727, baseType: !111, size: 32, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !598, file: !127, line: 2730, baseType: !103, size: 32, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !589, file: !119, line: 67, baseType: !680, size: 32, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "_k_thread_data_producer_thread_id", scope: !535, file: !542, line: 40, type: !686, isLocal: false, isDefinition: true, align: 32)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !127, line: 620, size: 384, elements: !687)
!687 = !{!688, !689, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !686, file: !127, line: 621, baseType: !602, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !686, file: !127, line: 622, baseType: !690, size: 32, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !297, line: 44, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !299, line: 47, size: 8, elements: !693)
!693 = !{!694}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !692, file: !299, line: 48, baseType: !110, size: 8)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !686, file: !127, line: 623, baseType: !32, size: 32, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !686, file: !127, line: 624, baseType: !304, size: 32, offset: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !686, file: !127, line: 625, baseType: !102, size: 32, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !686, file: !127, line: 626, baseType: !102, size: 32, offset: 160)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !686, file: !127, line: 627, baseType: !102, size: 32, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !686, file: !127, line: 628, baseType: !103, size: 32, offset: 224)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !686, file: !127, line: 629, baseType: !111, size: 32, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !686, file: !127, line: 630, baseType: !314, size: 32, offset: 288)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !686, file: !127, line: 631, baseType: !316, size: 32, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !686, file: !127, line: 632, baseType: !108, size: 32, offset: 352)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "producer_thread_id", scope: !535, file: !542, line: 40, type: !707, isLocal: false, isDefinition: true)
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !199, line: 347, baseType: !602)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_producer_sub", scope: !535, file: !542, line: 13, type: !326, isLocal: true, isDefinition: true, align: 32)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "_k_thread_stack_producer_thread_id", scope: !535, file: !542, line: 40, type: !713, isLocal: false, isDefinition: true, align: 64)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !692, size: 8192, elements: !332)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "_k_thread_obj_producer_thread_id", scope: !535, file: !542, line: 40, type: !603, isLocal: false, isDefinition: true)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !718, file: !732, line: 18, type: !733, isLocal: false, isDefinition: true)
!718 = distinct !DICompileUnit(language: DW_LANG_C99, file: !719, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !720, globals: !731, splitDebugInlining: false, nameTableKind: None)
!719 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/dyn_channel")
!720 = !{!22, !102, !24, !721, !723, !725, !156, !103, !726, !727, !729, !730, !160, !538, !181, !108}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!731 = !{!716}
!732 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !735, line: 16, size: 64, elements: !736)
!735 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!736 = !{!737, !738}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !734, file: !735, line: 17, baseType: !108, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !734, file: !735, line: 18, baseType: !166, size: 8, offset: 32)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "_char_out", scope: !741, file: !744, line: 54, type: !745, isLocal: false, isDefinition: true)
!741 = distinct !DICompileUnit(language: DW_LANG_C99, file: !742, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !340, globals: !743, splitDebugInlining: false, nameTableKind: None)
!742 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/dyn_channel")
!743 = !{!739}
!744 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!746 = !DISubroutineType(types: !747)
!747 = !{!103, !103}
!748 = !DIGlobalVariableExpression(var: !749, expr: !DIExpression())
!749 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !750, file: !1164, line: 258, type: !1165, isLocal: true, isDefinition: true, align: 32)
!750 = distinct !DICompileUnit(language: DW_LANG_C99, file: !751, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !752, retainedTypes: !1035, globals: !1163, splitDebugInlining: false, nameTableKind: None)
!751 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/dyn_channel")
!752 = !{!753, !785, !795, !844, !850, !971, !1006}
!753 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !754, line: 54, baseType: !32, size: 32, elements: !755)
!754 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!755 = !{!756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784}
!756 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!757 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!758 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!759 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!760 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!761 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!762 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!763 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!764 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!765 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!766 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!767 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!768 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!769 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!770 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!771 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!772 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!773 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!774 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!775 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!776 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!777 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!778 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!779 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!780 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!781 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!782 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!783 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!784 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!785 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !754, line: 224, baseType: !32, size: 32, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794}
!787 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!788 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!789 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!790 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!791 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!792 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!793 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!794 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!795 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !754, line: 275, baseType: !32, size: 32, elements: !796)
!796 = !{!797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843}
!797 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!798 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!799 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!800 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!801 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!802 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!803 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!804 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!805 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!806 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!807 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!808 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!809 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!810 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!811 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!812 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!813 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!814 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!815 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!816 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!817 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!818 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!819 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!820 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!821 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!822 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!823 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!824 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!825 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!826 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!827 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!828 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!829 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!830 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!831 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!832 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!833 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!834 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!835 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!836 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!837 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!838 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!839 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!840 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!841 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!842 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!843 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!844 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !754, line: 327, baseType: !32, size: 32, elements: !845)
!845 = !{!846, !847, !848, !849}
!846 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!847 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!848 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!849 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!850 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !851, line: 76, baseType: !32, size: 32, elements: !852)
!851 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!852 = !{!853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970}
!853 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!854 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!855 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!856 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!857 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!858 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!859 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!860 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!861 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!862 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!863 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!864 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!865 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!866 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!867 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!868 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!869 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!870 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!871 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!872 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!873 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!874 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!875 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!876 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!877 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!878 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!879 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!880 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!881 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!882 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!883 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!884 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!885 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!886 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!887 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!888 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!889 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!890 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!891 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!892 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!893 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!894 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!895 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!896 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!897 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!898 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!899 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!900 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!901 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!902 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!903 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!904 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!905 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!906 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!907 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!908 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!909 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!910 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!911 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!912 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!913 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!914 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!915 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!916 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!917 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!918 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!919 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!920 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!921 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!922 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!923 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!924 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!925 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!926 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!927 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!928 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!929 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!930 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!931 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!932 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!933 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!934 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!935 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!936 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!937 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!938 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!939 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!940 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!941 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!942 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!943 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!944 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!945 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!946 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!947 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!948 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!949 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!950 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!951 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!952 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!953 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!954 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!955 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!956 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!957 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!958 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!959 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!960 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!961 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!962 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!963 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!964 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!965 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!966 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!967 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!968 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!969 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!970 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!971 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !754, line: 237, baseType: !32, size: 32, elements: !972)
!972 = !{!973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005}
!973 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!974 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!975 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!976 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!977 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!978 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!979 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!980 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!981 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!982 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!983 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!984 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!985 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!986 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!987 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!988 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!989 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!990 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!991 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!992 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!993 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!994 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!995 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!996 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!997 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!998 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!999 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!1000 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!1001 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!1002 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!1003 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!1004 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!1005 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!1006 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !851, line: 44, baseType: !32, size: 32, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034}
!1008 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!1009 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!1010 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!1011 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!1012 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!1013 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!1014 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!1015 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!1016 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!1017 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!1018 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!1019 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!1020 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!1021 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!1022 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!1023 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!1024 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!1025 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!1026 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!1027 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!1028 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!1029 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!1030 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!1031 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!1032 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!1033 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!1034 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!1035 = !{!1036, !1108, !1151, !1162, !111}
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !1038, line: 4575, baseType: !1039)
!1038 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1038, line: 4532, size: 390144, elements: !1040)
!1040 = !{!1041, !1043, !1044, !1045, !1046, !1050, !1060, !1064, !1074, !1078}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !1039, file: !1038, line: 4533, baseType: !1042, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !111)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !1039, file: !1038, line: 4534, baseType: !1042, size: 32, offset: 32)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !1039, file: !1038, line: 4535, baseType: !1042, size: 32, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !1039, file: !1038, line: 4536, baseType: !1042, size: 32, offset: 96)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !1039, file: !1038, line: 4537, baseType: !1047, size: 16256, offset: 128)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 16256, elements: !1048)
!1048 = !{!1049}
!1049 = !DISubrange(count: 2032)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !1039, file: !1038, line: 4543, baseType: !1051, size: 4224, offset: 16384)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 4224, elements: !1058)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1039, file: !1038, line: 4538, size: 128, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !1052, file: !1038, line: 4539, baseType: !1042, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_SET", scope: !1052, file: !1038, line: 4540, baseType: !1042, size: 32, offset: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_CLR", scope: !1052, file: !1038, line: 4541, baseType: !1042, size: 32, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_TOG", scope: !1052, file: !1038, line: 4542, baseType: !1042, size: 32, offset: 96)
!1058 = !{!1059}
!1059 = !DISubrange(count: 33)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !1039, file: !1038, line: 4544, baseType: !1061, size: 110464, offset: 20608)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 110464, elements: !1062)
!1062 = !{!1063}
!1063 = !DISubrange(count: 13808)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !1039, file: !1038, line: 4550, baseType: !1065, size: 24448, offset: 131072)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1066, size: 24448, elements: !1072)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1039, file: !1038, line: 4545, size: 128, elements: !1067)
!1067 = !{!1068, !1069, !1070, !1071}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !1066, file: !1038, line: 4546, baseType: !1042, size: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_SET", scope: !1066, file: !1038, line: 4547, baseType: !1042, size: 32, offset: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_CLR", scope: !1066, file: !1038, line: 4548, baseType: !1042, size: 32, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_TOG", scope: !1066, file: !1038, line: 4549, baseType: !1042, size: 32, offset: 96)
!1072 = !{!1073}
!1073 = !DISubrange(count: 191)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !1039, file: !1038, line: 4551, baseType: !1075, size: 106624, offset: 155520)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 106624, elements: !1076)
!1076 = !{!1077}
!1077 = !DISubrange(count: 13328)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !1039, file: !1038, line: 4574, baseType: !1079, size: 128000, offset: 262144)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1080, size: 128000, elements: !1106)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1039, file: !1038, line: 4552, size: 1024, elements: !1081)
!1081 = !{!1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1102, !1103, !1104, !1105}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT", scope: !1080, file: !1038, line: 4553, baseType: !1042, size: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_SET", scope: !1080, file: !1038, line: 4554, baseType: !1042, size: 32, offset: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_CLR", scope: !1080, file: !1038, line: 4555, baseType: !1042, size: 32, offset: 64)
