; ModuleID = 'build/arduino_mkrzero/kernel/condition_variables/condvar/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.k_condvar = type { %struct._wait_q_t }
%struct.z_thread_stack_element = type { i8 }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/kernel/condition_variables/condvar/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/kernel/condition_variables/condvar")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/kernel/condition_variables/condvar")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "count_mutex", scope: !27, file: !116, line: 16, type: !256, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/condition_variables/condvar/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/kernel/condition_variables/condvar")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108, !109, !110, !111}
!102 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !102)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!25, !114, !141, !143, !154}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "count_threshold_cv", scope: !27, file: !116, line: 17, type: !117, isLocal: false, isDefinition: true, align: 32)
!116 = !DIFile(filename: "zephyr/samples/kernel/condition_variables/condvar/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !118, line: 2828, size: 64, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !117, file: !118, line: 2829, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !123, file: !122, line: 232, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !129)
!129 = !{!130, !136}
!130 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 38, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 38, size: 32, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !127, line: 39, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !127, line: 40, baseType: !134, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 42, baseType: !137, size: 32, offset: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 42, size: 32, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !137, file: !127, line: 43, baseType: !134, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !127, line: 44, baseType: !134, size: 32)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !116, line: 14, type: !109, isLocal: true, isDefinition: true)
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "tstacks", scope: !27, file: !116, line: 21, type: !145, isLocal: false, isDefinition: true, align: 64)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !146, size: 24576, elements: !151)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !147, line: 47, size: 8, elements: !148)
!147 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !146, file: !147, line: 48, baseType: !150, size: 8)
!150 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!151 = !{!152, !153}
!152 = !DISubrange(count: 3)
!153 = !DISubrange(count: 1024)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "t", scope: !27, file: !116, line: 23, type: !156, isLocal: true, isDefinition: true)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 3456, elements: !255)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !158, line: 245, size: 1152, elements: !159)
!158 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!159 = !{!160, !209, !222, !223, !224, !228, !229, !250}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !157, file: !158, line: 247, baseType: !161, size: 384)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !158, line: 57, size: 384, elements: !162)
!162 = !{!163, !177, !179, !182, !183, !196, !197, !198}
!163 = !DIDerivedType(tag: DW_TAG_member, scope: !161, file: !158, line: 60, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !158, line: 60, size: 64, elements: !165)
!165 = !{!166, !168}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !164, file: !158, line: 61, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !128)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !164, file: !158, line: 62, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !170, line: 49, size: 64, elements: !171)
!170 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !169, file: !170, line: 50, baseType: !173, size: 64)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 64, elements: !175)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!175 = !{!176}
!176 = !DISubrange(count: 2)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !161, file: !158, line: 68, baseType: !178, size: 32, offset: 64)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !161, file: !158, line: 71, baseType: !180, size: 8, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !181)
!181 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !161, file: !158, line: 74, baseType: !180, size: 8, offset: 104)
!183 = !DIDerivedType(tag: DW_TAG_member, scope: !161, file: !158, line: 90, baseType: !184, size: 16, offset: 112)
!184 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !158, line: 90, size: 16, elements: !185)
!185 = !{!186, !193}
!186 = !DIDerivedType(tag: DW_TAG_member, scope: !184, file: !158, line: 91, baseType: !187, size: 16)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !184, file: !158, line: 91, size: 16, elements: !188)
!188 = !{!189, !192}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !187, file: !158, line: 96, baseType: !190, size: 8)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !191)
!191 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !187, file: !158, line: 97, baseType: !180, size: 8, offset: 8)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !184, file: !158, line: 100, baseType: !194, size: 16)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !195)
!195 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !161, file: !158, line: 107, baseType: !110, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !161, file: !158, line: 127, baseType: !107, size: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !161, file: !158, line: 131, baseType: !199, size: 192, offset: 192)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !200)
!200 = !{!201, !202, !208}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !199, file: !122, line: 245, baseType: !167, size: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !199, file: !122, line: 246, baseType: !203, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DISubroutineType(types: !206)
!206 = !{null, !207}
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !199, file: !122, line: 249, baseType: !105, size: 64, offset: 128)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !157, file: !158, line: 250, baseType: !210, size: 288, offset: 384)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !211, line: 25, size: 288, elements: !212)
!211 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !{!213, !214, !215, !216, !217, !218, !219, !220, !221}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !210, file: !211, line: 26, baseType: !110, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !210, file: !211, line: 27, baseType: !110, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !210, file: !211, line: 28, baseType: !110, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !210, file: !211, line: 29, baseType: !110, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !210, file: !211, line: 30, baseType: !110, size: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !210, file: !211, line: 31, baseType: !110, size: 32, offset: 160)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !210, file: !211, line: 32, baseType: !110, size: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !210, file: !211, line: 33, baseType: !110, size: 32, offset: 224)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !210, file: !211, line: 34, baseType: !110, size: 32, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !157, file: !158, line: 253, baseType: !107, size: 32, offset: 672)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !157, file: !158, line: 256, baseType: !121, size: 64, offset: 704)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !158, line: 279, baseType: !225, size: 256, offset: 768)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !157, file: !158, line: 294, baseType: !109, size: 32, offset: 1024)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !157, file: !158, line: 325, baseType: !230, size: 32, offset: 1056)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 192, elements: !232)
!232 = !{!233, !244, !245}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !231, file: !118, line: 5074, baseType: !234, size: 96)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !235, line: 56, size: 96, elements: !236)
!235 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!236 = !{!237, !240, !241}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !234, file: !235, line: 57, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !235, line: 57, flags: DIFlagFwdDecl)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !234, file: !235, line: 58, baseType: !107, size: 32, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !234, file: !235, line: 59, baseType: !242, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !243, line: 214, baseType: !32)
!243 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!244 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !231, file: !118, line: 5075, baseType: !121, size: 64, offset: 96)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !231, file: !118, line: 5076, baseType: !246, size: 32, offset: 160)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !247, line: 43, size: 32, elements: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = !{!249}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !246, file: !247, line: 52, baseType: !22, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !157, file: !158, line: 343, baseType: !251, size: 64, offset: 1088)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !211, line: 60, size: 64, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !251, file: !211, line: 63, baseType: !110, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !251, file: !211, line: 66, baseType: !110, size: 32, offset: 32)
!255 = !{!152}
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !118, line: 2720, size: 160, elements: !257)
!257 = !{!258, !259, !261, !262}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !256, file: !118, line: 2722, baseType: !121, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !256, file: !118, line: 2724, baseType: !260, size: 32, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !256, file: !118, line: 2727, baseType: !110, size: 32, offset: 96)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !256, file: !118, line: 2730, baseType: !109, size: 32, offset: 128)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !265, file: !282, line: 18, type: !283, isLocal: false, isDefinition: true)
!265 = distinct !DICompileUnit(language: DW_LANG_C99, file: !266, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !267, globals: !281, splitDebugInlining: false, nameTableKind: None)
!266 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/kernel/condition_variables/condvar")
!267 = !{!22, !107, !24, !268, !270, !272, !242, !109, !275, !276, !277, !278, !279, !280, !194, !273}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!271 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!281 = !{!263}
!282 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !285, line: 16, size: 64, elements: !286)
!285 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !284, file: !285, line: 17, baseType: !273, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !284, file: !285, line: 18, baseType: !180, size: 8, offset: 32)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "_char_out", scope: !291, file: !295, line: 54, type: !296, isLocal: false, isDefinition: true)
!291 = distinct !DICompileUnit(language: DW_LANG_C99, file: !292, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !293, globals: !294, splitDebugInlining: false, nameTableKind: None)
!292 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/kernel/condition_variables/condvar")
!293 = !{!107, !109}
!294 = !{!289}
!295 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DISubroutineType(types: !298)
!298 = !{!109, !109}
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !301, file: !1033, line: 202, type: !1034, isLocal: true, isDefinition: true, align: 32)
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !303, globals: !1032, splitDebugInlining: false, nameTableKind: None)
!302 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_mkrzero/kernel/condition_variables/condvar")
!303 = !{!107, !109, !304, !424, !763, !764, !831}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !306, line: 335, baseType: !307)
!306 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !306, line: 320, size: 288, elements: !308)
!308 = !{!309, !320, !326, !340, !351, !362, !364, !375, !376, !387, !388, !403, !404, !414}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !307, file: !306, line: 321, baseType: !310, size: 16)
!310 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !306, line: 50, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !306, line: 43, size: 16, elements: !313)
!313 = !{!314, !319}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !312, file: !306, line: 48, baseType: !315, size: 16)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !312, file: !306, line: 44, size: 16, elements: !316)
!316 = !{!317, !318}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !315, file: !306, line: 45, baseType: !194, size: 7, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !315, file: !306, line: 47, baseType: !194, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !312, file: !306, line: 49, baseType: !194, size: 16)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !307, file: !306, line: 322, baseType: !321, size: 16, offset: 16)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 16, elements: !175)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !323, line: 52, baseType: !324)
!323 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !180)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !307, file: !306, line: 323, baseType: !327, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !328)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !306, line: 107, baseType: !329)
!329 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !306, line: 94, size: 32, elements: !330)
!330 = !{!331, !339}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !329, file: !306, line: 105, baseType: !332, size: 32)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !329, file: !306, line: 95, size: 32, elements: !333)
!333 = !{!334, !335, !336, !337, !338}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !332, file: !306, line: 97, baseType: !110, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !332, file: !306, line: 99, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !332, file: !306, line: 100, baseType: !110, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !332, file: !306, line: 102, baseType: !110, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !332, file: !306, line: 103, baseType: !110, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !329, file: !306, line: 106, baseType: !110, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !307, file: !306, line: 324, baseType: !341, size: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !306, line: 155, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !306, line: 148, size: 32, elements: !344)
!344 = !{!345, !350}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !343, file: !306, line: 153, baseType: !346, size: 32)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !343, file: !306, line: 149, size: 32, elements: !347)
!347 = !{!348, !349}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !346, file: !306, line: 150, baseType: !110, size: 16, flags: DIFlagBitField, extraData: i64 0)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !346, file: !306, line: 151, baseType: !110, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !343, file: !306, line: 154, baseType: !110, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !307, file: !306, line: 325, baseType: !352, size: 8, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !306, line: 194, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !306, line: 187, size: 8, elements: !355)
!355 = !{!356, !361}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !354, file: !306, line: 192, baseType: !357, size: 8)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !354, file: !306, line: 188, size: 8, elements: !358)
!358 = !{!359, !360}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !357, file: !306, line: 189, baseType: !180, size: 1, flags: DIFlagBitField, extraData: i64 0)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !357, file: !306, line: 190, baseType: !180, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !354, file: !306, line: 193, baseType: !180, size: 8)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !307, file: !306, line: 326, baseType: !363, size: 24, offset: 104)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 24, elements: !255)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !307, file: !306, line: 327, baseType: !365, size: 8, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !306, line: 215, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !306, line: 208, size: 8, elements: !368)
!368 = !{!369, !374}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !367, file: !306, line: 213, baseType: !370, size: 8)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !367, file: !306, line: 209, size: 8, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !370, file: !306, line: 210, baseType: !180, size: 1, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !370, file: !306, line: 211, baseType: !180, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !367, file: !306, line: 214, baseType: !180, size: 8)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !307, file: !306, line: 328, baseType: !363, size: 24, offset: 136)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !307, file: !306, line: 329, baseType: !377, size: 8, offset: 160)
!377 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !306, line: 236, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !306, line: 229, size: 8, elements: !380)
!380 = !{!381, !386}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !379, file: !306, line: 234, baseType: !382, size: 8)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !379, file: !306, line: 230, size: 8, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !382, file: !306, line: 231, baseType: !324, size: 1, flags: DIFlagBitField, extraData: i64 0)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !382, file: !306, line: 232, baseType: !324, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !379, file: !306, line: 235, baseType: !180, size: 8)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !307, file: !306, line: 330, baseType: !363, size: 24, offset: 168)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !307, file: !306, line: 331, baseType: !389, size: 16, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !390)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !306, line: 262, baseType: !391)
!391 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !306, line: 250, size: 16, elements: !392)
!392 = !{!393, !402}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !391, file: !306, line: 260, baseType: !394, size: 16)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !391, file: !306, line: 251, size: 16, elements: !395)
!395 = !{!396, !397, !398, !399, !400, !401}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !394, file: !306, line: 252, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !394, file: !306, line: 253, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !394, file: !306, line: 254, baseType: !194, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !394, file: !306, line: 255, baseType: !194, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !394, file: !306, line: 256, baseType: !194, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !394, file: !306, line: 258, baseType: !194, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !391, file: !306, line: 261, baseType: !194, size: 16)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !307, file: !306, line: 332, baseType: !321, size: 16, offset: 208)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !307, file: !306, line: 333, baseType: !405, size: 32, offset: 224)
!405 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !306, line: 290, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !306, line: 284, size: 32, elements: !408)
!408 = !{!409, !413}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !407, file: !306, line: 288, baseType: !410, size: 32)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !407, file: !306, line: 285, size: 32, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !410, file: !306, line: 286, baseType: !110, size: 22, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !407, file: !306, line: 289, baseType: !110, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !307, file: !306, line: 334, baseType: !415, size: 16, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !306, line: 308, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !306, line: 303, size: 16, elements: !418)
!418 = !{!419, !423}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !417, file: !306, line: 306, baseType: !420, size: 16)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !417, file: !306, line: 304, size: 16, elements: !421)
!421 = !{!422}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !420, file: !306, line: 305, baseType: !194, size: 16, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !417, file: !306, line: 307, baseType: !194, size: 16)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !426, line: 928, baseType: !427)
!426 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 899, size: 672, elements: !428)
!428 = !{!429, !453, !477, !503, !528, !544, !545, !563, !564, !581, !592, !593, !608, !628, !629, !641, !653, !663, !664, !681, !685, !696, !697, !709, !721, !722, !733, !749}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !427, file: !426, line: 900, baseType: !430, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !426, line: 64, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 43, size: 32, elements: !433)
!433 = !{!434, !452}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !432, file: !426, line: 62, baseType: !435, size: 32)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !426, line: 44, size: 32, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !435, file: !426, line: 45, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !435, file: !426, line: 46, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !435, file: !426, line: 47, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !435, file: !426, line: 48, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !435, file: !426, line: 49, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !435, file: !426, line: 50, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !435, file: !426, line: 51, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !435, file: !426, line: 52, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !435, file: !426, line: 53, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !435, file: !426, line: 54, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !435, file: !426, line: 55, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !435, file: !426, line: 56, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !435, file: !426, line: 58, baseType: !110, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !435, file: !426, line: 59, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !435, file: !426, line: 60, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !432, file: !426, line: 63, baseType: !110, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !427, file: !426, line: 901, baseType: !454, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !426, line: 125, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 104, size: 32, elements: !457)
!457 = !{!458, !476}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !456, file: !426, line: 123, baseType: !459, size: 32)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !456, file: !426, line: 105, size: 32, elements: !460)
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !459, file: !426, line: 106, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !459, file: !426, line: 107, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !459, file: !426, line: 108, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !459, file: !426, line: 109, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !459, file: !426, line: 110, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !459, file: !426, line: 111, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !459, file: !426, line: 112, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !459, file: !426, line: 113, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !459, file: !426, line: 114, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !459, file: !426, line: 115, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !459, file: !426, line: 116, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !459, file: !426, line: 117, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !459, file: !426, line: 119, baseType: !110, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !459, file: !426, line: 120, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !459, file: !426, line: 121, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !456, file: !426, line: 124, baseType: !110, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !427, file: !426, line: 902, baseType: !478, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !426, line: 186, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 165, size: 32, elements: !481)
!481 = !{!482, !502}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !480, file: !426, line: 184, baseType: !483, size: 32)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !480, file: !426, line: 166, size: 32, elements: !484)
!484 = !{!485, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !483, file: !426, line: 167, baseType: !486, size: 1, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !483, file: !426, line: 168, baseType: !486, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !483, file: !426, line: 169, baseType: !486, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !483, file: !426, line: 170, baseType: !486, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !483, file: !426, line: 171, baseType: !486, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !483, file: !426, line: 172, baseType: !486, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !483, file: !426, line: 173, baseType: !486, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !483, file: !426, line: 174, baseType: !486, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !483, file: !426, line: 175, baseType: !486, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !483, file: !426, line: 176, baseType: !486, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !483, file: !426, line: 177, baseType: !486, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !483, file: !426, line: 178, baseType: !486, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !483, file: !426, line: 180, baseType: !486, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !483, file: !426, line: 181, baseType: !486, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !483, file: !426, line: 182, baseType: !486, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !480, file: !426, line: 185, baseType: !110, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !427, file: !426, line: 903, baseType: !504, size: 32, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !426, line: 247, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 226, size: 32, elements: !508)
!508 = !{!509, !527}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !507, file: !426, line: 245, baseType: !510, size: 32)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !507, file: !426, line: 227, size: 32, elements: !511)
!511 = !{!512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !510, file: !426, line: 228, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !510, file: !426, line: 229, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !510, file: !426, line: 230, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !510, file: !426, line: 231, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !510, file: !426, line: 232, baseType: !110, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !510, file: !426, line: 233, baseType: !110, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !510, file: !426, line: 234, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !510, file: !426, line: 235, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !510, file: !426, line: 236, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !510, file: !426, line: 237, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !510, file: !426, line: 238, baseType: !110, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !510, file: !426, line: 239, baseType: !110, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !510, file: !426, line: 241, baseType: !110, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !510, file: !426, line: 242, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !510, file: !426, line: 243, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !507, file: !426, line: 246, baseType: !110, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !427, file: !426, line: 904, baseType: !529, size: 16, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !426, line: 300, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 287, size: 16, elements: !532)
!532 = !{!533, !543}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !531, file: !426, line: 298, baseType: !534, size: 16)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !531, file: !426, line: 288, size: 16, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !542}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !534, file: !426, line: 290, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !534, file: !426, line: 291, baseType: !194, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !534, file: !426, line: 293, baseType: !194, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !534, file: !426, line: 294, baseType: !194, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !534, file: !426, line: 295, baseType: !194, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !534, file: !426, line: 296, baseType: !194, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !534, file: !426, line: 297, baseType: !194, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !531, file: !426, line: 299, baseType: !194, size: 16)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !427, file: !426, line: 905, baseType: !321, size: 16, offset: 144)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !427, file: !426, line: 906, baseType: !546, size: 16, offset: 160)
!546 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !426, line: 352, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 336, size: 16, elements: !549)
!549 = !{!550, !562}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !548, file: !426, line: 350, baseType: !551, size: 16)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !548, file: !426, line: 337, size: 16, elements: !552)
!552 = !{!553, !554, !555, !556, !557, !558, !559, !560, !561}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !551, file: !426, line: 339, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !551, file: !426, line: 340, baseType: !194, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !551, file: !426, line: 341, baseType: !194, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !551, file: !426, line: 342, baseType: !194, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !551, file: !426, line: 343, baseType: !194, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !551, file: !426, line: 344, baseType: !194, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !551, file: !426, line: 345, baseType: !194, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !551, file: !426, line: 346, baseType: !194, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !551, file: !426, line: 348, baseType: !194, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !548, file: !426, line: 351, baseType: !194, size: 16)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !427, file: !426, line: 907, baseType: !321, size: 16, offset: 176)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !427, file: !426, line: 908, baseType: !565, size: 32, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !426, line: 398, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 381, size: 32, elements: !568)
!568 = !{!569, !580}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !567, file: !426, line: 396, baseType: !570, size: 32)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !567, file: !426, line: 382, size: 32, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !570, file: !426, line: 384, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !570, file: !426, line: 385, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !570, file: !426, line: 386, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !570, file: !426, line: 388, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !570, file: !426, line: 389, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !570, file: !426, line: 390, baseType: !110, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !570, file: !426, line: 392, baseType: !110, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !570, file: !426, line: 394, baseType: !110, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !567, file: !426, line: 397, baseType: !110, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !427, file: !426, line: 909, baseType: !582, size: 8, offset: 224)
!582 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !426, line: 433, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 426, size: 8, elements: !585)
!585 = !{!586, !591}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !584, file: !426, line: 431, baseType: !587, size: 8)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !584, file: !426, line: 427, size: 8, elements: !588)
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !587, file: !426, line: 428, baseType: !180, size: 5, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !587, file: !426, line: 430, baseType: !180, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !584, file: !426, line: 432, baseType: !180, size: 8)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !427, file: !426, line: 910, baseType: !363, size: 24, offset: 232)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !427, file: !426, line: 911, baseType: !594, size: 32, offset: 256)
!594 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !426, line: 462, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 448, size: 32, elements: !597)
!597 = !{!598, !607}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !596, file: !426, line: 460, baseType: !599, size: 32)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !596, file: !426, line: 449, size: 32, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !599, file: !426, line: 451, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !599, file: !426, line: 453, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !599, file: !426, line: 454, baseType: !110, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !599, file: !426, line: 455, baseType: !110, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !599, file: !426, line: 457, baseType: !110, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !599, file: !426, line: 459, baseType: !110, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !596, file: !426, line: 461, baseType: !110, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !427, file: !426, line: 912, baseType: !609, size: 16, offset: 288)
!609 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !426, line: 520, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 503, size: 16, elements: !612)
!612 = !{!613, !627}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !611, file: !426, line: 518, baseType: !614, size: 16)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !611, file: !426, line: 504, size: 16, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !614, file: !426, line: 506, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !614, file: !426, line: 507, baseType: !194, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !614, file: !426, line: 508, baseType: !194, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !614, file: !426, line: 509, baseType: !194, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !614, file: !426, line: 510, baseType: !194, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !614, file: !426, line: 511, baseType: !194, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !614, file: !426, line: 512, baseType: !194, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !614, file: !426, line: 513, baseType: !194, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !614, file: !426, line: 514, baseType: !194, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !614, file: !426, line: 515, baseType: !194, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !614, file: !426, line: 516, baseType: !194, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !611, file: !426, line: 519, baseType: !194, size: 16)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !427, file: !426, line: 913, baseType: !321, size: 16, offset: 304)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !427, file: !426, line: 914, baseType: !630, size: 32, offset: 320)
!630 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !426, line: 559, baseType: !632)
!632 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 552, size: 32, elements: !633)
!633 = !{!634, !640}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !632, file: !426, line: 557, baseType: !635, size: 32)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !632, file: !426, line: 553, size: 32, elements: !636)
!636 = !{!637, !638, !639}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !635, file: !426, line: 554, baseType: !110, size: 10, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !635, file: !426, line: 555, baseType: !110, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !635, file: !426, line: 556, baseType: !110, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !632, file: !426, line: 558, baseType: !110, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !427, file: !426, line: 915, baseType: !642, size: 32, offset: 352)
!642 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !426, line: 585, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 578, size: 32, elements: !645)
!645 = !{!646, !652}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !644, file: !426, line: 583, baseType: !647, size: 32)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !644, file: !426, line: 579, size: 32, elements: !648)
!648 = !{!649, !650, !651}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !647, file: !426, line: 580, baseType: !110, size: 16, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !647, file: !426, line: 581, baseType: !110, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !647, file: !426, line: 582, baseType: !110, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !644, file: !426, line: 584, baseType: !110, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !427, file: !426, line: 916, baseType: !654, size: 8, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !426, line: 610, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 604, size: 8, elements: !657)
!657 = !{!658, !662}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !656, file: !426, line: 608, baseType: !659, size: 8)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !656, file: !426, line: 605, size: 8, elements: !660)
!660 = !{!661}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !659, file: !426, line: 607, baseType: !180, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !656, file: !426, line: 609, baseType: !180, size: 8)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !427, file: !426, line: 917, baseType: !363, size: 24, offset: 392)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !427, file: !426, line: 918, baseType: !665, size: 32, offset: 416)
!665 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !426, line: 639, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 622, size: 32, elements: !668)
!668 = !{!669, !680}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !667, file: !426, line: 637, baseType: !670, size: 32)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !667, file: !426, line: 623, size: 32, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677, !678, !679}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !670, file: !426, line: 625, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !670, file: !426, line: 626, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !670, file: !426, line: 627, baseType: !110, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !670, file: !426, line: 629, baseType: !110, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !670, file: !426, line: 631, baseType: !110, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !670, file: !426, line: 632, baseType: !110, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !670, file: !426, line: 634, baseType: !110, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !670, file: !426, line: 635, baseType: !110, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !667, file: !426, line: 638, baseType: !110, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !427, file: !426, line: 919, baseType: !682, size: 32, offset: 448)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 32, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 4)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !427, file: !426, line: 920, baseType: !686, size: 16, offset: 480)
!686 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !426, line: 715, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 706, size: 16, elements: !689)
!689 = !{!690, !695}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !688, file: !426, line: 713, baseType: !691, size: 16)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !688, file: !426, line: 707, size: 16, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !691, file: !426, line: 709, baseType: !194, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !691, file: !426, line: 711, baseType: !194, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !688, file: !426, line: 714, baseType: !194, size: 16)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !427, file: !426, line: 921, baseType: !321, size: 16, offset: 496)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !427, file: !426, line: 922, baseType: !698, size: 32, offset: 512)
!698 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !426, line: 739, baseType: !700)
!700 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 729, size: 32, elements: !701)
!701 = !{!702, !708}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !700, file: !426, line: 737, baseType: !703, size: 32)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !700, file: !426, line: 730, size: 32, elements: !704)
!704 = !{!705, !706, !707}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !703, file: !426, line: 732, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !703, file: !426, line: 733, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !703, file: !426, line: 735, baseType: !110, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !700, file: !426, line: 738, baseType: !110, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !427, file: !426, line: 923, baseType: !710, size: 8, offset: 544)
!710 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !711)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !426, line: 765, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 756, size: 8, elements: !713)
!713 = !{!714, !720}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !712, file: !426, line: 763, baseType: !715, size: 8)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !712, file: !426, line: 757, size: 8, elements: !716)
!716 = !{!717, !718, !719}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !715, file: !426, line: 759, baseType: !180, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !715, file: !426, line: 761, baseType: !180, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !715, file: !426, line: 762, baseType: !180, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !712, file: !426, line: 764, baseType: !180, size: 8)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !427, file: !426, line: 924, baseType: !363, size: 24, offset: 552)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !427, file: !426, line: 925, baseType: !723, size: 32, offset: 576)
!723 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !426, line: 789, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 781, size: 32, elements: !726)
!726 = !{!727, !732}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !725, file: !426, line: 787, baseType: !728, size: 32)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !725, file: !426, line: 782, size: 32, elements: !729)
!729 = !{!730, !731}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !728, file: !426, line: 783, baseType: !110, size: 12, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !728, file: !426, line: 785, baseType: !110, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !725, file: !426, line: 788, baseType: !110, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !427, file: !426, line: 926, baseType: !734, size: 32, offset: 608)
!734 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !426, line: 820, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 805, size: 32, elements: !737)
!737 = !{!738, !748}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !736, file: !426, line: 818, baseType: !739, size: 32)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !736, file: !426, line: 806, size: 32, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !747}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !739, file: !426, line: 807, baseType: !110, size: 2, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !739, file: !426, line: 808, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !739, file: !426, line: 809, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !739, file: !426, line: 810, baseType: !110, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !739, file: !426, line: 812, baseType: !110, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !739, file: !426, line: 814, baseType: !110, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !739, file: !426, line: 816, baseType: !110, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !736, file: !426, line: 819, baseType: !110, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !427, file: !426, line: 927, baseType: !750, size: 8, offset: 640)
!750 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !426, line: 881, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !426, line: 872, size: 8, elements: !754)
!754 = !{!755, !762}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !753, file: !426, line: 879, baseType: !756, size: 8)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !753, file: !426, line: 873, size: 8, elements: !757)
!757 = !{!758, !759, !760, !761}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !756, file: !426, line: 874, baseType: !180, size: 1, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !756, file: !426, line: 875, baseType: !180, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !756, file: !426, line: 876, baseType: !180, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !756, file: !426, line: 877, baseType: !180, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !753, file: !426, line: 880, baseType: !180, size: 8)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !766, line: 290, baseType: !767)
!766 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !766, line: 284, size: 96, elements: !768)
!768 = !{!769, !779, !790, !803, !820}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !767, file: !766, line: 285, baseType: !770, size: 8)
!770 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !766, line: 49, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !766, line: 43, size: 8, elements: !773)
!773 = !{!774, !778}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !772, file: !766, line: 47, baseType: !775, size: 8)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !772, file: !766, line: 44, size: 8, elements: !776)
!776 = !{!777}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !775, file: !766, line: 45, baseType: !180, size: 1, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !772, file: !766, line: 48, baseType: !180, size: 8)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !767, file: !766, line: 286, baseType: !780, size: 8, offset: 8)
!780 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !766, line: 67, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !766, line: 61, size: 8, elements: !784)
!784 = !{!785, !789}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !783, file: !766, line: 65, baseType: !786, size: 8)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !783, file: !766, line: 62, size: 8, elements: !787)
!787 = !{!788}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !786, file: !766, line: 64, baseType: !180, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !783, file: !766, line: 66, baseType: !180, size: 8)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !767, file: !766, line: 287, baseType: !791, size: 16, offset: 16)
!791 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !766, line: 89, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !766, line: 79, size: 16, elements: !794)
!794 = !{!795, !802}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !793, file: !766, line: 87, baseType: !796, size: 16)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !793, file: !766, line: 80, size: 16, elements: !797)
!797 = !{!798, !799, !800, !801}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !796, file: !766, line: 81, baseType: !194, size: 6, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !796, file: !766, line: 83, baseType: !194, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !796, file: !766, line: 85, baseType: !194, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !796, file: !766, line: 86, baseType: !194, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !793, file: !766, line: 88, baseType: !194, size: 16)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !767, file: !766, line: 288, baseType: !804, size: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !805)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !766, line: 214, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !766, line: 199, size: 32, elements: !807)
!807 = !{!808, !819}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !806, file: !766, line: 212, baseType: !809, size: 32)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !806, file: !766, line: 200, size: 32, elements: !810)
!810 = !{!811, !812, !813, !814, !815, !816, !817, !818}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !809, file: !766, line: 201, baseType: !110, size: 4, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !809, file: !766, line: 203, baseType: !110, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !809, file: !766, line: 205, baseType: !110, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !809, file: !766, line: 206, baseType: !110, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !809, file: !766, line: 207, baseType: !110, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !809, file: !766, line: 208, baseType: !110, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !809, file: !766, line: 209, baseType: !110, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !809, file: !766, line: 210, baseType: !110, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !806, file: !766, line: 213, baseType: !110, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !767, file: !766, line: 289, baseType: !821, size: 32, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !766, line: 268, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !766, line: 260, size: 32, elements: !824)
!824 = !{!825, !830}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !823, file: !766, line: 266, baseType: !826, size: 32)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !823, file: !766, line: 261, size: 32, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !826, file: !766, line: 262, baseType: !110, size: 4, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !826, file: !766, line: 264, baseType: !110, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !823, file: !766, line: 267, baseType: !110, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !833, line: 513, baseType: !834)
!833 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !833, line: 494, size: 480, elements: !835)
!835 = !{!836, !842, !852, !856, !866, !876, !886, !896, !900, !916, !932, !948, !978, !982, !992, !1002, !1012, !1016}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !834, file: !833, line: 495, baseType: !837, size: 8)
!837 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !833, line: 45, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !833, line: 43, size: 8, elements: !840)
!840 = !{!841}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !839, file: !833, line: 44, baseType: !180, size: 8)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !834, file: !833, line: 496, baseType: !843, size: 8, offset: 8)
!843 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !833, line: 61, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !833, line: 55, size: 8, elements: !846)
!846 = !{!847, !851}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !845, file: !833, line: 59, baseType: !848, size: 8)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !845, file: !833, line: 56, size: 8, elements: !849)
!849 = !{!850}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !848, file: !833, line: 57, baseType: !180, size: 2, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !845, file: !833, line: 60, baseType: !180, size: 8)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !834, file: !833, line: 497, baseType: !853, size: 48, offset: 16)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 48, elements: !854)
!854 = !{!855}
!855 = !DISubrange(count: 6)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !834, file: !833, line: 498, baseType: !857, size: 8, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !833, line: 86, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !833, line: 80, size: 8, elements: !860)
!860 = !{!861, !865}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !859, file: !833, line: 84, baseType: !862, size: 8)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !859, file: !833, line: 81, size: 8, elements: !863)
!863 = !{!864}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !862, file: !833, line: 82, baseType: !180, size: 3, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !859, file: !833, line: 85, baseType: !180, size: 8)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !834, file: !833, line: 499, baseType: !867, size: 8, offset: 72)
!867 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !833, line: 121, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !833, line: 115, size: 8, elements: !870)
!870 = !{!871, !875}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !869, file: !833, line: 119, baseType: !872, size: 8)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !869, file: !833, line: 116, size: 8, elements: !873)
!873 = !{!874}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !872, file: !833, line: 117, baseType: !180, size: 3, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !869, file: !833, line: 120, baseType: !180, size: 8)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !834, file: !833, line: 500, baseType: !877, size: 8, offset: 80)
!877 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !878)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !833, line: 156, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !833, line: 150, size: 8, elements: !880)
!880 = !{!881, !885}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !879, file: !833, line: 154, baseType: !882, size: 8)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !879, file: !833, line: 151, size: 8, elements: !883)
!883 = !{!884}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !882, file: !833, line: 152, baseType: !180, size: 3, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !879, file: !833, line: 155, baseType: !180, size: 8)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !834, file: !833, line: 501, baseType: !887, size: 8, offset: 88)
!887 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !833, line: 191, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !833, line: 185, size: 8, elements: !890)
!890 = !{!891, !895}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !889, file: !833, line: 189, baseType: !892, size: 8)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !889, file: !833, line: 186, size: 8, elements: !893)
!893 = !{!894}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !892, file: !833, line: 187, baseType: !180, size: 3, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !889, file: !833, line: 190, baseType: !180, size: 8)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !834, file: !833, line: 502, baseType: !897, size: 64, offset: 96)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 64, elements: !898)
!898 = !{!899}
!899 = !DISubrange(count: 8)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !834, file: !833, line: 503, baseType: !901, size: 32, offset: 160)
!901 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !902)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !833, line: 232, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !833, line: 220, size: 32, elements: !904)
!904 = !{!905, !915}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !903, file: !833, line: 230, baseType: !906, size: 32)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !903, file: !833, line: 221, size: 32, elements: !907)
!907 = !{!908, !909, !910, !911, !912, !913, !914}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !906, file: !833, line: 222, baseType: !110, size: 1, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !906, file: !833, line: 223, baseType: !110, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !906, file: !833, line: 224, baseType: !110, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !906, file: !833, line: 225, baseType: !110, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
