; ModuleID = 'build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.os_timer_def = type { void (i8*)* }
%struct.k_msgq = type { %struct._wait_q_t, %union.anon.3, i32, i32, i8*, i8*, i8*, i8*, i32, %struct._dnode, i8 }
%struct._wait_q_t = type { %struct._dnode }
%union.anon.3 = type { i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.os_messageQ_def = type { i32, i32, i8*, %struct.k_msgq* }
%struct.os_messageQ_cb = type opaque
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.z_poller*, i8*, i16* }
%struct.z_poller = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.3 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.3 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.k_mem_slab = type { %struct._wait_q_t, %union.anon.3, i32, i32, i8*, i8*, i32 }
%struct.wdt_sam_dev_cfg = type { %struct._thread_stack_info* }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.wdt_driver_api = type { i32 (%struct.device*, i8)*, i32 (%struct.device*)*, i32 (%struct.device*, %struct.wdt_timeout_cfg*)*, i32 (%struct.device*, i32)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "os_timer_def_myTimer", scope: !27, file: !129, line: 25, type: !198, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !123, globals: !126, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/portability/cmsis_rtos_v1/timer_synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!29 = !{!30, !49, !53}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 99, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/portability/cmsis_os.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!34 = !DIEnumerator(name: "osOK", value: 0)
!35 = !DIEnumerator(name: "osEventSignal", value: 8)
!36 = !DIEnumerator(name: "osEventMessage", value: 16)
!37 = !DIEnumerator(name: "osEventMail", value: 32)
!38 = !DIEnumerator(name: "osEventTimeout", value: 64)
!39 = !DIEnumerator(name: "osErrorParameter", value: 128)
!40 = !DIEnumerator(name: "osErrorResource", value: 129)
!41 = !DIEnumerator(name: "osErrorTimeoutResource", value: 193)
!42 = !DIEnumerator(name: "osErrorISR", value: 130)
!43 = !DIEnumerator(name: "osErrorISRRecursive", value: 131)
!44 = !DIEnumerator(name: "osErrorPriority", value: 132)
!45 = !DIEnumerator(name: "osErrorNoMemory", value: 133)
!46 = !DIEnumerator(name: "osErrorValue", value: 134)
!47 = !DIEnumerator(name: "osErrorOS", value: 255)
!48 = !DIEnumerator(name: "os_status_reserved", value: 2147483647)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 120, baseType: !32, size: 32, elements: !50)
!50 = !{!51, !52}
!51 = !DIEnumerator(name: "osTimerOnce", value: 0)
!52 = !DIEnumerator(name: "osTimerPeriodic", value: 1)
!53 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !54, line: 27, baseType: !32, size: 32, elements: !55)
!54 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122}
!56 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!57 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!58 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!59 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!60 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!61 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!62 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!63 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!64 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!65 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!66 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!67 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!68 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!69 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!70 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!71 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!72 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!115 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!116 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!117 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!118 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!119 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!120 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!121 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!122 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!123 = !{!124, !125}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!125 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!126 = !{!25, !127, !184, !186, !188, !193}
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "os_messageQ_def_messageq", scope: !27, file: !129, line: 27, type: !130, isLocal: false, isDefinition: true)
!129 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v1/timer_synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "osMessageQDef_t", file: !31, line: 213, baseType: !132)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "os_messageQ_def", file: !31, line: 208, size: 128, elements: !133)
!133 = !{!134, !136, !137, !138}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "queue_sz", scope: !132, file: !31, line: 209, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "item_sz", scope: !132, file: !31, line: 210, baseType: !135, size: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !132, file: !31, line: 211, baseType: !124, size: 32, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "msgq", scope: !132, file: !31, line: 212, baseType: !139, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !141, line: 4204, size: 416, elements: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !{!143, !164, !169, !172, !173, !176, !177, !178, !179, !180, !181}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !140, file: !141, line: 4206, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !145, line: 233, baseType: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 231, size: 64, elements: !147)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !146, file: !145, line: 232, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !150, line: 48, baseType: !151)
!150 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !150, line: 37, size: 64, elements: !152)
!152 = !{!153, !159}
!153 = !DIDerivedType(tag: DW_TAG_member, scope: !151, file: !150, line: 38, baseType: !154, size: 32)
!154 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !151, file: !150, line: 38, size: 32, elements: !155)
!155 = !{!156, !158}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !154, file: !150, line: 39, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !154, file: !150, line: 40, baseType: !157, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, scope: !151, file: !150, line: 42, baseType: !160, size: 32, offset: 32)
!160 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !151, file: !150, line: 42, size: 32, elements: !161)
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !160, file: !150, line: 43, baseType: !157, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !160, file: !150, line: 44, baseType: !157, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !140, file: !141, line: 4208, baseType: !165, size: 32, offset: 64)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !166, line: 43, size: 32, elements: !167)
!166 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !165, file: !166, line: 52, baseType: !22, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !140, file: !141, line: 4210, baseType: !170, size: 32, offset: 96)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !171, line: 214, baseType: !32)
!171 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !140, file: !141, line: 4212, baseType: !135, size: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !140, file: !141, line: 4214, baseType: !174, size: 32, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !140, file: !141, line: 4216, baseType: !174, size: 32, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !140, file: !141, line: 4218, baseType: !174, size: 32, offset: 224)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !140, file: !141, line: 4220, baseType: !174, size: 32, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !140, file: !141, line: 4222, baseType: !135, size: 32, offset: 288)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !140, file: !141, line: 4224, baseType: !149, size: 64, offset: 320)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !140, file: !141, line: 4227, baseType: !182, size: 8, offset: 384)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !183)
!183 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "data", scope: !27, file: !129, line: 21, type: !135, isLocal: false, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "msgq_messageq", scope: !27, file: !129, line: 27, type: !140, isLocal: false, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "buf_messageq", scope: !27, file: !129, line: 27, type: !190, isLocal: true, isDefinition: true, align: 32)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 32, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 4)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "message_id", scope: !27, file: !129, line: 28, type: !195, isLocal: false, isDefinition: true)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "osMessageQId", file: !31, line: 157, baseType: !196)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "os_messageQ_cb", file: !31, line: 157, flags: DIFlagFwdDecl)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "osTimerDef_t", file: !31, line: 184, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "os_timer_def", file: !31, line: 182, size: 32, elements: !201)
!201 = !{!202}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "ptimer", scope: !200, file: !31, line: 183, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "os_ptimer", file: !31, line: 131, baseType: !16)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "_char_out", scope: !206, file: !210, line: 54, type: !211, isLocal: false, isDefinition: true)
!206 = distinct !DICompileUnit(language: DW_LANG_C99, file: !207, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !123, globals: !209, splitDebugInlining: false, nameTableKind: None)
!207 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!208 = !{!53}
!209 = !{!204}
!210 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = !DISubroutineType(types: !213)
!213 = !{!125, !125}
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !216, file: !281, line: 235, type: !282, isLocal: true, isDefinition: true, align: 32)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !218, globals: !280, splitDebugInlining: false, nameTableKind: None)
!217 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!218 = !{!124, !125, !219, !230}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !221, line: 46, baseType: !222)
!221 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 41, size: 128, elements: !223)
!223 = !{!224, !226, !227, !229}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !222, file: !221, line: 42, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !135)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !222, file: !221, line: 43, baseType: !225, size: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !222, file: !221, line: 44, baseType: !228, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !222, file: !221, line: 45, baseType: !228, size: 32, offset: 96)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !232, line: 75, baseType: !233)
!232 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !232, line: 41, size: 2176, elements: !234)
!234 = !{!235, !236, !237, !238, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !258, !262, !263, !264, !265, !266, !267, !268, !269, !273, !274, !275, !276, !277, !278, !279}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !233, file: !232, line: 42, baseType: !225, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !233, file: !232, line: 43, baseType: !225, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !233, file: !232, line: 44, baseType: !228, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !233, file: !232, line: 45, baseType: !239, size: 32, offset: 96)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 32, elements: !240)
!240 = !{!241}
!241 = !DISubrange(count: 1)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !233, file: !232, line: 46, baseType: !225, size: 32, offset: 128)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !233, file: !232, line: 47, baseType: !225, size: 32, offset: 160)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !233, file: !232, line: 48, baseType: !228, size: 32, offset: 192)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !233, file: !232, line: 49, baseType: !225, size: 32, offset: 224)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !233, file: !232, line: 50, baseType: !225, size: 32, offset: 256)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !233, file: !232, line: 51, baseType: !228, size: 32, offset: 288)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !233, file: !232, line: 52, baseType: !225, size: 32, offset: 320)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !233, file: !232, line: 53, baseType: !239, size: 32, offset: 352)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !233, file: !232, line: 54, baseType: !225, size: 32, offset: 384)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !233, file: !232, line: 55, baseType: !239, size: 32, offset: 416)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !233, file: !232, line: 56, baseType: !225, size: 32, offset: 448)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !233, file: !232, line: 57, baseType: !239, size: 32, offset: 480)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !233, file: !232, line: 58, baseType: !255, size: 96, offset: 512)
!255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 96, elements: !256)
!256 = !{!257}
!257 = !DISubrange(count: 3)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !233, file: !232, line: 59, baseType: !259, size: 160, offset: 608)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 160, elements: !260)
!260 = !{!261}
!261 = !DISubrange(count: 5)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !233, file: !232, line: 60, baseType: !225, size: 32, offset: 768)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !233, file: !232, line: 61, baseType: !225, size: 32, offset: 800)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !233, file: !232, line: 62, baseType: !228, size: 32, offset: 832)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !233, file: !232, line: 63, baseType: !228, size: 32, offset: 864)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !233, file: !232, line: 64, baseType: !225, size: 32, offset: 896)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !233, file: !232, line: 65, baseType: !225, size: 32, offset: 928)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !233, file: !232, line: 66, baseType: !225, size: 32, offset: 960)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !233, file: !232, line: 67, baseType: !270, size: 832, offset: 992)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 832, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 26)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !233, file: !232, line: 68, baseType: !225, size: 32, offset: 1824)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !233, file: !232, line: 69, baseType: !228, size: 32, offset: 1856)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !233, file: !232, line: 70, baseType: !259, size: 160, offset: 1888)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !233, file: !232, line: 71, baseType: !225, size: 32, offset: 2048)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !233, file: !232, line: 72, baseType: !225, size: 32, offset: 2080)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !233, file: !232, line: 73, baseType: !228, size: 32, offset: 2112)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !233, file: !232, line: 74, baseType: !225, size: 32, offset: 2144)
!280 = !{!214}
!281 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !284, line: 51, size: 64, elements: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !{!286, !314}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !283, file: !284, line: 60, baseType: !287, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{!125, !290}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !293, line: 378, size: 192, elements: !294)
!293 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!294 = !{!295, !298, !299, !300, !307, !308}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !292, file: !293, line: 380, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !292, file: !293, line: 382, baseType: !13, size: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !292, file: !293, line: 384, baseType: !13, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !292, file: !293, line: 386, baseType: !301, size: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !293, line: 351, size: 16, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !302, file: !293, line: 359, baseType: !182, size: 8)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !302, file: !293, line: 364, baseType: !306, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!306 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !292, file: !293, line: 388, baseType: !124, size: 32, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !292, file: !293, line: 396, baseType: !309, size: 32, offset: 160)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !293, line: 43, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !313)
!313 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !283, file: !284, line: 65, baseType: !290, size: 32, offset: 32)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "static_regions", scope: !317, file: !324, line: 62, type: !483, isLocal: true, isDefinition: true)
!317 = distinct !DICompileUnit(language: DW_LANG_C99, file: !318, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !319, globals: !320, splitDebugInlining: false, nameTableKind: None)
!318 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!319 = !{!170, !125, !135, !124}
!320 = !{!321, !315}
!321 = !DIGlobalVariableExpression(var: !322, expr: !DIExpression())
!322 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !323, file: !324, line: 198, type: !471, isLocal: true, isDefinition: true)
!323 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !324, file: !324, line: 175, type: !325, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !317, retainedNodes: !466)
!324 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!325 = !DISubroutineType(types: !326)
!326 = !{null, !327}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !329, line: 245, size: 1472, elements: !330)
!329 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!330 = !{!331, !398, !411, !412, !413, !418, !430, !431, !435, !436, !437, !443, !461}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !328, file: !329, line: 247, baseType: !332, size: 384)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !329, line: 57, size: 384, elements: !333)
!333 = !{!334, !361, !368, !369, !370, !383, !384, !385}
!334 = !DIDerivedType(tag: DW_TAG_member, scope: !332, file: !329, line: 60, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !332, file: !329, line: 60, size: 64, elements: !336)
!336 = !{!337, !352}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !335, file: !329, line: 61, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !150, line: 49, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !150, line: 37, size: 64, elements: !340)
!340 = !{!341, !347}
!341 = !DIDerivedType(tag: DW_TAG_member, scope: !339, file: !150, line: 38, baseType: !342, size: 32)
!342 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !339, file: !150, line: 38, size: 32, elements: !343)
!343 = !{!344, !346}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !342, file: !150, line: 39, baseType: !345, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !342, file: !150, line: 40, baseType: !345, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, scope: !339, file: !150, line: 42, baseType: !348, size: 32, offset: 32)
!348 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !339, file: !150, line: 42, size: 32, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !348, file: !150, line: 43, baseType: !345, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !348, file: !150, line: 44, baseType: !345, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !335, file: !329, line: 62, baseType: !353, size: 64)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !354, line: 49, size: 64, elements: !355)
!354 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!355 = !{!356}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !353, file: !354, line: 50, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 64, elements: !359)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!359 = !{!360}
!360 = !DISubrange(count: 2)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !332, file: !329, line: 68, baseType: !362, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !145, line: 233, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 231, size: 64, elements: !365)
!365 = !{!366}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !364, file: !145, line: 232, baseType: !367, size: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !150, line: 48, baseType: !339)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !332, file: !329, line: 71, baseType: !182, size: 8, offset: 96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !332, file: !329, line: 74, baseType: !182, size: 8, offset: 104)
!370 = !DIDerivedType(tag: DW_TAG_member, scope: !332, file: !329, line: 90, baseType: !371, size: 16, offset: 112)
!371 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !332, file: !329, line: 90, size: 16, elements: !372)
!372 = !{!373, !380}
!373 = !DIDerivedType(tag: DW_TAG_member, scope: !371, file: !329, line: 91, baseType: !374, size: 16)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !371, file: !329, line: 91, size: 16, elements: !375)
!375 = !{!376, !379}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !374, file: !329, line: 96, baseType: !377, size: 8)
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !378)
!378 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !374, file: !329, line: 97, baseType: !182, size: 8, offset: 8)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !371, file: !329, line: 100, baseType: !381, size: 16)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !382)
!382 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !332, file: !329, line: 107, baseType: !135, size: 32, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !332, file: !329, line: 127, baseType: !124, size: 32, offset: 160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !332, file: !329, line: 131, baseType: !386, size: 192, offset: 192)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !145, line: 244, size: 192, elements: !387)
!387 = !{!388, !389, !395}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !386, file: !145, line: 245, baseType: !338, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !386, file: !145, line: 246, baseType: !390, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !145, line: 242, baseType: !391)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !394}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !386, file: !145, line: 249, baseType: !396, size: 64, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !397)
!397 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !328, file: !329, line: 250, baseType: !399, size: 288, offset: 384)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !400, line: 25, size: 288, elements: !401)
!400 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !399, file: !400, line: 26, baseType: !135, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !399, file: !400, line: 27, baseType: !135, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !399, file: !400, line: 28, baseType: !135, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !399, file: !400, line: 29, baseType: !135, size: 32, offset: 96)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !399, file: !400, line: 30, baseType: !135, size: 32, offset: 128)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !399, file: !400, line: 31, baseType: !135, size: 32, offset: 160)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !399, file: !400, line: 32, baseType: !135, size: 32, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !399, file: !400, line: 33, baseType: !135, size: 32, offset: 224)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !399, file: !400, line: 34, baseType: !135, size: 32, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !328, file: !329, line: 253, baseType: !124, size: 32, offset: 672)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !328, file: !329, line: 256, baseType: !363, size: 64, offset: 704)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !328, file: !329, line: 259, baseType: !414, size: 16, offset: 768)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_poller", file: !329, line: 236, size: 16, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "is_polling", scope: !414, file: !329, line: 237, baseType: !306, size: 8)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !414, file: !329, line: 238, baseType: !182, size: 8, offset: 8)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !328, file: !329, line: 271, baseType: !419, size: 128, offset: 800)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !329, line: 34, size: 128, elements: !420)
!420 = !{!421, !427, !428, !429}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !419, file: !329, line: 35, baseType: !422, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !423, line: 46, baseType: !424)
!423 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 32)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !124, !124, !124}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !419, file: !329, line: 36, baseType: !124, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !419, file: !329, line: 37, baseType: !124, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !419, file: !329, line: 38, baseType: !124, size: 32, offset: 96)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !328, file: !329, line: 274, baseType: !327, size: 32, offset: 928)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !328, file: !329, line: 279, baseType: !432, size: 256, offset: 960)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 256, elements: !433)
!433 = !{!434}
!434 = !DISubrange(count: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "custom_data", scope: !328, file: !329, line: 284, baseType: !124, size: 32, offset: 1216)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !328, file: !329, line: 294, baseType: !125, size: 32, offset: 1248)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !328, file: !329, line: 300, baseType: !438, size: 96, offset: 1280)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !329, line: 149, size: 96, elements: !439)
!439 = !{!440, !441, !442}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !438, file: !329, line: 153, baseType: !22, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !438, file: !329, line: 162, baseType: !170, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !438, file: !329, line: 168, baseType: !170, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !328, file: !329, line: 325, baseType: !444, size: 32, offset: 1376)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !141, line: 5073, size: 192, elements: !446)
!446 = !{!447, !456, !457}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !445, file: !141, line: 5074, baseType: !448, size: 96)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !449, line: 56, size: 96, elements: !450)
!449 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!450 = !{!451, !454, !455}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !448, file: !449, line: 57, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 32)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !449, line: 57, flags: DIFlagFwdDecl)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !448, file: !449, line: 58, baseType: !124, size: 32, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !448, file: !449, line: 59, baseType: !170, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !445, file: !141, line: 5075, baseType: !363, size: 64, offset: 96)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !445, file: !141, line: 5076, baseType: !458, size: 32, offset: 160)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !166, line: 43, size: 32, elements: !459)
!459 = !{!460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !458, file: !166, line: 52, baseType: !22, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !328, file: !329, line: 343, baseType: !462, size: 64, offset: 1408)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !400, line: 60, size: 64, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !462, file: !400, line: 63, baseType: !135, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !462, file: !400, line: 66, baseType: !135, size: 32, offset: 32)
!466 = !{!467, !468, !469, !470}
!467 = !DILocalVariable(name: "thread", arg: 1, scope: !323, file: !324, line: 175, type: !327)
!468 = !DILocalVariable(name: "region_num", scope: !323, file: !324, line: 200, type: !182)
!469 = !DILocalVariable(name: "guard_start", scope: !323, file: !324, line: 265, type: !22)
!470 = !DILocalVariable(name: "guard_size", scope: !323, file: !324, line: 266, type: !170)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 96, elements: !240)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !473, line: 52, size: 96, elements: !474)
!473 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!474 = !{!475, !476, !477}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !472, file: !473, line: 53, baseType: !22, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !472, file: !473, line: 54, baseType: !170, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !472, file: !473, line: 55, baseType: !478, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !479, line: 151, baseType: !480)
!479 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !479, line: 149, size: 32, elements: !481)
!481 = !{!482}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !480, file: !479, line: 150, baseType: !135, size: 32)
!483 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 96, elements: !240)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !487, file: !519, line: 39, type: !182, isLocal: true, isDefinition: true)
!487 = distinct !DICompileUnit(language: DW_LANG_C99, file: !488, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !489, globals: !518, splitDebugInlining: false, nameTableKind: None)
!488 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!489 = !{!490, !124, !125, !506, !182}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !492, line: 1168, baseType: !493)
!492 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !492, line: 1155, size: 352, elements: !494)
!494 = !{!495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !493, file: !492, line: 1157, baseType: !228, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !493, file: !492, line: 1158, baseType: !225, size: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !493, file: !492, line: 1159, baseType: !225, size: 32, offset: 64)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !493, file: !492, line: 1160, baseType: !225, size: 32, offset: 96)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !493, file: !492, line: 1161, baseType: !225, size: 32, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !493, file: !492, line: 1162, baseType: !225, size: 32, offset: 160)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !493, file: !492, line: 1163, baseType: !225, size: 32, offset: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !493, file: !492, line: 1164, baseType: !225, size: 32, offset: 224)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !493, file: !492, line: 1165, baseType: !225, size: 32, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !493, file: !492, line: 1166, baseType: !225, size: 32, offset: 288)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !493, file: !492, line: 1167, baseType: !225, size: 32, offset: 320)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !508)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !509, line: 27, size: 96, elements: !510)
!509 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!510 = !{!511, !512, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !508, file: !509, line: 29, baseType: !135, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !508, file: !509, line: 31, baseType: !296, size: 32, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !508, file: !509, line: 37, baseType: !514, size: 32, offset: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !479, line: 146, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !479, line: 141, size: 32, elements: !516)
!516 = !{!517}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !515, file: !479, line: 143, baseType: !135, size: 32)
!518 = !{!485}
!519 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !522, file: !529, line: 21, type: !211, isLocal: true, isDefinition: true)
!522 = distinct !DICompileUnit(language: DW_LANG_C99, file: !523, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !524, globals: !528, splitDebugInlining: false, nameTableKind: None)
!523 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!524 = !{!525, !125, !124}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !527, line: 22, baseType: !125)
!527 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!528 = !{!520}
!529 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !532, file: !537, line: 13, type: !554, isLocal: true, isDefinition: true)
!532 = distinct !DICompileUnit(language: DW_LANG_C99, file: !533, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !534, splitDebugInlining: false, nameTableKind: None)
!533 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!534 = !{!535, !530}
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "mpu_config", scope: !532, file: !537, line: 37, type: !538, isLocal: false, isDefinition: true)
!537 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !509, line: 41, size: 64, elements: !540)
!540 = !{!541, !542}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !539, file: !509, line: 43, baseType: !135, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !539, file: !509, line: 45, baseType: !543, size: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !509, line: 27, size: 96, elements: !546)
!546 = !{!547, !548, !549}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !545, file: !509, line: 29, baseType: !135, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !545, file: !509, line: 31, baseType: !296, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !545, file: !509, line: 37, baseType: !550, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !479, line: 146, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !479, line: 141, size: 32, elements: !552)
!552 = !{!553}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !551, file: !479, line: 143, baseType: !135, size: 32)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 192, elements: !359)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "cmsis_timer_slab", scope: !557, file: !569, line: 24, type: !631, isLocal: false, isDefinition: true, align: 32)
!557 = distinct !DICompileUnit(language: DW_LANG_C99, file: !558, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !559, retainedTypes: !560, globals: !625, splitDebugInlining: false, nameTableKind: None)
!558 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/portability/cmsis_rtos_v1/cmsis_timer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!559 = !{!49, !30, !53}
!560 = !{!124, !561, !562, !564, !567, !125, !135, !623, !174}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !563, line: 46, baseType: !396)
!563 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "osTimerId", file: !31, line: 141, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "os_timer_cb", file: !31, line: 141, flags: DIFlagFwdDecl)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timer_obj", file: !569, line: 16, size: 576, elements: !570)
!569 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v1/cmsis_timer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!570 = !{!571, !618, !620, !621, !622}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ztimer", scope: !568, file: !569, line: 17, baseType: !572, size: 448)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !141, line: 1318, size: 448, elements: !573)
!573 = !{!574, !599, !605, !610, !611, !616, !617}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !572, file: !141, line: 1324, baseType: !575, size: 192)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !145, line: 244, size: 192, elements: !576)
!576 = !{!577, !592, !598}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !575, file: !145, line: 245, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !150, line: 49, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !150, line: 37, size: 64, elements: !580)
!580 = !{!581, !587}
!581 = !DIDerivedType(tag: DW_TAG_member, scope: !579, file: !150, line: 38, baseType: !582, size: 32)
!582 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !579, file: !150, line: 38, size: 32, elements: !583)
!583 = !{!584, !586}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !582, file: !150, line: 39, baseType: !585, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !582, file: !150, line: 40, baseType: !585, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, scope: !579, file: !150, line: 42, baseType: !588, size: 32, offset: 32)
!588 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !579, file: !150, line: 42, size: 32, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !588, file: !150, line: 43, baseType: !585, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !588, file: !150, line: 44, baseType: !585, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !575, file: !145, line: 246, baseType: !593, size: 32, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !145, line: 242, baseType: !594)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !597}
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !575, file: !145, line: 249, baseType: !396, size: 64, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !572, file: !141, line: 1327, baseType: !600, size: 64, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !145, line: 233, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 231, size: 64, elements: !602)
!602 = !{!603}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !601, file: !145, line: 232, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !150, line: 48, baseType: !579)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !572, file: !141, line: 1330, baseType: !606, size: 32, offset: 256)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 32)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !609}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !572, file: !141, line: 1333, baseType: !606, size: 32, offset: 288)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !572, file: !141, line: 1336, baseType: !612, size: 64, offset: 320)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !563, line: 67, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !563, line: 65, size: 64, elements: !614)
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !613, file: !563, line: 66, baseType: !562, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !572, file: !141, line: 1339, baseType: !135, size: 32, offset: 384)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !572, file: !141, line: 1342, baseType: !124, size: 32, offset: 416)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !568, file: !569, line: 18, baseType: !619, size: 32, offset: 448)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "os_timer_type", file: !31, line: 123, baseType: !49)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !568, file: !569, line: 19, baseType: !135, size: 32, offset: 480)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "callback_function", scope: !568, file: !569, line: 20, baseType: !16, size: 32, offset: 512)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !568, file: !569, line: 21, baseType: !124, size: 32, offset: 544)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !624)
!624 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!625 = !{!555, !626}
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "_k_mem_slab_buf_cmsis_timer_slab", scope: !557, file: !569, line: 24, type: !628, isLocal: false, isDefinition: true, align: 64)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 2880, elements: !629)
!629 = !{!630}
!630 = !DISubrange(count: 360)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_slab", file: !141, line: 4836, size: 256, elements: !632)
!632 = !{!633, !634, !638, !639, !640, !641, !642}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !631, file: !141, line: 4837, baseType: !600, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !631, file: !141, line: 4838, baseType: !635, size: 32, offset: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !166, line: 43, size: 32, elements: !636)
!636 = !{!637}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !635, file: !166, line: 52, baseType: !22, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !631, file: !141, line: 4839, baseType: !135, size: 32, offset: 96)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !631, file: !141, line: 4840, baseType: !170, size: 32, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !631, file: !141, line: 4841, baseType: !174, size: 32, offset: 160)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "free_list", scope: !631, file: !141, line: 4842, baseType: !174, size: 32, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "num_used", scope: !631, file: !141, line: 4843, baseType: !135, size: 32, offset: 224)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !645, file: !702, line: 603, type: !704, isLocal: true, isDefinition: true, align: 32)
!645 = distinct !DICompileUnit(language: DW_LANG_C99, file: !646, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !208, retainedTypes: !647, globals: !699, splitDebugInlining: false, nameTableKind: None)
!646 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!647 = !{!124, !125, !648}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !651, line: 336, size: 160, elements: !652)
!651 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!652 = !{!653, !673, !677, !681, !694}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !650, file: !651, line: 365, baseType: !654, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 32)
!655 = !DISubroutineType(types: !656)
!656 = !{!125, !657, !672}
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !293, line: 378, size: 192, elements: !660)
!660 = !{!661, !662, !663, !664, !670, !671}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !659, file: !293, line: 380, baseType: !296, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !659, file: !293, line: 382, baseType: !13, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !659, file: !293, line: 384, baseType: !13, size: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !659, file: !293, line: 386, baseType: !665, size: 32, offset: 96)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !293, line: 351, size: 16, elements: !667)
!667 = !{!668, !669}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !666, file: !293, line: 359, baseType: !182, size: 8)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !666, file: !293, line: 364, baseType: !306, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !659, file: !293, line: 388, baseType: !124, size: 32, offset: 128)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !659, file: !293, line: 396, baseType: !309, size: 32, offset: 160)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !650, file: !651, line: 366, baseType: !674, size: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 32)
!675 = !DISubroutineType(types: !676)
!676 = !{null, !657, !183}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !650, file: !651, line: 374, baseType: !678, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = !DISubroutineType(types: !680)
!680 = !{!125, !657}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !650, file: !651, line: 377, baseType: !682, size: 32, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!683 = !DISubroutineType(types: !684)
!684 = !{!125, !657, !685}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !651, line: 122, size: 64, elements: !688)
!688 = !{!689, !690, !691, !692, !693}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !687, file: !651, line: 123, baseType: !135, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !687, file: !651, line: 124, baseType: !182, size: 8, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !687, file: !651, line: 125, baseType: !182, size: 8, offset: 40)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !687, file: !651, line: 126, baseType: !182, size: 8, offset: 48)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !687, file: !651, line: 127, baseType: !182, size: 8, offset: 56)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !650, file: !651, line: 379, baseType: !695, size: 32, offset: 128)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!696 = !DISubroutineType(types: !697)
!697 = !{!125, !657, !698}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 32)
!699 = !{!643, !700}
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !645, file: !702, line: 38, type: !703, isLocal: true, isDefinition: true)
!702 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!703 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !657)
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !284, line: 51, size: 64, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !705, file: !284, line: 60, baseType: !678, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !705, file: !284, line: 65, baseType: !657, size: 32, offset: 32)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !711, file: !716, line: 7, type: !717, isLocal: false, isDefinition: true, align: 16)
!711 = distinct !DICompileUnit(language: DW_LANG_C99, file: !712, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !713, splitDebugInlining: false, nameTableKind: None)
!712 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!713 = !{!709, !714}
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !711, file: !716, line: 12, type: !717, isLocal: false, isDefinition: true, align: 16)
!716 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 48, elements: !256)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "wdt_sam_cfg", scope: !720, file: !781, line: 234, type: !817, isLocal: true, isDefinition: true)
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !722, globals: !778, splitDebugInlining: false, nameTableKind: None)
!721 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!722 = !{!723, !135}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !726, line: 134, size: 128, elements: !727)
!726 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!727 = !{!728, !748, !753, !773}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !725, file: !726, line: 135, baseType: !729, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !726, line: 113, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!731 = !DISubroutineType(types: !732)
!732 = !{!125, !733, !182}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !293, line: 378, size: 192, elements: !736)
!736 = !{!737, !738, !739, !740, !746, !747}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !735, file: !293, line: 380, baseType: !296, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !735, file: !293, line: 382, baseType: !13, size: 32, offset: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !735, file: !293, line: 384, baseType: !13, size: 32, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !735, file: !293, line: 386, baseType: !741, size: 32, offset: 96)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 32)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !293, line: 351, size: 16, elements: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !742, file: !293, line: 359, baseType: !182, size: 8)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !742, file: !293, line: 364, baseType: !306, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !735, file: !293, line: 388, baseType: !124, size: 32, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !735, file: !293, line: 396, baseType: !309, size: 32, offset: 160)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !725, file: !726, line: 136, baseType: !749, size: 32, offset: 32)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_disable", file: !726, line: 119, baseType: !750)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!751 = !DISubroutineType(types: !752)
!752 = !{!125, !733}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "install_timeout", scope: !725, file: !726, line: 137, baseType: !754, size: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_install_timeout", file: !726, line: 125, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = !DISubroutineType(types: !757)
!757 = !{!125, !733, !758}
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_timeout_cfg", file: !726, line: 88, size: 128, elements: !761)
!761 = !{!762, !767, !772}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !760, file: !726, line: 90, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_window", file: !726, line: 72, size: 64, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !763, file: !726, line: 74, baseType: !135, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !763, file: !726, line: 76, baseType: !135, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !760, file: !726, line: 92, baseType: !768, size: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_callback_t", file: !726, line: 85, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 32)
!770 = !DISubroutineType(types: !771)
!771 = !{null, !733, !125}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !760, file: !726, line: 104, baseType: !182, size: 8, offset: 96)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "feed", scope: !725, file: !726, line: 138, baseType: !774, size: 32, offset: 96)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_feed", file: !726, line: 132, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!776 = !DISubroutineType(types: !777)
!777 = !{!125, !733, !125}
!778 = !{!779, !783, !785, !792, !718, !794, !796, !804}
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !720, file: !781, line: 256, type: !782, isLocal: false, isDefinition: true, align: 16)
!781 = !DIFile(filename: "zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 80, elements: !260)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "__device_dts_ord_26", scope: !720, file: !781, line: 256, type: !734, isLocal: false, isDefinition: true, align: 32)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_26", scope: !720, file: !781, line: 256, type: !787, isLocal: true, isDefinition: true, align: 32)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !284, line: 51, size: 64, elements: !789)
!789 = !{!790, !791}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !788, file: !284, line: 60, baseType: !750, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !788, file: !284, line: 65, baseType: !733, size: 32, offset: 32)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_26", scope: !720, file: !781, line: 256, type: !742, isLocal: true, isDefinition: true, align: 8)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "wdt_sam_api", scope: !720, file: !781, line: 227, type: !724, isLocal: true, isDefinition: true)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "wdt_sam_data", scope: !720, file: !781, line: 45, type: !798, isLocal: true, isDefinition: true)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_data", file: !781, line: 38, size: 96, elements: !799)
!799 = !{!800, !801, !802, !803}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !798, file: !781, line: 39, baseType: !768, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !798, file: !781, line: 40, baseType: !135, size: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_valid", scope: !798, file: !781, line: 41, baseType: !306, size: 8, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "mode_set", scope: !798, file: !781, line: 42, baseType: !306, size: 8, offset: 72)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "__isr_wdt_sam_isr_irq_0", scope: !806, file: !781, line: 240, type: !810, isLocal: true, isDefinition: true, align: 32)
!806 = distinct !DISubprogram(name: "wdt_sam_irq_config", scope: !781, file: !781, line: 238, type: !807, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !720, retainedNodes: !809)
!807 = !DISubroutineType(types: !808)
!808 = !{null}
!809 = !{}
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !811)
!811 = !{!812, !814, !815, !816}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !810, file: !10, line: 55, baseType: !813, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !125)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !810, file: !10, line: 57, baseType: !813, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !810, file: !10, line: 59, baseType: !124, size: 32, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !810, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_cfg", file: !781, line: 34, size: 32, elements: !819)
!819 = !{!820}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !818, file: !781, line: 35, baseType: !821, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "Wdt", file: !823, line: 45, baseType: !824)
!823 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/wdt.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !823, line: 41, size: 96, elements: !825)
!825 = !{!826, !827, !828}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_CR", scope: !824, file: !823, line: 42, baseType: !225, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_MR", scope: !824, file: !823, line: 43, baseType: !225, size: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_SR", scope: !824, file: !823, line: 44, baseType: !228, size: 32, offset: 64)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "uart0_sam_config", scope: !831, file: !919, line: 494, type: !966, isLocal: true, isDefinition: true)
!831 = distinct !DICompileUnit(language: DW_LANG_C99, file: !832, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !833, retainedTypes: !866, globals: !916, splitDebugInlining: false, nameTableKind: None)
!832 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!833 = !{!834, !841, !847, !854, !859}
!834 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_rx_stop_reason", file: !651, line: 47, baseType: !32, size: 32, elements: !835)
!835 = !{!836, !837, !838, !839, !840}
!836 = !DIEnumerator(name: "UART_ERROR_OVERRUN", value: 1)
!837 = !DIEnumerator(name: "UART_ERROR_PARITY", value: 2)
!838 = !DIEnumerator(name: "UART_ERROR_FRAMING", value: 4)
!839 = !DIEnumerator(name: "UART_BREAK", value: 8)
!840 = !DIEnumerator(name: "UART_ERROR_COLLISION", value: 16)
!841 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_stop_bits", file: !651, line: 84, baseType: !32, size: 32, elements: !842)
!842 = !{!843, !844, !845, !846}
!843 = !DIEnumerator(name: "UART_CFG_STOP_BITS_0_5", value: 0)
!844 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1", value: 1)
!845 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1_5", value: 2)
!846 = !DIEnumerator(name: "UART_CFG_STOP_BITS_2", value: 3)
!847 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_data_bits", file: !651, line: 92, baseType: !32, size: 32, elements: !848)
!848 = !{!849, !850, !851, !852, !853}
!849 = !DIEnumerator(name: "UART_CFG_DATA_BITS_5", value: 0)
!850 = !DIEnumerator(name: "UART_CFG_DATA_BITS_6", value: 1)
!851 = !DIEnumerator(name: "UART_CFG_DATA_BITS_7", value: 2)
!852 = !DIEnumerator(name: "UART_CFG_DATA_BITS_8", value: 3)
!853 = !DIEnumerator(name: "UART_CFG_DATA_BITS_9", value: 4)
!854 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_flow_control", file: !651, line: 107, baseType: !32, size: 32, elements: !855)
!855 = !{!856, !857, !858}
!856 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_NONE", value: 0)
!857 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RTS_CTS", value: 1)
!858 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_DTR_DSR", value: 2)
!859 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_parity", file: !651, line: 75, baseType: !32, size: 32, elements: !860)
!860 = !{!861, !862, !863, !864, !865}
!861 = !DIEnumerator(name: "UART_CFG_PARITY_NONE", value: 0)
!862 = !DIEnumerator(name: "UART_CFG_PARITY_ODD", value: 1)
!863 = !DIEnumerator(name: "UART_CFG_PARITY_EVEN", value: 2)
!864 = !DIEnumerator(name: "UART_CFG_PARITY_MARK", value: 3)
!865 = !DIEnumerator(name: "UART_CFG_PARITY_SPACE", value: 4)
!866 = !{!867, !124, !183, !135}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !651, line: 336, size: 160, elements: !870)
!870 = !{!871, !890, !894, !898, !911}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !869, file: !651, line: 365, baseType: !872, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!873 = !DISubroutineType(types: !874)
!874 = !{!125, !875, !672}
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !877)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !293, line: 378, size: 192, elements: !878)
!878 = !{!879, !880, !881, !882, !888, !889}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !877, file: !293, line: 380, baseType: !296, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !877, file: !293, line: 382, baseType: !13, size: 32, offset: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !877, file: !293, line: 384, baseType: !13, size: 32, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !877, file: !293, line: 386, baseType: !883, size: 32, offset: 96)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 32)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !293, line: 351, size: 16, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !884, file: !293, line: 359, baseType: !182, size: 8)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !884, file: !293, line: 364, baseType: !306, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !877, file: !293, line: 388, baseType: !124, size: 32, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !877, file: !293, line: 396, baseType: !309, size: 32, offset: 160)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !869, file: !651, line: 366, baseType: !891, size: 32, offset: 32)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 32)
!892 = !DISubroutineType(types: !893)
!893 = !{null, !875, !183}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !869, file: !651, line: 374, baseType: !895, size: 32, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = !DISubroutineType(types: !897)
!897 = !{!125, !875}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !869, file: !651, line: 377, baseType: !899, size: 32, offset: 96)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 32)
!900 = !DISubroutineType(types: !901)
!901 = !{!125, !875, !902}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !651, line: 122, size: 64, elements: !905)
!905 = !{!906, !907, !908, !909, !910}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !904, file: !651, line: 123, baseType: !135, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !904, file: !651, line: 124, baseType: !182, size: 8, offset: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !904, file: !651, line: 125, baseType: !182, size: 8, offset: 40)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !904, file: !651, line: 126, baseType: !182, size: 8, offset: 48)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !904, file: !651, line: 127, baseType: !182, size: 8, offset: 56)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !869, file: !651, line: 379, baseType: !912, size: 32, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!913 = !DISubroutineType(types: !914)
!914 = !{!125, !875, !915}
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!916 = !{!917, !923, !925, !932, !934, !936, !829, !941, !960, !963}
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !831, file: !919, line: 494, type: !920, isLocal: false, isDefinition: true, align: 16)
!919 = !DIFile(filename: "zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 96, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 6)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "__device_dts_ord_21", scope: !831, file: !919, line: 494, type: !876, isLocal: false, isDefinition: true, align: 32)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_21", scope: !831, file: !919, line: 494, type: !927, isLocal: true, isDefinition: true, align: 32)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !284, line: 51, size: 64, elements: !929)
!929 = !{!930, !931}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !928, file: !284, line: 60, baseType: !895, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !928, file: !284, line: 65, baseType: !875, size: 32, offset: 32)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_21", scope: !831, file: !919, line: 494, type: !884, isLocal: true, isDefinition: true, align: 8)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(name: "uart_sam_driver_api", scope: !831, file: !919, line: 419, type: !868, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(name: "uart0_sam_data", scope: !831, file: !919, line: 494, type: !938, isLocal: true, isDefinition: true)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_sam_dev_data", file: !919, line: 38, size: 32, elements: !939)
!939 = !{!940}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "baud_rate", scope: !938, file: !919, line: 39, baseType: !135, size: 32)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(name: "__pinctrl_dev_config__device_dts_ord_21", scope: !831, file: !919, line: 494, type: !943, isLocal: true, isDefinition: true)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_dev_config", file: !945, line: 60, size: 64, elements: !946)
!945 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!946 = !{!947, !959}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !944, file: !945, line: 69, baseType: !948, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_state", file: !945, line: 50, size: 64, elements: !951)
!951 = !{!952, !957, !958}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "pins", scope: !950, file: !945, line: 52, baseType: !953, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "pinctrl_soc_pin_t", file: !956, line: 32, baseType: !135)
!956 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl/pinctrl_soc_sam_common.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!957 = !DIDerivedType(tag: DW_TAG_member, name: "pin_cnt", scope: !950, file: !945, line: 54, baseType: !182, size: 8, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !950, file: !945, line: 56, baseType: !182, size: 8, offset: 40)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "state_cnt", scope: !944, file: !945, line: 71, baseType: !182, size: 8, offset: 32)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(name: "__pinctrl_states__device_dts_ord_21", scope: !831, file: !919, line: 494, type: !962, isLocal: true, isDefinition: true)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 64, elements: !240)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(name: "__pinctrl_state_pins_0__device_dts_ord_21", scope: !831, file: !919, line: 494, type: !965, isLocal: true, isDefinition: true)
!965 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 64, elements: !359)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_sam_dev_cfg", file: !919, line: 27, size: 96, elements: !968)
!968 = !{!969, !998, !999}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !967, file: !919, line: 28, baseType: !970, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uart", file: !972, line: 62, baseType: !973)
!972 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !972, line: 41, size: 2368, elements: !974)
!974 = !{!975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "UART_CR", scope: !973, file: !972, line: 42, baseType: !225, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "UART_MR", scope: !973, file: !972, line: 43, baseType: !225, size: 32, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IER", scope: !973, file: !972, line: 44, baseType: !225, size: 32, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IDR", scope: !973, file: !972, line: 45, baseType: !225, size: 32, offset: 96)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IMR", scope: !973, file: !972, line: 46, baseType: !228, size: 32, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "UART_SR", scope: !973, file: !972, line: 47, baseType: !228, size: 32, offset: 160)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RHR", scope: !973, file: !972, line: 48, baseType: !228, size: 32, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "UART_THR", scope: !973, file: !972, line: 49, baseType: !225, size: 32, offset: 224)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "UART_BRGR", scope: !973, file: !972, line: 50, baseType: !225, size: 32, offset: 256)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !973, file: !972, line: 51, baseType: !985, size: 1760, offset: 288)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 1760, elements: !986)
!986 = !{!987}
!987 = !DISubrange(count: 55)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RPR", scope: !973, file: !972, line: 52, baseType: !225, size: 32, offset: 2048)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RCR", scope: !973, file: !972, line: 53, baseType: !225, size: 32, offset: 2080)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TPR", scope: !973, file: !972, line: 54, baseType: !225, size: 32, offset: 2112)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TCR", scope: !973, file: !972, line: 55, baseType: !225, size: 32, offset: 2144)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RNPR", scope: !973, file: !972, line: 56, baseType: !225, size: 32, offset: 2176)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RNCR", scope: !973, file: !972, line: 57, baseType: !225, size: 32, offset: 2208)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TNPR", scope: !973, file: !972, line: 58, baseType: !225, size: 32, offset: 2240)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TNCR", scope: !973, file: !972, line: 59, baseType: !225, size: 32, offset: 2272)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "UART_PTCR", scope: !973, file: !972, line: 60, baseType: !225, size: 32, offset: 2304)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "UART_PTSR", scope: !973, file: !972, line: 61, baseType: !228, size: 32, offset: 2336)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "periph_id", scope: !967, file: !919, line: 29, baseType: !135, size: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "pcfg", scope: !967, file: !919, line: 30, baseType: !1000, size: 32, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 32)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(name: "overflow_cyc", scope: !1003, file: !1135, line: 65, type: !225, isLocal: true, isDefinition: true)
!1003 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1004, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1005, retainedTypes: !1059, globals: !1132, splitDebugInlining: false, nameTableKind: None)
!1004 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/timer/cortex_m_systick.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/subsys/portability/cmsis_rtos_v1/timer_synchronization")
!1005 = !{!1006}
!1006 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !1007, line: 57, baseType: !125, size: 32, elements: !1008)
