; ModuleID = 'build/arduino_due/drivers/led_lp503x/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.3, i8*, i32 }
%union.anon.3 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer.16 = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon.3 }
%struct.mpsc_pbuf_buffer_config.17 = type { i32*, i32, void (%struct.mpsc_pbuf_buffer.16*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }
%union.log_msg_generic = type { %struct.log_msg }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/led_lp503x/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/led_lp503x")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/led_lp503x")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !230, line: 16, type: !232, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !107, globals: !227, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/led_lp503x/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/led_lp503x")
!29 = !{!30, !37}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !38, line: 27, baseType: !32, size: 32, elements: !39)
!38 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!40 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!41 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!42 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!43 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!44 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!45 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!46 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!47 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!48 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!49 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!50 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!51 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!52 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!53 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!54 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!55 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!56 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!106 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!107 = !{!108, !109, !123, !124, !117, !125, !135, !154}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !122}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !110, file: !111, line: 80, baseType: !114, size: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !115)
!115 = !{!116, !119, !120, !121}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !114, file: !111, line: 47, baseType: !117, size: 8)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !118)
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !114, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !114, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !114, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !110, file: !111, line: 82, baseType: !108, size: 32)
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !127)
!127 = !{!128, !146, !150}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !126, file: !31, line: 89, baseType: !129, size: 96)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !130)
!130 = !{!131, !143, !144}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !129, file: !31, line: 67, baseType: !132, size: 32)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !133)
!133 = !{!134, !136, !137, !138, !139, !140, !141, !142}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !132, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !132, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !132, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !132, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !132, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !132, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !129, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !129, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !135)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !126, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 32, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 4)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !31, line: 94, baseType: !151, offset: 128)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: -1)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "led_driver_api", file: !157, line: 113, size: 224, elements: !158)
!157 = !DIFile(filename: "zephyr/include/zephyr/drivers/led.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!158 = !{!159, !189, !191, !196, !212, !217, !222}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !156, file: !157, line: 115, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_on", file: !157, line: 89, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{!123, !164, !135}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !167, line: 378, size: 192, elements: !168)
!167 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!168 = !{!169, !173, !174, !175, !182, !183}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !166, file: !167, line: 380, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!172 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !166, file: !167, line: 382, baseType: !13, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !166, file: !167, line: 384, baseType: !13, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !166, file: !167, line: 386, baseType: !176, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !167, line: 351, size: 16, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !177, file: !167, line: 359, baseType: !117, size: 8)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !177, file: !167, line: 364, baseType: !181, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!181 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !166, file: !167, line: 388, baseType: !108, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !166, file: !167, line: 396, baseType: !184, size: 32, offset: 160)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !167, line: 43, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !188)
!188 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !156, file: !157, line: 116, baseType: !190, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_off", file: !157, line: 97, baseType: !161)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "blink", scope: !156, file: !157, line: 118, baseType: !192, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_blink", file: !157, line: 54, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!123, !164, !135, !135, !135}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "get_info", scope: !156, file: !157, line: 119, baseType: !197, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_get_info", file: !157, line: 63, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{!123, !164, !135, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "led_info", file: !157, line: 41, size: 128, elements: !205)
!205 = !{!206, !207, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !204, file: !157, line: 42, baseType: !170, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !204, file: !157, line: 43, baseType: !135, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "num_colors", scope: !204, file: !157, line: 44, baseType: !117, size: 8, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "color_mapping", scope: !204, file: !157, line: 45, baseType: !210, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "set_brightness", scope: !156, file: !157, line: 120, baseType: !213, size: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_set_brightness", file: !157, line: 72, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DISubroutineType(types: !216)
!216 = !{!123, !164, !135, !117}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "set_color", scope: !156, file: !157, line: 121, baseType: !218, size: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_set_color", file: !157, line: 80, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DISubroutineType(types: !221)
!221 = !{!123, !164, !135, !117, !210}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "write_channels", scope: !156, file: !157, line: 122, baseType: !223, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_write_channels", file: !157, line: 105, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DISubroutineType(types: !226)
!226 = !{!123, !164, !135, !135, !210}
!227 = !{!25, !228}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !230, line: 16, type: !231, isLocal: true, isDefinition: true)
!230 = !DIFile(filename: "zephyr/samples/drivers/led_lp503x/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !234, line: 16, size: 64, elements: !235)
!234 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !234, line: 17, baseType: !170, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !233, file: !234, line: 18, baseType: !117, size: 8, offset: 32)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !240, file: !296, line: 18, type: !298, isLocal: false, isDefinition: true)
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !242, retainedTypes: !243, globals: !293, splitDebugInlining: false, nameTableKind: None)
!241 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/led_lp503x")
!242 = !{!30}
!243 = !{!22, !108, !24, !244, !246, !248, !249, !123, !251, !252, !254, !256, !257, !258, !259, !261, !124, !117, !272, !135, !170}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !250, line: 214, baseType: !32)
!250 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !260)
!260 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !263)
!263 = !{!264, !271}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !262, file: !111, line: 80, baseType: !265, size: 32)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !266)
!266 = !{!267, !268, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !265, file: !111, line: 47, baseType: !117, size: 8)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !265, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !265, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !265, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !262, file: !111, line: 82, baseType: !108, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !274)
!274 = !{!275, !291, !292}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !273, file: !31, line: 89, baseType: !276, size: 96)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !277)
!277 = !{!278, !289, !290}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !276, file: !31, line: 67, baseType: !279, size: 32)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !279, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !279, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !279, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !279, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !279, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !279, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !279, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !279, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !276, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !276, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !273, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !273, file: !31, line: 94, baseType: !151, offset: 128)
!293 = !{!238, !294}
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !240, file: !296, line: 18, type: !297, isLocal: true, isDefinition: true)
!296 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !234, line: 16, size: 64, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !299, file: !234, line: 17, baseType: !170, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !299, file: !234, line: 18, baseType: !117, size: 8, offset: 32)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "_char_out", scope: !305, file: !310, line: 54, type: !311, isLocal: false, isDefinition: true)
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !307, retainedTypes: !308, globals: !309, splitDebugInlining: false, nameTableKind: None)
!306 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/led_lp503x")
!307 = !{!37}
!308 = !{!108, !123}
!309 = !{!303}
!310 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DISubroutineType(types: !313)
!313 = !{!123, !123}
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !316, file: !381, line: 235, type: !382, isLocal: true, isDefinition: true, align: 32)
!316 = distinct !DICompileUnit(language: DW_LANG_C99, file: !317, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !307, retainedTypes: !318, globals: !380, splitDebugInlining: false, nameTableKind: None)
!317 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/led_lp503x")
!318 = !{!108, !123, !319, !330}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !321, line: 46, baseType: !322)
!321 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !321, line: 41, size: 128, elements: !323)
!323 = !{!324, !326, !327, !329}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !322, file: !321, line: 42, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !135)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !322, file: !321, line: 43, baseType: !325, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !322, file: !321, line: 44, baseType: !328, size: 32, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !325)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !322, file: !321, line: 45, baseType: !328, size: 32, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !332, line: 75, baseType: !333)
!332 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !332, line: 41, size: 2176, elements: !334)
!334 = !{!335, !336, !337, !338, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !358, !362, !363, !364, !365, !366, !367, !368, !369, !373, !374, !375, !376, !377, !378, !379}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !333, file: !332, line: 42, baseType: !325, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !333, file: !332, line: 43, baseType: !325, size: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !333, file: !332, line: 44, baseType: !328, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !333, file: !332, line: 45, baseType: !339, size: 32, offset: 96)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 32, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 1)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !333, file: !332, line: 46, baseType: !325, size: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !333, file: !332, line: 47, baseType: !325, size: 32, offset: 160)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !333, file: !332, line: 48, baseType: !328, size: 32, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !333, file: !332, line: 49, baseType: !325, size: 32, offset: 224)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !333, file: !332, line: 50, baseType: !325, size: 32, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !333, file: !332, line: 51, baseType: !328, size: 32, offset: 288)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !333, file: !332, line: 52, baseType: !325, size: 32, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !333, file: !332, line: 53, baseType: !339, size: 32, offset: 352)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !333, file: !332, line: 54, baseType: !325, size: 32, offset: 384)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !333, file: !332, line: 55, baseType: !339, size: 32, offset: 416)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !333, file: !332, line: 56, baseType: !325, size: 32, offset: 448)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !333, file: !332, line: 57, baseType: !339, size: 32, offset: 480)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !333, file: !332, line: 58, baseType: !355, size: 96, offset: 512)
!355 = !DICompositeType(tag: DW_TAG_array_type, baseType: !325, size: 96, elements: !356)
!356 = !{!357}
!357 = !DISubrange(count: 3)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !333, file: !332, line: 59, baseType: !359, size: 160, offset: 608)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 160, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 5)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !333, file: !332, line: 60, baseType: !325, size: 32, offset: 768)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !333, file: !332, line: 61, baseType: !325, size: 32, offset: 800)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !333, file: !332, line: 62, baseType: !328, size: 32, offset: 832)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !333, file: !332, line: 63, baseType: !328, size: 32, offset: 864)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !333, file: !332, line: 64, baseType: !325, size: 32, offset: 896)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !333, file: !332, line: 65, baseType: !325, size: 32, offset: 928)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !333, file: !332, line: 66, baseType: !325, size: 32, offset: 960)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !333, file: !332, line: 67, baseType: !370, size: 832, offset: 992)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 832, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 26)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !333, file: !332, line: 68, baseType: !325, size: 32, offset: 1824)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !333, file: !332, line: 69, baseType: !328, size: 32, offset: 1856)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !333, file: !332, line: 70, baseType: !359, size: 160, offset: 1888)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !333, file: !332, line: 71, baseType: !325, size: 32, offset: 2048)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !333, file: !332, line: 72, baseType: !325, size: 32, offset: 2080)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !333, file: !332, line: 73, baseType: !328, size: 32, offset: 2112)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !333, file: !332, line: 74, baseType: !325, size: 32, offset: 2144)
!380 = !{!314}
!381 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!382 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !384, line: 51, size: 64, elements: !385)
!384 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !{!386, !405}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !383, file: !384, line: 60, baseType: !387, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!388 = !DISubroutineType(types: !389)
!389 = !{!123, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !167, line: 378, size: 192, elements: !393)
!393 = !{!394, !395, !396, !397, !403, !404}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !392, file: !167, line: 380, baseType: !170, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !392, file: !167, line: 382, baseType: !13, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !392, file: !167, line: 384, baseType: !13, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !392, file: !167, line: 386, baseType: !398, size: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !167, line: 351, size: 16, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !399, file: !167, line: 359, baseType: !117, size: 8)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !399, file: !167, line: 364, baseType: !181, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !392, file: !167, line: 388, baseType: !108, size: 32, offset: 128)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !392, file: !167, line: 396, baseType: !184, size: 32, offset: 160)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !383, file: !384, line: 65, baseType: !390, size: 32, offset: 32)
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "log_const_log", scope: !408, file: !489, line: 25, type: !729, isLocal: false, isDefinition: true)
!408 = distinct !DICompileUnit(language: DW_LANG_C99, file: !409, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !410, retainedTypes: !416, globals: !486, splitDebugInlining: false, nameTableKind: None)
!409 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/led_lp503x")
!410 = !{!411, !30, !37}
!411 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !412, line: 33, baseType: !32, size: 32, elements: !413)
!412 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!413 = !{!414, !415}
!414 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!415 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!416 = !{!249, !123, !108, !417, !124, !428, !117, !429, !135, !450, !22, !24, !477, !480, !482, !484}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !419)
!419 = !{!420, !427}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !418, file: !111, line: 80, baseType: !421, size: 32)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !422)
!422 = !{!423, !424, !425, !426}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !421, file: !111, line: 47, baseType: !117, size: 8)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !421, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !421, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !421, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !418, file: !111, line: 82, baseType: !108, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 32)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !431)
!431 = !{!432, !448, !449}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !430, file: !31, line: 89, baseType: !433, size: 96)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !434)
!434 = !{!435, !446, !447}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !433, file: !31, line: 67, baseType: !436, size: 32)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !437)
!437 = !{!438, !439, !440, !441, !442, !443, !444, !445}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !436, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !436, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !436, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !436, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !436, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !436, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !436, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !436, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !433, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !433, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !430, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !430, file: !31, line: 94, baseType: !151, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 32)
!451 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !452)
!452 = !{!453, !470, !476}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !451, file: !31, line: 112, baseType: !454, size: 32)
!454 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !455, line: 49, size: 32, elements: !456)
!455 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_packet.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!456 = !{!457, !463, !469}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !454, file: !455, line: 50, baseType: !458, size: 32)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !455, line: 37, size: 32, elements: !459)
!459 = !{!460, !461, !462}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !458, file: !455, line: 38, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !458, file: !455, line: 38, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !458, file: !455, line: 39, baseType: !135, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !454, file: !455, line: 51, baseType: !464, size: 32)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !455, line: 43, size: 32, elements: !465)
!465 = !{!466, !467, !468}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !464, file: !455, line: 44, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !464, file: !455, line: 44, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !464, file: !455, line: 45, baseType: !135, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !454, file: !455, line: 52, baseType: !135, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !451, file: !31, line: 113, baseType: !471, size: 32)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !472)
!472 = !{!473, !474, !475}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !471, file: !31, line: 108, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !471, file: !31, line: 108, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !471, file: !31, line: 108, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !451, file: !31, line: 114, baseType: !430, size: 128)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !478, line: 46, baseType: !479)
!478 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !255)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !481)
!481 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !451)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!486 = !{!406, !487, !516, !529, !531, !533, !537, !539, !541, !543, !545, !547, !553, !586, !589, !598, !690, !717, !724, !726, !734, !744, !749, !764, !768}
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "log_process_thread_sem", scope: !408, file: !489, line: 93, type: !490, isLocal: false, isDefinition: true, align: 32)
!489 = !DIFile(filename: "zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !491, line: 2909, size: 128, elements: !492)
!491 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!492 = !{!493, !514, !515}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !490, file: !491, line: 2910, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !495, line: 233, baseType: !496)
!495 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !495, line: 231, size: 64, elements: !497)
!497 = !{!498}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !496, file: !495, line: 232, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !500, line: 48, baseType: !501)
!500 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !500, line: 37, size: 64, elements: !502)
!502 = !{!503, !509}
!503 = !DIDerivedType(tag: DW_TAG_member, scope: !501, file: !500, line: 38, baseType: !504, size: 32)
!504 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !501, file: !500, line: 38, size: 32, elements: !505)
!505 = !{!506, !508}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !504, file: !500, line: 39, baseType: !507, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !504, file: !500, line: 40, baseType: !507, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, scope: !501, file: !500, line: 42, baseType: !510, size: 32, offset: 32)
!510 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !501, file: !500, line: 42, size: 32, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !510, file: !500, line: 43, baseType: !507, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !510, file: !500, line: 44, baseType: !507, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !490, file: !491, line: 2911, baseType: !32, size: 32, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !490, file: !491, line: 2912, baseType: !32, size: 32, offset: 96)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "__init_enable_logger", scope: !408, file: !489, line: 910, type: !518, isLocal: true, isDefinition: true, align: 32)
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !384, line: 51, size: 64, elements: !520)
!520 = !{!521, !528}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !519, file: !384, line: 60, baseType: !522, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = !DISubroutineType(types: !524)
!524 = !{!123, !525}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !527)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !384, line: 48, flags: DIFlagFwdDecl)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !519, file: !384, line: 65, baseType: !525, size: 32, offset: 32)
!529 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression())
!530 = distinct !DIGlobalVariable(name: "panic_mode", scope: !408, file: !489, line: 96, type: !181, isLocal: true, isDefinition: true)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "backend_attached", scope: !408, file: !489, line: 97, type: !181, isLocal: true, isDefinition: true)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "buffered_cnt", scope: !408, file: !489, line: 98, type: !535, isLocal: true, isDefinition: true)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !536, line: 22, baseType: !253)
!536 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "dropped_cnt", scope: !408, file: !489, line: 99, type: !535, isLocal: true, isDefinition: true)
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "timestamp_freq", scope: !408, file: !489, line: 105, type: !135, isLocal: true, isDefinition: true)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "prev_timestamp", scope: !408, file: !489, line: 107, type: !145, isLocal: true, isDefinition: true)
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "unordered_cnt", scope: !408, file: !489, line: 108, type: !535, isLocal: true, isDefinition: true)
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "last_failure_report", scope: !408, file: !489, line: 109, type: !480, isLocal: true, isDefinition: true)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "log_msg_ptr", scope: !408, file: !489, line: 111, type: !549, isLocal: true, isDefinition: true, align: 32)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_ptr", file: !550, line: 29, size: 32, elements: !551)
!550 = !DIFile(filename: "zephyr/include/zephyr/logging/log_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!551 = !{!552}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !549, file: !550, line: 30, baseType: !450, size: 32)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "log_buffer", scope: !408, file: !489, line: 112, type: !555, isLocal: true, isDefinition: true, align: 32)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !556, line: 87, size: 448, elements: !557)
!556 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_pbuf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!557 = !{!558, !559, !560, !561, !562, !563, !567, !576, !581, !583, !584, !585}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !555, file: !556, line: 89, baseType: !135, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !555, file: !556, line: 92, baseType: !135, size: 32, offset: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !555, file: !556, line: 95, baseType: !135, size: 32, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !555, file: !556, line: 98, baseType: !135, size: 32, offset: 96)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !555, file: !556, line: 101, baseType: !135, size: 32, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !555, file: !556, line: 104, baseType: !564, offset: 160)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !565, line: 43, elements: !566)
!565 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!566 = !{}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !555, file: !556, line: 110, baseType: !568, size: 32, offset: 160)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !556, line: 83, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 32)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !572, !574}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !555, file: !556, line: 113, baseType: !577, size: 32, offset: 192)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !556, line: 75, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!579 = !DISubroutineType(types: !580)
!580 = !{!135, !574}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !555, file: !556, line: 116, baseType: !582, size: 32, offset: 224)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !555, file: !556, line: 119, baseType: !135, size: 32, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !555, file: !556, line: 122, baseType: !135, size: 32, offset: 288)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !555, file: !556, line: 124, baseType: !490, size: 128, offset: 320)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "curr_log_buffer", scope: !408, file: !489, line: 113, type: !588, isLocal: true, isDefinition: true)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 32)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "logging_stack", scope: !408, file: !489, line: 884, type: !591, isLocal: false, isDefinition: true, align: 512)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !592, size: 6656, elements: !596)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !593, line: 47, size: 8, elements: !594)
!593 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!594 = !{!595}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !592, file: !593, line: 48, baseType: !172, size: 8)
!596 = !{!597}
!597 = !DISubrange(count: 832)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "logging_thread", scope: !408, file: !489, line: 885, type: !600, isLocal: false, isDefinition: true)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !601, line: 245, size: 1024, elements: !602)
!601 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!602 = !{!603, !648, !661, !662, !663, !664, !670, !685}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !600, file: !601, line: 247, baseType: !604, size: 384)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !601, line: 57, size: 384, elements: !605)
!605 = !{!606, !620, !622, !623, !624, !635, !636, !637}
!606 = !DIDerivedType(tag: DW_TAG_member, scope: !604, file: !601, line: 60, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !604, file: !601, line: 60, size: 64, elements: !608)
!608 = !{!609, !611}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !607, file: !601, line: 61, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !500, line: 49, baseType: !501)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !607, file: !601, line: 62, baseType: !612, size: 64)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !613, line: 49, size: 64, elements: !614)
!613 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !612, file: !613, line: 50, baseType: !616, size: 64)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !617, size: 64, elements: !618)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!618 = !{!619}
!619 = !DISubrange(count: 2)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !604, file: !601, line: 68, baseType: !621, size: 32, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !604, file: !601, line: 71, baseType: !117, size: 8, offset: 96)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !604, file: !601, line: 74, baseType: !117, size: 8, offset: 104)
!624 = !DIDerivedType(tag: DW_TAG_member, scope: !604, file: !601, line: 90, baseType: !625, size: 16, offset: 112)
!625 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !604, file: !601, line: 90, size: 16, elements: !626)
!626 = !{!627, !634}
!627 = !DIDerivedType(tag: DW_TAG_member, scope: !625, file: !601, line: 91, baseType: !628, size: 16)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !625, file: !601, line: 91, size: 16, elements: !629)
!629 = !{!630, !633}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !628, file: !601, line: 96, baseType: !631, size: 8)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !632)
!632 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !628, file: !601, line: 97, baseType: !117, size: 8, offset: 8)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !625, file: !601, line: 100, baseType: !259, size: 16)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !604, file: !601, line: 107, baseType: !135, size: 32, offset: 128)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !604, file: !601, line: 127, baseType: !108, size: 32, offset: 160)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !604, file: !601, line: 131, baseType: !638, size: 192, offset: 192)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !495, line: 244, size: 192, elements: !639)
!639 = !{!640, !641, !647}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !638, file: !495, line: 245, baseType: !610, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !638, file: !495, line: 246, baseType: !642, size: 32, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !495, line: 242, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 32)
!644 = !DISubroutineType(types: !645)
!645 = !{null, !646}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !638, file: !495, line: 249, baseType: !479, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !600, file: !601, line: 250, baseType: !649, size: 288, offset: 384)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !650, line: 25, size: 288, elements: !651)
!650 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!651 = !{!652, !653, !654, !655, !656, !657, !658, !659, !660}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !649, file: !650, line: 26, baseType: !135, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !649, file: !650, line: 27, baseType: !135, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !649, file: !650, line: 28, baseType: !135, size: 32, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !649, file: !650, line: 29, baseType: !135, size: 32, offset: 96)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !649, file: !650, line: 30, baseType: !135, size: 32, offset: 128)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !649, file: !650, line: 31, baseType: !135, size: 32, offset: 160)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !649, file: !650, line: 32, baseType: !135, size: 32, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !649, file: !650, line: 33, baseType: !135, size: 32, offset: 224)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !649, file: !650, line: 34, baseType: !135, size: 32, offset: 256)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !600, file: !601, line: 253, baseType: !108, size: 32, offset: 672)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !600, file: !601, line: 256, baseType: !494, size: 64, offset: 704)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !600, file: !601, line: 294, baseType: !123, size: 32, offset: 768)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !600, file: !601, line: 300, baseType: !665, size: 96, offset: 800)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !601, line: 149, size: 96, elements: !666)
!666 = !{!667, !668, !669}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !665, file: !601, line: 153, baseType: !22, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !665, file: !601, line: 162, baseType: !249, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !665, file: !601, line: 168, baseType: !249, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !600, file: !601, line: 325, baseType: !671, size: 32, offset: 896)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !491, line: 5073, size: 160, elements: !673)
!673 = !{!674, !683, !684}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !672, file: !491, line: 5074, baseType: !675, size: 96)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !676, line: 56, size: 96, elements: !677)
!676 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!677 = !{!678, !681, !682}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !675, file: !676, line: 57, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !676, line: 57, flags: DIFlagFwdDecl)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !675, file: !676, line: 58, baseType: !108, size: 32, offset: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !675, file: !676, line: 59, baseType: !249, size: 32, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !672, file: !491, line: 5075, baseType: !494, size: 64, offset: 96)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !672, file: !491, line: 5076, baseType: !564, offset: 160)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !600, file: !601, line: 343, baseType: !686, size: 64, offset: 928)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !650, line: 60, size: 64, elements: !687)
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !686, file: !650, line: 63, baseType: !135, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !686, file: !650, line: 66, baseType: !135, size: 32, offset: 32)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "format_table", scope: !408, file: !489, line: 72, type: !692, isLocal: true, isDefinition: true)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 128, elements: !148)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_format_func_t", file: !695, line: 105, baseType: !696)
!695 = !DIFile(filename: "zephyr/include/zephyr/logging/log_output.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = !DISubroutineType(types: !698)
!698 = !{null, !699, !429, !135}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !695, line: 89, size: 128, elements: !702)
!702 = !{!703, !708, !715, !716}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !701, file: !695, line: 90, baseType: !704, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_output_func_t", file: !695, line: 79, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!706 = !DISubroutineType(types: !707)
!707 = !{!123, !258, !249, !108}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !701, file: !695, line: 91, baseType: !709, size: 32, offset: 32)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !695, line: 82, size: 96, elements: !711)
!711 = !{!712, !713, !714}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !710, file: !695, line: 83, baseType: !535, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !710, file: !695, line: 84, baseType: !108, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !710, file: !695, line: 85, baseType: !170, size: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !701, file: !695, line: 92, baseType: !258, size: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !701, file: !695, line: 93, baseType: !249, size: 32, offset: 96)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "timestamp_func", scope: !408, file: !489, line: 104, type: !719, isLocal: true, isDefinition: true)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_get_t", file: !720, line: 33, baseType: !721)
!720 = !DIFile(filename: "zephyr/include/zephyr/logging/log_ctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = !DISubroutineType(types: !723)
!723 = !{!145}
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "initialized", scope: !408, file: !489, line: 95, type: !535, isLocal: true, isDefinition: true)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !408, file: !489, line: 25, type: !728, isLocal: true, isDefinition: true)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !234, line: 16, size: 64, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !730, file: !234, line: 17, baseType: !170, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !730, file: !234, line: 18, baseType: !117, size: 8, offset: 32)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "mpsc_config", scope: !408, file: !489, line: 121, type: !736, isLocal: true, isDefinition: true)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !556, line: 128, size: 160, elements: !738)
!738 = !{!739, !740, !741, !742, !743}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !737, file: !556, line: 130, baseType: !582, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !737, file: !556, line: 133, baseType: !135, size: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !737, file: !556, line: 136, baseType: !568, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !737, file: !556, line: 137, baseType: !577, size: 32, offset: 96)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !737, file: !556, line: 140, baseType: !135, size: 32, offset: 128)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "buf32", scope: !408, file: !489, line: 116, type: !746, isLocal: true, isDefinition: true, align: 64)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 8192, elements: !747)
!747 = !{!748}
!748 = !DISubrange(count: 256)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "process_lock", scope: !751, file: !489, line: 157, type: !564, isLocal: true, isDefinition: true)
!751 = distinct !DISubprogram(name: "z_log_msg_post_finalize", scope: !489, file: !489, line: 152, type: !752, scopeLine: 153, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !408, retainedNodes: !754)
!752 = !DISubroutineType(types: !753)
!753 = !{null}
!754 = !{!755, !757}
!755 = !DILocalVariable(name: "cnt", scope: !751, file: !489, line: 154, type: !756)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_val_t", file: !536, line: 23, baseType: !535)
!757 = !DILocalVariable(name: "key", scope: !758, file: !489, line: 158, type: !760)
!758 = distinct !DILexicalBlock(scope: !759, file: !489, line: 156, column: 18)
!759 = distinct !DILexicalBlock(scope: !751, file: !489, line: 156, column: 6)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !565, line: 106, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !565, line: 32, size: 32, elements: !762)
!762 = !{!763}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !761, file: !565, line: 33, baseType: !123, size: 32)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "proc_tid", scope: !408, file: !489, line: 100, type: !766, isLocal: true, isDefinition: true)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !601, line: 347, baseType: !767)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 32)
!768 = !DIGlobalVariableExpression(var: !769, expr: !DIExpression())
!769 = distinct !DIGlobalVariable(name: "log_process_thread_timer", scope: !408, file: !489, line: 101, type: !770, isLocal: true, isDefinition: true)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !491, line: 1318, size: 448, elements: !771)
!771 = !{!772, !773, !774, !779, !780, !785, !786}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !770, file: !491, line: 1324, baseType: !638, size: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !770, file: !491, line: 1327, baseType: !494, size: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !770, file: !491, line: 1330, baseType: !775, size: 32, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !778}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !770, file: !491, line: 1333, baseType: !775, size: 32, offset: 288)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !770, file: !491, line: 1336, baseType: !781, size: 64, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !478, line: 67, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !478, line: 65, size: 64, elements: !783)
!783 = !{!784}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !782, file: !478, line: 66, baseType: !477, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !770, file: !491, line: 1339, baseType: !135, size: 32, offset: 384)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !770, file: !491, line: 1342, baseType: !108, size: 32, offset: 416)
!787 = !DIGlobalVariableExpression(var: !530, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!788 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "log_const_log_mgmt", scope: !791, file: !798, line: 14, type: !1029, isLocal: false, isDefinition: true)
!791 = distinct !DICompileUnit(language: DW_LANG_C99, file: !792, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !793, retainedTypes: !794, globals: !795, splitDebugInlining: false, nameTableKind: None)
!792 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/led_lp503x")
!793 = !{!411, !37}
!794 = !{!108, !123, !210, !258, !170, !22}
!795 = !{!789, !796, !824, !1006, !1008, !1020, !1022, !1027}
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "sname_cache", scope: !791, file: !798, line: 44, type: !799, isLocal: true, isDefinition: true)
!798 = !DIFile(filename: "zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache", file: !800, line: 30, size: 256, elements: !801)
!800 = !DIFile(filename: "zephyr/subsys/logging/log_cache.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!801 = !{!802, !815, !816, !821, !822, !823}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !799, file: !800, line: 31, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !804, line: 40, baseType: !805)
!804 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !804, line: 35, size: 64, elements: !806)
!806 = !{!807, !814}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !805, file: !804, line: 36, baseType: !808, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !804, line: 33, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !804, line: 29, size: 32, elements: !811)
!811 = !{!812}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !810, file: !804, line: 30, baseType: !813, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !805, file: !804, line: 37, baseType: !808, size: 32, offset: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !799, file: !800, line: 32, baseType: !803, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !799, file: !800, line: 33, baseType: !817, size: 32, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_cache_cmp_func_t", file: !800, line: 21, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DISubroutineType(types: !820)
!820 = !{!181, !22, !22}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !799, file: !800, line: 34, baseType: !135, size: 32, offset: 160)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "miss", scope: !799, file: !800, line: 35, baseType: !135, size: 32, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !799, file: !800, line: 36, baseType: !249, size: 32, offset: 224)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "invalid_domain", scope: !826, file: !798, line: 261, type: !170, isLocal: true, isDefinition: true)
!826 = distinct !DISubprogram(name: "link_domain_name_get", scope: !798, file: !798, line: 256, type: !827, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !791, retainedNodes: !829)
!827 = !DISubroutineType(types: !828)
!828 = !{!170, !117}
!829 = !{!830, !831, !832, !833, !834, !837, !1005}
!830 = !DILocalVariable(name: "domain_id", arg: 1, scope: !826, file: !798, line: 256, type: !117)
!831 = !DILocalVariable(name: "cached", scope: !826, file: !798, line: 258, type: !258)
!832 = !DILocalVariable(name: "cache_size", scope: !826, file: !798, line: 259, type: !249)
!833 = !DILocalVariable(name: "id", scope: !826, file: !798, line: 260, type: !22)
!834 = !DILocalVariable(name: "rel_domain_id", scope: !835, file: !798, line: 265, type: !117)
!835 = distinct !DILexicalBlock(scope: !836, file: !798, line: 264, column: 49)
!836 = distinct !DILexicalBlock(scope: !826, file: !798, line: 264, column: 6)
!837 = !DILocalVariable(name: "link", scope: !835, file: !798, line: 266, type: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link", file: !841, line: 61, size: 192, elements: !842)
!841 = !DIFile(filename: "zephyr/include/zephyr/logging/log_link.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!842 = !{!843, !932, !933, !942, !943, !995}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !840, file: !841, line: 62, baseType: !844, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_api", file: !841, line: 38, size: 192, elements: !847)
!847 = !{!848, !911, !915, !920, !924, !928}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "initiate", scope: !846, file: !841, line: 39, baseType: !849, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 32)
!850 = !DISubroutineType(types: !851)
!851 = !{!123, !838, !852}
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 32)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_config", file: !841, line: 33, size: 64, elements: !854)
!854 = !{!855, !906}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "msg_cb", scope: !853, file: !841, line: 34, baseType: !856, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_callback_t", file: !841, line: 27, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = !DISubroutineType(types: !859)
!859 = !{null, !838, !860}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !862)
!862 = !{!863, !879, !885}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !861, file: !31, line: 112, baseType: !864, size: 32)
!864 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !455, line: 49, size: 32, elements: !865)
!865 = !{!866, !872, !878}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !864, file: !455, line: 50, baseType: !867, size: 32)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !455, line: 37, size: 32, elements: !868)
!868 = !{!869, !870, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !867, file: !455, line: 38, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !867, file: !455, line: 38, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !867, file: !455, line: 39, baseType: !135, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !864, file: !455, line: 51, baseType: !873, size: 32)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !455, line: 43, size: 32, elements: !874)
!874 = !{!875, !876, !877}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !873, file: !455, line: 44, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !873, file: !455, line: 44, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !873, file: !455, line: 45, baseType: !135, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !864, file: !455, line: 52, baseType: !135, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !861, file: !31, line: 113, baseType: !880, size: 32)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !881)
!881 = !{!882, !883, !884}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !880, file: !31, line: 108, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !880, file: !31, line: 108, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !880, file: !31, line: 108, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !861, file: !31, line: 114, baseType: !886, size: 128)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !887)
!887 = !{!888, !904, !905}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !886, file: !31, line: 89, baseType: !889, size: 96)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !890)
!890 = !{!891, !902, !903}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !889, file: !31, line: 67, baseType: !892, size: 32)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !893)
!893 = !{!894, !895, !896, !897, !898, !899, !900, !901}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !892, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !892, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !892, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !892, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !892, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !892, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !892, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !892, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !889, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !889, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !886, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !886, file: !31, line: 94, baseType: !151, offset: 128)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "dropped_cb", scope: !853, file: !841, line: 35, baseType: !907, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_dropped_cb_t", file: !841, line: 30, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !838, !135}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !846, file: !841, line: 40, baseType: !912, size: 32, offset: 32)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!913 = !DISubroutineType(types: !914)
!914 = !{!123, !838}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "get_domain_name", scope: !846, file: !841, line: 41, baseType: !916, size: 32, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 32)
!917 = !DISubroutineType(types: !918)
!918 = !{!123, !838, !135, !257, !919}
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "get_source_name", scope: !846, file: !841, line: 43, baseType: !921, size: 32, offset: 96)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 32)
!922 = !DISubroutineType(types: !923)
!923 = !{!123, !838, !135, !259, !257, !919}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "get_levels", scope: !846, file: !841, line: 45, baseType: !925, size: 32, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = !DISubroutineType(types: !927)
!927 = !{!123, !838, !135, !259, !258, !258}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "set_runtime_level", scope: !846, file: !841, line: 48, baseType: !929, size: 32, offset: 160)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = !DISubroutineType(types: !931)
!931 = !{!123, !838, !135, !259, !117}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !840, file: !841, line: 63, baseType: !170, size: 32, offset: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl_blk", scope: !840, file: !841, line: 64, baseType: !934, size: 32, offset: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_ctrl_blk", file: !841, line: 52, size: 128, elements: !936)
!936 = !{!937, !938, !940, !941}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "domain_cnt", scope: !935, file: !841, line: 53, baseType: !135, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "source_cnt", scope: !935, file: !841, line: 54, baseType: !939, size: 16, offset: 32)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 16, elements: !340)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "domain_offset", scope: !935, file: !841, line: 57, baseType: !135, size: 32, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !935, file: !841, line: 58, baseType: !582, size: 32, offset: 96)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !840, file: !841, line: 65, baseType: !108, size: 32, offset: 96)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf", scope: !840, file: !841, line: 66, baseType: !944, size: 32, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !556, line: 87, size: 448, elements: !946)
!946 = !{!947, !948, !949, !950, !951, !952, !954, !963, !968, !969, !970, !971}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !945, file: !556, line: 89, baseType: !135, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !945, file: !556, line: 92, baseType: !135, size: 32, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !945, file: !556, line: 95, baseType: !135, size: 32, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !945, file: !556, line: 98, baseType: !135, size: 32, offset: 96)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !945, file: !556, line: 101, baseType: !135, size: 32, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !945, file: !556, line: 104, baseType: !953, offset: 160)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !565, line: 43, elements: !566)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !945, file: !556, line: 110, baseType: !955, size: 32, offset: 160)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !556, line: 83, baseType: !956)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 32)
!957 = !DISubroutineType(types: !958)
!958 = !{null, !959, !961}
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !864)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !945, file: !556, line: 113, baseType: !964, size: 32, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !556, line: 75, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = !DISubroutineType(types: !967)
!967 = !{!135, !961}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !945, file: !556, line: 116, baseType: !582, size: 32, offset: 224)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !945, file: !556, line: 119, baseType: !135, size: 32, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !945, file: !556, line: 122, baseType: !135, size: 32, offset: 288)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !945, file: !556, line: 124, baseType: !972, size: 128, offset: 320)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !491, line: 2909, size: 128, elements: !973)
!973 = !{!974, !993, !994}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !972, file: !491, line: 2910, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !495, line: 233, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !495, line: 231, size: 64, elements: !977)
!977 = !{!978}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !976, file: !495, line: 232, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !500, line: 48, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !500, line: 37, size: 64, elements: !981)
!981 = !{!982, !988}
!982 = !DIDerivedType(tag: DW_TAG_member, scope: !980, file: !500, line: 38, baseType: !983, size: 32)
!983 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !980, file: !500, line: 38, size: 32, elements: !984)
!984 = !{!985, !987}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !983, file: !500, line: 39, baseType: !986, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !983, file: !500, line: 40, baseType: !986, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, scope: !980, file: !500, line: 42, baseType: !989, size: 32, offset: 32)
!989 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !980, file: !500, line: 42, size: 32, elements: !990)
!990 = !{!991, !992}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !989, file: !500, line: 43, baseType: !986, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !989, file: !500, line: 44, baseType: !986, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !972, file: !491, line: 2911, baseType: !32, size: 32, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !972, file: !491, line: 2912, baseType: !32, size: 32, offset: 96)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf_config", scope: !840, file: !841, line: 67, baseType: !996, size: 32, offset: 160)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !556, line: 128, size: 160, elements: !999)
!999 = !{!1000, !1001, !1002, !1003, !1004}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !998, file: !556, line: 130, baseType: !582, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !998, file: !556, line: 133, baseType: !135, size: 32, offset: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !998, file: !556, line: 136, baseType: !955, size: 32, offset: 64)
