; ModuleID = 'build/adafruit_feather_stm32f405/basic/sys_heap/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, i32, i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %struct.z_heap_bucket, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 94, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5248, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 82)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2624, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "heap", scope: !27, file: !107, line: 13, type: !112, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!105, !25}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "heap_mem", scope: !27, file: !107, line: 12, type: !108, isLocal: true, isDefinition: true)
!107 = !DIFile(filename: "zephyr/samples/basic/sys_heap/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 2048, elements: !110)
!109 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!110 = !{!111}
!111 = !DISubrange(count: 256)
!112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !114)
!113 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!114 = !{!115, !118, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !112, file: !113, line: 57, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !113, line: 57, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !112, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !112, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !121, line: 214, baseType: !32)
!121 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "_char_out", scope: !124, file: !127, line: 54, type: !128, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !126, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap")
!126 = !{!122}
!127 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{!103, !103}
!131 = !DIGlobalVariableExpression(var: !132, expr: !DIExpression())
!132 = distinct !DIGlobalVariable(name: "state", scope: !133, file: !134, line: 227, type: !163, isLocal: true, isDefinition: true)
!133 = distinct !DISubprogram(name: "rand32", scope: !134, file: !134, line: 225, type: !135, scopeLine: 226, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !138, retainedNodes: !162)
!134 = !DIFile(filename: "zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!135 = !DISubroutineType(types: !136)
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!138 = distinct !DICompileUnit(language: DW_LANG_C99, file: !139, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !140, retainedTypes: !148, globals: !161, splitDebugInlining: false, nameTableKind: None)
!139 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/heap-validate.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap")
!140 = !{!30, !141}
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "chunk_fields", file: !142, line: 54, baseType: !32, size: 32, elements: !143)
!142 = !DIFile(filename: "zephyr/lib/os/heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !145, !146, !147}
!144 = !DIEnumerator(name: "LEFT_SIZE", value: 0)
!145 = !DIEnumerator(name: "SIZE_AND_USED", value: 1)
!146 = !DIEnumerator(name: "FREE_PREV", value: 2)
!147 = !DIEnumerator(name: "FREE_NEXT", value: 3)
!148 = !{!102, !103, !149, !150, !137, !153}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !152)
!152 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk_unit_t", file: !142, line: 58, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !142, line: 58, size: 64, elements: !156)
!156 = !{!157}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !155, file: !142, line: 58, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !109, size: 64, elements: !159)
!159 = !{!160}
!160 = !DISubrange(count: 8)
!161 = !{!131}
!162 = !{}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !164)
!164 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !167, file: !184, line: 56, type: !185, isLocal: true, isDefinition: true, align: 32)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !169, globals: !183, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !172, line: 369, baseType: !173)
!172 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f405xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 360, size: 224, elements: !174)
!174 = !{!175, !177, !178, !179, !180, !181, !182}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !173, file: !172, line: 362, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !137)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !173, file: !172, line: 363, baseType: !176, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !173, file: !172, line: 364, baseType: !176, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !173, file: !172, line: 365, baseType: !176, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !173, file: !172, line: 366, baseType: !176, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !173, file: !172, line: 367, baseType: !176, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !173, file: !172, line: 368, baseType: !176, size: 32, offset: 192)
!183 = !{!165}
!184 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !188)
!187 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!188 = !{!189, !219}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !186, file: !187, line: 60, baseType: !190, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DISubroutineType(types: !192)
!192 = !{!103, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !197)
!196 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!197 = !{!198, !201, !202, !203, !212, !213}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !196, line: 380, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !195, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !195, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !195, file: !196, line: 386, baseType: !204, size: 32, offset: 96)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !206)
!206 = !{!207, !210}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !205, file: !196, line: 359, baseType: !208, size: 8)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !209)
!209 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !205, file: !196, line: 364, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!211 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !195, file: !196, line: 388, baseType: !102, size: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !195, file: !196, line: 396, baseType: !214, size: 32, offset: 160)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !196, line: 43, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !218)
!218 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !186, file: !187, line: 65, baseType: !193, size: 32, offset: 32)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !222, file: !225, line: 71, type: !226, isLocal: true, isDefinition: true, align: 32)
!222 = distinct !DICompileUnit(language: DW_LANG_C99, file: !223, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !224, splitDebugInlining: false, nameTableKind: None)
!223 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap")
!224 = !{!220}
!225 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !228)
!228 = !{!229, !248}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !227, file: !187, line: 60, baseType: !230, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DISubroutineType(types: !232)
!232 = !{!103, !233}
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !236)
!236 = !{!237, !238, !239, !240, !246, !247}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !235, file: !196, line: 380, baseType: !199, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !235, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !235, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !235, file: !196, line: 386, baseType: !241, size: 32, offset: 96)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !243)
!243 = !{!244, !245}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !242, file: !196, line: 359, baseType: !208, size: 8)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !242, file: !196, line: 364, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !235, file: !196, line: 388, baseType: !102, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !235, file: !196, line: 396, baseType: !214, size: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !227, file: !187, line: 65, baseType: !233, size: 32, offset: 32)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "static_regions", scope: !251, file: !258, line: 62, type: !393, isLocal: true, isDefinition: true)
!251 = distinct !DICompileUnit(language: DW_LANG_C99, file: !252, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !253, globals: !254, splitDebugInlining: false, nameTableKind: None)
!252 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap")
!253 = !{!120, !103, !137, !102}
!254 = !{!255, !249}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !257, file: !258, line: 198, type: !379, isLocal: true, isDefinition: true)
!257 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !258, file: !258, line: 175, type: !259, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !251, retainedNodes: !374)
!258 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!259 = !DISubroutineType(types: !260)
!260 = !{null, !261}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !263, line: 245, size: 1024, elements: !264)
!263 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!264 = !{!265, !332, !345, !346, !347, !348, !354, !369}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !262, file: !263, line: 247, baseType: !266, size: 384)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !263, line: 57, size: 384, elements: !267)
!267 = !{!268, !296, !304, !305, !306, !317, !318, !319}
!268 = !DIDerivedType(tag: DW_TAG_member, scope: !266, file: !263, line: 60, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !263, line: 60, size: 64, elements: !270)
!270 = !{!271, !287}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !269, file: !263, line: 61, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !273, line: 49, baseType: !274)
!273 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !273, line: 37, size: 64, elements: !275)
!275 = !{!276, !282}
!276 = !DIDerivedType(tag: DW_TAG_member, scope: !274, file: !273, line: 38, baseType: !277, size: 32)
!277 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !274, file: !273, line: 38, size: 32, elements: !278)
!278 = !{!279, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !277, file: !273, line: 39, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !273, line: 40, baseType: !280, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, scope: !274, file: !273, line: 42, baseType: !283, size: 32, offset: 32)
!283 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !274, file: !273, line: 42, size: 32, elements: !284)
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !283, file: !273, line: 43, baseType: !280, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !283, file: !273, line: 44, baseType: !280, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !269, file: !263, line: 62, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !289, line: 49, size: 64, elements: !290)
!289 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !288, file: !289, line: 50, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 64, elements: !294)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!294 = !{!295}
!295 = !DISubrange(count: 2)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !266, file: !263, line: 68, baseType: !297, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !299, line: 233, baseType: !300)
!299 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !299, line: 231, size: 64, elements: !301)
!301 = !{!302}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !300, file: !299, line: 232, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !273, line: 48, baseType: !274)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !266, file: !263, line: 71, baseType: !208, size: 8, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !266, file: !263, line: 74, baseType: !208, size: 8, offset: 104)
!306 = !DIDerivedType(tag: DW_TAG_member, scope: !266, file: !263, line: 90, baseType: !307, size: 16, offset: 112)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !263, line: 90, size: 16, elements: !308)
!308 = !{!309, !316}
!309 = !DIDerivedType(tag: DW_TAG_member, scope: !307, file: !263, line: 91, baseType: !310, size: 16)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !307, file: !263, line: 91, size: 16, elements: !311)
!311 = !{!312, !315}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !310, file: !263, line: 96, baseType: !313, size: 8)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !314)
!314 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !310, file: !263, line: 97, baseType: !208, size: 8, offset: 8)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !307, file: !263, line: 100, baseType: !151, size: 16)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !266, file: !263, line: 107, baseType: !137, size: 32, offset: 128)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !266, file: !263, line: 127, baseType: !102, size: 32, offset: 160)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !266, file: !263, line: 131, baseType: !320, size: 192, offset: 192)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !299, line: 244, size: 192, elements: !321)
!321 = !{!322, !323, !329}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !320, file: !299, line: 245, baseType: !272, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !320, file: !299, line: 246, baseType: !324, size: 32, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !299, line: 242, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !328}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !320, file: !299, line: 249, baseType: !330, size: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !331)
!331 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !262, file: !263, line: 250, baseType: !333, size: 288, offset: 384)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !334, line: 25, size: 288, elements: !335)
!334 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = !{!336, !337, !338, !339, !340, !341, !342, !343, !344}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !333, file: !334, line: 26, baseType: !137, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !333, file: !334, line: 27, baseType: !137, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !333, file: !334, line: 28, baseType: !137, size: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !333, file: !334, line: 29, baseType: !137, size: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !333, file: !334, line: 30, baseType: !137, size: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !333, file: !334, line: 31, baseType: !137, size: 32, offset: 160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !333, file: !334, line: 32, baseType: !137, size: 32, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !333, file: !334, line: 33, baseType: !137, size: 32, offset: 224)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !333, file: !334, line: 34, baseType: !137, size: 32, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !262, file: !263, line: 253, baseType: !102, size: 32, offset: 672)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !262, file: !263, line: 256, baseType: !298, size: 64, offset: 704)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !262, file: !263, line: 294, baseType: !103, size: 32, offset: 768)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !262, file: !263, line: 300, baseType: !349, size: 96, offset: 800)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !263, line: 149, size: 96, elements: !350)
!350 = !{!351, !352, !353}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !349, file: !263, line: 153, baseType: !22, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !349, file: !263, line: 162, baseType: !120, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !349, file: !263, line: 168, baseType: !120, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !262, file: !263, line: 325, baseType: !355, size: 32, offset: 896)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !357, line: 5073, size: 160, elements: !358)
!357 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!358 = !{!359, !365, !366}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !356, file: !357, line: 5074, baseType: !360, size: 96)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !113, line: 56, size: 96, elements: !361)
!361 = !{!362, !363, !364}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !360, file: !113, line: 57, baseType: !116, size: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !360, file: !113, line: 58, baseType: !102, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !360, file: !113, line: 59, baseType: !120, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !356, file: !357, line: 5075, baseType: !298, size: 64, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !356, file: !357, line: 5076, baseType: !367, offset: 160)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !368, line: 43, elements: !162)
!368 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!369 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !262, file: !263, line: 343, baseType: !370, size: 64, offset: 928)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !334, line: 60, size: 64, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !370, file: !334, line: 63, baseType: !137, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !370, file: !334, line: 66, baseType: !137, size: 32, offset: 32)
!374 = !{!375, !376, !377, !378}
!375 = !DILocalVariable(name: "thread", arg: 1, scope: !257, file: !258, line: 175, type: !261)
!376 = !DILocalVariable(name: "region_num", scope: !257, file: !258, line: 200, type: !208)
!377 = !DILocalVariable(name: "guard_start", scope: !257, file: !258, line: 265, type: !22)
!378 = !DILocalVariable(name: "guard_size", scope: !257, file: !258, line: 266, type: !120)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 96, elements: !391)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !381, line: 52, size: 96, elements: !382)
!381 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!382 = !{!383, !384, !385}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !380, file: !381, line: 53, baseType: !22, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !380, file: !381, line: 54, baseType: !120, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !380, file: !381, line: 55, baseType: !386, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !387, line: 151, baseType: !388)
!387 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !387, line: 149, size: 32, elements: !389)
!389 = !{!390}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !388, file: !387, line: 150, baseType: !137, size: 32)
!391 = !{!392}
!392 = !DISubrange(count: 1)
!393 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 96, elements: !391)
!394 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !380)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !397, file: !430, line: 39, type: !208, isLocal: true, isDefinition: true)
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !399, globals: !429, splitDebugInlining: false, nameTableKind: None)
!398 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap")
!399 = !{!400, !102, !103, !417, !208}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !402, line: 1226, baseType: !403)
!402 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !402, line: 1213, size: 352, elements: !404)
!404 = !{!405, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !403, file: !402, line: 1215, baseType: !406, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !403, file: !402, line: 1216, baseType: !176, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !403, file: !402, line: 1217, baseType: !176, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !403, file: !402, line: 1218, baseType: !176, size: 32, offset: 96)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !403, file: !402, line: 1219, baseType: !176, size: 32, offset: 128)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !403, file: !402, line: 1220, baseType: !176, size: 32, offset: 160)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !403, file: !402, line: 1221, baseType: !176, size: 32, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !403, file: !402, line: 1222, baseType: !176, size: 32, offset: 224)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !403, file: !402, line: 1223, baseType: !176, size: 32, offset: 256)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !403, file: !402, line: 1224, baseType: !176, size: 32, offset: 288)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !403, file: !402, line: 1225, baseType: !176, size: 32, offset: 320)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !420, line: 27, size: 96, elements: !421)
!420 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!421 = !{!422, !423, !424}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !419, file: !420, line: 29, baseType: !137, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !419, file: !420, line: 31, baseType: !199, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !419, file: !420, line: 37, baseType: !425, size: 32, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !387, line: 146, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !387, line: 141, size: 32, elements: !427)
!427 = !{!428}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !426, file: !387, line: 143, baseType: !137, size: 32)
!429 = !{!395}
!430 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !433, file: !440, line: 21, type: !128, isLocal: true, isDefinition: true)
!433 = distinct !DICompileUnit(language: DW_LANG_C99, file: !434, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !435, globals: !439, splitDebugInlining: false, nameTableKind: None)
!434 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap")
!435 = !{!436, !103, !102}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !438, line: 22, baseType: !103)
!438 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!439 = !{!431}
!440 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !443, file: !448, line: 13, type: !465, isLocal: true, isDefinition: true)
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !445, splitDebugInlining: false, nameTableKind: None)
!444 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap")
!445 = !{!446, !441}
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "mpu_config", scope: !443, file: !448, line: 37, type: !449, isLocal: false, isDefinition: true)
!448 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !420, line: 41, size: 64, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !450, file: !420, line: 43, baseType: !137, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !450, file: !420, line: 45, baseType: !454, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !420, line: 27, size: 96, elements: !457)
!457 = !{!458, !459, !460}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !456, file: !420, line: 29, baseType: !137, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !456, file: !420, line: 31, baseType: !199, size: 32, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !456, file: !420, line: 37, baseType: !461, size: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !387, line: 146, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !387, line: 141, size: 32, elements: !463)
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !462, file: !387, line: 143, baseType: !137, size: 32)
!465 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 192, elements: !294)
!466 = !DIGlobalVariableExpression(var: !467, expr: !DIExpression())
!467 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !468, file: !573, line: 72, type: !657, isLocal: true, isDefinition: true)
!468 = distinct !DICompileUnit(language: DW_LANG_C99, file: !469, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !470, retainedTypes: !559, globals: !570, splitDebugInlining: false, nameTableKind: None)
!469 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap")
!470 = !{!30, !471}
!471 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !172, line: 65, baseType: !103, size: 32, elements: !472)
!472 = !{!473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!473 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!474 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!475 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!476 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!477 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!478 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!479 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!480 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!481 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!482 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!483 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!484 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!485 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!486 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!487 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!488 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!489 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!490 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!491 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!492 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!493 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!494 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!495 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!496 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!497 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!498 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!499 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!500 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!501 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!502 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!503 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!504 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!505 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!506 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!507 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!508 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!509 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!510 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!511 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!512 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!513 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!514 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!515 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!516 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!517 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!518 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!519 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!520 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!521 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!522 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!523 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!524 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!525 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!526 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!527 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!528 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!529 = !DIEnumerator(name: "FSMC_IRQn", value: 48)
!530 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!531 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!532 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!533 = !DIEnumerator(name: "UART4_IRQn", value: 52)
!534 = !DIEnumerator(name: "UART5_IRQn", value: 53)
!535 = !DIEnumerator(name: "TIM6_DAC_IRQn", value: 54)
!536 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!537 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!538 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!539 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!540 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!541 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!542 = !DIEnumerator(name: "CAN2_TX_IRQn", value: 63)
!543 = !DIEnumerator(name: "CAN2_RX0_IRQn", value: 64)
!544 = !DIEnumerator(name: "CAN2_RX1_IRQn", value: 65)
!545 = !DIEnumerator(name: "CAN2_SCE_IRQn", value: 66)
!546 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!547 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!548 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!549 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!550 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!551 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!552 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!553 = !DIEnumerator(name: "OTG_HS_EP1_OUT_IRQn", value: 74)
!554 = !DIEnumerator(name: "OTG_HS_EP1_IN_IRQn", value: 75)
!555 = !DIEnumerator(name: "OTG_HS_WKUP_IRQn", value: 76)
!556 = !DIEnumerator(name: "OTG_HS_IRQn", value: 77)
!557 = !DIEnumerator(name: "RNG_IRQn", value: 80)
!558 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!559 = !{!120, !103, !102, !560}
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !172, line: 354, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 346, size: 192, elements: !563)
!563 = !{!564, !565, !566, !567, !568, !569}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !562, file: !172, line: 348, baseType: !176, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !562, file: !172, line: 349, baseType: !176, size: 32, offset: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !562, file: !172, line: 350, baseType: !176, size: 32, offset: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !562, file: !172, line: 351, baseType: !176, size: 32, offset: 96)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !562, file: !172, line: 352, baseType: !176, size: 32, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !562, file: !172, line: 353, baseType: !176, size: 32, offset: 160)
!570 = !{!571, !577, !593, !604, !621, !466, !623, !637, !639, !641, !643, !645, !647, !649, !651, !653, !655}
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_37", scope: !468, file: !573, line: 424, type: !574, isLocal: false, isDefinition: true, align: 16)
!573 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 64, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 4)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "__device_dts_ord_37", scope: !468, file: !573, line: 424, type: !579, isLocal: false, isDefinition: true, align: 32)
!579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !581)
!581 = !{!582, !583, !584, !585, !591, !592}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !580, file: !196, line: 380, baseType: !199, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !580, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !580, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !580, file: !196, line: 386, baseType: !586, size: 32, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 32)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !588)
!588 = !{!589, !590}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !587, file: !196, line: 359, baseType: !208, size: 8)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !587, file: !196, line: 364, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !580, file: !196, line: 388, baseType: !102, size: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !580, file: !196, line: 396, baseType: !214, size: 32, offset: 160)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_37", scope: !468, file: !573, line: 424, type: !595, isLocal: true, isDefinition: true, align: 32)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !597)
!597 = !{!598, !603}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !596, file: !187, line: 60, baseType: !599, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 32)
!600 = !DISubroutineType(types: !601)
!601 = !{!103, !602}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !596, file: !187, line: 65, baseType: !602, size: 32, offset: 32)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "exti_data", scope: !468, file: !573, line: 423, type: !606, isLocal: true, isDefinition: true)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !573, line: 107, size: 1472, elements: !607)
!607 = !{!608}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !606, file: !573, line: 109, baseType: !609, size: 1472)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 1472, elements: !619)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !573, line: 101, size: 64, elements: !611)
!611 = !{!612, !618}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !610, file: !573, line: 102, baseType: !613, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !614, line: 63, baseType: !615)
!614 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 32)
!616 = !DISubroutineType(types: !617)
!617 = !{null, !103, !102}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !610, file: !573, line: 103, baseType: !102, size: 32, offset: 32)
!619 = !{!620}
!620 = !DISubrange(count: 23)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_37", scope: !468, file: !573, line: 424, type: !587, isLocal: true, isDefinition: true, align: 8)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !625, file: !573, line: 493, type: !630, isLocal: true, isDefinition: true, align: 32)
!625 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !573, file: !573, line: 460, type: !626, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !468, retainedNodes: !628)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !602}
!628 = !{!629}
!629 = !DILocalVariable(name: "dev", arg: 1, scope: !625, file: !573, line: 460, type: !602)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !631)
!631 = !{!632, !634, !635, !636}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !630, file: !10, line: 55, baseType: !633, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !630, file: !10, line: 57, baseType: !633, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !630, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !630, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !625, file: !573, line: 497, type: !630, isLocal: true, isDefinition: true, align: 32)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !625, file: !573, line: 507, type: !630, isLocal: true, isDefinition: true, align: 32)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !625, file: !573, line: 512, type: !630, isLocal: true, isDefinition: true, align: 32)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !625, file: !573, line: 516, type: !630, isLocal: true, isDefinition: true, align: 32)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !625, file: !573, line: 523, type: !630, isLocal: true, isDefinition: true, align: 32)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !625, file: !573, line: 527, type: !630, isLocal: true, isDefinition: true, align: 32)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !625, file: !573, line: 581, type: !630, isLocal: true, isDefinition: true, align: 32)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !625, file: !573, line: 586, type: !630, isLocal: true, isDefinition: true, align: 32)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !625, file: !573, line: 591, type: !630, isLocal: true, isDefinition: true, align: 32)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !625, file: !573, line: 595, type: !630, isLocal: true, isDefinition: true, align: 32)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 736, elements: !619)
!658 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !172, line: 155, baseType: !471)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_37", scope: !662, file: !667, line: 23, type: !691, isLocal: false, isDefinition: true, align: 16)
!662 = distinct !DICompileUnit(language: DW_LANG_C99, file: !663, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !664, splitDebugInlining: false, nameTableKind: None)
!663 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap")
!664 = !{!665, !660, !671, !673, !675, !677, !679, !681, !683, !685, !687, !689}
!665 = !DIGlobalVariableExpression(var: !666, expr: !DIExpression())
!666 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !662, file: !667, line: 18, type: !668, isLocal: false, isDefinition: true, align: 16)
!667 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap")
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 208, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 13)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_73", scope: !662, file: !667, line: 30, type: !574, isLocal: false, isDefinition: true, align: 16)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_72", scope: !662, file: !667, line: 37, type: !574, isLocal: false, isDefinition: true, align: 16)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_71", scope: !662, file: !667, line: 44, type: !574, isLocal: false, isDefinition: true, align: 16)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_70", scope: !662, file: !667, line: 51, type: !574, isLocal: false, isDefinition: true, align: 16)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_69", scope: !662, file: !667, line: 58, type: !574, isLocal: false, isDefinition: true, align: 16)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_68", scope: !662, file: !667, line: 65, type: !574, isLocal: false, isDefinition: true, align: 16)
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !662, file: !667, line: 72, type: !574, isLocal: false, isDefinition: true, align: 16)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_67", scope: !662, file: !667, line: 79, type: !574, isLocal: false, isDefinition: true, align: 16)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_74", scope: !662, file: !667, line: 86, type: !574, isLocal: false, isDefinition: true, align: 16)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_45", scope: !662, file: !667, line: 93, type: !574, isLocal: false, isDefinition: true, align: 16)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 48, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 3)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !696, file: !756, line: 398, type: !789, isLocal: true, isDefinition: true)
!696 = distinct !DICompileUnit(language: DW_LANG_C99, file: !697, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !698, retainedTypes: !711, globals: !753, splitDebugInlining: false, nameTableKind: None)
!697 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap")
!698 = !{!699, !30, !704}
!699 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !700, line: 197, baseType: !32, size: 32, elements: !701)
!700 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!701 = !{!702, !703}
!702 = !DIEnumerator(name: "SUCCESS", value: 0)
!703 = !DIEnumerator(name: "ERROR", value: 1)
!704 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !705, line: 44, baseType: !32, size: 32, elements: !706)
!705 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!706 = !{!707, !708, !709, !710}
!707 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!708 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!709 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!710 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!711 = !{!102, !103, !137, !712, !747, !149}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !172, line: 532, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 500, size: 1088, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !714, file: !172, line: 502, baseType: !176, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !714, file: !172, line: 503, baseType: !176, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !714, file: !172, line: 504, baseType: !176, size: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !714, file: !172, line: 505, baseType: !176, size: 32, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !714, file: !172, line: 506, baseType: !176, size: 32, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !714, file: !172, line: 507, baseType: !176, size: 32, offset: 160)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !714, file: !172, line: 508, baseType: !176, size: 32, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !714, file: !172, line: 509, baseType: !137, size: 32, offset: 224)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !714, file: !172, line: 510, baseType: !176, size: 32, offset: 256)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !714, file: !172, line: 511, baseType: !176, size: 32, offset: 288)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !714, file: !172, line: 512, baseType: !727, size: 64, offset: 320)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 64, elements: !294)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !714, file: !172, line: 513, baseType: !176, size: 32, offset: 384)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !714, file: !172, line: 514, baseType: !176, size: 32, offset: 416)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !714, file: !172, line: 515, baseType: !176, size: 32, offset: 448)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !714, file: !172, line: 516, baseType: !137, size: 32, offset: 480)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !714, file: !172, line: 517, baseType: !176, size: 32, offset: 512)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !714, file: !172, line: 518, baseType: !176, size: 32, offset: 544)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !714, file: !172, line: 519, baseType: !727, size: 64, offset: 576)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !714, file: !172, line: 520, baseType: !176, size: 32, offset: 640)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !714, file: !172, line: 521, baseType: !176, size: 32, offset: 672)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !714, file: !172, line: 522, baseType: !176, size: 32, offset: 704)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !714, file: !172, line: 523, baseType: !137, size: 32, offset: 736)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !714, file: !172, line: 524, baseType: !176, size: 32, offset: 768)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !714, file: !172, line: 525, baseType: !176, size: 32, offset: 800)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !714, file: !172, line: 526, baseType: !727, size: 64, offset: 832)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !714, file: !172, line: 527, baseType: !176, size: 32, offset: 896)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !714, file: !172, line: 528, baseType: !176, size: 32, offset: 928)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !714, file: !172, line: 529, baseType: !727, size: 64, offset: 960)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !714, file: !172, line: 530, baseType: !176, size: 32, offset: 1024)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !714, file: !172, line: 531, baseType: !176, size: 32, offset: 1056)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !749, line: 343, size: 64, elements: !750)
!749 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !748, file: !749, line: 344, baseType: !137, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !748, file: !749, line: 345, baseType: !137, size: 32, offset: 32)
!753 = !{!754, !760, !776, !787, !694}
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !696, file: !756, line: 752, type: !757, isLocal: false, isDefinition: true, align: 16)
!756 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 928, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 58)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !696, file: !756, line: 752, type: !762, isLocal: false, isDefinition: true, align: 32)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !764)
!764 = !{!765, !766, !767, !768, !774, !775}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !763, file: !196, line: 380, baseType: !199, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !763, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !763, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !763, file: !196, line: 386, baseType: !769, size: 32, offset: 96)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 32)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !770, file: !196, line: 359, baseType: !208, size: 8)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !770, file: !196, line: 364, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !763, file: !196, line: 388, baseType: !102, size: 32, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !763, file: !196, line: 396, baseType: !214, size: 32, offset: 160)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !696, file: !756, line: 752, type: !778, isLocal: true, isDefinition: true, align: 32)
!778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !780)
!780 = !{!781, !786}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !779, file: !187, line: 60, baseType: !782, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 32)
!783 = !DISubroutineType(types: !784)
!784 = !{!103, !785}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !779, file: !187, line: 65, baseType: !785, size: 32, offset: 32)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !696, file: !756, line: 752, type: !770, isLocal: true, isDefinition: true, align: 8)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !705, line: 100, size: 224, elements: !790)
!790 = !{!791, !797, !798, !807, !812, !817, !823}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !789, file: !705, line: 101, baseType: !792, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !705, line: 76, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 32)
!794 = !DISubroutineType(types: !795)
!795 = !{!103, !785, !796}
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !705, line: 56, baseType: !102)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !789, file: !705, line: 102, baseType: !792, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !789, file: !705, line: 103, baseType: !799, size: 32, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !705, line: 83, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 32)
!801 = !DISubroutineType(types: !802)
!802 = !{!103, !785, !796, !803, !102}
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !705, line: 72, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 32)
!805 = !DISubroutineType(types: !806)
!806 = !{null, !785, !796, !102}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !789, file: !705, line: 104, baseType: !808, size: 32, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !705, line: 79, baseType: !809)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 32)
!810 = !DISubroutineType(types: !811)
!811 = !{!103, !785, !796, !149}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !789, file: !705, line: 105, baseType: !813, size: 32, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !705, line: 88, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DISubroutineType(types: !816)
!816 = !{!704, !785, !796}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !789, file: !705, line: 106, baseType: !818, size: 32, offset: 160)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !705, line: 92, baseType: !819)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = !DISubroutineType(types: !821)
!821 = !{!103, !785, !796, !822}
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !705, line: 64, baseType: !102)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !789, file: !705, line: 107, baseType: !824, size: 32, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !705, line: 96, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DISubroutineType(types: !827)
!827 = !{!103, !785, !796, !102}
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !830, file: !887, line: 603, type: !889, isLocal: true, isDefinition: true, align: 32)
!830 = distinct !DICompileUnit(language: DW_LANG_C99, file: !831, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !832, globals: !884, splitDebugInlining: false, nameTableKind: None)
!831 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap")
!832 = !{!102, !103, !833}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !836, line: 336, size: 160, elements: !837)
!836 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!837 = !{!838, !858, !862, !866, !879}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !835, file: !836, line: 365, baseType: !839, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 32)
!840 = !DISubroutineType(types: !841)
!841 = !{!103, !842, !857}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !845)
!845 = !{!846, !847, !848, !849, !855, !856}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !844, file: !196, line: 380, baseType: !199, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !844, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !844, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !844, file: !196, line: 386, baseType: !850, size: 32, offset: 96)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !851, file: !196, line: 359, baseType: !208, size: 8)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !851, file: !196, line: 364, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !844, file: !196, line: 388, baseType: !102, size: 32, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !844, file: !196, line: 396, baseType: !214, size: 32, offset: 160)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !835, file: !836, line: 366, baseType: !859, size: 32, offset: 32)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = !DISubroutineType(types: !861)
!861 = !{null, !842, !209}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !835, file: !836, line: 374, baseType: !863, size: 32, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 32)
!864 = !DISubroutineType(types: !865)
!865 = !{!103, !842}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !835, file: !836, line: 377, baseType: !867, size: 32, offset: 96)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!868 = !DISubroutineType(types: !869)
!869 = !{!103, !842, !870}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !836, line: 122, size: 64, elements: !873)
!873 = !{!874, !875, !876, !877, !878}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !872, file: !836, line: 123, baseType: !137, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !872, file: !836, line: 124, baseType: !208, size: 8, offset: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !872, file: !836, line: 125, baseType: !208, size: 8, offset: 40)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !872, file: !836, line: 126, baseType: !208, size: 8, offset: 48)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !872, file: !836, line: 127, baseType: !208, size: 8, offset: 56)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !835, file: !836, line: 379, baseType: !880, size: 32, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 32)
!881 = !DISubroutineType(types: !882)
!882 = !{!103, !842, !883}
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!884 = !{!828, !885}
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !830, file: !887, line: 38, type: !888, isLocal: true, isDefinition: true)
!887 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!888 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !842)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !891)
!891 = !{!892, !893}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !890, file: !187, line: 60, baseType: !863, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !890, file: !187, line: 65, baseType: !842, size: 32, offset: 32)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !896, file: !1066, line: 762, type: !1185, isLocal: true, isDefinition: true)
!896 = distinct !DICompileUnit(language: DW_LANG_C99, file: !897, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !898, retainedTypes: !916, globals: !1063, splitDebugInlining: false, nameTableKind: None)
!897 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/sys_heap")
!898 = !{!30, !899, !905, !910, !704}
!899 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !900, line: 506, baseType: !32, size: 32, elements: !901)
!900 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!901 = !{!902, !903, !904}
!902 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!903 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!904 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !900, line: 512, baseType: !32, size: 32, elements: !906)
!906 = !{!907, !908, !909}
!907 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!908 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!909 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!910 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !614, line: 43, baseType: !32, size: 32, elements: !911)
!911 = !{!912, !913, !914, !915}
!912 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!913 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!914 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!915 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!916 = !{!102, !103, !917, !987, !992, !952, !905, !899, !997, !998, !137, !1012, !967, !1022, !1023, !1024}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !900, line: 523, size: 288, elements: !920)
!920 = !{!921, !942, !948, !953, !957, !958, !959, !963, !983}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !919, file: !900, line: 524, baseType: !922, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!923 = !DISubroutineType(types: !924)
!924 = !{!103, !925, !940, !941}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !928)
!928 = !{!929, !930, !931, !932, !938, !939}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !927, file: !196, line: 380, baseType: !199, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !927, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !927, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !927, file: !196, line: 386, baseType: !933, size: 32, offset: 96)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 32)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !935)
!935 = !{!936, !937}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !934, file: !196, line: 359, baseType: !208, size: 8)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !934, file: !196, line: 364, baseType: !211, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !927, file: !196, line: 388, baseType: !102, size: 32, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !927, file: !196, line: 396, baseType: !214, size: 32, offset: 160)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !900, line: 237, baseType: !208)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !900, line: 257, baseType: !137)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !919, file: !900, line: 530, baseType: !943, size: 32, offset: 32)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = !DISubroutineType(types: !945)
!945 = !{!103, !925, !946}
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 32)
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !900, line: 229, baseType: !137)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !919, file: !900, line: 532, baseType: !949, size: 32, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 32)
!950 = !DISubroutineType(types: !951)
!951 = !{!103, !925, !952, !947}
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !900, line: 216, baseType: !137)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !919, file: !900, line: 535, baseType: !954, size: 32, offset: 96)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 32)
!955 = !DISubroutineType(types: !956)
!956 = !{!103, !925, !952}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !919, file: !900, line: 537, baseType: !954, size: 32, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !919, file: !900, line: 539, baseType: !954, size: 32, offset: 160)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !919, file: !900, line: 541, baseType: !960, size: 32, offset: 192)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = !DISubroutineType(types: !962)
!962 = !{!103, !925, !940, !899, !905}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !919, file: !900, line: 544, baseType: !964, size: 32, offset: 224)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = !DISubroutineType(types: !966)
!966 = !{!103, !925, !967, !211}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !900, line: 478, size: 96, elements: !969)
!969 = !{!970, !977, !982}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !968, file: !900, line: 482, baseType: !971, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !972, line: 33, baseType: !973)
!972 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !972, line: 29, size: 32, elements: !974)
!974 = !{!975}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !973, file: !972, line: 30, baseType: !976, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !968, file: !900, line: 485, baseType: !978, size: 32, offset: 32)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !900, line: 464, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 32)
!980 = !DISubroutineType(types: !981)
!981 = !{null, !925, !967, !952}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !968, file: !900, line: 493, baseType: !952, size: 32, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !919, file: !900, line: 547, baseType: !984, size: 32, offset: 256)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DISubroutineType(types: !986)
!986 = !{!137, !925}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !900, line: 428, size: 32, elements: !990)
!990 = !{!991}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !989, file: !900, line: 434, baseType: !952, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !900, line: 441, size: 32, elements: !995)
!995 = !{!996}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !994, file: !900, line: 447, baseType: !952, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !172, line: 441, baseType: !1000)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 430, size: 320, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !1000, file: !172, line: 432, baseType: !176, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !1000, file: !172, line: 433, baseType: !176, size: 32, offset: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !1000, file: !172, line: 434, baseType: !176, size: 32, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !1000, file: !172, line: 435, baseType: !176, size: 32, offset: 96)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !1000, file: !172, line: 436, baseType: !176, size: 32, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !1000, file: !172, line: 437, baseType: !176, size: 32, offset: 160)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !1000, file: !172, line: 438, baseType: !176, size: 32, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !1000, file: !172, line: 439, baseType: !176, size: 32, offset: 224)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !1000, file: !172, line: 440, baseType: !1011, size: 64, offset: 256)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 64, elements: !294)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !172, line: 454, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 447, size: 288, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1020, !1021}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !1014, file: !172, line: 449, baseType: !176, size: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !1014, file: !172, line: 450, baseType: !176, size: 32, offset: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !1014, file: !172, line: 451, baseType: !1019, size: 128, offset: 64)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 128, elements: !575)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !1014, file: !172, line: 452, baseType: !727, size: 64, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !1014, file: !172, line: 453, baseType: !176, size: 32, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !705, line: 100, size: 224, elements: !1027)
!1027 = !{!1028, !1033, !1034, !1043, !1048, !1053, !1058}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !1026, file: !705, line: 101, baseType: !1029, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !705, line: 76, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 32)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!103, !925, !796}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !1026, file: !705, line: 102, baseType: !1029, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !1026, file: !705, line: 103, baseType: !1035, size: 32, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !705, line: 83, baseType: !1036)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 32)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!103, !925, !796, !1039, !102}
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !705, line: 72, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 32)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{null, !925, !796, !102}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !1026, file: !705, line: 104, baseType: !1044, size: 32, offset: 96)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !705, line: 79, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 32)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!103, !925, !796, !149}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !1026, file: !705, line: 105, baseType: !1049, size: 32, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !705, line: 88, baseType: !1050)
