; ModuleID = 'build/96b_meerkat96/sensor_batch_processing/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.rtio_executor_api = type { i32 (%struct.rtio*)*, void (%struct.rtio*, %struct.rtio_sqe*, i32)*, void (%struct.rtio*, %struct.rtio_sqe*, i32)* }
%struct.rtio = type { %struct.rtio_executor*, i32, %struct.rtio_sq*, %struct.rtio_cq* }
%struct.rtio_executor = type { %struct.rtio_executor_api* }
%struct.rtio_sq = type { %struct.rtio_spsc, [0 x %struct.rtio_sqe] }
%struct.rtio_spsc = type { i32, i32, i32, i32, i32 }
%struct.rtio_sqe = type { i8, i8, i16, %struct.rtio_iodev*, i8*, %union.anon.3 }
%struct.rtio_iodev = type { %struct.rtio_iodev_api*, %struct.rtio_iodev_sq*, i8* }
%struct.rtio_iodev_api = type { void (%struct.rtio_sqe*, %struct.rtio*)* }
%struct.rtio_iodev_sq = type { %struct.rtio_spsc, [0 x %struct.rtio_iodev_sqe] }
%struct.rtio_iodev_sqe = type { %struct.rtio_sqe*, %struct.rtio* }
%union.anon.3 = type { %struct.anon.4 }
%struct.anon.4 = type { i32, i8* }
%struct.rtio_cq = type { %struct.rtio_spsc, [0 x %struct.anon.4] }
%struct.rtio_simple_executor = type { %struct.rtio_executor }
%struct.rtio_spsc__sq_ez_io = type { %struct.rtio_spsc, [8 x %struct.rtio_sqe] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/sensor_batch_processing/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/sensor_batch_processing")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/sensor_batch_processing")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !119, line: 12, type: !252, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !103, globals: !116, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/rtio/sensor_batch_processing/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/sensor_batch_processing")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_RTIO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_RTIO_IODEV", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 67)
!102 = !DIEnumerator(name: "K_OBJ_LAST", value: 68)
!103 = !{!104, !105, !108, !109, !113, !114}
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!108 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !110, line: 46, baseType: !111)
!110 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !112)
!112 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !115)
!115 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!116 = !{!25, !117, !227, !229, !235, !237, !245}
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "simple_exec", scope: !27, file: !119, line: 24, type: !120, isLocal: false, isDefinition: true)
!119 = !DIFile(filename: "zephyr/samples/subsys/rtio/sensor_batch_processing/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_simple_executor", file: !121, line: 57, size: 32, elements: !122)
!121 = !DIFile(filename: "zephyr/include/zephyr/rtio/rtio_executor_simple.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !120, file: !121, line: 58, baseType: !124, size: 32)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor", file: !125, line: 210, size: 32, elements: !126)
!125 = !DIFile(filename: "zephyr/include/zephyr/rtio/rtio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!126 = !{!127}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !124, file: !125, line: 211, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor_api", file: !125, line: 168, size: 96, elements: !131)
!131 = !{!132, !222, !226}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !130, file: !125, line: 177, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DISubroutineType(types: !135)
!135 = !{!108, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio", file: !125, line: 222, size: 128, elements: !138)
!138 = !{!139, !141, !145, !210}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "executor", scope: !137, file: !125, line: 228, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "xcqcnt", scope: !137, file: !125, line: 251, baseType: !142, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !143, line: 22, baseType: !144)
!143 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!144 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "sq", scope: !137, file: !125, line: 254, baseType: !146, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sq", file: !125, line: 142, size: 160, elements: !148)
!148 = !{!149, !159}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !147, file: !125, line: 143, baseType: !150, size: 160)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc", file: !151, line: 58, size: 160, elements: !152)
!151 = !DIFile(filename: "zephyr/include/zephyr/rtio/rtio_spsc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!152 = !{!153, !154, !155, !156, !157}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "acquire", scope: !150, file: !151, line: 60, baseType: !24, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "consume", scope: !150, file: !151, line: 63, baseType: !24, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !150, file: !151, line: 66, baseType: !142, size: 32, offset: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !150, file: !151, line: 69, baseType: !142, size: 32, offset: 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !150, file: !151, line: 72, baseType: !158, size: 32, offset: 128)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !147, file: !125, line: 144, baseType: !160, offset: 160)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, elements: !197)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sqe", file: !125, line: 109, size: 160, elements: !162)
!162 = !{!163, !166, !167, !170, !200, !201}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !161, file: !125, line: 110, baseType: !164, size: 8)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !165)
!165 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !161, file: !125, line: 112, baseType: !164, size: 8, offset: 8)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !161, file: !125, line: 114, baseType: !168, size: 16, offset: 16)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !169)
!169 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "iodev", scope: !161, file: !125, line: 116, baseType: !171, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev", file: !125, line: 306, size: 96, elements: !174)
!174 = !{!175, !186, !199}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !173, file: !125, line: 308, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_api", file: !125, line: 263, size: 32, elements: !179)
!179 = !{!180}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !178, file: !125, line: 271, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!182 = !DISubroutineType(types: !183)
!183 = !{null, !184, !136}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !161)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "iodev_sq", scope: !173, file: !125, line: 311, baseType: !187, size: 32, offset: 32)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sq", file: !125, line: 298, size: 160, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !188, file: !125, line: 299, baseType: !150, size: 160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !188, file: !125, line: 300, baseType: !192, offset: 160)
!192 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, elements: !197)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sqe", file: !125, line: 288, size: 64, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sqe", scope: !193, file: !125, line: 289, baseType: !184, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !193, file: !125, line: 290, baseType: !136, size: 32, offset: 32)
!197 = !{!198}
!198 = !DISubrange(count: -1)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !173, file: !125, line: 314, baseType: !104, size: 32, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !161, file: !125, line: 125, baseType: !104, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, scope: !161, file: !125, line: 127, baseType: !202, size: 64, offset: 96)
!202 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !161, file: !125, line: 127, size: 64, elements: !203)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, scope: !202, file: !125, line: 128, baseType: !205, size: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !202, file: !125, line: 128, size: 64, elements: !206)
!206 = !{!207, !208}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !205, file: !125, line: 129, baseType: !113, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !205, file: !125, line: 131, baseType: !209, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "cq", scope: !137, file: !125, line: 257, baseType: !211, size: 32, offset: 96)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cq", file: !125, line: 161, size: 160, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !212, file: !125, line: 162, baseType: !150, size: 160)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !212, file: !125, line: 163, baseType: !216, offset: 160)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, elements: !197)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cqe", file: !125, line: 150, size: 64, elements: !218)
!218 = !{!219, !221}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !217, file: !125, line: 151, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !108)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !217, file: !125, line: 152, baseType: !104, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !130, file: !125, line: 182, baseType: !223, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = !DISubroutineType(types: !225)
!225 = !{null, !136, !184, !108}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !130, file: !125, line: 187, baseType: !223, size: 32, offset: 64)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "ez_io", scope: !27, file: !119, line: 25, type: !137, isLocal: false, isDefinition: true, align: 32)
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "bufs", scope: !27, file: !119, line: 27, type: !231, isLocal: true, isDefinition: true)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 1024, elements: !232)
!232 = !{!233, !234}
!233 = !DISubrange(count: 8)
!234 = !DISubrange(count: 16)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "z_rtio_simple_api", scope: !27, file: !121, line: 64, type: !129, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "_sq_ez_io", scope: !27, file: !119, line: 25, type: !239, isLocal: true, isDefinition: true)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc__sq_ez_io", file: !119, line: 25, size: 1440, elements: !240)
!240 = !{!241, !242}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !239, file: !119, line: 25, baseType: !150, size: 160)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !239, file: !119, line: 25, baseType: !243, size: 1280, offset: 160)
!243 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1280, elements: !244)
!244 = !{!233}
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "_cq_ez_io", scope: !27, file: !119, line: 25, type: !247, isLocal: true, isDefinition: true)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc__cq_ez_io", file: !119, line: 25, size: 672, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !247, file: !119, line: 25, baseType: !150, size: 160)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !247, file: !119, line: 25, baseType: !251, size: 512, offset: 160)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 512, elements: !244)
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !255)
!254 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!255 = !{!256, !257}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !253, file: !254, line: 17, baseType: !105, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !253, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "log_const_vnd_sensor", scope: !260, file: !265, line: 14, type: !489, isLocal: false, isDefinition: true)
!260 = distinct !DICompileUnit(language: DW_LANG_C99, file: !261, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !262, globals: !450, splitDebugInlining: false, nameTableKind: None)
!261 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/rtio/sensor_batch_processing/src/vnd_sensor.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/sensor_batch_processing")
!262 = !{!104, !108, !263, !109, !443, !113, !114}
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vnd_sensor_data", file: !265, line: 21, size: 960, elements: !266)
!265 = !DIFile(filename: "zephyr/samples/subsys/rtio/sensor_batch_processing/src/vnd_sensor.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!266 = !{!267, !357, !407, !430, !449}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "iodev", scope: !264, file: !265, line: 22, baseType: !268, size: 96)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev", file: !125, line: 306, size: 96, elements: !269)
!269 = !{!270, !345, !356}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !268, file: !125, line: 308, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_api", file: !125, line: 263, size: 32, elements: !274)
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !273, file: !125, line: 271, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !279, !298}
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sqe", file: !125, line: 109, size: 160, elements: !282)
!282 = !{!283, !284, !285, !286, !289, !290}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !281, file: !125, line: 110, baseType: !164, size: 8)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !281, file: !125, line: 112, baseType: !164, size: 8, offset: 8)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !281, file: !125, line: 114, baseType: !168, size: 16, offset: 16)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "iodev", scope: !281, file: !125, line: 116, baseType: !287, size: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !268)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !281, file: !125, line: 125, baseType: !104, size: 32, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, scope: !281, file: !125, line: 127, baseType: !291, size: 64, offset: 96)
!291 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !281, file: !125, line: 127, size: 64, elements: !292)
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, scope: !291, file: !125, line: 128, baseType: !294, size: 64)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !291, file: !125, line: 128, size: 64, elements: !295)
!295 = !{!296, !297}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !294, file: !125, line: 129, baseType: !113, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !294, file: !125, line: 131, baseType: !209, size: 32, offset: 32)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio", file: !125, line: 222, size: 128, elements: !300)
!300 = !{!301, !319, !320, !334}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "executor", scope: !299, file: !125, line: 228, baseType: !302, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor", file: !125, line: 210, size: 32, elements: !304)
!304 = !{!305}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !303, file: !125, line: 211, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor_api", file: !125, line: 168, size: 96, elements: !309)
!309 = !{!310, !314, !318}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !308, file: !125, line: 177, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DISubroutineType(types: !313)
!313 = !{!108, !298}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !308, file: !125, line: 182, baseType: !315, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !298, !279, !108}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !308, file: !125, line: 187, baseType: !315, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "xcqcnt", scope: !299, file: !125, line: 251, baseType: !142, size: 32, offset: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sq", scope: !299, file: !125, line: 254, baseType: !321, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sq", file: !125, line: 142, size: 160, elements: !323)
!323 = !{!324, !332}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !322, file: !125, line: 143, baseType: !325, size: 160)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc", file: !151, line: 58, size: 160, elements: !326)
!326 = !{!327, !328, !329, !330, !331}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "acquire", scope: !325, file: !151, line: 60, baseType: !24, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "consume", scope: !325, file: !151, line: 63, baseType: !24, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !325, file: !151, line: 66, baseType: !142, size: 32, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !325, file: !151, line: 69, baseType: !142, size: 32, offset: 96)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !325, file: !151, line: 72, baseType: !158, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !322, file: !125, line: 144, baseType: !333, offset: 160)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !281, elements: !197)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "cq", scope: !299, file: !125, line: 257, baseType: !335, size: 32, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cq", file: !125, line: 161, size: 160, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !336, file: !125, line: 162, baseType: !325, size: 160)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !336, file: !125, line: 163, baseType: !340, offset: 160)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !341, elements: !197)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cqe", file: !125, line: 150, size: 64, elements: !342)
!342 = !{!343, !344}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !341, file: !125, line: 151, baseType: !220, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !341, file: !125, line: 152, baseType: !104, size: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "iodev_sq", scope: !268, file: !125, line: 311, baseType: !346, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sq", file: !125, line: 298, size: 160, elements: !348)
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !347, file: !125, line: 299, baseType: !325, size: 160)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !347, file: !125, line: 300, baseType: !351, offset: 160)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, elements: !197)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sqe", file: !125, line: 288, size: 64, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "sqe", scope: !352, file: !125, line: 289, baseType: !279, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !352, file: !125, line: 290, baseType: !298, size: 32, offset: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !268, file: !125, line: 314, baseType: !104, size: 32, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !264, file: !265, line: 23, baseType: !358, size: 448, offset: 128)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !359, line: 1318, size: 448, elements: !360)
!359 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!360 = !{!361, !388, !394, !399, !400, !405, !406}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !358, file: !359, line: 1324, baseType: !362, size: 192)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !363, line: 244, size: 192, elements: !364)
!363 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = !{!365, !381, !387}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !362, file: !363, line: 245, baseType: !366, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !367, line: 49, baseType: !368)
!367 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !367, line: 37, size: 64, elements: !369)
!369 = !{!370, !376}
!370 = !DIDerivedType(tag: DW_TAG_member, scope: !368, file: !367, line: 38, baseType: !371, size: 32)
!371 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !368, file: !367, line: 38, size: 32, elements: !372)
!372 = !{!373, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !371, file: !367, line: 39, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !371, file: !367, line: 40, baseType: !374, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, scope: !368, file: !367, line: 42, baseType: !377, size: 32, offset: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !368, file: !367, line: 42, size: 32, elements: !378)
!378 = !{!379, !380}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !377, file: !367, line: 43, baseType: !374, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !377, file: !367, line: 44, baseType: !374, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !362, file: !363, line: 246, baseType: !382, size: 32, offset: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !363, line: 242, baseType: !383)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !362, file: !363, line: 249, baseType: !111, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !358, file: !359, line: 1327, baseType: !389, size: 64, offset: 192)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !363, line: 233, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !363, line: 231, size: 64, elements: !391)
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !390, file: !363, line: 232, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !367, line: 48, baseType: !368)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !358, file: !359, line: 1330, baseType: !395, size: 32, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !398}
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !358, file: !359, line: 1333, baseType: !395, size: 32, offset: 288)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !358, file: !359, line: 1336, baseType: !401, size: 64, offset: 320)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !110, line: 67, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !110, line: 65, size: 64, elements: !403)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !402, file: !110, line: 66, baseType: !109, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !358, file: !359, line: 1339, baseType: !113, size: 32, offset: 384)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !358, file: !359, line: 1342, baseType: !104, size: 32, offset: 416)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !264, file: !265, line: 24, baseType: !408, size: 32, offset: 576)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !411, line: 378, size: 192, elements: !412)
!411 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!412 = !{!413, !414, !415, !416, !423, !424}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !410, file: !411, line: 380, baseType: !105, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !410, file: !411, line: 382, baseType: !13, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !410, file: !411, line: 384, baseType: !13, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !410, file: !411, line: 386, baseType: !417, size: 32, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !411, line: 351, size: 16, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !418, file: !411, line: 359, baseType: !164, size: 8)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !418, file: !411, line: 364, baseType: !422, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!422 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !410, file: !411, line: 388, baseType: !104, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !410, file: !411, line: 396, baseType: !425, size: 32, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !411, line: 43, baseType: !428)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !429)
!429 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "msgq", scope: !264, file: !265, line: 25, baseType: !431, size: 320, offset: 608)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !359, line: 4204, size: 320, elements: !432)
!432 = !{!433, !434, !438, !441, !442, !444, !445, !446, !447, !448}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !431, file: !359, line: 4206, baseType: !389, size: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !431, file: !359, line: 4208, baseType: !435, offset: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !436, line: 43, elements: !437)
!436 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!437 = !{}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !431, file: !359, line: 4210, baseType: !439, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !440, line: 214, baseType: !32)
!440 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!441 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !431, file: !359, line: 4212, baseType: !113, size: 32, offset: 96)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !431, file: !359, line: 4214, baseType: !443, size: 32, offset: 128)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !431, file: !359, line: 4216, baseType: !443, size: 32, offset: 160)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !431, file: !359, line: 4218, baseType: !443, size: 32, offset: 192)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !431, file: !359, line: 4220, baseType: !443, size: 32, offset: 224)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !431, file: !359, line: 4222, baseType: !113, size: 32, offset: 256)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !431, file: !359, line: 4227, baseType: !164, size: 8, offset: 288)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sample_number", scope: !264, file: !265, line: 26, baseType: !113, size: 32, offset: 928)
!450 = !{!258, !451, !458, !463, !465, !476, !478, !485, !487}
!451 = !DIGlobalVariableExpression(var: !452, expr: !DIExpression())
!452 = distinct !DIGlobalVariable(name: "vnd_sensor_iodev_sq_0", scope: !260, file: !265, line: 152, type: !453, isLocal: false, isDefinition: true)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc_vnd_sensor_iodev_sq_0", file: !265, line: 152, size: 672, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !453, file: !265, line: 152, baseType: !325, size: 160)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !453, file: !265, line: 152, baseType: !457, size: 512, offset: 160)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 512, elements: !244)
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_4", scope: !260, file: !265, line: 152, type: !460, isLocal: false, isDefinition: true, align: 16)
!460 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 64, elements: !461)
!461 = !{!462}
!462 = !DISubrange(count: 4)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "__device_dts_ord_4", scope: !260, file: !265, line: 152, type: !409, isLocal: false, isDefinition: true, align: 32)
!465 = !DIGlobalVariableExpression(var: !466, expr: !DIExpression())
!466 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_4", scope: !260, file: !265, line: 152, type: !467, isLocal: true, isDefinition: true, align: 32)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !469, line: 51, size: 64, elements: !470)
!469 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!470 = !{!471, !475}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !468, file: !469, line: 60, baseType: !472, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DISubroutineType(types: !474)
!474 = !{!108, !408}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !468, file: !469, line: 65, baseType: !408, size: 32, offset: 32)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_4", scope: !260, file: !265, line: 152, type: !418, isLocal: true, isDefinition: true, align: 8)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "vnd_sensor_config_0", scope: !260, file: !265, line: 152, type: !480, isLocal: true, isDefinition: true)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vnd_sensor_config", file: !265, line: 16, size: 64, elements: !482)
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sample_period", scope: !481, file: !265, line: 17, baseType: !113, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "sample_size", scope: !481, file: !265, line: 18, baseType: !439, size: 32, offset: 32)
!485 = !DIGlobalVariableExpression(var: !486, expr: !DIExpression())
!486 = distinct !DIGlobalVariable(name: "vnd_sensor_data_0", scope: !260, file: !265, line: 152, type: !264, isLocal: true, isDefinition: true)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "vnd_sensor_iodev_api", scope: !260, file: !265, line: 127, type: !272, isLocal: true, isDefinition: true)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !490, file: !254, line: 17, baseType: !105, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !490, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_4", scope: !496, file: !501, line: 17, type: !502, isLocal: false, isDefinition: true, align: 16)
!496 = distinct !DICompileUnit(language: DW_LANG_C99, file: !497, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !498, splitDebugInlining: false, nameTableKind: None)
!497 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/sensor_batch_processing/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/sensor_batch_processing")
!498 = !{!499, !505, !494}
!499 = !DIGlobalVariableExpression(var: !500, expr: !DIExpression())
!500 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_28", scope: !496, file: !501, line: 7, type: !502, isLocal: false, isDefinition: true, align: 16)
!501 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/sensor_batch_processing")
!502 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 48, elements: !503)
!503 = !{!504}
!504 = !DISubrange(count: 3)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_201", scope: !496, file: !501, line: 12, type: !502, isLocal: false, isDefinition: true, align: 16)
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !509, file: !522, line: 18, type: !523, isLocal: false, isDefinition: true)
!509 = distinct !DICompileUnit(language: DW_LANG_C99, file: !510, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !511, globals: !521, splitDebugInlining: false, nameTableKind: None)
!510 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/sensor_batch_processing")
!511 = !{!22, !104, !24, !512, !514, !516, !439, !108, !517, !518, !519, !520, !443, !209, !168, !105}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 32)
!513 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!521 = !{!507}
!522 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !525)
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !524, file: !254, line: 17, baseType: !105, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !524, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "_char_out", scope: !530, file: !534, line: 54, type: !535, isLocal: false, isDefinition: true)
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !531, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !532, globals: !533, splitDebugInlining: false, nameTableKind: None)
!531 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/sensor_batch_processing")
!532 = !{!104, !108}
!533 = !{!528}
!534 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DISubroutineType(types: !537)
!537 = !{!108, !108}
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !540, file: !954, line: 258, type: !955, isLocal: true, isDefinition: true, align: 32)
!540 = distinct !DICompileUnit(language: DW_LANG_C99, file: !541, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !542, retainedTypes: !825, globals: !953, splitDebugInlining: false, nameTableKind: None)
!541 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/sensor_batch_processing")
!542 = !{!543, !575, !585, !634, !640, !761, !796}
!543 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !544, line: 54, baseType: !32, size: 32, elements: !545)
!544 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!545 = !{!546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574}
!546 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!547 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!548 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!549 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!550 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!551 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!552 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!553 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!554 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!555 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!556 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!557 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!558 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!559 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!560 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!561 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!562 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!563 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!564 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!565 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!566 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!567 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!568 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!569 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!570 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!571 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!572 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!573 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!574 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!575 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !544, line: 224, baseType: !32, size: 32, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584}
!577 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!578 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!579 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!580 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!581 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!582 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!583 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!584 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!585 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !544, line: 275, baseType: !32, size: 32, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633}
!587 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!588 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!589 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!590 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!591 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!592 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!593 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!594 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!595 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!596 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!597 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!598 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!599 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!600 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!601 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!602 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!603 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!604 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!605 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!606 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!607 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!608 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!609 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!610 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!611 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!612 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!613 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!614 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!615 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!616 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!617 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!618 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!619 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!620 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!621 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!622 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!623 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!624 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!625 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!626 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!627 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!628 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!629 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!630 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!631 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!632 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!633 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!634 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !544, line: 327, baseType: !32, size: 32, elements: !635)
!635 = !{!636, !637, !638, !639}
!636 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!637 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!638 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!639 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!640 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !641, line: 76, baseType: !32, size: 32, elements: !642)
!641 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760}
!643 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!644 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!645 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!646 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!647 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!648 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!649 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!650 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!651 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!652 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!653 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!654 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!655 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!656 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!657 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!658 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!659 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!660 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!661 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!662 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!663 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!664 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!665 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!666 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!667 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!668 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!669 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!670 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!671 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!672 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!673 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!674 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!675 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!676 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!677 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!678 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!679 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!680 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!681 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!682 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!683 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!684 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!685 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!686 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!687 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!688 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!689 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!690 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!691 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!692 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!693 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!694 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!695 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!696 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!697 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!698 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!699 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!700 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!701 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!702 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!703 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!704 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!705 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!706 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!707 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!708 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!709 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!710 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!711 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!712 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!713 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!714 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!715 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!716 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!717 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!718 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!719 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!720 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!721 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!722 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!723 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!724 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!725 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!726 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!727 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!728 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!729 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!730 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!731 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!732 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!733 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!734 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!735 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!736 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!737 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!738 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!739 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!740 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!741 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!742 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!743 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!744 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!745 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!746 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!747 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!748 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!749 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!750 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!751 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!752 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!753 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!754 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!755 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!756 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!757 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!758 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!759 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!760 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!761 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !544, line: 237, baseType: !32, size: 32, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795}
!763 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!764 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!765 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!766 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!767 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!768 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!769 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!770 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!771 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!772 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!773 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!774 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!775 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!776 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!777 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!778 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!779 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!780 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!781 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!782 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!783 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!784 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!785 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!786 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!787 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!788 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!789 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!790 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!791 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!792 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!793 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!794 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!795 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!796 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !641, line: 44, baseType: !32, size: 32, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824}
!798 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!799 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!800 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!801 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!802 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!803 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!804 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!805 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!806 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!807 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!808 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!809 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!810 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!811 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!812 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!813 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!814 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!815 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!816 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!817 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!818 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!819 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!820 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!821 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!822 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!823 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!824 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!825 = !{!826, !898, !941, !952, !113}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !828, line: 4575, baseType: !829)
!828 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !828, line: 4532, size: 390144, elements: !830)
!830 = !{!831, !833, !834, !835, !836, !840, !850, !854, !864, !868}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !829, file: !828, line: 4533, baseType: !832, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !829, file: !828, line: 4534, baseType: !832, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !829, file: !828, line: 4535, baseType: !832, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !829, file: !828, line: 4536, baseType: !832, size: 32, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !829, file: !828, line: 4537, baseType: !837, size: 16256, offset: 128)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 16256, elements: !838)
!838 = !{!839}
!839 = !DISubrange(count: 2032)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !829, file: !828, line: 4543, baseType: !841, size: 4224, offset: 16384)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 4224, elements: !848)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !829, file: !828, line: 4538, size: 128, elements: !843)
!843 = !{!844, !845, !846, !847}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !842, file: !828, line: 4539, baseType: !832, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_SET", scope: !842, file: !828, line: 4540, baseType: !832, size: 32, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_CLR", scope: !842, file: !828, line: 4541, baseType: !832, size: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_TOG", scope: !842, file: !828, line: 4542, baseType: !832, size: 32, offset: 96)
!848 = !{!849}
!849 = !DISubrange(count: 33)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !829, file: !828, line: 4544, baseType: !851, size: 110464, offset: 20608)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 110464, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 13808)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !829, file: !828, line: 4550, baseType: !855, size: 24448, offset: 131072)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !856, size: 24448, elements: !862)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !829, file: !828, line: 4545, size: 128, elements: !857)
!857 = !{!858, !859, !860, !861}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !856, file: !828, line: 4546, baseType: !832, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_SET", scope: !856, file: !828, line: 4547, baseType: !832, size: 32, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_CLR", scope: !856, file: !828, line: 4548, baseType: !832, size: 32, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_TOG", scope: !856, file: !828, line: 4549, baseType: !832, size: 32, offset: 96)
!862 = !{!863}
!863 = !DISubrange(count: 191)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !829, file: !828, line: 4551, baseType: !865, size: 106624, offset: 155520)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 106624, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 13328)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !829, file: !828, line: 4574, baseType: !869, size: 128000, offset: 262144)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 128000, elements: !896)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !829, file: !828, line: 4552, size: 1024, elements: !871)
!871 = !{!872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !892, !893, !894, !895}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT", scope: !870, file: !828, line: 4553, baseType: !832, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_SET", scope: !870, file: !828, line: 4554, baseType: !832, size: 32, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_CLR", scope: !870, file: !828, line: 4555, baseType: !832, size: 32, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_TOG", scope: !870, file: !828, line: 4556, baseType: !832, size: 32, offset: 96)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "MISC", scope: !870, file: !828, line: 4557, baseType: !832, size: 32, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_SET", scope: !870, file: !828, line: 4558, baseType: !832, size: 32, offset: 160)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_CLR", scope: !870, file: !828, line: 4559, baseType: !832, size: 32, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_TOG", scope: !870, file: !828, line: 4560, baseType: !832, size: 32, offset: 224)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "POST", scope: !870, file: !828, line: 4561, baseType: !832, size: 32, offset: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_SET", scope: !870, file: !828, line: 4562, baseType: !832, size: 32, offset: 288)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_CLR", scope: !870, file: !828, line: 4563, baseType: !832, size: 32, offset: 320)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_TOG", scope: !870, file: !828, line: 4564, baseType: !832, size: 32, offset: 352)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "PRE", scope: !870, file: !828, line: 4565, baseType: !832, size: 32, offset: 384)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_SET", scope: !870, file: !828, line: 4566, baseType: !832, size: 32, offset: 416)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_CLR", scope: !870, file: !828, line: 4567, baseType: !832, size: 32, offset: 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_TOG", scope: !870, file: !828, line: 4568, baseType: !832, size: 32, offset: 480)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !870, file: !828, line: 4569, baseType: !889, size: 384, offset: 512)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 384, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 48)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL", scope: !870, file: !828, line: 4570, baseType: !832, size: 32, offset: 896)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_SET", scope: !870, file: !828, line: 4571, baseType: !832, size: 32, offset: 928)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_CLR", scope: !870, file: !828, line: 4572, baseType: !832, size: 32, offset: 960)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !870, file: !828, line: 4573, baseType: !832, size: 32, offset: 992)
!896 = !{!897}
!897 = !DISubrange(count: 125)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDC_Type", file: !828, line: 38320, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !828, line: 38303, size: 23040, elements: !901)
!901 = !{!902, !904, !908, !909, !910, !911, !915, !919, !923, !927, !931}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "VIR", scope: !900, file: !828, line: 38304, baseType: !903, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !900, file: !828, line: 38305, baseType: !905, size: 256, offset: 32)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 256, elements: !906)
!906 = !{!907}
!907 = !DISubrange(count: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "STAT", scope: !900, file: !828, line: 38306, baseType: !832, size: 32, offset: 288)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "INTCTRL", scope: !900, file: !828, line: 38307, baseType: !832, size: 32, offset: 320)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "INTSTAT", scope: !900, file: !828, line: 38308, baseType: !832, size: 32, offset: 352)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !900, file: !828, line: 38309, baseType: !912, size: 3712, offset: 384)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 3712, elements: !913)
!913 = !{!914}
!914 = !DISubrange(count: 464)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "MDA", scope: !900, file: !828, line: 38310, baseType: !916, size: 864, offset: 4096)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !832, size: 864, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 27)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !900, file: !828, line: 38311, baseType: !920, size: 3232, offset: 4960)
!920 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 3232, elements: !921)
!921 = !{!922}
!922 = !DISubrange(count: 404)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "PDAP", scope: !900, file: !828, line: 38312, baseType: !924, size: 3776, offset: 8192)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !832, size: 3776, elements: !925)
!925 = !{!926}
!926 = !DISubrange(count: 118)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_3", scope: !900, file: !828, line: 38313, baseType: !928, size: 4416, offset: 11968)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 4416, elements: !929)
!929 = !{!930}
!930 = !DISubrange(count: 552)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "MR", scope: !900, file: !828, line: 38319, baseType: !932, size: 6656, offset: 16384)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 6656, elements: !939)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !900, file: !828, line: 38314, size: 128, elements: !934)
!934 = !{!935, !936, !937, !938}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "MRSA", scope: !933, file: !828, line: 38315, baseType: !832, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "MREA", scope: !933, file: !828, line: 38316, baseType: !832, size: 32, offset: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "MRC", scope: !933, file: !828, line: 38317, baseType: !832, size: 32, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "MRVS", scope: !933, file: !828, line: 38318, baseType: !832, size: 32, offset: 96)
!939 = !{!940}
!940 = !DISubrange(count: 52)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "WDOG_Type", file: !828, line: 43319, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !828, line: 43313, size: 80, elements: !944)
!944 = !{!945, !947, !948, !950, !951}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "WCR", scope: !943, file: !828, line: 43314, baseType: !946, size: 16)
!946 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !168)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "WSR", scope: !943, file: !828, line: 43315, baseType: !946, size: 16, offset: 16)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "WRSR", scope: !943, file: !828, line: 43316, baseType: !949, size: 16, offset: 32)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "WICR", scope: !943, file: !828, line: 43317, baseType: !946, size: 16, offset: 48)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "WMCR", scope: !943, file: !828, line: 43318, baseType: !946, size: 16, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 32)
!953 = !{!538}
!954 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!955 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !469, line: 51, size: 64, elements: !957)
!957 = !{!958, !965}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !956, file: !469, line: 60, baseType: !959, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!960 = !DISubroutineType(types: !961)
!961 = !{!108, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !964)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !469, line: 48, flags: DIFlagFwdDecl)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !956, file: !469, line: 65, baseType: !962, size: 32, offset: 32)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !968, file: !975, line: 21, type: !535, isLocal: true, isDefinition: true)
!968 = distinct !DICompileUnit(language: DW_LANG_C99, file: !969, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !970, globals: !974, splitDebugInlining: false, nameTableKind: None)
!969 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/sensor_batch_processing")
!970 = !{!971, !108, !104}
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !973, line: 22, baseType: !108)
!973 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!974 = !{!966}
!975 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "log_const_rtio_executor_simple", scope: !978, file: !981, line: 12, type: !982, isLocal: false, isDefinition: true)
!978 = distinct !DICompileUnit(language: DW_LANG_C99, file: !979, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !532, globals: !980, splitDebugInlining: false, nameTableKind: None)
!979 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/rtio/rtio_executor_simple.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/sensor_batch_processing")
!980 = !{!976}
!981 = !DIFile(filename: "zephyr/subsys/rtio/rtio_executor_simple.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!982 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !983)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !984)
!984 = !{!985, !986}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !983, file: !254, line: 17, baseType: !105, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !983, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(name: "log_const_rtio_executor_concurrent", scope: !989, file: !1098, line: 13, type: !1099, isLocal: false, isDefinition: true)
!989 = distinct !DICompileUnit(language: DW_LANG_C99, file: !990, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !991, globals: !1097, splitDebugInlining: false, nameTableKind: None)
!990 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/rtio/rtio_executor_concurrent.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/sensor_batch_processing")
!991 = !{!992, !104, !108}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_concurrent_executor", file: !994, line: 61, size: 224, elements: !995)
!994 = !DIFile(filename: "zephyr/include/zephyr/rtio/rtio_executor_concurrent.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!995 = !{!996, !1086, !1088, !1089, !1090, !1091, !1093, !1094, !1095}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !993, file: !994, line: 62, baseType: !997, size: 32)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor", file: !125, line: 210, size: 32, elements: !998)
!998 = !{!999}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !997, file: !125, line: 211, baseType: !1000, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_executor_api", file: !125, line: 168, size: 96, elements: !1003)
!1003 = !{!1004, !1081, !1085}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !1002, file: !125, line: 177, baseType: !1005, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 32)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!108, !1008}
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 32)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio", file: !125, line: 222, size: 128, elements: !1010)
!1010 = !{!1011, !1013, !1014, !1070}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "executor", scope: !1009, file: !125, line: 228, baseType: !1012, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "xcqcnt", scope: !1009, file: !125, line: 251, baseType: !142, size: 32, offset: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "sq", scope: !1009, file: !125, line: 254, baseType: !1015, size: 32, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sq", file: !125, line: 142, size: 160, elements: !1017)
!1017 = !{!1018, !1026}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !1016, file: !125, line: 143, baseType: !1019, size: 160)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_spsc", file: !151, line: 58, size: 160, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024, !1025}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "acquire", scope: !1019, file: !151, line: 60, baseType: !24, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "consume", scope: !1019, file: !151, line: 63, baseType: !24, size: 32, offset: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !1019, file: !151, line: 66, baseType: !142, size: 32, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !1019, file: !151, line: 69, baseType: !142, size: 32, offset: 96)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "mask", scope: !1019, file: !151, line: 72, baseType: !158, size: 32, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1016, file: !125, line: 144, baseType: !1027, offset: 160)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1028, elements: !197)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_sqe", file: !125, line: 109, size: 160, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1033, !1061, !1062}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1028, file: !125, line: 110, baseType: !164, size: 8)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !1028, file: !125, line: 112, baseType: !164, size: 8, offset: 8)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1028, file: !125, line: 114, baseType: !168, size: 16, offset: 16)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "iodev", scope: !1028, file: !125, line: 116, baseType: !1034, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev", file: !125, line: 306, size: 96, elements: !1037)
!1037 = !{!1038, !1049, !1060}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1036, file: !125, line: 308, baseType: !1039, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 32)
!1040 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_api", file: !125, line: 263, size: 32, elements: !1042)
!1042 = !{!1043}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "submit", scope: !1041, file: !125, line: 271, baseType: !1044, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 32)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{null, !1047, !1008}
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1028)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "iodev_sq", scope: !1036, file: !125, line: 311, baseType: !1050, size: 32, offset: 32)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 32)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sq", file: !125, line: 298, size: 160, elements: !1052)
!1052 = !{!1053, !1054}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !1051, file: !125, line: 299, baseType: !1019, size: 160)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1051, file: !125, line: 300, baseType: !1055, offset: 160)
!1055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1056, elements: !197)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_iodev_sqe", file: !125, line: 288, size: 64, elements: !1057)
!1057 = !{!1058, !1059}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "sqe", scope: !1056, file: !125, line: 289, baseType: !1047, size: 32)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1056, file: !125, line: 290, baseType: !1008, size: 32, offset: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1036, file: !125, line: 314, baseType: !104, size: 32, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !1028, file: !125, line: 125, baseType: !104, size: 32, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, scope: !1028, file: !125, line: 127, baseType: !1063, size: 64, offset: 96)
!1063 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1028, file: !125, line: 127, size: 64, elements: !1064)
!1064 = !{!1065}
!1065 = !DIDerivedType(tag: DW_TAG_member, scope: !1063, file: !125, line: 128, baseType: !1066, size: 64)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1063, file: !125, line: 128, size: 64, elements: !1067)
!1067 = !{!1068, !1069}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !1066, file: !125, line: 129, baseType: !113, size: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !1066, file: !125, line: 131, baseType: !209, size: 32, offset: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "cq", scope: !1009, file: !125, line: 257, baseType: !1071, size: 32, offset: 96)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 32)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cq", file: !125, line: 161, size: 160, elements: !1073)
!1073 = !{!1074, !1075}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "_spsc", scope: !1072, file: !125, line: 162, baseType: !1019, size: 160)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1072, file: !125, line: 163, baseType: !1076, offset: 160)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1077, elements: !197)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtio_cqe", file: !125, line: 150, size: 64, elements: !1078)
!1078 = !{!1079, !1080}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1077, file: !125, line: 151, baseType: !220, size: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "userdata", scope: !1077, file: !125, line: 152, baseType: !104, size: 32, offset: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "ok", scope: !1002, file: !125, line: 182, baseType: !1082, size: 32, offset: 32)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 32)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{null, !1008, !1047, !108}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !1002, file: !125, line: 187, baseType: !1082, size: 32, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !993, file: !994, line: 65, baseType: !1087, offset: 32)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !436, line: 43, elements: !437)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "task_in", scope: !993, file: !994, line: 68, baseType: !168, size: 16, offset: 32)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "task_out", scope: !993, file: !994, line: 68, baseType: !168, size: 16, offset: 48)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "task_mask", scope: !993, file: !994, line: 68, baseType: !168, size: 16, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "pending_sqe", scope: !993, file: !994, line: 71, baseType: !1092, size: 32, offset: 96)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 32)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "last_sqe", scope: !993, file: !994, line: 74, baseType: !1092, size: 32, offset: 128)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "task_status", scope: !993, file: !994, line: 77, baseType: !209, size: 32, offset: 160)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "task_cur", scope: !993, file: !994, line: 80, baseType: !1096, size: 32, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 32)
!1097 = !{!987}
!1098 = !DIFile(filename: "zephyr/subsys/rtio/rtio_executor_concurrent.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1099 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1100)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !254, line: 16, size: 64, elements: !1101)
!1101 = !{!1102, !1103}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1100, file: !254, line: 17, baseType: !105, size: 32)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1100, file: !254, line: 18, baseType: !164, size: 8, offset: 32)
!1104 = !DIGlobalVariableExpression(var: !1105, expr: !DIExpression())
!1105 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !1106, file: !1196, line: 603, type: !1198, isLocal: true, isDefinition: true, align: 32)
!1106 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1107, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !1108, globals: !1193, splitDebugInlining: false, nameTableKind: None)
!1107 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/sensor_batch_processing")
!1108 = !{!104, !108, !1109}
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 32)
!1110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !1112, line: 336, size: 608, elements: !1113)
!1112 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1113 = !{!1114, !1134, !1138, !1142, !1155, !1160, !1166, !1171, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !1111, file: !1112, line: 365, baseType: !1115, size: 32)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 32)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!108, !1118, !1133}
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 32)
!1119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1120)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !411, line: 378, size: 192, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1125, !1131, !1132}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1120, file: !411, line: 380, baseType: !105, size: 32)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1120, file: !411, line: 382, baseType: !13, size: 32, offset: 32)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1120, file: !411, line: 384, baseType: !13, size: 32, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1120, file: !411, line: 386, baseType: !1126, size: 32, offset: 96)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 32)
