; ModuleID = 'build/adafruit_feather_m0_lora/subsys/logging/syst/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.3, i8*, i32 }
%union.anon.3 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.PORT_DIR_Type*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.PORT_DIR_Type = type { %union.anon.3 }
%struct.mpsc_pbuf_buffer_config = type { i32*, i32, void (%struct.mpsc_pbuf_buffer*, %union.PORT_DIR_Type*)*, i32 (%union.PORT_DIR_Type*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }
%union.log_msg_generic = type { %struct.log_msg }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/logging/syst/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/logging/syst")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/logging/syst")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 256, baseType: !24)
!23 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stdint.h", directory: "")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_syst", scope: !27, file: !123, line: 15, type: !125, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !112, globals: !120, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/logging/syst/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/logging/syst")
!29 = !{!30, !37, !42}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !38, line: 33, baseType: !32, size: 32, elements: !39)
!38 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!39 = !{!40, !41}
!40 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!41 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !43, line: 27, baseType: !32, size: 32, elements: !44)
!43 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!45 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!46 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!47 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!48 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!49 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!50 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!51 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!52 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!53 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!54 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!55 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!56 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!57 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!58 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!59 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!60 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!61 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!111 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!112 = !{!113, !114, !117, !119}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 226, baseType: !116)
!116 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!119 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!120 = !{!25, !121}
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !123, line: 15, type: !124, isLocal: true, isDefinition: true)
!123 = !DIFile(filename: "zephyr/samples/subsys/logging/syst/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !127, line: 16, size: 64, elements: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !{!129, !133}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !127, line: 17, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !126, file: !127, line: 18, baseType: !115, size: 8, offset: 32)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !136, file: !159, line: 18, type: !161, isLocal: false, isDefinition: true)
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !138, retainedTypes: !139, globals: !156, splitDebugInlining: false, nameTableKind: None)
!137 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/logging/syst")
!138 = !{!30}
!139 = !{!22, !113, !24, !140, !142, !144, !145, !119, !147, !148, !150, !152, !153, !114, !154, !130}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !146, line: 46, baseType: !32)
!146 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 207, baseType: !155)
!155 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!156 = !{!134, !157}
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !136, file: !159, line: 18, type: !160, isLocal: true, isDefinition: true)
!159 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !127, line: 16, size: 64, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !127, line: 17, baseType: !130, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !162, file: !127, line: 18, baseType: !115, size: 8, offset: 32)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "_char_out", scope: !168, file: !173, line: 54, type: !174, isLocal: false, isDefinition: true)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, retainedTypes: !171, globals: !172, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/logging/syst")
!170 = !{!42}
!171 = !{!113, !119}
!172 = !{!166}
!173 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DISubroutineType(types: !176)
!176 = !{!119, !119}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !179, file: !916, line: 202, type: !917, isLocal: true, isDefinition: true, align: 32)
!179 = distinct !DICompileUnit(language: DW_LANG_C99, file: !180, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, retainedTypes: !181, globals: !915, splitDebugInlining: false, nameTableKind: None)
!180 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/logging/syst")
!181 = !{!113, !119, !182, !307, !646, !647, !714}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !184, line: 335, baseType: !185)
!184 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !184, line: 320, size: 288, elements: !186)
!186 = !{!187, !198, !206, !221, !232, !243, !247, !258, !259, !270, !271, !286, !287, !297}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !185, file: !184, line: 321, baseType: !188, size: 16)
!188 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !184, line: 50, baseType: !190)
!190 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !184, line: 43, size: 16, elements: !191)
!191 = !{!192, !197}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !190, file: !184, line: 48, baseType: !193, size: 16)
!193 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !190, file: !184, line: 44, size: 16, elements: !194)
!194 = !{!195, !196}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !193, file: !184, line: 45, baseType: !154, size: 7, flags: DIFlagBitField, extraData: i64 0)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !193, file: !184, line: 47, baseType: !154, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !190, file: !184, line: 49, baseType: !154, size: 16)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !185, file: !184, line: 322, baseType: !199, size: 16, offset: 16)
!199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 16, elements: !204)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !201, line: 52, baseType: !202)
!201 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !115)
!204 = !{!205}
!205 = !DISubrange(count: 2)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !185, file: !184, line: 323, baseType: !207, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !208)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !184, line: 107, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !184, line: 94, size: 32, elements: !210)
!210 = !{!211, !220}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !209, file: !184, line: 105, baseType: !212, size: 32)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !209, file: !184, line: 95, size: 32, elements: !213)
!213 = !{!214, !216, !217, !218, !219}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !212, file: !184, line: 97, baseType: !215, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 172, baseType: !32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !212, file: !184, line: 99, baseType: !215, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !212, file: !184, line: 100, baseType: !215, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !212, file: !184, line: 102, baseType: !215, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !212, file: !184, line: 103, baseType: !215, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !209, file: !184, line: 106, baseType: !215, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !185, file: !184, line: 324, baseType: !222, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !184, line: 155, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !184, line: 148, size: 32, elements: !225)
!225 = !{!226, !231}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !224, file: !184, line: 153, baseType: !227, size: 32)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !224, file: !184, line: 149, size: 32, elements: !228)
!228 = !{!229, !230}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !227, file: !184, line: 150, baseType: !215, size: 16, flags: DIFlagBitField, extraData: i64 0)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !227, file: !184, line: 151, baseType: !215, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !224, file: !184, line: 154, baseType: !215, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !185, file: !184, line: 325, baseType: !233, size: 8, offset: 96)
!233 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !184, line: 194, baseType: !235)
!235 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !184, line: 187, size: 8, elements: !236)
!236 = !{!237, !242}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !235, file: !184, line: 192, baseType: !238, size: 8)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !235, file: !184, line: 188, size: 8, elements: !239)
!239 = !{!240, !241}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !238, file: !184, line: 189, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !238, file: !184, line: 190, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !235, file: !184, line: 193, baseType: !115, size: 8)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !185, file: !184, line: 326, baseType: !244, size: 24, offset: 104)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 24, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 3)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !185, file: !184, line: 327, baseType: !248, size: 8, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !184, line: 215, baseType: !250)
!250 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !184, line: 208, size: 8, elements: !251)
!251 = !{!252, !257}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !250, file: !184, line: 213, baseType: !253, size: 8)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !250, file: !184, line: 209, size: 8, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !253, file: !184, line: 210, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !253, file: !184, line: 211, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !250, file: !184, line: 214, baseType: !115, size: 8)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !185, file: !184, line: 328, baseType: !244, size: 24, offset: 136)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !185, file: !184, line: 329, baseType: !260, size: 8, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !184, line: 236, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !184, line: 229, size: 8, elements: !263)
!263 = !{!264, !269}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !262, file: !184, line: 234, baseType: !265, size: 8)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !262, file: !184, line: 230, size: 8, elements: !266)
!266 = !{!267, !268}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !265, file: !184, line: 231, baseType: !202, size: 1, flags: DIFlagBitField, extraData: i64 0)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !265, file: !184, line: 232, baseType: !202, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !262, file: !184, line: 235, baseType: !115, size: 8)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !185, file: !184, line: 330, baseType: !244, size: 24, offset: 168)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !185, file: !184, line: 331, baseType: !272, size: 16, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !273)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !184, line: 262, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !184, line: 250, size: 16, elements: !275)
!275 = !{!276, !285}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !274, file: !184, line: 260, baseType: !277, size: 16)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !274, file: !184, line: 251, size: 16, elements: !278)
!278 = !{!279, !280, !281, !282, !283, !284}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !277, file: !184, line: 252, baseType: !154, size: 1, flags: DIFlagBitField, extraData: i64 0)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !277, file: !184, line: 253, baseType: !154, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !277, file: !184, line: 254, baseType: !154, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !277, file: !184, line: 255, baseType: !154, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !277, file: !184, line: 256, baseType: !154, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !277, file: !184, line: 258, baseType: !154, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !274, file: !184, line: 261, baseType: !154, size: 16)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !185, file: !184, line: 332, baseType: !199, size: 16, offset: 208)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !185, file: !184, line: 333, baseType: !288, size: 32, offset: 224)
!288 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !184, line: 290, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !184, line: 284, size: 32, elements: !291)
!291 = !{!292, !296}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !290, file: !184, line: 288, baseType: !293, size: 32)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !290, file: !184, line: 285, size: 32, elements: !294)
!294 = !{!295}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !293, file: !184, line: 286, baseType: !215, size: 22, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !290, file: !184, line: 289, baseType: !215, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !185, file: !184, line: 334, baseType: !298, size: 16, offset: 256)
!298 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !299)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !184, line: 308, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !184, line: 303, size: 16, elements: !301)
!301 = !{!302, !306}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !300, file: !184, line: 306, baseType: !303, size: 16)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !300, file: !184, line: 304, size: 16, elements: !304)
!304 = !{!305}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !303, file: !184, line: 305, baseType: !154, size: 16, flags: DIFlagBitField, extraData: i64 0)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !300, file: !184, line: 307, baseType: !154, size: 16)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !309, line: 928, baseType: !310)
!309 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !309, line: 899, size: 672, elements: !311)
!311 = !{!312, !336, !360, !386, !411, !427, !428, !446, !447, !464, !475, !476, !491, !511, !512, !524, !536, !546, !547, !564, !568, !579, !580, !592, !604, !605, !616, !632}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !310, file: !309, line: 900, baseType: !313, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !309, line: 64, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 43, size: 32, elements: !316)
!316 = !{!317, !335}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !315, file: !309, line: 62, baseType: !318, size: 32)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !315, file: !309, line: 44, size: 32, elements: !319)
!319 = !{!320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !318, file: !309, line: 45, baseType: !215, size: 1, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !318, file: !309, line: 46, baseType: !215, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !318, file: !309, line: 47, baseType: !215, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !318, file: !309, line: 48, baseType: !215, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !318, file: !309, line: 49, baseType: !215, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !318, file: !309, line: 50, baseType: !215, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !318, file: !309, line: 51, baseType: !215, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !318, file: !309, line: 52, baseType: !215, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !318, file: !309, line: 53, baseType: !215, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !318, file: !309, line: 54, baseType: !215, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !318, file: !309, line: 55, baseType: !215, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !318, file: !309, line: 56, baseType: !215, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !318, file: !309, line: 58, baseType: !215, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !318, file: !309, line: 59, baseType: !215, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !318, file: !309, line: 60, baseType: !215, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !315, file: !309, line: 63, baseType: !215, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !310, file: !309, line: 901, baseType: !337, size: 32, offset: 32)
!337 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !309, line: 125, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 104, size: 32, elements: !340)
!340 = !{!341, !359}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !339, file: !309, line: 123, baseType: !342, size: 32)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !339, file: !309, line: 105, size: 32, elements: !343)
!343 = !{!344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !342, file: !309, line: 106, baseType: !215, size: 1, flags: DIFlagBitField, extraData: i64 0)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !342, file: !309, line: 107, baseType: !215, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !342, file: !309, line: 108, baseType: !215, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !342, file: !309, line: 109, baseType: !215, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !342, file: !309, line: 110, baseType: !215, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !342, file: !309, line: 111, baseType: !215, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !342, file: !309, line: 112, baseType: !215, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !342, file: !309, line: 113, baseType: !215, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !342, file: !309, line: 114, baseType: !215, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !342, file: !309, line: 115, baseType: !215, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !342, file: !309, line: 116, baseType: !215, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !342, file: !309, line: 117, baseType: !215, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !342, file: !309, line: 119, baseType: !215, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !342, file: !309, line: 120, baseType: !215, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !342, file: !309, line: 121, baseType: !215, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !339, file: !309, line: 124, baseType: !215, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !310, file: !309, line: 902, baseType: !361, size: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !309, line: 186, baseType: !363)
!363 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 165, size: 32, elements: !364)
!364 = !{!365, !385}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !363, file: !309, line: 184, baseType: !366, size: 32)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !363, file: !309, line: 166, size: 32, elements: !367)
!367 = !{!368, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !366, file: !309, line: 167, baseType: !369, size: 1, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !370)
!370 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !215)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !366, file: !309, line: 168, baseType: !369, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !366, file: !309, line: 169, baseType: !369, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !366, file: !309, line: 170, baseType: !369, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !366, file: !309, line: 171, baseType: !369, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !366, file: !309, line: 172, baseType: !369, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !366, file: !309, line: 173, baseType: !369, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !366, file: !309, line: 174, baseType: !369, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !366, file: !309, line: 175, baseType: !369, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !366, file: !309, line: 176, baseType: !369, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !366, file: !309, line: 177, baseType: !369, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !366, file: !309, line: 178, baseType: !369, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !366, file: !309, line: 180, baseType: !369, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !366, file: !309, line: 181, baseType: !369, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !366, file: !309, line: 182, baseType: !369, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !363, file: !309, line: 185, baseType: !215, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !310, file: !309, line: 903, baseType: !387, size: 32, offset: 96)
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !389)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !309, line: 247, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 226, size: 32, elements: !391)
!391 = !{!392, !410}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !390, file: !309, line: 245, baseType: !393, size: 32)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !390, file: !309, line: 227, size: 32, elements: !394)
!394 = !{!395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !393, file: !309, line: 228, baseType: !215, size: 1, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !393, file: !309, line: 229, baseType: !215, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !393, file: !309, line: 230, baseType: !215, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !393, file: !309, line: 231, baseType: !215, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !393, file: !309, line: 232, baseType: !215, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !393, file: !309, line: 233, baseType: !215, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !393, file: !309, line: 234, baseType: !215, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !393, file: !309, line: 235, baseType: !215, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !393, file: !309, line: 236, baseType: !215, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !393, file: !309, line: 237, baseType: !215, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !393, file: !309, line: 238, baseType: !215, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !393, file: !309, line: 239, baseType: !215, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !393, file: !309, line: 241, baseType: !215, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !393, file: !309, line: 242, baseType: !215, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !393, file: !309, line: 243, baseType: !215, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !390, file: !309, line: 246, baseType: !215, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !310, file: !309, line: 904, baseType: !412, size: 16, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !413)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !309, line: 300, baseType: !414)
!414 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 287, size: 16, elements: !415)
!415 = !{!416, !426}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !414, file: !309, line: 298, baseType: !417, size: 16)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !414, file: !309, line: 288, size: 16, elements: !418)
!418 = !{!419, !420, !421, !422, !423, !424, !425}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !417, file: !309, line: 290, baseType: !154, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !417, file: !309, line: 291, baseType: !154, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !417, file: !309, line: 293, baseType: !154, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !417, file: !309, line: 294, baseType: !154, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !417, file: !309, line: 295, baseType: !154, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !417, file: !309, line: 296, baseType: !154, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !417, file: !309, line: 297, baseType: !154, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !414, file: !309, line: 299, baseType: !154, size: 16)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !310, file: !309, line: 905, baseType: !199, size: 16, offset: 144)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !310, file: !309, line: 906, baseType: !429, size: 16, offset: 160)
!429 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !430)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !309, line: 352, baseType: !431)
!431 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 336, size: 16, elements: !432)
!432 = !{!433, !445}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !431, file: !309, line: 350, baseType: !434, size: 16)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !431, file: !309, line: 337, size: 16, elements: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !434, file: !309, line: 339, baseType: !154, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !434, file: !309, line: 340, baseType: !154, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !434, file: !309, line: 341, baseType: !154, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !434, file: !309, line: 342, baseType: !154, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !434, file: !309, line: 343, baseType: !154, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !434, file: !309, line: 344, baseType: !154, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !434, file: !309, line: 345, baseType: !154, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !434, file: !309, line: 346, baseType: !154, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !434, file: !309, line: 348, baseType: !154, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !431, file: !309, line: 351, baseType: !154, size: 16)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !310, file: !309, line: 907, baseType: !199, size: 16, offset: 176)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !310, file: !309, line: 908, baseType: !448, size: 32, offset: 192)
!448 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !309, line: 398, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 381, size: 32, elements: !451)
!451 = !{!452, !463}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !450, file: !309, line: 396, baseType: !453, size: 32)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !450, file: !309, line: 382, size: 32, elements: !454)
!454 = !{!455, !456, !457, !458, !459, !460, !461, !462}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !453, file: !309, line: 384, baseType: !215, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !453, file: !309, line: 385, baseType: !215, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !453, file: !309, line: 386, baseType: !215, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !453, file: !309, line: 388, baseType: !215, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !453, file: !309, line: 389, baseType: !215, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !453, file: !309, line: 390, baseType: !215, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !453, file: !309, line: 392, baseType: !215, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !453, file: !309, line: 394, baseType: !215, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !450, file: !309, line: 397, baseType: !215, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !310, file: !309, line: 909, baseType: !465, size: 8, offset: 224)
!465 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !309, line: 433, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 426, size: 8, elements: !468)
!468 = !{!469, !474}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !467, file: !309, line: 431, baseType: !470, size: 8)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !467, file: !309, line: 427, size: 8, elements: !471)
!471 = !{!472, !473}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !470, file: !309, line: 428, baseType: !115, size: 5, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !470, file: !309, line: 430, baseType: !115, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !467, file: !309, line: 432, baseType: !115, size: 8)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !310, file: !309, line: 910, baseType: !244, size: 24, offset: 232)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !310, file: !309, line: 911, baseType: !477, size: 32, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !309, line: 462, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 448, size: 32, elements: !480)
!480 = !{!481, !490}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !479, file: !309, line: 460, baseType: !482, size: 32)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !479, file: !309, line: 449, size: 32, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !489}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !482, file: !309, line: 451, baseType: !215, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !482, file: !309, line: 453, baseType: !215, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !482, file: !309, line: 454, baseType: !215, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !482, file: !309, line: 455, baseType: !215, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !482, file: !309, line: 457, baseType: !215, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !482, file: !309, line: 459, baseType: !215, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !479, file: !309, line: 461, baseType: !215, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !310, file: !309, line: 912, baseType: !492, size: 16, offset: 288)
!492 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !309, line: 520, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 503, size: 16, elements: !495)
!495 = !{!496, !510}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !494, file: !309, line: 518, baseType: !497, size: 16)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !494, file: !309, line: 504, size: 16, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !497, file: !309, line: 506, baseType: !154, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !497, file: !309, line: 507, baseType: !154, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !497, file: !309, line: 508, baseType: !154, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !497, file: !309, line: 509, baseType: !154, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !497, file: !309, line: 510, baseType: !154, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !497, file: !309, line: 511, baseType: !154, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !497, file: !309, line: 512, baseType: !154, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !497, file: !309, line: 513, baseType: !154, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !497, file: !309, line: 514, baseType: !154, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !497, file: !309, line: 515, baseType: !154, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !497, file: !309, line: 516, baseType: !154, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !494, file: !309, line: 519, baseType: !154, size: 16)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !310, file: !309, line: 913, baseType: !199, size: 16, offset: 304)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !310, file: !309, line: 914, baseType: !513, size: 32, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !514)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !309, line: 559, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 552, size: 32, elements: !516)
!516 = !{!517, !523}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !515, file: !309, line: 557, baseType: !518, size: 32)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !515, file: !309, line: 553, size: 32, elements: !519)
!519 = !{!520, !521, !522}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !518, file: !309, line: 554, baseType: !215, size: 10, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !518, file: !309, line: 555, baseType: !215, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !518, file: !309, line: 556, baseType: !215, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !515, file: !309, line: 558, baseType: !215, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !310, file: !309, line: 915, baseType: !525, size: 32, offset: 352)
!525 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !526)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !309, line: 585, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 578, size: 32, elements: !528)
!528 = !{!529, !535}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !527, file: !309, line: 583, baseType: !530, size: 32)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !527, file: !309, line: 579, size: 32, elements: !531)
!531 = !{!532, !533, !534}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !530, file: !309, line: 580, baseType: !215, size: 16, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !530, file: !309, line: 581, baseType: !215, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !530, file: !309, line: 582, baseType: !215, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !527, file: !309, line: 584, baseType: !215, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !310, file: !309, line: 916, baseType: !537, size: 8, offset: 384)
!537 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !309, line: 610, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 604, size: 8, elements: !540)
!540 = !{!541, !545}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !539, file: !309, line: 608, baseType: !542, size: 8)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !539, file: !309, line: 605, size: 8, elements: !543)
!543 = !{!544}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !542, file: !309, line: 607, baseType: !115, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !539, file: !309, line: 609, baseType: !115, size: 8)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !310, file: !309, line: 917, baseType: !244, size: 24, offset: 392)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !310, file: !309, line: 918, baseType: !548, size: 32, offset: 416)
!548 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !309, line: 639, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 622, size: 32, elements: !551)
!551 = !{!552, !563}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !550, file: !309, line: 637, baseType: !553, size: 32)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !550, file: !309, line: 623, size: 32, elements: !554)
!554 = !{!555, !556, !557, !558, !559, !560, !561, !562}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !553, file: !309, line: 625, baseType: !215, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !553, file: !309, line: 626, baseType: !215, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !553, file: !309, line: 627, baseType: !215, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !553, file: !309, line: 629, baseType: !215, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !553, file: !309, line: 631, baseType: !215, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !553, file: !309, line: 632, baseType: !215, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !553, file: !309, line: 634, baseType: !215, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !553, file: !309, line: 635, baseType: !215, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !550, file: !309, line: 638, baseType: !215, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !310, file: !309, line: 919, baseType: !565, size: 32, offset: 448)
!565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 32, elements: !566)
!566 = !{!567}
!567 = !DISubrange(count: 4)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !310, file: !309, line: 920, baseType: !569, size: 16, offset: 480)
!569 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !309, line: 715, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 706, size: 16, elements: !572)
!572 = !{!573, !578}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !571, file: !309, line: 713, baseType: !574, size: 16)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !571, file: !309, line: 707, size: 16, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !574, file: !309, line: 709, baseType: !154, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !574, file: !309, line: 711, baseType: !154, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !571, file: !309, line: 714, baseType: !154, size: 16)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !310, file: !309, line: 921, baseType: !199, size: 16, offset: 496)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !310, file: !309, line: 922, baseType: !581, size: 32, offset: 512)
!581 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !309, line: 739, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 729, size: 32, elements: !584)
!584 = !{!585, !591}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !583, file: !309, line: 737, baseType: !586, size: 32)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !309, line: 730, size: 32, elements: !587)
!587 = !{!588, !589, !590}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !586, file: !309, line: 732, baseType: !215, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !586, file: !309, line: 733, baseType: !215, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !586, file: !309, line: 735, baseType: !215, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !583, file: !309, line: 738, baseType: !215, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !310, file: !309, line: 923, baseType: !593, size: 8, offset: 544)
!593 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !594)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !309, line: 765, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 756, size: 8, elements: !596)
!596 = !{!597, !603}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !595, file: !309, line: 763, baseType: !598, size: 8)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !595, file: !309, line: 757, size: 8, elements: !599)
!599 = !{!600, !601, !602}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !598, file: !309, line: 759, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !598, file: !309, line: 761, baseType: !115, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !598, file: !309, line: 762, baseType: !115, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !595, file: !309, line: 764, baseType: !115, size: 8)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !310, file: !309, line: 924, baseType: !244, size: 24, offset: 552)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !310, file: !309, line: 925, baseType: !606, size: 32, offset: 576)
!606 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !309, line: 789, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 781, size: 32, elements: !609)
!609 = !{!610, !615}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !608, file: !309, line: 787, baseType: !611, size: 32)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !608, file: !309, line: 782, size: 32, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !611, file: !309, line: 783, baseType: !215, size: 12, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !611, file: !309, line: 785, baseType: !215, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !608, file: !309, line: 788, baseType: !215, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !310, file: !309, line: 926, baseType: !617, size: 32, offset: 608)
!617 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !618)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !309, line: 820, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 805, size: 32, elements: !620)
!620 = !{!621, !631}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !619, file: !309, line: 818, baseType: !622, size: 32)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !619, file: !309, line: 806, size: 32, elements: !623)
!623 = !{!624, !625, !626, !627, !628, !629, !630}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !622, file: !309, line: 807, baseType: !215, size: 2, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !622, file: !309, line: 808, baseType: !215, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !622, file: !309, line: 809, baseType: !215, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !622, file: !309, line: 810, baseType: !215, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !622, file: !309, line: 812, baseType: !215, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !622, file: !309, line: 814, baseType: !215, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !622, file: !309, line: 816, baseType: !215, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !619, file: !309, line: 819, baseType: !215, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !310, file: !309, line: 927, baseType: !633, size: 8, offset: 640)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !309, line: 881, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !309, line: 872, size: 8, elements: !637)
!637 = !{!638, !645}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !636, file: !309, line: 879, baseType: !639, size: 8)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !636, file: !309, line: 873, size: 8, elements: !640)
!640 = !{!641, !642, !643, !644}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !639, file: !309, line: 874, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !639, file: !309, line: 875, baseType: !115, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !639, file: !309, line: 876, baseType: !115, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !639, file: !309, line: 877, baseType: !115, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !636, file: !309, line: 880, baseType: !115, size: 8)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !649, line: 290, baseType: !650)
!649 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !649, line: 284, size: 96, elements: !651)
!651 = !{!652, !662, !673, !686, !703}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !650, file: !649, line: 285, baseType: !653, size: 8)
!653 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !649, line: 49, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !649, line: 43, size: 8, elements: !656)
!656 = !{!657, !661}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !655, file: !649, line: 47, baseType: !658, size: 8)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !655, file: !649, line: 44, size: 8, elements: !659)
!659 = !{!660}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !658, file: !649, line: 45, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !655, file: !649, line: 48, baseType: !115, size: 8)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !650, file: !649, line: 286, baseType: !663, size: 8, offset: 8)
!663 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !649, line: 67, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !649, line: 61, size: 8, elements: !667)
!667 = !{!668, !672}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !666, file: !649, line: 65, baseType: !669, size: 8)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !666, file: !649, line: 62, size: 8, elements: !670)
!670 = !{!671}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !669, file: !649, line: 64, baseType: !115, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !666, file: !649, line: 66, baseType: !115, size: 8)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !650, file: !649, line: 287, baseType: !674, size: 16, offset: 16)
!674 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !649, line: 89, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !649, line: 79, size: 16, elements: !677)
!677 = !{!678, !685}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !676, file: !649, line: 87, baseType: !679, size: 16)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !676, file: !649, line: 80, size: 16, elements: !680)
!680 = !{!681, !682, !683, !684}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !679, file: !649, line: 81, baseType: !154, size: 6, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !679, file: !649, line: 83, baseType: !154, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !679, file: !649, line: 85, baseType: !154, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !679, file: !649, line: 86, baseType: !154, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !676, file: !649, line: 88, baseType: !154, size: 16)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !650, file: !649, line: 288, baseType: !687, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !688)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !649, line: 214, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !649, line: 199, size: 32, elements: !690)
!690 = !{!691, !702}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !689, file: !649, line: 212, baseType: !692, size: 32)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !689, file: !649, line: 200, size: 32, elements: !693)
!693 = !{!694, !695, !696, !697, !698, !699, !700, !701}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !692, file: !649, line: 201, baseType: !215, size: 4, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !692, file: !649, line: 203, baseType: !215, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !692, file: !649, line: 205, baseType: !215, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !692, file: !649, line: 206, baseType: !215, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !692, file: !649, line: 207, baseType: !215, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !692, file: !649, line: 208, baseType: !215, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !692, file: !649, line: 209, baseType: !215, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !692, file: !649, line: 210, baseType: !215, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !689, file: !649, line: 213, baseType: !215, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !650, file: !649, line: 289, baseType: !704, size: 32, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !649, line: 268, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !649, line: 260, size: 32, elements: !707)
!707 = !{!708, !713}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !706, file: !649, line: 266, baseType: !709, size: 32)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !706, file: !649, line: 261, size: 32, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !709, file: !649, line: 262, baseType: !215, size: 4, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !709, file: !649, line: 264, baseType: !215, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !706, file: !649, line: 267, baseType: !215, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !716, line: 513, baseType: !717)
!716 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !716, line: 494, size: 480, elements: !718)
!718 = !{!719, !725, !735, !739, !749, !759, !769, !779, !783, !799, !815, !831, !861, !865, !875, !885, !895, !899}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !717, file: !716, line: 495, baseType: !720, size: 8)
!720 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !721)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !716, line: 45, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !716, line: 43, size: 8, elements: !723)
!723 = !{!724}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !722, file: !716, line: 44, baseType: !115, size: 8)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !717, file: !716, line: 496, baseType: !726, size: 8, offset: 8)
!726 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !716, line: 61, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !716, line: 55, size: 8, elements: !729)
!729 = !{!730, !734}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !728, file: !716, line: 59, baseType: !731, size: 8)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !728, file: !716, line: 56, size: 8, elements: !732)
!732 = !{!733}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !731, file: !716, line: 57, baseType: !115, size: 2, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !728, file: !716, line: 60, baseType: !115, size: 8)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !717, file: !716, line: 497, baseType: !736, size: 48, offset: 16)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 48, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 6)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !717, file: !716, line: 498, baseType: !740, size: 8, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !741)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !716, line: 86, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !716, line: 80, size: 8, elements: !743)
!743 = !{!744, !748}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !742, file: !716, line: 84, baseType: !745, size: 8)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !742, file: !716, line: 81, size: 8, elements: !746)
!746 = !{!747}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !745, file: !716, line: 82, baseType: !115, size: 3, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !742, file: !716, line: 85, baseType: !115, size: 8)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !717, file: !716, line: 499, baseType: !750, size: 8, offset: 72)
!750 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !716, line: 121, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !716, line: 115, size: 8, elements: !753)
!753 = !{!754, !758}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !752, file: !716, line: 119, baseType: !755, size: 8)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !752, file: !716, line: 116, size: 8, elements: !756)
!756 = !{!757}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !755, file: !716, line: 117, baseType: !115, size: 3, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !752, file: !716, line: 120, baseType: !115, size: 8)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !717, file: !716, line: 500, baseType: !760, size: 8, offset: 80)
!760 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !761)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !716, line: 156, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !716, line: 150, size: 8, elements: !763)
!763 = !{!764, !768}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !762, file: !716, line: 154, baseType: !765, size: 8)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !762, file: !716, line: 151, size: 8, elements: !766)
!766 = !{!767}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !765, file: !716, line: 152, baseType: !115, size: 3, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !762, file: !716, line: 155, baseType: !115, size: 8)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !717, file: !716, line: 501, baseType: !770, size: 8, offset: 88)
!770 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !716, line: 191, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !716, line: 185, size: 8, elements: !773)
!773 = !{!774, !778}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !772, file: !716, line: 189, baseType: !775, size: 8)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !772, file: !716, line: 186, size: 8, elements: !776)
!776 = !{!777}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !775, file: !716, line: 187, baseType: !115, size: 3, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !772, file: !716, line: 190, baseType: !115, size: 8)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !717, file: !716, line: 502, baseType: !780, size: 64, offset: 96)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 64, elements: !781)
!781 = !{!782}
!782 = !DISubrange(count: 8)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !717, file: !716, line: 503, baseType: !784, size: 32, offset: 160)
!784 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !716, line: 232, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !716, line: 220, size: 32, elements: !787)
!787 = !{!788, !798}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !786, file: !716, line: 230, baseType: !789, size: 32)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !786, file: !716, line: 221, size: 32, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !789, file: !716, line: 222, baseType: !215, size: 1, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !789, file: !716, line: 223, baseType: !215, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !789, file: !716, line: 224, baseType: !215, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !789, file: !716, line: 225, baseType: !215, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !789, file: !716, line: 226, baseType: !215, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !789, file: !716, line: 227, baseType: !215, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !789, file: !716, line: 228, baseType: !215, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !786, file: !716, line: 231, baseType: !215, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !717, file: !716, line: 504, baseType: !800, size: 32, offset: 192)
!800 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !716, line: 268, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !716, line: 256, size: 32, elements: !803)
!803 = !{!804, !814}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !802, file: !716, line: 266, baseType: !805, size: 32)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !802, file: !716, line: 257, size: 32, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !805, file: !716, line: 258, baseType: !215, size: 1, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !805, file: !716, line: 259, baseType: !215, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !805, file: !716, line: 260, baseType: !215, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !805, file: !716, line: 261, baseType: !215, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !805, file: !716, line: 262, baseType: !215, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_", scope: !805, file: !716, line: 263, baseType: !215, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "EIC_", scope: !805, file: !716, line: 264, baseType: !215, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !802, file: !716, line: 267, baseType: !215, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "APBBMASK", scope: !717, file: !716, line: 505, baseType: !816, size: 32, offset: 224)
!816 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBMASK_Type", file: !716, line: 304, baseType: !818)
!818 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !716, line: 292, size: 32, elements: !819)
!819 = !{!820, !830}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !818, file: !716, line: 302, baseType: !821, size: 32)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !818, file: !716, line: 293, size: 32, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828, !829}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "PAC1_", scope: !821, file: !716, line: 294, baseType: !215, size: 1, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !821, file: !716, line: 295, baseType: !215, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !821, file: !716, line: 296, baseType: !215, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "PORT_", scope: !821, file: !716, line: 297, baseType: !215, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !821, file: !716, line: 298, baseType: !215, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !821, file: !716, line: 299, baseType: !215, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "HMATRIX_", scope: !821, file: !716, line: 300, baseType: !215, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !818, file: !716, line: 303, baseType: !215, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "APBCMASK", scope: !717, file: !716, line: 506, baseType: !832, size: 32, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCMASK_Type", file: !716, line: 354, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !716, line: 328, size: 32, elements: !835)
!835 = !{!836, !860}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !834, file: !716, line: 352, baseType: !837, size: 32)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !834, file: !716, line: 329, size: 32, elements: !838)
!838 = !{!839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "PAC2_", scope: !837, file: !716, line: 330, baseType: !215, size: 1, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "EVSYS_", scope: !837, file: !716, line: 331, baseType: !215, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM0_", scope: !837, file: !716, line: 332, baseType: !215, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM1_", scope: !837, file: !716, line: 333, baseType: !215, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM2_", scope: !837, file: !716, line: 334, baseType: !215, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM3_", scope: !837, file: !716, line: 335, baseType: !215, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM4_", scope: !837, file: !716, line: 336, baseType: !215, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM5_", scope: !837, file: !716, line: 337, baseType: !215, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "TCC0_", scope: !837, file: !716, line: 338, baseType: !215, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "TCC1_", scope: !837, file: !716, line: 339, baseType: !215, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "TCC2_", scope: !837, file: !716, line: 340, baseType: !215, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "TC3_", scope: !837, file: !716, line: 341, baseType: !215, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "TC4_", scope: !837, file: !716, line: 342, baseType: !215, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "TC5_", scope: !837, file: !716, line: 343, baseType: !215, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "TC6_", scope: !837, file: !716, line: 344, baseType: !215, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "TC7_", scope: !837, file: !716, line: 345, baseType: !215, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_", scope: !837, file: !716, line: 346, baseType: !215, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "AC_", scope: !837, file: !716, line: 347, baseType: !215, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "DAC_", scope: !837, file: !716, line: 348, baseType: !215, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "PTC_", scope: !837, file: !716, line: 349, baseType: !215, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "I2S_", scope: !837, file: !716, line: 350, baseType: !215, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !834, file: !716, line: 353, baseType: !215, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !717, file: !716, line: 507, baseType: !862, size: 128, offset: 288)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !200, size: 128, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 16)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !717, file: !716, line: 508, baseType: !866, size: 8, offset: 416)
!866 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENCLR_Type", file: !716, line: 412, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !716, line: 406, size: 8, elements: !869)
!869 = !{!870, !874}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !868, file: !716, line: 410, baseType: !871, size: 8)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !868, file: !716, line: 407, size: 8, elements: !872)
!872 = !{!873}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !871, file: !716, line: 408, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !868, file: !716, line: 411, baseType: !115, size: 8)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !717, file: !716, line: 509, baseType: !876, size: 8, offset: 424)
!876 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !877)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENSET_Type", file: !716, line: 430, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !716, line: 424, size: 8, elements: !879)
!879 = !{!880, !884}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !878, file: !716, line: 428, baseType: !881, size: 8)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !878, file: !716, line: 425, size: 8, elements: !882)
!882 = !{!883}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !881, file: !716, line: 426, baseType: !115, size: 1, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !878, file: !716, line: 429, baseType: !115, size: 8)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !717, file: !716, line: 510, baseType: !886, size: 8, offset: 432)
!886 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !887)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTFLAG_Type", file: !716, line: 448, baseType: !888)
!888 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !716, line: 442, size: 8, elements: !889)
!889 = !{!890, !894}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !888, file: !716, line: 446, baseType: !891, size: 8)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !888, file: !716, line: 443, size: 8, elements: !892)
!892 = !{!893}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !891, file: !716, line: 444, baseType: !202, size: 1, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !888, file: !716, line: 447, baseType: !115, size: 8)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !717, file: !716, line: 511, baseType: !896, size: 8, offset: 440)
