; ModuleID = 'build/96b_carbon_nrf51/pytest/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.ztest_suite_stats = type { i32, i32, i32 }
%struct.ztest_suite_node = type { i8*, i8* ()*, void (i8*)*, void (i8*)*, void (i8*)*, i1 (i8*)*, %struct.ztest_suite_stats* }
%struct.ztest_unit_test_stats = type { i32, i32, i32, i32, i32 }
%struct.ztest_unit_test = type { i8*, i8*, void (i8*)*, i32, %struct.ztest_unit_test_stats* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct.k_spinlock = type { i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_thread_stack_element = type { i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, [32 x i8], i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/pytest/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/pytest")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 38, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/pytest")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1664, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 26)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 832, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "z_ztest_suite_node_stats_test_pytest", scope: !27, file: !111, line: 8, type: !149, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !108, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/testsuite/pytest/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/pytest")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_ZTEST_SUITE_NODE", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_ZTEST_SUITE_STATS", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_ZTEST_UNIT_TEST", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_ZTEST_TEST_RULE", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 67)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 68)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 69)
!104 = !DIEnumerator(name: "K_OBJ_LAST", value: 70)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !{!109, !155, !25, !173}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "z_ztest_test_node_test_pytest", scope: !27, file: !111, line: 8, type: !112, isLocal: true, isDefinition: true, align: 32)
!111 = !DIFile(filename: "zephyr/samples/subsys/testsuite/pytest/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_node", file: !114, line: 177, size: 224, elements: !115)
!114 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/include/zephyr/ztest_test_new.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !{!116, !121, !127, !133, !136, !139, !146}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !114, line: 179, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !113, file: !114, line: 182, baseType: !122, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_setup_t", file: !114, line: 141, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DISubroutineType(types: !126)
!126 = !{!106}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !113, file: !114, line: 185, baseType: !128, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_before_t", file: !114, line: 148, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !106}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !113, file: !114, line: 188, baseType: !134, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_after_t", file: !114, line: 155, baseType: !130)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "teardown", scope: !113, file: !114, line: 191, baseType: !137, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_teardown_t", file: !114, line: 162, baseType: !130)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !113, file: !114, line: 194, baseType: !140, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_predicate_t", file: !114, line: 171, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !13}
!145 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !113, file: !114, line: 197, baseType: !147, size: 32, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_stats", file: !114, line: 114, size: 96, elements: !150)
!150 = !{!151, !153, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !149, file: !114, line: 116, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !149, file: !114, line: 118, baseType: !152, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !149, file: !114, line: 120, baseType: !152, size: 32, offset: 64)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "z_ztest_unit_test__test_pytest__test_pytest", scope: !27, file: !111, line: 10, type: !157, isLocal: true, isDefinition: true, align: 32)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_unit_test", file: !114, line: 97, size: 160, elements: !158)
!158 = !{!159, !160, !161, !162, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "test_suite_name", scope: !157, file: !114, line: 98, baseType: !118, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !114, line: 99, baseType: !118, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !157, file: !114, line: 100, baseType: !130, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "thread_options", scope: !157, file: !114, line: 101, baseType: !152, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !157, file: !114, line: 104, baseType: !164, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_unit_test_stats", file: !114, line: 123, size: 160, elements: !167)
!167 = !{!168, !169, !170, !171, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !166, file: !114, line: 125, baseType: !152, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !166, file: !114, line: 127, baseType: !152, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !166, file: !114, line: 129, baseType: !152, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pass_count", scope: !166, file: !114, line: 131, baseType: !152, size: 32, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "duration_worst_ms", scope: !166, file: !114, line: 133, baseType: !152, size: 32, offset: 128)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "z_ztest_unit_test_stats_test_pytest_test_pytest", scope: !27, file: !111, line: 10, type: !166, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !177, file: !200, line: 18, type: !201, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !179, globals: !199, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/pytest")
!179 = !{!22, !106, !24, !180, !182, !184, !185, !107, !187, !188, !190, !192, !193, !194, !197, !118}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !186, line: 214, baseType: !32)
!186 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !196)
!196 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !198)
!198 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!199 = !{!175}
!200 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !204)
!203 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !203, line: 17, baseType: !118, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !202, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "_char_out", scope: !209, file: !212, line: 54, type: !213, isLocal: false, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !211, splitDebugInlining: false, nameTableKind: None)
!210 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/pytest")
!211 = !{!207}
!212 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DISubroutineType(types: !215)
!215 = !{!107, !107}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !218, file: !257, line: 22, type: !290, isLocal: false, isDefinition: true)
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !220, retainedTypes: !232, globals: !254, splitDebugInlining: false, nameTableKind: None)
!219 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/pytest")
!220 = !{!221, !30}
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !222, line: 27, baseType: !32, size: 32, elements: !223)
!222 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231}
!224 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!225 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!226 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!227 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!228 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!229 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!230 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!231 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!232 = !{!106, !233, !107, !24, !236, !193, !152, !252}
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !234, line: 46, baseType: !235)
!234 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !191)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !238, line: 54, size: 96, elements: !239)
!238 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!239 = !{!240, !247, !251}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !237, file: !238, line: 55, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !242, line: 33, baseType: !243)
!242 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !242, line: 29, size: 32, elements: !244)
!244 = !{!245}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !242, line: 30, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !237, file: !238, line: 60, baseType: !248, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !221}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !237, file: !238, line: 65, baseType: !248, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !253)
!253 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!254 = !{!216, !255, !263, !269, !271, !280, !282}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !218, file: !257, line: 27, type: !258, isLocal: true, isDefinition: true)
!257 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 32, elements: !261)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !260, line: 22, baseType: !189)
!260 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!261 = !{!262}
!262 = !DISubrange(count: 1)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !218, file: !257, line: 44, type: !265, isLocal: true, isDefinition: true)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !266, line: 43, size: 32, elements: !267)
!266 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!267 = !{!268}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !265, file: !266, line: 52, baseType: !22, size: 32)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !218, file: !257, line: 49, type: !265, isLocal: true, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !218, file: !257, line: 36, type: !273, isLocal: true, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 128, elements: !261)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !222, line: 114, size: 128, elements: !275)
!275 = !{!276, !277, !278, !279}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !274, file: !222, line: 115, baseType: !221, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !274, file: !222, line: 141, baseType: !195, size: 8, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !274, file: !222, line: 149, baseType: !152, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !274, file: !222, line: 156, baseType: !152, size: 32, offset: 96)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !218, file: !257, line: 40, type: !273, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !218, file: !257, line: 28, type: !284, isLocal: true, isDefinition: true)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !242, line: 40, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !242, line: 35, size: 64, elements: !286)
!286 = !{!287, !289}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !285, file: !242, line: 36, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !285, file: !242, line: 37, baseType: !288, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !291, file: !203, line: 17, baseType: !118, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !291, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!295 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!296 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !299, file: !328, line: 50, type: !315, isLocal: true, isDefinition: true)
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !220, retainedTypes: !301, globals: !325, splitDebugInlining: false, nameTableKind: None)
!300 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/pytest")
!301 = !{!302, !233, !185, !107, !106, !152, !252, !304, !193, !315, !316}
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !303)
!303 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !306, line: 45, size: 64, elements: !307)
!306 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = !{!308, !314}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !305, file: !306, line: 46, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !242, line: 33, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !242, line: 29, size: 32, elements: !311)
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !310, file: !242, line: 30, baseType: !313, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !305, file: !306, line: 48, baseType: !152, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !306, line: 38, size: 64, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !317, file: !306, line: 39, baseType: !309, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !317, file: !306, line: 41, baseType: !321, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !306, line: 35, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !315}
!325 = !{!326, !332, !340, !297, !342, !352}
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "latency_lock", scope: !299, file: !328, line: 44, type: !329, isLocal: true, isDefinition: true)
!328 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !266, line: 43, size: 32, elements: !330)
!330 = !{!331}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !329, file: !266, line: 52, baseType: !22, size: 32)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !299, file: !328, line: 46, type: !334, isLocal: true, isDefinition: true)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !242, line: 40, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !242, line: 35, size: 64, elements: !336)
!336 = !{!337, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !335, file: !242, line: 36, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !335, file: !242, line: 37, baseType: !338, size: 32, offset: 32)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "latency_subs", scope: !299, file: !328, line: 52, type: !334, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !299, file: !328, line: 39, type: !344, isLocal: true, isDefinition: true)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, elements: !350)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 35, size: 96, elements: !346)
!346 = !{!347, !348, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !345, file: !328, line: 36, baseType: !221, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !345, file: !328, line: 37, baseType: !195, size: 8, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !345, file: !328, line: 38, baseType: !259, size: 32, offset: 64)
!350 = !{!351}
!351 = !DISubrange(count: 0)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !299, file: !328, line: 48, type: !315, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !356, file: !363, line: 47, type: !377, isLocal: true, isDefinition: true)
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !358, retainedTypes: !359, globals: !360, splitDebugInlining: false, nameTableKind: None)
!357 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/pytest")
!358 = !{!221}
!359 = !{!185, !107}
!360 = !{!361, !354, !373}
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "cpus_states", scope: !356, file: !363, line: 50, type: !364, isLocal: true, isDefinition: true)
!363 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 32, elements: !261)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !222, line: 114, size: 128, elements: !368)
!368 = !{!369, !370, !371, !372}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !367, file: !222, line: 115, baseType: !221, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !367, file: !222, line: 141, baseType: !195, size: 8, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !367, file: !222, line: 149, baseType: !152, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !367, file: !222, line: 156, baseType: !152, size: 32, offset: 96)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !356, file: !363, line: 55, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 8, elements: !261)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, elements: !350)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !380, file: !387, line: 21, type: !213, isLocal: true, isDefinition: true)
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !382, globals: !386, splitDebugInlining: false, nameTableKind: None)
!381 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/pytest")
!382 = !{!383, !107, !106}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !385, line: 22, baseType: !107)
!385 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!386 = !{!378}
!387 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !390, file: !491, line: 31, type: !508, isLocal: false, isDefinition: true)
!390 = distinct !DICompileUnit(language: DW_LANG_C99, file: !391, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !392, globals: !488, splitDebugInlining: false, nameTableKind: None)
!391 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/pytest")
!392 = !{!393, !195, !106, !107, !461, !462, !477, !152}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !395, line: 247, baseType: !396)
!395 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf51.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !395, line: 216, size: 20576, elements: !397)
!397 = !{!398, !404, !405, !406, !410, !411, !415, !416, !417, !421, !422, !426, !427, !431, !432, !436, !437, !441, !442, !443, !444, !448, !449, !450, !451, !455, !456, !460}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !396, file: !395, line: 217, baseType: !399, size: 960)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 960, elements: !402)
!400 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!401 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !152)
!402 = !{!403}
!403 = !DISubrange(count: 30)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !396, file: !395, line: 218, baseType: !401, size: 32, offset: 960)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !396, file: !395, line: 219, baseType: !401, size: 32, offset: 992)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !396, file: !395, line: 220, baseType: !407, size: 1088, offset: 1024)
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 1088, elements: !408)
!408 = !{!409}
!409 = !DISubrange(count: 34)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !396, file: !395, line: 221, baseType: !401, size: 32, offset: 2112)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !396, file: !395, line: 222, baseType: !412, size: 4032, offset: 2144)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 4032, elements: !413)
!413 = !{!414}
!414 = !DISubrange(count: 126)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !396, file: !395, line: 223, baseType: !401, size: 32, offset: 6176)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !396, file: !395, line: 224, baseType: !401, size: 32, offset: 6208)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !396, file: !395, line: 225, baseType: !418, size: 1952, offset: 6240)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 1952, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 61)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !396, file: !395, line: 226, baseType: !401, size: 32, offset: 8192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !396, file: !395, line: 227, baseType: !423, size: 288, offset: 8224)
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 288, elements: !424)
!424 = !{!425}
!425 = !DISubrange(count: 9)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !396, file: !395, line: 228, baseType: !400, size: 32, offset: 8512)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !396, file: !395, line: 229, baseType: !428, size: 1696, offset: 8544)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 1696, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 53)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !396, file: !395, line: 230, baseType: !401, size: 32, offset: 10240)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !396, file: !395, line: 231, baseType: !433, size: 96, offset: 10272)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 96, elements: !434)
!434 = !{!435}
!435 = !DISubrange(count: 3)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !396, file: !395, line: 232, baseType: !401, size: 32, offset: 10368)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !396, file: !395, line: 233, baseType: !438, size: 64, offset: 10400)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 64, elements: !439)
!439 = !{!440}
!440 = !DISubrange(count: 2)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !396, file: !395, line: 234, baseType: !401, size: 32, offset: 10464)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !396, file: !395, line: 236, baseType: !400, size: 32, offset: 10496)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !396, file: !395, line: 237, baseType: !401, size: 32, offset: 10528)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !396, file: !395, line: 238, baseType: !445, size: 224, offset: 10560)
!445 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 224, elements: !446)
!446 = !{!447}
!447 = !DISubrange(count: 7)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "RESET", scope: !396, file: !395, line: 239, baseType: !401, size: 32, offset: 10784)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !396, file: !395, line: 241, baseType: !433, size: 96, offset: 10816)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !396, file: !395, line: 242, baseType: !401, size: 32, offset: 10912)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !396, file: !395, line: 243, baseType: !452, size: 256, offset: 10944)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 256, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 8)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !396, file: !395, line: 244, baseType: !401, size: 32, offset: 11200)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !396, file: !395, line: 245, baseType: !457, size: 9312, offset: 11232)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 9312, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 291)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCFORCE", scope: !396, file: !395, line: 246, baseType: !401, size: 32, offset: 20544)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !464, line: 352, baseType: !465)
!464 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !464, line: 341, size: 320, elements: !466)
!466 = !{!467, !468, !469, !470, !471, !472, !473, !474, !476}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !465, file: !464, line: 343, baseType: !400, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !465, file: !464, line: 344, baseType: !401, size: 32, offset: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !465, file: !464, line: 345, baseType: !152, size: 32, offset: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !465, file: !464, line: 346, baseType: !401, size: 32, offset: 96)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !465, file: !464, line: 347, baseType: !401, size: 32, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !465, file: !464, line: 348, baseType: !401, size: 32, offset: 160)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !465, file: !464, line: 349, baseType: !152, size: 32, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !465, file: !464, line: 350, baseType: !475, size: 64, offset: 224)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 64, elements: !439)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !465, file: !464, line: 351, baseType: !401, size: 32, offset: 288)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !479, file: !478, line: 167, baseType: !487)
!478 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!479 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !478, file: !478, line: 134, type: !480, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !390, retainedNodes: !482)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !152}
!482 = !{!483, !484, !486}
!483 = !DILocalVariable(name: "time_us", arg: 1, scope: !479, file: !478, line: 134, type: !152)
!484 = !DILocalVariable(name: "delay_cycles", scope: !479, file: !478, line: 168, type: !485)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!486 = !DILocalVariable(name: "cycles", scope: !479, file: !478, line: 171, type: !152)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!488 = !{!388, !489, !504}
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf51_init", scope: !390, file: !491, line: 71, type: !492, isLocal: true, isDefinition: true, align: 32)
!491 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!492 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !493)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !494, line: 51, size: 64, elements: !495)
!494 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!495 = !{!496, !503}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !493, file: !494, line: 60, baseType: !497, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 32)
!498 = !DISubroutineType(types: !499)
!499 = !{!107, !500}
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !502)
!502 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !494, line: 48, flags: DIFlagFwdDecl)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !493, file: !494, line: 65, baseType: !500, size: 32, offset: 32)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !479, file: !478, line: 161, type: !506, isLocal: true, isDefinition: true, align: 128)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 48, elements: !434)
!507 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!508 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !509, file: !203, line: 17, baseType: !118, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !509, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "phase", scope: !515, file: !519, line: 61, type: !518, isLocal: false, isDefinition: true)
!515 = distinct !DICompileUnit(language: DW_LANG_C99, file: !516, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !517, retainedTypes: !544, globals: !550, splitDebugInlining: false, nameTableKind: None)
!516 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/testsuite/ztest/src/ztest_new.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/pytest")
!517 = !{!518, !527, !535, !30, !540}
!518 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_phase", file: !519, line: 40, baseType: !32, size: 32, elements: !520)
!519 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/src/ztest_new.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!520 = !{!521, !522, !523, !524, !525, !526}
!521 = !DIEnumerator(name: "TEST_PHASE_SETUP", value: 0)
!522 = !DIEnumerator(name: "TEST_PHASE_BEFORE", value: 1)
!523 = !DIEnumerator(name: "TEST_PHASE_TEST", value: 2)
!524 = !DIEnumerator(name: "TEST_PHASE_AFTER", value: 3)
!525 = !DIEnumerator(name: "TEST_PHASE_TEARDOWN", value: 4)
!526 = !DIEnumerator(name: "TEST_PHASE_FRAMEWORK", value: 5)
!527 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_result", file: !519, line: 226, baseType: !32, size: 32, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534}
!529 = !DIEnumerator(name: "ZTEST_RESULT_PENDING", value: 0)
!530 = !DIEnumerator(name: "ZTEST_RESULT_PASS", value: 1)
!531 = !DIEnumerator(name: "ZTEST_RESULT_FAIL", value: 2)
!532 = !DIEnumerator(name: "ZTEST_RESULT_SKIP", value: 3)
!533 = !DIEnumerator(name: "ZTEST_RESULT_SUITE_SKIP", value: 4)
!534 = !DIEnumerator(name: "ZTEST_RESULT_SUITE_FAIL", value: 5)
!535 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_status", file: !519, line: 52, baseType: !32, size: 32, elements: !536)
!536 = !{!537, !538, !539}
!537 = !DIEnumerator(name: "ZTEST_STATUS_OK", value: 0)
!538 = !DIEnumerator(name: "ZTEST_STATUS_HAS_FAILURE", value: 1)
!539 = !DIEnumerator(name: "ZTEST_STATUS_CRITICAL_ERROR", value: 2)
!540 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_expected_result", file: !114, line: 36, baseType: !32, size: 32, elements: !541)
!541 = !{!542, !543}
!542 = !DIEnumerator(name: "ZTEST_EXPECTED_RESULT_FAIL", value: 0)
!543 = !DIEnumerator(name: "ZTEST_EXPECTED_RESULT_SKIP", value: 1)
!544 = !{!106, !107, !185, !545, !233, !152, !252}
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !546, line: 46, baseType: !547)
!546 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !106, !106, !106}
!550 = !{!513, !551, !553, !555, !564, !566, !678, !681}
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "test_result", scope: !515, file: !519, line: 234, type: !527, isLocal: true, isDefinition: true)
!553 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression())
!554 = distinct !DIGlobalVariable(name: "current_test_failed_assumption", scope: !515, file: !519, line: 294, type: !145, isLocal: true, isDefinition: true)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "ztest_thread_stack", scope: !515, file: !519, line: 430, type: !557, isLocal: false, isDefinition: true, align: 64)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 8192, elements: !562)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !559, line: 47, size: 8, elements: !560)
!559 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !558, file: !559, line: 48, baseType: !120, size: 8)
!562 = !{!563}
!563 = !DISubrange(count: 1024)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "test_status", scope: !515, file: !519, line: 63, type: !535, isLocal: true, isDefinition: true)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "ztest_thread", scope: !515, file: !519, line: 17, type: !568, isLocal: true, isDefinition: true)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !569, line: 245, size: 1152, elements: !570)
!569 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!570 = !{!571, !634, !647, !648, !649, !653, !654, !673}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !568, file: !569, line: 247, baseType: !572, size: 384)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !569, line: 57, size: 384, elements: !573)
!573 = !{!574, !600, !608, !609, !610, !621, !622, !623}
!574 = !DIDerivedType(tag: DW_TAG_member, scope: !572, file: !569, line: 60, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !572, file: !569, line: 60, size: 64, elements: !576)
!576 = !{!577, !593}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !575, file: !569, line: 61, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !579, line: 49, baseType: !580)
!579 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !579, line: 37, size: 64, elements: !581)
!581 = !{!582, !588}
!582 = !DIDerivedType(tag: DW_TAG_member, scope: !580, file: !579, line: 38, baseType: !583, size: 32)
!583 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !580, file: !579, line: 38, size: 32, elements: !584)
!584 = !{!585, !587}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !583, file: !579, line: 39, baseType: !586, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !583, file: !579, line: 40, baseType: !586, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, scope: !580, file: !579, line: 42, baseType: !589, size: 32, offset: 32)
!589 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !580, file: !579, line: 42, size: 32, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !589, file: !579, line: 43, baseType: !586, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !589, file: !579, line: 44, baseType: !586, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !575, file: !569, line: 62, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !595, line: 49, size: 64, elements: !596)
!595 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!596 = !{!597}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !594, file: !595, line: 50, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 64, elements: !439)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !572, file: !569, line: 68, baseType: !601, size: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !603, line: 233, baseType: !604)
!603 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !603, line: 231, size: 64, elements: !605)
!605 = !{!606}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !604, file: !603, line: 232, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !579, line: 48, baseType: !580)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !572, file: !569, line: 71, baseType: !195, size: 8, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !572, file: !569, line: 74, baseType: !195, size: 8, offset: 104)
!610 = !DIDerivedType(tag: DW_TAG_member, scope: !572, file: !569, line: 90, baseType: !611, size: 16, offset: 112)
!611 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !572, file: !569, line: 90, size: 16, elements: !612)
!612 = !{!613, !620}
!613 = !DIDerivedType(tag: DW_TAG_member, scope: !611, file: !569, line: 91, baseType: !614, size: 16)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !611, file: !569, line: 91, size: 16, elements: !615)
!615 = !{!616, !619}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !614, file: !569, line: 96, baseType: !617, size: 8)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !618)
!618 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !614, file: !569, line: 97, baseType: !195, size: 8, offset: 8)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !611, file: !569, line: 100, baseType: !197, size: 16)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !572, file: !569, line: 107, baseType: !152, size: 32, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !572, file: !569, line: 127, baseType: !106, size: 32, offset: 160)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !572, file: !569, line: 131, baseType: !624, size: 192, offset: 192)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !603, line: 244, size: 192, elements: !625)
!625 = !{!626, !627, !633}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !624, file: !603, line: 245, baseType: !578, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !624, file: !603, line: 246, baseType: !628, size: 32, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !603, line: 242, baseType: !629)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !632}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !624, file: !603, line: 249, baseType: !235, size: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !568, file: !569, line: 250, baseType: !635, size: 288, offset: 384)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !636, line: 25, size: 288, elements: !637)
!636 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !635, file: !636, line: 26, baseType: !152, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !635, file: !636, line: 27, baseType: !152, size: 32, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !635, file: !636, line: 28, baseType: !152, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !635, file: !636, line: 29, baseType: !152, size: 32, offset: 96)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !635, file: !636, line: 30, baseType: !152, size: 32, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !635, file: !636, line: 31, baseType: !152, size: 32, offset: 160)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !635, file: !636, line: 32, baseType: !152, size: 32, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !635, file: !636, line: 33, baseType: !152, size: 32, offset: 224)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !635, file: !636, line: 34, baseType: !152, size: 32, offset: 256)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !568, file: !569, line: 253, baseType: !106, size: 32, offset: 672)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !568, file: !569, line: 256, baseType: !602, size: 64, offset: 704)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !568, file: !569, line: 279, baseType: !650, size: 256, offset: 768)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 256, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !568, file: !569, line: 294, baseType: !107, size: 32, offset: 1024)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !568, file: !569, line: 325, baseType: !655, size: 32, offset: 1056)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !657, line: 5073, size: 192, elements: !658)
!657 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!658 = !{!659, !668, !669}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !656, file: !657, line: 5074, baseType: !660, size: 96)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !661, line: 56, size: 96, elements: !662)
!661 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!662 = !{!663, !666, !667}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !660, file: !661, line: 57, baseType: !664, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 32)
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !661, line: 57, flags: DIFlagFwdDecl)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !660, file: !661, line: 58, baseType: !106, size: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !660, file: !661, line: 59, baseType: !185, size: 32, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !656, file: !657, line: 5075, baseType: !602, size: 64, offset: 96)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !656, file: !657, line: 5076, baseType: !670, size: 32, offset: 160)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !266, line: 43, size: 32, elements: !671)
!671 = !{!672}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !670, file: !266, line: 52, baseType: !22, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !568, file: !569, line: 343, baseType: !674, size: 64, offset: 1088)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !636, line: 60, size: 64, elements: !675)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !674, file: !636, line: 63, baseType: !152, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !674, file: !636, line: 66, baseType: !152, size: 32, offset: 32)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "tc_start_time", scope: !515, file: !680, line: 95, type: !152, isLocal: true, isDefinition: true)
!680 = !DIFile(filename: "zephyr/subsys/testsuite/include/zephyr/tc_util.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "tc_spend_time", scope: !515, file: !680, line: 96, type: !152, isLocal: true, isDefinition: true)
!683 = !DIGlobalVariableExpression(var: !554, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "ztest_api", scope: !686, file: !689, line: 70, type: !690, isLocal: false, isDefinition: true)
!686 = distinct !DICompileUnit(language: DW_LANG_C99, file: !687, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !688, splitDebugInlining: false, nameTableKind: None)
!687 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/testsuite/ztest/src/ztest_defaults.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/pytest")
!688 = !{!684}
!689 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/src/ztest_defaults.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_arch_api", file: !114, line: 499, size: 96, elements: !692)
!692 = !{!693, !694, !715}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "run_all", scope: !691, file: !114, line: 500, baseType: !16, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "should_suite_run", scope: !691, file: !114, line: 501, baseType: !695, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!696 = !DISubroutineType(types: !697)
!697 = !{!145, !13, !698}
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_node", file: !114, line: 177, size: 224, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !699, file: !114, line: 179, baseType: !117, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !699, file: !114, line: 182, baseType: !122, size: 32, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !699, file: !114, line: 185, baseType: !128, size: 32, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !699, file: !114, line: 188, baseType: !134, size: 32, offset: 96)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "teardown", scope: !699, file: !114, line: 191, baseType: !137, size: 32, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !699, file: !114, line: 194, baseType: !140, size: 32, offset: 160)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !699, file: !114, line: 197, baseType: !708, size: 32, offset: 192)
!708 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_stats", file: !114, line: 114, size: 96, elements: !711)
!711 = !{!712, !713, !714}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !710, file: !114, line: 116, baseType: !152, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !710, file: !114, line: 118, baseType: !152, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !710, file: !114, line: 120, baseType: !152, size: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "should_test_run", scope: !691, file: !114, line: 502, baseType: !716, size: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!717 = !DISubroutineType(types: !718)
!718 = !{!145, !118, !118}
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "log_const_clock_control", scope: !721, file: !918, line: 18, type: !1152, isLocal: false, isDefinition: true)
!721 = distinct !DICompileUnit(language: DW_LANG_C99, file: !722, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !723, retainedTypes: !838, globals: !914, splitDebugInlining: false, nameTableKind: None)
!722 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/pytest")
!723 = !{!724, !730, !30, !735, !740, !745, !751, !757, !766, !770, !803, !810, !829}
!724 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !725, line: 23, baseType: !32, size: 32, elements: !726)
!725 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!726 = !{!727, !728, !729}
!727 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!728 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!729 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!730 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !725, line: 48, baseType: !32, size: 32, elements: !731)
!731 = !{!732, !733, !734}
!732 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!733 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!734 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!735 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !736, line: 167, baseType: !32, size: 32, elements: !737)
!736 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!737 = !{!738, !739}
!738 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!739 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!740 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !736, line: 107, baseType: !32, size: 32, elements: !741)
!741 = !{!742, !743, !744}
!742 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!743 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!744 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!745 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !736, line: 208, baseType: !32, size: 32, elements: !746)
!746 = !{!747, !748, !749, !750}
!747 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!748 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!749 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!750 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!751 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !736, line: 261, baseType: !32, size: 32, elements: !752)
!752 = !{!753, !754, !755, !756}
!753 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!754 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!755 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!756 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!757 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !736, line: 237, baseType: !32, size: 32, elements: !758)
!758 = !{!759, !760, !761, !762, !763, !764, !765}
!759 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!760 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!761 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!762 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!763 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!764 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!765 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!766 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !736, line: 152, baseType: !32, size: 32, elements: !767)
!767 = !{!768, !769}
!768 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!769 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!770 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !395, line: 71, baseType: !107, size: 32, elements: !771)
!771 = !{!772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802}
!772 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!773 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!774 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!775 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!776 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!777 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!778 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!779 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!780 = !DIEnumerator(name: "UART0_IRQn", value: 2)
!781 = !DIEnumerator(name: "SPI0_TWI0_IRQn", value: 3)
!782 = !DIEnumerator(name: "SPI1_TWI1_IRQn", value: 4)
!783 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!784 = !DIEnumerator(name: "ADC_IRQn", value: 7)
!785 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!786 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!787 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!788 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!789 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!790 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!791 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!792 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!793 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!794 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!795 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!796 = !DIEnumerator(name: "LPCOMP_IRQn", value: 19)
!797 = !DIEnumerator(name: "SWI0_IRQn", value: 20)
!798 = !DIEnumerator(name: "SWI1_IRQn", value: 21)
!799 = !DIEnumerator(name: "SWI2_IRQn", value: 22)
!800 = !DIEnumerator(name: "SWI3_IRQn", value: 23)
!801 = !DIEnumerator(name: "SWI4_IRQn", value: 24)
!802 = !DIEnumerator(name: "SWI5_IRQn", value: 25)
!803 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !804, line: 44, baseType: !32, size: 32, elements: !805)
!804 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!805 = !{!806, !807, !808, !809}
!806 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!807 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!808 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!809 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!810 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !811, line: 54, baseType: !32, size: 32, elements: !812)
!811 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!812 = !{!813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828}
!813 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!814 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!815 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!816 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!817 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!818 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!819 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!820 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!821 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!822 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!823 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!824 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!825 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!826 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!827 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!828 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!829 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !830, line: 53, baseType: !32, size: 32, elements: !831)
!830 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!831 = !{!832, !833, !834, !835, !836, !837}
!832 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!833 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!834 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!835 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!836 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!837 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!838 = !{!724, !106, !107, !839, !887, !888, !889, !890, !233, !152, !252, !145, !461, !194, !315, !891, !913, !185}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !395, line: 291, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !395, line: 260, size: 10912, elements: !842)
!842 = !{!843, !844, !845, !846, !847, !848, !849, !850, !854, !855, !856, !857, !858, !859, !863, !864, !865, !869, !870, !871, !872, !873, !874, !875, !879, !880, !881, !882, !886}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !841, file: !395, line: 261, baseType: !401, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !841, file: !395, line: 262, baseType: !401, size: 32, offset: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !841, file: !395, line: 263, baseType: !401, size: 32, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !841, file: !395, line: 264, baseType: !401, size: 32, offset: 96)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !841, file: !395, line: 265, baseType: !401, size: 32, offset: 128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !841, file: !395, line: 266, baseType: !401, size: 32, offset: 160)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !841, file: !395, line: 267, baseType: !401, size: 32, offset: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !841, file: !395, line: 268, baseType: !851, size: 1824, offset: 224)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 1824, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 57)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !841, file: !395, line: 269, baseType: !401, size: 32, offset: 2048)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !841, file: !395, line: 270, baseType: !401, size: 32, offset: 2080)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !841, file: !395, line: 271, baseType: !400, size: 32, offset: 2112)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !841, file: !395, line: 272, baseType: !401, size: 32, offset: 2144)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !841, file: !395, line: 273, baseType: !401, size: 32, offset: 2176)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !841, file: !395, line: 274, baseType: !860, size: 3968, offset: 2208)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 3968, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 124)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !841, file: !395, line: 275, baseType: !401, size: 32, offset: 6176)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !841, file: !395, line: 276, baseType: !401, size: 32, offset: 6208)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !841, file: !395, line: 277, baseType: !866, size: 2016, offset: 6240)
!866 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 2016, elements: !867)
!867 = !{!868}
!868 = !DISubrange(count: 63)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !841, file: !395, line: 278, baseType: !400, size: 32, offset: 8256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !841, file: !395, line: 279, baseType: !400, size: 32, offset: 8288)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !841, file: !395, line: 280, baseType: !400, size: 32, offset: 8320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !841, file: !395, line: 281, baseType: !400, size: 32, offset: 8352)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !841, file: !395, line: 282, baseType: !400, size: 32, offset: 8384)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !841, file: !395, line: 283, baseType: !400, size: 32, offset: 8416)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !841, file: !395, line: 285, baseType: !876, size: 1984, offset: 8448)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 1984, elements: !877)
!877 = !{!878}
!878 = !DISubrange(count: 62)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !841, file: !395, line: 286, baseType: !401, size: 32, offset: 10432)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !841, file: !395, line: 287, baseType: !445, size: 224, offset: 10464)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !841, file: !395, line: 288, baseType: !401, size: 32, offset: 10688)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !841, file: !395, line: 289, baseType: !883, size: 160, offset: 10720)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 160, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 5)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "XTALFREQ", scope: !841, file: !395, line: 290, baseType: !401, size: 32, offset: 10880)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !736, line: 146, baseType: !740)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !736, line: 164, baseType: !766)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !464, line: 326, baseType: !893)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !464, line: 314, size: 6400, elements: !894)
!894 = !{!895, !897, !901, !902, !903, !904, !905, !906, !907, !911}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !893, file: !464, line: 316, baseType: !896, size: 32)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 32, elements: !261)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !893, file: !464, line: 317, baseType: !898, size: 992, offset: 32)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 992, elements: !899)
!899 = !{!900}
!900 = !DISubrange(count: 31)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !893, file: !464, line: 318, baseType: !896, size: 32, offset: 1024)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !893, file: !464, line: 319, baseType: !898, size: 992, offset: 1056)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !893, file: !464, line: 320, baseType: !896, size: 32, offset: 2048)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !893, file: !464, line: 321, baseType: !898, size: 992, offset: 2080)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !893, file: !464, line: 322, baseType: !896, size: 32, offset: 3072)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !893, file: !464, line: 323, baseType: !898, size: 992, offset: 3104)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !893, file: !464, line: 324, baseType: !908, size: 2048, offset: 4096)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 2048, elements: !909)
!909 = !{!910}
!910 = !DISubrange(count: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !893, file: !464, line: 325, baseType: !912, size: 256, offset: 6144)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 256, elements: !453)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !804, line: 56, baseType: !106)
!914 = !{!719, !915, !967, !1008, !1014, !1031, !1042, !1044, !1061, !1063, !1073, !1076, !1092, !1130, !1144}
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "on", scope: !917, file: !918, line: 549, type: !259, isLocal: true, isDefinition: true)
!917 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !918, file: !918, line: 547, type: !919, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !721, retainedNodes: !921)
!918 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!919 = !DISubroutineType(types: !920)
!920 = !{null, !730}
!921 = !{!922, !923, !926}
!922 = !DILocalVariable(name: "start_mode", arg: 1, scope: !917, file: !918, line: 547, type: !730)
!923 = !DILocalVariable(name: "err", scope: !924, file: !918, line: 553, type: !107)
!924 = distinct !DILexicalBlock(scope: !925, file: !918, line: 552, column: 31)
!925 = distinct !DILexicalBlock(scope: !917, file: !918, line: 552, column: 6)
!926 = !DILocalVariable(name: "mgr", scope: !924, file: !918, line: 554, type: !927)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 32)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !929, line: 154, size: 256, elements: !930)
!929 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!930 = !{!931, !943, !944, !960, !964, !965, !966}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !928, file: !929, line: 158, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !242, line: 40, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !242, line: 35, size: 64, elements: !934)
!934 = !{!935, !942}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !933, file: !242, line: 36, baseType: !936, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !242, line: 33, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !242, line: 29, size: 32, elements: !939)
!939 = !{!940}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !938, file: !242, line: 30, baseType: !941, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !933, file: !242, line: 37, baseType: !936, size: 32, offset: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !928, file: !929, line: 163, baseType: !932, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !928, file: !929, line: 166, baseType: !945, size: 32, offset: 128)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !929, line: 133, size: 96, elements: !948)
!948 = !{!949, !958, !959}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !947, file: !929, line: 135, baseType: !950, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !929, line: 129, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = !DISubroutineType(types: !953)
!953 = !{null, !927, !954}
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !929, line: 101, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !927, !107}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !947, file: !929, line: 138, baseType: !950, size: 32, offset: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !947, file: !929, line: 143, baseType: !950, size: 32, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !928, file: !929, line: 169, baseType: !961, size: 32, offset: 160)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !266, line: 43, size: 32, elements: !962)
!962 = !{!963}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !961, file: !266, line: 52, baseType: !22, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !928, file: !929, line: 172, baseType: !107, size: 32, offset: 192)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !928, file: !929, line: 175, baseType: !197, size: 16, offset: 224)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !928, file: !929, line: 178, baseType: !197, size: 16, offset: 240)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(name: "cli", scope: !917, file: !918, line: 550, type: !969, isLocal: true, isDefinition: true)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !929, line: 273, size: 128, elements: !970)
!970 = !{!971, !972}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !969, file: !929, line: 280, baseType: !937, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !969, file: !929, line: 283, baseType: !973, size: 96, offset: 32)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !974, line: 138, size: 96, elements: !975)
!974 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!975 = !{!976, !1005, !1006}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !973, file: !974, line: 149, baseType: !977, size: 32)
!977 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !974, line: 139, size: 32, elements: !978)
!978 = !{!979, !1000}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !977, file: !974, line: 145, baseType: !980, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 32)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !657, line: 5397, size: 128, elements: !982)
!982 = !{!983, !998, !999}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !981, file: !657, line: 5399, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !579, line: 48, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !579, line: 37, size: 64, elements: !986)
!986 = !{!987, !993}
!987 = !DIDerivedType(tag: DW_TAG_member, scope: !985, file: !579, line: 38, baseType: !988, size: 32)
!988 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !985, file: !579, line: 38, size: 32, elements: !989)
!989 = !{!990, !992}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !988, file: !579, line: 39, baseType: !991, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !988, file: !579, line: 40, baseType: !991, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, scope: !985, file: !579, line: 42, baseType: !994, size: 32, offset: 32)
!994 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !985, file: !579, line: 42, size: 32, elements: !995)
!995 = !{!996, !997}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !994, file: !579, line: 43, baseType: !991, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !994, file: !579, line: 44, baseType: !991, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !981, file: !657, line: 5405, baseType: !32, size: 32, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !981, file: !657, line: 5408, baseType: !107, size: 32, offset: 96)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !977, file: !974, line: 148, baseType: !1001, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !974, line: 98, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 32)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{null, null}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !973, file: !974, line: 165, baseType: !401, size: 32, offset: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !973, file: !974, line: 174, baseType: !1007, size: 32, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !107)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !721, file: !918, line: 733, type: !1010, isLocal: false, isDefinition: true, align: 16)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1011, size: 80, elements: !884)
!1011 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !1013, line: 43, baseType: !302)
!1013 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(name: "__device_dts_ord_23", scope: !721, file: !918, line: 733, type: !1016, isLocal: false, isDefinition: true, align: 32)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !1013, line: 378, size: 192, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1028, !1029}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1017, file: !1013, line: 380, baseType: !118, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1017, file: !1013, line: 382, baseType: !13, size: 32, offset: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1017, file: !1013, line: 384, baseType: !13, size: 32, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1017, file: !1013, line: 386, baseType: !1023, size: 32, offset: 96)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !1013, line: 351, size: 16, elements: !1025)
!1025 = !{!1026, !1027}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1024, file: !1013, line: 359, baseType: !195, size: 8)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1024, file: !1013, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1017, file: !1013, line: 388, baseType: !106, size: 32, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1017, file: !1013, line: 396, baseType: !1030, size: 32, offset: 160)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 32)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_23", scope: !721, file: !918, line: 733, type: !1033, isLocal: true, isDefinition: true, align: 32)
!1033 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !494, line: 51, size: 64, elements: !1035)
!1035 = !{!1036, !1041}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1034, file: !494, line: 60, baseType: !1037, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 32)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!107, !1040}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1034, file: !494, line: 65, baseType: !1040, size: 32, offset: 32)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !721, file: !918, line: 79, type: !259, isLocal: true, isDefinition: true)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(name: "data", scope: !721, file: !918, line: 702, type: !1046, isLocal: true, isDefinition: true)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !918, line: 69, size: 704, elements: !1047)
!1047 = !{!1048, !1050}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !1046, file: !918, line: 70, baseType: !1049, size: 512)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !928, size: 512, elements: !439)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !1046, file: !918, line: 71, baseType: !1051, size: 192, offset: 512)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 192, elements: !439)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !918, line: 52, size: 96, elements: !1053)
!1053 = !{!1054, !1059, !1060}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !1052, file: !918, line: 53, baseType: !1055, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !804, line: 72, baseType: !1056)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 32)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{null, !1040, !913, !106}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !1052, file: !918, line: 54, baseType: !106, size: 32, offset: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1052, file: !918, line: 55, baseType: !152, size: 32, offset: 64)
!1061 = !DIGlobalVariableExpression(var: !1062, expr: !DIExpression())
!1062 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_23", scope: !721, file: !918, line: 733, type: !1024, isLocal: true, isDefinition: true, align: 8)
!1063 = !DIGlobalVariableExpression(var: !1064, expr: !DIExpression())
!1064 = distinct !DIGlobalVariable(name: "d", scope: !1065, file: !918, line: 476, type: !1071, isLocal: true, isDefinition: true)
