; ModuleID = 'build/96b_nitrogen/metairq_dispatch/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.k_spinlock] }
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct._static_thread_data = type { %struct.k_thread*, %struct.z_thread_stack_element*, i32, void (i8*, i8*, i8*)*, i8*, i8*, i8*, i32, i32, i32, void ()*, i8* }
%struct.k_sem = type { %union.anon, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/metairq_dispatch/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/metairq_dispatch")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 51, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/metairq_dispatch")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2496, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 39)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1248, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !120, line: 10, type: !346, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !117, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/metairq_dispatch/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/metairq_dispatch")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !104, !105, !106, !107, !111, !113, !114, !116}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!106 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !108, line: 46, baseType: !109)
!108 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !110)
!110 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !112, line: 214, baseType: !32)
!112 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !115)
!115 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !105)
!117 = !{!25, !118, !271, !275, !282, !315, !320, !324, !326}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "_k_thread_data_metairq_thread", scope: !27, file: !120, line: 28, type: !121, isLocal: false, isDefinition: true, align: 32)
!120 = !DIFile(filename: "zephyr/samples/kernel/metairq_dispatch/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !122, line: 620, size: 384, elements: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = !{!124, !244, !252, !253, !258, !259, !260, !261, !262, !263, !264, !268}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !121, file: !122, line: 621, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !127, line: 245, size: 1024, elements: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !{!129, !198, !211, !212, !213, !214, !220, !239}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !126, file: !127, line: 247, baseType: !130, size: 384)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !127, line: 57, size: 384, elements: !131)
!131 = !{!132, !160, !168, !171, !172, !185, !186, !187}
!132 = !DIDerivedType(tag: DW_TAG_member, scope: !130, file: !127, line: 60, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !127, line: 60, size: 64, elements: !134)
!134 = !{!135, !151}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !133, file: !127, line: 61, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !137, line: 49, baseType: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !137, line: 37, size: 64, elements: !139)
!139 = !{!140, !146}
!140 = !DIDerivedType(tag: DW_TAG_member, scope: !138, file: !137, line: 38, baseType: !141, size: 32)
!141 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !138, file: !137, line: 38, size: 32, elements: !142)
!142 = !{!143, !145}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !141, file: !137, line: 39, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !137, line: 40, baseType: !144, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, scope: !138, file: !137, line: 42, baseType: !147, size: 32, offset: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !138, file: !137, line: 42, size: 32, elements: !148)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !147, file: !137, line: 43, baseType: !144, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !147, file: !137, line: 44, baseType: !144, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !133, file: !127, line: 62, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !153, line: 49, size: 64, elements: !154)
!153 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !152, file: !153, line: 50, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 64, elements: !158)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!158 = !{!159}
!159 = !DISubrange(count: 2)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !130, file: !127, line: 68, baseType: !161, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !163, line: 233, baseType: !164)
!163 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !163, line: 231, size: 64, elements: !165)
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !164, file: !163, line: 232, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !137, line: 48, baseType: !138)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !130, file: !127, line: 71, baseType: !169, size: 8, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !170)
!170 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !130, file: !127, line: 74, baseType: !169, size: 8, offset: 104)
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !130, file: !127, line: 90, baseType: !173, size: 16, offset: 112)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !127, line: 90, size: 16, elements: !174)
!174 = !{!175, !182}
!175 = !DIDerivedType(tag: DW_TAG_member, scope: !173, file: !127, line: 91, baseType: !176, size: 16)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !173, file: !127, line: 91, size: 16, elements: !177)
!177 = !{!178, !181}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !176, file: !127, line: 96, baseType: !179, size: 8)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !180)
!180 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !176, file: !127, line: 97, baseType: !169, size: 8, offset: 8)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !173, file: !127, line: 100, baseType: !183, size: 16)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !184)
!184 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !130, file: !127, line: 107, baseType: !113, size: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !130, file: !127, line: 127, baseType: !104, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !130, file: !127, line: 131, baseType: !188, size: 192, offset: 192)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !163, line: 244, size: 192, elements: !189)
!189 = !{!190, !191, !197}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !188, file: !163, line: 245, baseType: !136, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !188, file: !163, line: 246, baseType: !192, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !163, line: 242, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !188, file: !163, line: 249, baseType: !109, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !126, file: !127, line: 250, baseType: !199, size: 288, offset: 384)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !200, line: 25, size: 288, elements: !201)
!200 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !199, file: !200, line: 26, baseType: !113, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !199, file: !200, line: 27, baseType: !113, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !199, file: !200, line: 28, baseType: !113, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !199, file: !200, line: 29, baseType: !113, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !199, file: !200, line: 30, baseType: !113, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !199, file: !200, line: 31, baseType: !113, size: 32, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !199, file: !200, line: 32, baseType: !113, size: 32, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !199, file: !200, line: 33, baseType: !113, size: 32, offset: 224)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !199, file: !200, line: 34, baseType: !113, size: 32, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !126, file: !127, line: 253, baseType: !104, size: 32, offset: 672)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !126, file: !127, line: 256, baseType: !162, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !126, file: !127, line: 294, baseType: !105, size: 32, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !126, file: !127, line: 300, baseType: !215, size: 96, offset: 800)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !127, line: 149, size: 96, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !215, file: !127, line: 153, baseType: !22, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !215, file: !127, line: 162, baseType: !111, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !215, file: !127, line: 168, baseType: !111, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !126, file: !127, line: 325, baseType: !221, size: 32, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !122, line: 5073, size: 192, elements: !223)
!223 = !{!224, !233, !234}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !222, file: !122, line: 5074, baseType: !225, size: 96)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !226, line: 56, size: 96, elements: !227)
!226 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!227 = !{!228, !231, !232}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !225, file: !226, line: 57, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !226, line: 57, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !225, file: !226, line: 58, baseType: !104, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !225, file: !226, line: 59, baseType: !111, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !222, file: !122, line: 5075, baseType: !162, size: 64, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !222, file: !122, line: 5076, baseType: !235, size: 32, offset: 160)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !236, line: 43, size: 32, elements: !237)
!236 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !235, file: !236, line: 52, baseType: !22, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !126, file: !127, line: 343, baseType: !240, size: 64, offset: 928)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !200, line: 60, size: 64, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !240, file: !200, line: 63, baseType: !113, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !240, file: !200, line: 66, baseType: !113, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !121, file: !122, line: 622, baseType: !245, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !247, line: 44, baseType: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !249, line: 47, size: 8, elements: !250)
!249 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!250 = !{!251}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !248, file: !249, line: 48, baseType: !103, size: 8)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !121, file: !122, line: 623, baseType: !32, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !121, file: !122, line: 624, baseType: !254, size: 32, offset: 96)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !247, line: 46, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !104, !104, !104}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !121, file: !122, line: 625, baseType: !104, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !121, file: !122, line: 626, baseType: !104, size: 32, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !121, file: !122, line: 627, baseType: !104, size: 32, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !121, file: !122, line: 628, baseType: !105, size: 32, offset: 224)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !121, file: !122, line: 629, baseType: !113, size: 32, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !121, file: !122, line: 630, baseType: !116, size: 32, offset: 288)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !121, file: !122, line: 631, baseType: !265, size: 32, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DISubroutineType(types: !267)
!267 = !{null}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !121, file: !122, line: 632, baseType: !269, size: 32, offset: 352)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "metairq_thread", scope: !27, file: !120, line: 28, type: !273, isLocal: false, isDefinition: true)
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !127, line: 347, baseType: !125)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "report_cookie", scope: !27, file: !120, line: 46, type: !277, isLocal: false, isDefinition: true, align: 32)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !122, line: 2909, size: 128, elements: !278)
!278 = !{!279, !280, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !277, file: !122, line: 2910, baseType: !162, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !277, file: !122, line: 2911, baseType: !32, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !277, file: !122, line: 2912, baseType: !32, size: 32, offset: 96)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "threads", scope: !27, file: !120, line: 22, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 15872, elements: !313)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_rec", file: !120, line: 18, size: 3968, elements: !286)
!286 = !{!287, !288, !301}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !285, file: !120, line: 19, baseType: !126, size: 1024)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "msgq", scope: !285, file: !120, line: 20, baseType: !289, size: 352, offset: 1024)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !122, line: 4204, size: 352, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !289, file: !122, line: 4206, baseType: !162, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !289, file: !122, line: 4208, baseType: !235, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !289, file: !122, line: 4210, baseType: !111, size: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !289, file: !122, line: 4212, baseType: !113, size: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !289, file: !122, line: 4214, baseType: !102, size: 32, offset: 160)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !289, file: !122, line: 4216, baseType: !102, size: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !289, file: !122, line: 4218, baseType: !102, size: 32, offset: 224)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !289, file: !122, line: 4220, baseType: !102, size: 32, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !289, file: !122, line: 4222, baseType: !113, size: 32, offset: 288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !289, file: !122, line: 4227, baseType: !169, size: 8, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "msgq_buf", scope: !285, file: !120, line: 21, baseType: !302, size: 2560, offset: 1376)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 2560, elements: !311)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msg", file: !304, line: 44, size: 160, elements: !305)
!304 = !DIFile(filename: "zephyr/samples/kernel/metairq_dispatch/src/msgdev.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!305 = !{!306, !307, !308, !309, !310}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !303, file: !304, line: 46, baseType: !113, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !303, file: !304, line: 49, baseType: !113, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !303, file: !304, line: 52, baseType: !113, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "proc_cyc", scope: !303, file: !304, line: 55, baseType: !113, size: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "metairq_latency", scope: !303, file: !304, line: 58, baseType: !113, size: 32, offset: 128)
!311 = !{!312}
!312 = !DISubrange(count: 16)
!313 = !{!314}
!314 = !DISubrange(count: 4)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "thread_stacks", scope: !27, file: !120, line: 24, type: !317, isLocal: false, isDefinition: true, align: 64)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 65536, elements: !318)
!318 = !{!314, !319}
!319 = !DISubrange(count: 2048)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "_k_thread_stack_metairq_thread", scope: !27, file: !120, line: 28, type: !322, isLocal: false, isDefinition: true, align: 64)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 16384, elements: !323)
!323 = !{!319}
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "_k_thread_obj_metairq_thread", scope: !27, file: !120, line: 28, type: !126, isLocal: false, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "stats", scope: !27, file: !120, line: 41, type: !328, isLocal: false, isDefinition: true)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 34, size: 4000, elements: !329)
!329 = !{!330, !333, !337}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "num_mirq", scope: !328, file: !120, line: 35, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !332, line: 22, baseType: !106)
!332 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mirq_latencies", scope: !328, file: !120, line: 36, baseType: !334, size: 1280, offset: 32)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 1280, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 40)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !328, file: !120, line: 40, baseType: !338, size: 2688, offset: 1312)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 2688, elements: !313)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !120, line: 37, size: 672, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nevt", scope: !339, file: !120, line: 38, baseType: !113, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "latencies", scope: !339, file: !120, line: 39, baseType: !343, size: 640, offset: 32)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 640, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 20)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !348, line: 16, size: 64, elements: !349)
!348 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !347, file: !348, line: 17, baseType: !269, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !347, file: !348, line: 18, baseType: !169, size: 8, offset: 32)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "hw_msgs", scope: !354, file: !360, line: 27, type: !398, isLocal: false, isDefinition: true, align: 32)
!354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !355, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !356, globals: !357, splitDebugInlining: false, nameTableKind: None)
!355 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/metairq_dispatch/src/msgdev.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/metairq_dispatch")
!356 = !{!107, !104, !105, !113, !114}
!357 = !{!352, !358, !385, !387, !389, !392}
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "timeout", scope: !354, file: !360, line: 17, type: !361, isLocal: true, isDefinition: true)
!360 = !DIFile(filename: "zephyr/samples/kernel/metairq_dispatch/src/msgdev.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !163, line: 244, size: 192, elements: !362)
!362 = !{!363, !378, !384}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !361, file: !163, line: 245, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !137, line: 49, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !137, line: 37, size: 64, elements: !366)
!366 = !{!367, !373}
!367 = !DIDerivedType(tag: DW_TAG_member, scope: !365, file: !137, line: 38, baseType: !368, size: 32)
!368 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !365, file: !137, line: 38, size: 32, elements: !369)
!369 = !{!370, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !368, file: !137, line: 39, baseType: !371, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !368, file: !137, line: 40, baseType: !371, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, scope: !365, file: !137, line: 42, baseType: !374, size: 32, offset: 32)
!374 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !365, file: !137, line: 42, size: 32, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !374, file: !137, line: 43, baseType: !371, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !374, file: !137, line: 44, baseType: !371, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !361, file: !163, line: 246, baseType: !379, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !163, line: 242, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !361, file: !163, line: 249, baseType: !109, size: 64, offset: 128)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "max_duty_cyc", scope: !354, file: !360, line: 23, type: !113, isLocal: false, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "msg_seq", scope: !354, file: !360, line: 25, type: !113, isLocal: false, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "_k_fifo_buf_hw_msgs", scope: !354, file: !360, line: 27, type: !391, isLocal: true, isDefinition: true, align: 32)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 320, elements: !335)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "state", scope: !394, file: !360, line: 38, type: !114, isLocal: true, isDefinition: true)
!394 = distinct !DISubprogram(name: "rand32", scope: !360, file: !360, line: 36, type: !395, scopeLine: 37, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !354, retainedNodes: !397)
!395 = !DISubroutineType(types: !396)
!396 = !{!113}
!397 = !{}
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !122, line: 4204, size: 352, elements: !399)
!399 = !{!400, !406, !410, !411, !412, !413, !414, !415, !416, !417}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !398, file: !122, line: 4206, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !163, line: 233, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !163, line: 231, size: 64, elements: !403)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !402, file: !163, line: 232, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !137, line: 48, baseType: !365)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !398, file: !122, line: 4208, baseType: !407, size: 32, offset: 64)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !236, line: 43, size: 32, elements: !408)
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !407, file: !236, line: 52, baseType: !22, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !398, file: !122, line: 4210, baseType: !111, size: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !398, file: !122, line: 4212, baseType: !113, size: 32, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !398, file: !122, line: 4214, baseType: !102, size: 32, offset: 160)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !398, file: !122, line: 4216, baseType: !102, size: 32, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !398, file: !122, line: 4218, baseType: !102, size: 32, offset: 224)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !398, file: !122, line: 4220, baseType: !102, size: 32, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !398, file: !122, line: 4222, baseType: !113, size: 32, offset: 288)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !398, file: !122, line: 4227, baseType: !169, size: 8, offset: 320)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !420, file: !434, line: 18, type: !435, isLocal: false, isDefinition: true)
!420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !421, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !422, globals: !433, splitDebugInlining: false, nameTableKind: None)
!421 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/metairq_dispatch")
!422 = !{!22, !104, !24, !423, !425, !427, !111, !105, !428, !429, !430, !431, !102, !432, !183, !269}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 32)
!424 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!433 = !{!418}
!434 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !348, line: 16, size: 64, elements: !437)
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !436, file: !348, line: 17, baseType: !269, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !436, file: !348, line: 18, baseType: !169, size: 8, offset: 32)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "_char_out", scope: !442, file: !446, line: 54, type: !447, isLocal: false, isDefinition: true)
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !444, globals: !445, splitDebugInlining: false, nameTableKind: None)
!443 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/metairq_dispatch")
!444 = !{!104, !105}
!445 = !{!440}
!446 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!448 = !DISubroutineType(types: !449)
!449 = !{!105, !105}
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !452, file: !486, line: 22, type: !516, isLocal: false, isDefinition: true)
!452 = distinct !DICompileUnit(language: DW_LANG_C99, file: !453, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !454, retainedTypes: !466, globals: !483, splitDebugInlining: false, nameTableKind: None)
!453 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/metairq_dispatch")
!454 = !{!455, !30}
!455 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !456, line: 27, baseType: !32, size: 32, elements: !457)
!456 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!457 = !{!458, !459, !460, !461, !462, !463, !464, !465}
!458 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!459 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!460 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!461 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!462 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!463 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!464 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!465 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!466 = !{!104, !107, !105, !24, !467, !102, !113, !114}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !469, line: 54, size: 96, elements: !470)
!469 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!470 = !{!471, !478, !482}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !468, file: !469, line: 55, baseType: !472, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !473, line: 33, baseType: !474)
!473 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !473, line: 29, size: 32, elements: !475)
!475 = !{!476}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !474, file: !473, line: 30, baseType: !477, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !468, file: !469, line: 60, baseType: !479, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !455}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !468, file: !469, line: 65, baseType: !479, size: 32, offset: 64)
!483 = !{!450, !484, !490, !495, !497, !506, !508}
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !452, file: !486, line: 27, type: !487, isLocal: true, isDefinition: true)
!486 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 32, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 1)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !452, file: !486, line: 44, type: !492, isLocal: true, isDefinition: true)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !236, line: 43, size: 32, elements: !493)
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !492, file: !236, line: 52, baseType: !22, size: 32)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !452, file: !486, line: 49, type: !492, isLocal: true, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !452, file: !486, line: 36, type: !499, isLocal: true, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 128, elements: !488)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !456, line: 114, size: 128, elements: !501)
!501 = !{!502, !503, !504, !505}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !500, file: !456, line: 115, baseType: !455, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !500, file: !456, line: 141, baseType: !169, size: 8, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !500, file: !456, line: 149, baseType: !113, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !500, file: !456, line: 156, baseType: !113, size: 32, offset: 96)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !452, file: !486, line: 40, type: !499, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !452, file: !486, line: 28, type: !510, isLocal: true, isDefinition: true)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !473, line: 40, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !473, line: 35, size: 64, elements: !512)
!512 = !{!513, !515}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !511, file: !473, line: 36, baseType: !514, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !511, file: !473, line: 37, baseType: !514, size: 32, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !348, line: 16, size: 64, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !517, file: !348, line: 17, baseType: !269, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !517, file: !348, line: 18, baseType: !169, size: 8, offset: 32)
!521 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!522 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !525, file: !553, line: 50, type: !116, isLocal: true, isDefinition: true)
!525 = distinct !DICompileUnit(language: DW_LANG_C99, file: !526, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !454, retainedTypes: !527, globals: !550, splitDebugInlining: false, nameTableKind: None)
!526 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/metairq_dispatch")
!527 = !{!528, !107, !111, !105, !104, !113, !114, !530, !102, !116, !541}
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !529)
!529 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 32)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !532, line: 45, size: 64, elements: !533)
!532 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!533 = !{!534, !540}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !531, file: !532, line: 46, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !473, line: 33, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !473, line: 29, size: 32, elements: !537)
!537 = !{!538}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !536, file: !473, line: 30, baseType: !539, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !531, file: !532, line: 48, baseType: !113, size: 32, offset: 32)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !532, line: 38, size: 64, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !542, file: !532, line: 39, baseType: !535, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !542, file: !532, line: 41, baseType: !546, size: 32, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !532, line: 35, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !116}
!550 = !{!551, !557, !565, !523, !567, !577}
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "latency_lock", scope: !525, file: !553, line: 44, type: !554, isLocal: true, isDefinition: true)
!553 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !236, line: 43, size: 32, elements: !555)
!555 = !{!556}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !554, file: !236, line: 52, baseType: !22, size: 32)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !525, file: !553, line: 46, type: !559, isLocal: true, isDefinition: true)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !473, line: 40, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !473, line: 35, size: 64, elements: !561)
!561 = !{!562, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !560, file: !473, line: 36, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !560, file: !473, line: 37, baseType: !563, size: 32, offset: 32)
!565 = !DIGlobalVariableExpression(var: !566, expr: !DIExpression())
!566 = distinct !DIGlobalVariable(name: "latency_subs", scope: !525, file: !553, line: 52, type: !559, isLocal: true, isDefinition: true)
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !525, file: !553, line: 39, type: !569, isLocal: true, isDefinition: true)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !570, elements: !575)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !553, line: 35, size: 96, elements: !571)
!571 = !{!572, !573, !574}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !570, file: !553, line: 36, baseType: !455, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !570, file: !553, line: 37, baseType: !169, size: 8, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !570, file: !553, line: 38, baseType: !331, size: 32, offset: 64)
!575 = !{!576}
!576 = !DISubrange(count: 0)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !525, file: !553, line: 48, type: !116, isLocal: true, isDefinition: true)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !581, file: !588, line: 47, type: !602, isLocal: true, isDefinition: true)
!581 = distinct !DICompileUnit(language: DW_LANG_C99, file: !582, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !583, retainedTypes: !584, globals: !585, splitDebugInlining: false, nameTableKind: None)
!582 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/metairq_dispatch")
!583 = !{!455}
!584 = !{!111, !105}
!585 = !{!586, !579, !598}
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "cpus_states", scope: !581, file: !588, line: 50, type: !589, isLocal: true, isDefinition: true)
!588 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 32, elements: !488)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !456, line: 114, size: 128, elements: !593)
!593 = !{!594, !595, !596, !597}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !592, file: !456, line: 115, baseType: !455, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !592, file: !456, line: 141, baseType: !169, size: 8, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !592, file: !456, line: 149, baseType: !113, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !592, file: !456, line: 156, baseType: !113, size: 32, offset: 96)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !581, file: !588, line: 55, type: !600, isLocal: true, isDefinition: true)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 8, elements: !488)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, elements: !575)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !605, file: !612, line: 17, type: !736, isLocal: false, isDefinition: true)
!605 = distinct !DICompileUnit(language: DW_LANG_C99, file: !606, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !607, globals: !608, splitDebugInlining: false, nameTableKind: None)
!606 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/metairq_dispatch")
!607 = !{!111, !105, !113, !104}
!608 = !{!603, !609, !732}
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !611, file: !612, line: 198, type: !720, isLocal: true, isDefinition: true)
!611 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !612, file: !612, line: 175, type: !613, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !605, retainedNodes: !717)
!612 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!613 = !DISubroutineType(types: !614)
!614 = !{null, !615}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 32)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !127, line: 245, size: 1024, elements: !617)
!617 = !{!618, !676, !688, !689, !690, !691, !697, !712}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !616, file: !127, line: 247, baseType: !619, size: 384)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !127, line: 57, size: 384, elements: !620)
!620 = !{!621, !645, !652, !653, !654, !663, !664, !665}
!621 = !DIDerivedType(tag: DW_TAG_member, scope: !619, file: !127, line: 60, baseType: !622, size: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !619, file: !127, line: 60, size: 64, elements: !623)
!623 = !{!624, !639}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !622, file: !127, line: 61, baseType: !625, size: 64)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !137, line: 49, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !137, line: 37, size: 64, elements: !627)
!627 = !{!628, !634}
!628 = !DIDerivedType(tag: DW_TAG_member, scope: !626, file: !137, line: 38, baseType: !629, size: 32)
!629 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !626, file: !137, line: 38, size: 32, elements: !630)
!630 = !{!631, !633}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !629, file: !137, line: 39, baseType: !632, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !629, file: !137, line: 40, baseType: !632, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, scope: !626, file: !137, line: 42, baseType: !635, size: 32, offset: 32)
!635 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !626, file: !137, line: 42, size: 32, elements: !636)
!636 = !{!637, !638}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !635, file: !137, line: 43, baseType: !632, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !635, file: !137, line: 44, baseType: !632, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !622, file: !127, line: 62, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !153, line: 49, size: 64, elements: !641)
!641 = !{!642}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !640, file: !153, line: 50, baseType: !643, size: 64)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 64, elements: !158)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !619, file: !127, line: 68, baseType: !646, size: 32, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !163, line: 233, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !163, line: 231, size: 64, elements: !649)
!649 = !{!650}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !648, file: !163, line: 232, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !137, line: 48, baseType: !626)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !619, file: !127, line: 71, baseType: !169, size: 8, offset: 96)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !619, file: !127, line: 74, baseType: !169, size: 8, offset: 104)
!654 = !DIDerivedType(tag: DW_TAG_member, scope: !619, file: !127, line: 90, baseType: !655, size: 16, offset: 112)
!655 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !619, file: !127, line: 90, size: 16, elements: !656)
!656 = !{!657, !662}
!657 = !DIDerivedType(tag: DW_TAG_member, scope: !655, file: !127, line: 91, baseType: !658, size: 16)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !655, file: !127, line: 91, size: 16, elements: !659)
!659 = !{!660, !661}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !658, file: !127, line: 96, baseType: !179, size: 8)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !658, file: !127, line: 97, baseType: !169, size: 8, offset: 8)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !655, file: !127, line: 100, baseType: !183, size: 16)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !619, file: !127, line: 107, baseType: !113, size: 32, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !619, file: !127, line: 127, baseType: !104, size: 32, offset: 160)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !619, file: !127, line: 131, baseType: !666, size: 192, offset: 192)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !163, line: 244, size: 192, elements: !667)
!667 = !{!668, !669, !675}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !666, file: !163, line: 245, baseType: !625, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !666, file: !163, line: 246, baseType: !670, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !163, line: 242, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !674}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !666, file: !163, line: 249, baseType: !109, size: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !616, file: !127, line: 250, baseType: !677, size: 288, offset: 384)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !200, line: 25, size: 288, elements: !678)
!678 = !{!679, !680, !681, !682, !683, !684, !685, !686, !687}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !677, file: !200, line: 26, baseType: !113, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !677, file: !200, line: 27, baseType: !113, size: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !677, file: !200, line: 28, baseType: !113, size: 32, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !677, file: !200, line: 29, baseType: !113, size: 32, offset: 96)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !677, file: !200, line: 30, baseType: !113, size: 32, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !677, file: !200, line: 31, baseType: !113, size: 32, offset: 160)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !677, file: !200, line: 32, baseType: !113, size: 32, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !677, file: !200, line: 33, baseType: !113, size: 32, offset: 224)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !677, file: !200, line: 34, baseType: !113, size: 32, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !616, file: !127, line: 253, baseType: !104, size: 32, offset: 672)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !616, file: !127, line: 256, baseType: !647, size: 64, offset: 704)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !616, file: !127, line: 294, baseType: !105, size: 32, offset: 768)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !616, file: !127, line: 300, baseType: !692, size: 96, offset: 800)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !127, line: 149, size: 96, elements: !693)
!693 = !{!694, !695, !696}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !692, file: !127, line: 153, baseType: !22, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !692, file: !127, line: 162, baseType: !111, size: 32, offset: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !692, file: !127, line: 168, baseType: !111, size: 32, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !616, file: !127, line: 325, baseType: !698, size: 32, offset: 896)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !122, line: 5073, size: 192, elements: !700)
!700 = !{!701, !707, !708}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !699, file: !122, line: 5074, baseType: !702, size: 96)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !226, line: 56, size: 96, elements: !703)
!703 = !{!704, !705, !706}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !702, file: !226, line: 57, baseType: !229, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !702, file: !226, line: 58, baseType: !104, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !702, file: !226, line: 59, baseType: !111, size: 32, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !699, file: !122, line: 5075, baseType: !647, size: 64, offset: 96)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !699, file: !122, line: 5076, baseType: !709, size: 32, offset: 160)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !236, line: 43, size: 32, elements: !710)
!710 = !{!711}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !709, file: !236, line: 52, baseType: !22, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !616, file: !127, line: 343, baseType: !713, size: 64, offset: 928)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !200, line: 60, size: 64, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !713, file: !200, line: 63, baseType: !113, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !713, file: !200, line: 66, baseType: !113, size: 32, offset: 32)
!717 = !{!718, !719}
!718 = !DILocalVariable(name: "thread", arg: 1, scope: !611, file: !612, line: 175, type: !615)
!719 = !DILocalVariable(name: "region_num", scope: !611, file: !612, line: 200, type: !169)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !721, elements: !575)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !722, line: 52, size: 96, elements: !723)
!722 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!723 = !{!724, !725, !726}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !721, file: !722, line: 53, baseType: !22, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !721, file: !722, line: 54, baseType: !111, size: 32, offset: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !721, file: !722, line: 55, baseType: !727, size: 32, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !728, line: 151, baseType: !729)
!728 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !728, line: 149, size: 32, elements: !730)
!730 = !{!731}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !729, file: !728, line: 150, baseType: !113, size: 32)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "static_regions", scope: !605, file: !612, line: 62, type: !734, isLocal: true, isDefinition: true)
!734 = !DICompositeType(tag: DW_TAG_array_type, baseType: !735, size: 96, elements: !488)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !721)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !348, line: 16, size: 64, elements: !738)
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !737, file: !348, line: 17, baseType: !269, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !737, file: !348, line: 18, baseType: !169, size: 8, offset: 32)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !743, file: !777, line: 39, type: !169, isLocal: true, isDefinition: true)
!743 = distinct !DICompileUnit(language: DW_LANG_C99, file: !744, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !745, globals: !776, splitDebugInlining: false, nameTableKind: None)
!744 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/metairq_dispatch")
!745 = !{!746, !104, !105, !764, !169}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !748, line: 1226, baseType: !749)
!748 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !748, line: 1213, size: 352, elements: !750)
!750 = !{!751, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !749, file: !748, line: 1215, baseType: !752, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !749, file: !748, line: 1216, baseType: !753, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !749, file: !748, line: 1217, baseType: !753, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !749, file: !748, line: 1218, baseType: !753, size: 32, offset: 96)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !749, file: !748, line: 1219, baseType: !753, size: 32, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !749, file: !748, line: 1220, baseType: !753, size: 32, offset: 160)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !749, file: !748, line: 1221, baseType: !753, size: 32, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !749, file: !748, line: 1222, baseType: !753, size: 32, offset: 224)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !749, file: !748, line: 1223, baseType: !753, size: 32, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !749, file: !748, line: 1224, baseType: !753, size: 32, offset: 288)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !749, file: !748, line: 1225, baseType: !753, size: 32, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !767, line: 27, size: 96, elements: !768)
!767 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!768 = !{!769, !770, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !766, file: !767, line: 29, baseType: !113, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !766, file: !767, line: 31, baseType: !269, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !766, file: !767, line: 37, baseType: !772, size: 32, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !728, line: 146, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !728, line: 141, size: 32, elements: !774)
!774 = !{!775}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !773, file: !728, line: 143, baseType: !113, size: 32)
!776 = !{!741}
!777 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !780, file: !787, line: 21, type: !447, isLocal: true, isDefinition: true)
!780 = distinct !DICompileUnit(language: DW_LANG_C99, file: !781, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !782, globals: !786, splitDebugInlining: false, nameTableKind: None)
!781 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/metairq_dispatch")
!782 = !{!783, !105, !104}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !785, line: 22, baseType: !105)
!785 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!786 = !{!778}
!787 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!788 = !DIGlobalVariableExpression(var: !789, expr: !DIExpression())
!789 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !790, file: !795, line: 13, type: !812, isLocal: true, isDefinition: true)
!790 = distinct !DICompileUnit(language: DW_LANG_C99, file: !791, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !792, splitDebugInlining: false, nameTableKind: None)
!791 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/metairq_dispatch")
!792 = !{!793, !788}
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "mpu_config", scope: !790, file: !795, line: 37, type: !796, isLocal: false, isDefinition: true)
!795 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!796 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !767, line: 41, size: 64, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !797, file: !767, line: 43, baseType: !113, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !797, file: !767, line: 45, baseType: !801, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !767, line: 27, size: 96, elements: !804)
!804 = !{!805, !806, !807}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !803, file: !767, line: 29, baseType: !113, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !803, file: !767, line: 31, baseType: !269, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !803, file: !767, line: 37, baseType: !808, size: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !728, line: 146, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !728, line: 141, size: 32, elements: !810)
!810 = !{!811}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !809, file: !728, line: 143, baseType: !113, size: 32)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 192, elements: !158)
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !815, file: !971, line: 48, type: !988, isLocal: false, isDefinition: true)
!815 = distinct !DICompileUnit(language: DW_LANG_C99, file: !816, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !817, globals: !968, splitDebugInlining: false, nameTableKind: None)
!816 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/metairq_dispatch")
!817 = !{!818, !169, !104, !105, !892, !113, !893, !927, !938}
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !820, line: 882, baseType: !821)
!820 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !820, line: 850, size: 19456, elements: !822)
!822 = !{!823, !827, !828, !829, !833, !834, !836, !837, !838, !842, !843, !844, !848, !849, !853, !854, !858, !859, !863, !864, !865, !866, !867, !868, !872, !873, !877, !878, !882}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !821, file: !820, line: 851, baseType: !824, size: 960)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 960, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 30)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !821, file: !820, line: 852, baseType: !753, size: 32, offset: 960)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !821, file: !820, line: 853, baseType: !753, size: 32, offset: 992)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !821, file: !820, line: 854, baseType: !830, size: 1088, offset: 1024)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 1088, elements: !831)
!831 = !{!832}
!832 = !DISubrange(count: 34)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !821, file: !820, line: 855, baseType: !753, size: 32, offset: 2112)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !821, file: !820, line: 856, baseType: !835, size: 64, offset: 2144)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 64, elements: !158)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !821, file: !820, line: 857, baseType: !753, size: 32, offset: 2208)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !821, file: !820, line: 858, baseType: !753, size: 32, offset: 2240)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !821, file: !820, line: 859, baseType: !839, size: 3904, offset: 2272)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 3904, elements: !840)
!840 = !{!841}
!841 = !DISubrange(count: 122)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !821, file: !820, line: 860, baseType: !753, size: 32, offset: 6176)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !821, file: !820, line: 861, baseType: !753, size: 32, offset: 6208)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !821, file: !820, line: 862, baseType: !845, size: 1952, offset: 6240)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 1952, elements: !846)
!846 = !{!847}
!847 = !DISubrange(count: 61)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !821, file: !820, line: 863, baseType: !753, size: 32, offset: 8192)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !821, file: !820, line: 864, baseType: !850, size: 288, offset: 8224)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 288, elements: !851)
!851 = !{!852}
!852 = !DISubrange(count: 9)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !821, file: !820, line: 865, baseType: !752, size: 32, offset: 8512)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !821, file: !820, line: 866, baseType: !855, size: 1696, offset: 8544)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 1696, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 53)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !821, file: !820, line: 867, baseType: !753, size: 32, offset: 10240)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !821, file: !820, line: 868, baseType: !860, size: 96, offset: 10272)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 96, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 3)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !821, file: !820, line: 869, baseType: !753, size: 32, offset: 10368)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !821, file: !820, line: 870, baseType: !835, size: 64, offset: 10400)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !821, file: !820, line: 871, baseType: !753, size: 32, offset: 10464)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !821, file: !820, line: 872, baseType: !753, size: 32, offset: 10496)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !821, file: !820, line: 873, baseType: !753, size: 32, offset: 10528)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !821, file: !820, line: 875, baseType: !869, size: 352, offset: 10560)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 352, elements: !870)
!870 = !{!871}
!871 = !DISubrange(count: 11)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !821, file: !820, line: 876, baseType: !753, size: 32, offset: 10912)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !821, file: !820, line: 878, baseType: !874, size: 256, offset: 10944)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 256, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 8)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !821, file: !820, line: 879, baseType: !753, size: 32, offset: 11200)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !821, file: !820, line: 880, baseType: !879, size: 7200, offset: 11232)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 7200, elements: !880)
!880 = !{!881}
!881 = !DISubrange(count: 225)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !821, file: !820, line: 881, baseType: !883, size: 1024, offset: 18432)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !884, size: 1024, elements: !875)
!884 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !885)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !820, line: 258, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !820, line: 252, size: 128, elements: !887)
!887 = !{!888, !889, !890, !891}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !886, file: !820, line: 253, baseType: !753, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !886, file: !820, line: 254, baseType: !753, size: 32, offset: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !886, file: !820, line: 255, baseType: !753, size: 32, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !886, file: !820, line: 257, baseType: !752, size: 32, offset: 96)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !748, line: 468, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !748, line: 445, size: 1120, elements: !896)
!896 = !{!897, !898, !899, !900, !901, !902, !903, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !920, !924, !926}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !895, file: !748, line: 447, baseType: !752, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !895, file: !748, line: 448, baseType: !753, size: 32, offset: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !895, file: !748, line: 449, baseType: !753, size: 32, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !895, file: !748, line: 450, baseType: !753, size: 32, offset: 96)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !895, file: !748, line: 451, baseType: !753, size: 32, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !895, file: !748, line: 452, baseType: !753, size: 32, offset: 160)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !895, file: !748, line: 453, baseType: !904, size: 96, offset: 192)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !905, size: 96, elements: !906)
!905 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !169)
!906 = !{!907}
!907 = !DISubrange(count: 12)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !895, file: !748, line: 454, baseType: !753, size: 32, offset: 288)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !895, file: !748, line: 455, baseType: !753, size: 32, offset: 320)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !895, file: !748, line: 456, baseType: !753, size: 32, offset: 352)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !895, file: !748, line: 457, baseType: !753, size: 32, offset: 384)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !895, file: !748, line: 458, baseType: !753, size: 32, offset: 416)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !895, file: !748, line: 459, baseType: !753, size: 32, offset: 448)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !895, file: !748, line: 460, baseType: !753, size: 32, offset: 480)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !895, file: !748, line: 461, baseType: !835, size: 64, offset: 512)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !895, file: !748, line: 462, baseType: !752, size: 32, offset: 576)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !895, file: !748, line: 463, baseType: !752, size: 32, offset: 608)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !895, file: !748, line: 464, baseType: !919, size: 128, offset: 640)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 128, elements: !313)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !895, file: !748, line: 465, baseType: !921, size: 160, offset: 768)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 160, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 5)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !895, file: !748, line: 466, baseType: !925, size: 160, offset: 928)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 160, elements: !922)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !895, file: !748, line: 467, baseType: !753, size: 32, offset: 1088)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !929, file: !928, line: 167, baseType: !937)
!928 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!929 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !928, file: !928, line: 134, type: !930, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !815, retainedNodes: !932)
!930 = !DISubroutineType(types: !931)
!931 = !{null, !113}
!932 = !{!933, !934, !936}
!933 = !DILocalVariable(name: "time_us", arg: 1, scope: !929, file: !928, line: 134, type: !113)
!934 = !DILocalVariable(name: "delay_cycles", scope: !929, file: !928, line: 168, type: !935)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!936 = !DILocalVariable(name: "cycles", scope: !929, file: !928, line: 171, type: !113)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !820, line: 2140, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !820, line: 2119, size: 10880, elements: !941)
!941 = !{!942, !946, !947, !951, !952, !957, !958, !959, !960, !964, !965, !966, !967}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !940, file: !820, line: 2120, baseType: !943, size: 8192)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 8192, elements: !944)
!944 = !{!945}
!945 = !DISubrange(count: 256)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !940, file: !820, line: 2121, baseType: !752, size: 32, offset: 8192)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !940, file: !820, line: 2122, baseType: !948, size: 2048, offset: 8224)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 2048, elements: !949)
!949 = !{!950}
!950 = !DISubrange(count: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !940, file: !820, line: 2123, baseType: !753, size: 32, offset: 10272)
!952 = !DIDerivedType(tag: DW_TAG_member, scope: !940, file: !820, line: 2125, baseType: !953, size: 32, offset: 10304)
!953 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !940, file: !820, line: 2125, size: 32, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !953, file: !820, line: 2126, baseType: !753, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !953, file: !820, line: 2127, baseType: !753, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !940, file: !820, line: 2130, baseType: !753, size: 32, offset: 10336)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !940, file: !820, line: 2131, baseType: !753, size: 32, offset: 10368)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !940, file: !820, line: 2133, baseType: !753, size: 32, offset: 10400)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !940, file: !820, line: 2135, baseType: !961, size: 320, offset: 10432)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 320, elements: !962)
!962 = !{!963}
!963 = !DISubrange(count: 10)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !940, file: !820, line: 2136, baseType: !753, size: 32, offset: 10752)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !940, file: !820, line: 2137, baseType: !752, size: 32, offset: 10784)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !940, file: !820, line: 2138, baseType: !753, size: 32, offset: 10816)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !940, file: !820, line: 2139, baseType: !753, size: 32, offset: 10848)
!968 = !{!813, !969, !984}
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !815, file: !971, line: 93, type: !972, isLocal: true, isDefinition: true, align: 32)
!971 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !974, line: 51, size: 64, elements: !975)
!974 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!975 = !{!976, !983}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !973, file: !974, line: 60, baseType: !977, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 32)
!978 = !DISubroutineType(types: !979)
!979 = !{!105, !980}
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !982)
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !974, line: 48, flags: DIFlagFwdDecl)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !973, file: !974, line: 65, baseType: !980, size: 32, offset: 32)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !929, file: !928, line: 161, type: !986, isLocal: true, isDefinition: true, align: 128)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !987, size: 48, elements: !861)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !348, line: 16, size: 64, elements: !990)
!990 = !{!991, !992}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !989, file: !348, line: 17, baseType: !269, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !989, file: !348, line: 18, baseType: !169, size: 8, offset: 32)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(name: "log_const_clock_control", scope: !995, file: !1219, line: 18, type: !1453, isLocal: false, isDefinition: true)
!995 = distinct !DICompileUnit(language: DW_LANG_C99, file: !996, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !997, retainedTypes: !1130, globals: !1215, splitDebugInlining: false, nameTableKind: None)
!996 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/metairq_dispatch")
!997 = !{!998, !1004, !30, !1009, !1014, !1021, !1027, !1033, !1042, !1046, !1095, !1102, !1121}
!998 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !999, line: 23, baseType: !32, size: 32, elements: !1000)
!999 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1000 = !{!1001, !1002, !1003}
!1001 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!1002 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!1003 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!1004 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !999, line: 48, baseType: !32, size: 32, elements: !1005)
!1005 = !{!1006, !1007, !1008}
!1006 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!1007 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
