; ModuleID = 'build/arduino_due/sensor/bme280/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.1, i8*, i32 }
%union.anon.1 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer.16 = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon.1 }
%struct.mpsc_pbuf_buffer_config.17 = type { i32*, i32, void (%struct.mpsc_pbuf_buffer.16*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }
%union.log_msg_generic = type { %struct.log_msg }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bme280/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bme280")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bme280")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !27, file: !107, line: 18, type: !109, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !37, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bme280")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !{!22, !38, !24, !39, !41, !43, !47, !49, !50, !51, !53, !55, !56, !57, !60, !62, !74, !58, !75, !85, !44}
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 32)
!40 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 32)
!42 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !48, line: 214, baseType: !32)
!48 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!49 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 32)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 32)
!52 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!54 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !59)
!59 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !61)
!61 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 32)
!63 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !64, line: 78, size: 32, elements: !65)
!64 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!65 = !{!66, !73}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !63, file: !64, line: 80, baseType: !67, size: 32)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !64, line: 45, size: 32, elements: !68)
!68 = !{!69, !70, !71, !72}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !67, file: !64, line: 47, baseType: !58, size: 8)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !67, file: !64, line: 50, baseType: !58, size: 8, offset: 8)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !67, file: !64, line: 53, baseType: !58, size: 8, offset: 16)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !67, file: !64, line: 56, baseType: !58, size: 8, offset: 24)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !63, file: !64, line: 82, baseType: !38, size: 32)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !77)
!77 = !{!78, !96, !100}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !76, file: !31, line: 89, baseType: !79, size: 96)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !80)
!80 = !{!81, !93, !94}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !79, file: !31, line: 67, baseType: !82, size: 32)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !83)
!83 = !{!84, !86, !87, !88, !89, !90, !91, !92}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !82, file: !31, line: 52, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !82, file: !31, line: 52, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !82, file: !31, line: 52, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !82, file: !31, line: 53, baseType: !85, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !82, file: !31, line: 54, baseType: !85, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !82, file: !31, line: 55, baseType: !85, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !82, file: !31, line: 56, baseType: !85, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !82, file: !31, line: 57, baseType: !85, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !79, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !79, file: !31, line: 76, baseType: !95, size: 32, offset: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !85)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !76, file: !31, line: 93, baseType: !97, size: 32, offset: 96)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 4)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !76, file: !31, line: 94, baseType: !101, offset: 128)
!101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, elements: !102)
!102 = !{!103}
!103 = !DISubrange(count: -1)
!104 = !{!25, !105}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !107, line: 18, type: !108, isLocal: true, isDefinition: true)
!107 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !111, line: 16, size: 64, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !114}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !110, file: !111, line: 17, baseType: !44, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !110, file: !111, line: 18, baseType: !58, size: 8, offset: 32)
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "_char_out", scope: !117, file: !192, line: 54, type: !193, isLocal: false, isDefinition: true)
!117 = distinct !DICompileUnit(language: DW_LANG_C99, file: !118, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !119, retainedTypes: !190, globals: !191, splitDebugInlining: false, nameTableKind: None)
!118 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bme280")
!119 = !{!120}
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !121, line: 27, baseType: !32, size: 32, elements: !122)
!121 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189}
!123 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!124 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!125 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!126 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!127 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!128 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!129 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!130 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!131 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!132 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!133 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!134 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!135 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!136 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!137 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!138 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!139 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!140 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!141 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!142 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!143 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!144 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!145 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!146 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!147 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!148 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!149 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!150 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!151 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!152 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!153 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!154 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!155 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!156 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!157 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!158 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!159 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!160 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!161 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!162 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!163 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!164 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!165 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!166 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!167 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!168 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!169 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!170 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!171 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!172 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!173 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!174 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!175 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!176 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!177 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!178 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!179 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!180 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!181 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!182 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!183 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!184 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!185 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!186 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!187 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!188 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!189 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!190 = !{!38, !49}
!191 = !{!115}
!192 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!49, !49}
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !198, file: !263, line: 235, type: !264, isLocal: true, isDefinition: true, align: 32)
!198 = distinct !DICompileUnit(language: DW_LANG_C99, file: !199, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !119, retainedTypes: !200, globals: !262, splitDebugInlining: false, nameTableKind: None)
!199 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bme280")
!200 = !{!38, !49, !201, !212}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !203, line: 46, baseType: !204)
!203 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !203, line: 41, size: 128, elements: !205)
!205 = !{!206, !208, !209, !211}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !204, file: !203, line: 42, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !85)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !204, file: !203, line: 43, baseType: !207, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !204, file: !203, line: 44, baseType: !210, size: 32, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !204, file: !203, line: 45, baseType: !210, size: 32, offset: 96)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !214, line: 75, baseType: !215)
!214 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 41, size: 2176, elements: !216)
!216 = !{!217, !218, !219, !220, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !240, !244, !245, !246, !247, !248, !249, !250, !251, !255, !256, !257, !258, !259, !260, !261}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !215, file: !214, line: 42, baseType: !207, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !215, file: !214, line: 43, baseType: !207, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !215, file: !214, line: 44, baseType: !210, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !215, file: !214, line: 45, baseType: !221, size: 32, offset: 96)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 32, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 1)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !215, file: !214, line: 46, baseType: !207, size: 32, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !215, file: !214, line: 47, baseType: !207, size: 32, offset: 160)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !215, file: !214, line: 48, baseType: !210, size: 32, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !215, file: !214, line: 49, baseType: !207, size: 32, offset: 224)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !215, file: !214, line: 50, baseType: !207, size: 32, offset: 256)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !215, file: !214, line: 51, baseType: !210, size: 32, offset: 288)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !215, file: !214, line: 52, baseType: !207, size: 32, offset: 320)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !215, file: !214, line: 53, baseType: !221, size: 32, offset: 352)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !215, file: !214, line: 54, baseType: !207, size: 32, offset: 384)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !215, file: !214, line: 55, baseType: !221, size: 32, offset: 416)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !215, file: !214, line: 56, baseType: !207, size: 32, offset: 448)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !215, file: !214, line: 57, baseType: !221, size: 32, offset: 480)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !215, file: !214, line: 58, baseType: !237, size: 96, offset: 512)
!237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 96, elements: !238)
!238 = !{!239}
!239 = !DISubrange(count: 3)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !215, file: !214, line: 59, baseType: !241, size: 160, offset: 608)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 160, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 5)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !215, file: !214, line: 60, baseType: !207, size: 32, offset: 768)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !215, file: !214, line: 61, baseType: !207, size: 32, offset: 800)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !215, file: !214, line: 62, baseType: !210, size: 32, offset: 832)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !215, file: !214, line: 63, baseType: !210, size: 32, offset: 864)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !215, file: !214, line: 64, baseType: !207, size: 32, offset: 896)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !215, file: !214, line: 65, baseType: !207, size: 32, offset: 928)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !215, file: !214, line: 66, baseType: !207, size: 32, offset: 960)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !215, file: !214, line: 67, baseType: !252, size: 832, offset: 992)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !210, size: 832, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 26)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !215, file: !214, line: 68, baseType: !207, size: 32, offset: 1824)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !215, file: !214, line: 69, baseType: !210, size: 32, offset: 1856)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !215, file: !214, line: 70, baseType: !241, size: 160, offset: 1888)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !215, file: !214, line: 71, baseType: !207, size: 32, offset: 2048)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !215, file: !214, line: 72, baseType: !207, size: 32, offset: 2080)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !215, file: !214, line: 73, baseType: !210, size: 32, offset: 2112)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !215, file: !214, line: 74, baseType: !207, size: 32, offset: 2144)
!262 = !{!196}
!263 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!264 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !266, line: 51, size: 64, elements: !267)
!266 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!267 = !{!268, !294}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !265, file: !266, line: 60, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DISubroutineType(types: !271)
!271 = !{!49, !272}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !275, line: 378, size: 192, elements: !276)
!275 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!276 = !{!277, !278, !279, !280, !287, !288}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !274, file: !275, line: 380, baseType: !44, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !274, file: !275, line: 382, baseType: !13, size: 32, offset: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !274, file: !275, line: 384, baseType: !13, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !274, file: !275, line: 386, baseType: !281, size: 32, offset: 96)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 32)
!282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !275, line: 351, size: 16, elements: !283)
!283 = !{!284, !285}
!284 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !282, file: !275, line: 359, baseType: !58, size: 8)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !282, file: !275, line: 364, baseType: !286, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!286 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !274, file: !275, line: 388, baseType: !38, size: 32, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !274, file: !275, line: 396, baseType: !289, size: 32, offset: 160)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !275, line: 43, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !293)
!293 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !265, file: !266, line: 65, baseType: !272, size: 32, offset: 32)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "log_const_log", scope: !297, file: !378, line: 25, type: !618, isLocal: false, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !299, retainedTypes: !305, globals: !375, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bme280")
!299 = !{!300, !30, !120}
!300 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !301, line: 33, baseType: !32, size: 32, elements: !302)
!301 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!302 = !{!303, !304}
!303 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!304 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!305 = !{!47, !49, !38, !306, !74, !317, !58, !318, !85, !339, !22, !24, !366, !369, !371, !373}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !64, line: 78, size: 32, elements: !308)
!308 = !{!309, !316}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !307, file: !64, line: 80, baseType: !310, size: 32)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !64, line: 45, size: 32, elements: !311)
!311 = !{!312, !313, !314, !315}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !310, file: !64, line: 47, baseType: !58, size: 8)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !310, file: !64, line: 50, baseType: !58, size: 8, offset: 8)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !310, file: !64, line: 53, baseType: !58, size: 8, offset: 16)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !310, file: !64, line: 56, baseType: !58, size: 8, offset: 24)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !307, file: !64, line: 82, baseType: !38, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !320)
!320 = !{!321, !337, !338}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !319, file: !31, line: 89, baseType: !322, size: 96)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !323)
!323 = !{!324, !335, !336}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !322, file: !31, line: 67, baseType: !325, size: 32)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !326)
!326 = !{!327, !328, !329, !330, !331, !332, !333, !334}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !325, file: !31, line: 52, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !325, file: !31, line: 52, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !325, file: !31, line: 52, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !325, file: !31, line: 53, baseType: !85, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !325, file: !31, line: 54, baseType: !85, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !325, file: !31, line: 55, baseType: !85, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !325, file: !31, line: 56, baseType: !85, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !325, file: !31, line: 57, baseType: !85, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !322, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !322, file: !31, line: 76, baseType: !95, size: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !319, file: !31, line: 93, baseType: !97, size: 32, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !319, file: !31, line: 94, baseType: !101, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !341)
!341 = !{!342, !359, !365}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !340, file: !31, line: 112, baseType: !343, size: 32)
!343 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !344, line: 49, size: 32, elements: !345)
!344 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_packet.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!345 = !{!346, !352, !358}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !343, file: !344, line: 50, baseType: !347, size: 32)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !344, line: 37, size: 32, elements: !348)
!348 = !{!349, !350, !351}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !347, file: !344, line: 38, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !347, file: !344, line: 38, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !347, file: !344, line: 39, baseType: !85, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !343, file: !344, line: 51, baseType: !353, size: 32)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !344, line: 43, size: 32, elements: !354)
!354 = !{!355, !356, !357}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !353, file: !344, line: 44, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !353, file: !344, line: 44, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !353, file: !344, line: 45, baseType: !85, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !343, file: !344, line: 52, baseType: !85, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !340, file: !31, line: 113, baseType: !360, size: 32)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !361)
!361 = !{!362, !363, !364}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !360, file: !31, line: 108, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !360, file: !31, line: 108, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !360, file: !31, line: 108, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !340, file: !31, line: 114, baseType: !319, size: 128)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !367, line: 46, baseType: !368)
!367 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !54)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !370)
!370 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !340)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !319)
!375 = !{!295, !376, !405, !418, !420, !422, !426, !428, !430, !432, !434, !436, !442, !475, !478, !487, !579, !606, !613, !615, !623, !633, !638, !653, !657}
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "log_process_thread_sem", scope: !297, file: !378, line: 93, type: !379, isLocal: false, isDefinition: true, align: 32)
!378 = !DIFile(filename: "zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !380, line: 2909, size: 128, elements: !381)
!380 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!381 = !{!382, !403, !404}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !379, file: !380, line: 2910, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !384, line: 233, baseType: !385)
!384 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !384, line: 231, size: 64, elements: !386)
!386 = !{!387}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !385, file: !384, line: 232, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !389, line: 48, baseType: !390)
!389 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !389, line: 37, size: 64, elements: !391)
!391 = !{!392, !398}
!392 = !DIDerivedType(tag: DW_TAG_member, scope: !390, file: !389, line: 38, baseType: !393, size: 32)
!393 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !390, file: !389, line: 38, size: 32, elements: !394)
!394 = !{!395, !397}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !393, file: !389, line: 39, baseType: !396, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !393, file: !389, line: 40, baseType: !396, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, scope: !390, file: !389, line: 42, baseType: !399, size: 32, offset: 32)
!399 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !390, file: !389, line: 42, size: 32, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !399, file: !389, line: 43, baseType: !396, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !399, file: !389, line: 44, baseType: !396, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !379, file: !380, line: 2911, baseType: !32, size: 32, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !379, file: !380, line: 2912, baseType: !32, size: 32, offset: 96)
!405 = !DIGlobalVariableExpression(var: !406, expr: !DIExpression())
!406 = distinct !DIGlobalVariable(name: "__init_enable_logger", scope: !297, file: !378, line: 910, type: !407, isLocal: true, isDefinition: true, align: 32)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !408)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !266, line: 51, size: 64, elements: !409)
!409 = !{!410, !417}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !408, file: !266, line: 60, baseType: !411, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = !DISubroutineType(types: !413)
!413 = !{!49, !414}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !266, line: 48, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !408, file: !266, line: 65, baseType: !414, size: 32, offset: 32)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "panic_mode", scope: !297, file: !378, line: 96, type: !286, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "backend_attached", scope: !297, file: !378, line: 97, type: !286, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "buffered_cnt", scope: !297, file: !378, line: 98, type: !424, isLocal: true, isDefinition: true)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !425, line: 22, baseType: !52)
!425 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "dropped_cnt", scope: !297, file: !378, line: 99, type: !424, isLocal: true, isDefinition: true)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "timestamp_freq", scope: !297, file: !378, line: 105, type: !85, isLocal: true, isDefinition: true)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "prev_timestamp", scope: !297, file: !378, line: 107, type: !95, isLocal: true, isDefinition: true)
!432 = !DIGlobalVariableExpression(var: !433, expr: !DIExpression())
!433 = distinct !DIGlobalVariable(name: "unordered_cnt", scope: !297, file: !378, line: 108, type: !424, isLocal: true, isDefinition: true)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "last_failure_report", scope: !297, file: !378, line: 109, type: !369, isLocal: true, isDefinition: true)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "log_msg_ptr", scope: !297, file: !378, line: 111, type: !438, isLocal: true, isDefinition: true, align: 32)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_ptr", file: !439, line: 29, size: 32, elements: !440)
!439 = !DIFile(filename: "zephyr/include/zephyr/logging/log_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !438, file: !439, line: 30, baseType: !339, size: 32)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "log_buffer", scope: !297, file: !378, line: 112, type: !444, isLocal: true, isDefinition: true, align: 32)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !445, line: 87, size: 448, elements: !446)
!445 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_pbuf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!446 = !{!447, !448, !449, !450, !451, !452, !456, !465, !470, !472, !473, !474}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !444, file: !445, line: 89, baseType: !85, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !444, file: !445, line: 92, baseType: !85, size: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !444, file: !445, line: 95, baseType: !85, size: 32, offset: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !444, file: !445, line: 98, baseType: !85, size: 32, offset: 96)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !444, file: !445, line: 101, baseType: !85, size: 32, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !444, file: !445, line: 104, baseType: !453, offset: 160)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !454, line: 43, elements: !455)
!454 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!455 = !{}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !444, file: !445, line: 110, baseType: !457, size: 32, offset: 160)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !445, line: 83, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !461, !463}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !444, file: !445, line: 113, baseType: !466, size: 32, offset: 192)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !445, line: 75, baseType: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!468 = !DISubroutineType(types: !469)
!469 = !{!85, !463}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !444, file: !445, line: 116, baseType: !471, size: 32, offset: 224)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !444, file: !445, line: 119, baseType: !85, size: 32, offset: 256)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !444, file: !445, line: 122, baseType: !85, size: 32, offset: 288)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !444, file: !445, line: 124, baseType: !379, size: 128, offset: 320)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "curr_log_buffer", scope: !297, file: !378, line: 113, type: !477, isLocal: true, isDefinition: true)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 32)
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "logging_stack", scope: !297, file: !378, line: 884, type: !480, isLocal: false, isDefinition: true, align: 512)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !481, size: 6656, elements: !485)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !482, line: 47, size: 8, elements: !483)
!482 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!483 = !{!484}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !481, file: !482, line: 48, baseType: !46, size: 8)
!485 = !{!486}
!486 = !DISubrange(count: 832)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "logging_thread", scope: !297, file: !378, line: 885, type: !489, isLocal: false, isDefinition: true)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !490, line: 245, size: 1024, elements: !491)
!490 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!491 = !{!492, !537, !550, !551, !552, !553, !559, !574}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !489, file: !490, line: 247, baseType: !493, size: 384)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !490, line: 57, size: 384, elements: !494)
!494 = !{!495, !509, !511, !512, !513, !524, !525, !526}
!495 = !DIDerivedType(tag: DW_TAG_member, scope: !493, file: !490, line: 60, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !493, file: !490, line: 60, size: 64, elements: !497)
!497 = !{!498, !500}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !496, file: !490, line: 61, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !389, line: 49, baseType: !390)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !496, file: !490, line: 62, baseType: !501, size: 64)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !502, line: 49, size: 64, elements: !503)
!502 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!503 = !{!504}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !501, file: !502, line: 50, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 64, elements: !507)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 32)
!507 = !{!508}
!508 = !DISubrange(count: 2)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !493, file: !490, line: 68, baseType: !510, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !493, file: !490, line: 71, baseType: !58, size: 8, offset: 96)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !493, file: !490, line: 74, baseType: !58, size: 8, offset: 104)
!513 = !DIDerivedType(tag: DW_TAG_member, scope: !493, file: !490, line: 90, baseType: !514, size: 16, offset: 112)
!514 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !493, file: !490, line: 90, size: 16, elements: !515)
!515 = !{!516, !523}
!516 = !DIDerivedType(tag: DW_TAG_member, scope: !514, file: !490, line: 91, baseType: !517, size: 16)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !514, file: !490, line: 91, size: 16, elements: !518)
!518 = !{!519, !522}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !517, file: !490, line: 96, baseType: !520, size: 8)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !521)
!521 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !517, file: !490, line: 97, baseType: !58, size: 8, offset: 8)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !514, file: !490, line: 100, baseType: !60, size: 16)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !493, file: !490, line: 107, baseType: !85, size: 32, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !493, file: !490, line: 127, baseType: !38, size: 32, offset: 160)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !493, file: !490, line: 131, baseType: !527, size: 192, offset: 192)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !384, line: 244, size: 192, elements: !528)
!528 = !{!529, !530, !536}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !527, file: !384, line: 245, baseType: !499, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !527, file: !384, line: 246, baseType: !531, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !384, line: 242, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !527, file: !384, line: 249, baseType: !368, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !489, file: !490, line: 250, baseType: !538, size: 288, offset: 384)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !539, line: 25, size: 288, elements: !540)
!539 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!540 = !{!541, !542, !543, !544, !545, !546, !547, !548, !549}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !538, file: !539, line: 26, baseType: !85, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !538, file: !539, line: 27, baseType: !85, size: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !538, file: !539, line: 28, baseType: !85, size: 32, offset: 64)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !538, file: !539, line: 29, baseType: !85, size: 32, offset: 96)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !538, file: !539, line: 30, baseType: !85, size: 32, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !538, file: !539, line: 31, baseType: !85, size: 32, offset: 160)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !538, file: !539, line: 32, baseType: !85, size: 32, offset: 192)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !538, file: !539, line: 33, baseType: !85, size: 32, offset: 224)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !538, file: !539, line: 34, baseType: !85, size: 32, offset: 256)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !489, file: !490, line: 253, baseType: !38, size: 32, offset: 672)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !489, file: !490, line: 256, baseType: !383, size: 64, offset: 704)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !489, file: !490, line: 294, baseType: !49, size: 32, offset: 768)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !489, file: !490, line: 300, baseType: !554, size: 96, offset: 800)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !490, line: 149, size: 96, elements: !555)
!555 = !{!556, !557, !558}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !554, file: !490, line: 153, baseType: !22, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !554, file: !490, line: 162, baseType: !47, size: 32, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !554, file: !490, line: 168, baseType: !47, size: 32, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !489, file: !490, line: 325, baseType: !560, size: 32, offset: 896)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 32)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !380, line: 5073, size: 160, elements: !562)
!562 = !{!563, !572, !573}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !561, file: !380, line: 5074, baseType: !564, size: 96)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !565, line: 56, size: 96, elements: !566)
!565 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!566 = !{!567, !570, !571}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !564, file: !565, line: 57, baseType: !568, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!569 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !565, line: 57, flags: DIFlagFwdDecl)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !564, file: !565, line: 58, baseType: !38, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !564, file: !565, line: 59, baseType: !47, size: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !561, file: !380, line: 5075, baseType: !383, size: 64, offset: 96)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !561, file: !380, line: 5076, baseType: !453, offset: 160)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !489, file: !490, line: 343, baseType: !575, size: 64, offset: 928)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !539, line: 60, size: 64, elements: !576)
!576 = !{!577, !578}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !575, file: !539, line: 63, baseType: !85, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !575, file: !539, line: 66, baseType: !85, size: 32, offset: 32)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "format_table", scope: !297, file: !378, line: 72, type: !581, isLocal: true, isDefinition: true)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 128, elements: !98)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !583)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_format_func_t", file: !584, line: 105, baseType: !585)
!584 = !DIFile(filename: "zephyr/include/zephyr/logging/log_output.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !588, !318, !85}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !584, line: 89, size: 128, elements: !591)
!591 = !{!592, !597, !604, !605}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !590, file: !584, line: 90, baseType: !593, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_output_func_t", file: !584, line: 79, baseType: !594)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DISubroutineType(types: !596)
!596 = !{!49, !57, !47, !38}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !590, file: !584, line: 91, baseType: !598, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 32)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !584, line: 82, size: 96, elements: !600)
!600 = !{!601, !602, !603}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !599, file: !584, line: 83, baseType: !424, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !599, file: !584, line: 84, baseType: !38, size: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !599, file: !584, line: 85, baseType: !44, size: 32, offset: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !590, file: !584, line: 92, baseType: !57, size: 32, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !590, file: !584, line: 93, baseType: !47, size: 32, offset: 96)
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "timestamp_func", scope: !297, file: !378, line: 104, type: !608, isLocal: true, isDefinition: true)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_get_t", file: !609, line: 33, baseType: !610)
!609 = !DIFile(filename: "zephyr/include/zephyr/logging/log_ctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!611 = !DISubroutineType(types: !612)
!612 = !{!95}
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "initialized", scope: !297, file: !378, line: 95, type: !424, isLocal: true, isDefinition: true)
!615 = !DIGlobalVariableExpression(var: !616, expr: !DIExpression())
!616 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !297, file: !378, line: 25, type: !617, isLocal: true, isDefinition: true)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !111, line: 16, size: 64, elements: !620)
!620 = !{!621, !622}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !619, file: !111, line: 17, baseType: !44, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !619, file: !111, line: 18, baseType: !58, size: 8, offset: 32)
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "mpsc_config", scope: !297, file: !378, line: 121, type: !625, isLocal: true, isDefinition: true)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !445, line: 128, size: 160, elements: !627)
!627 = !{!628, !629, !630, !631, !632}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !626, file: !445, line: 130, baseType: !471, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !626, file: !445, line: 133, baseType: !85, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !626, file: !445, line: 136, baseType: !457, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !626, file: !445, line: 137, baseType: !466, size: 32, offset: 96)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !626, file: !445, line: 140, baseType: !85, size: 32, offset: 128)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "buf32", scope: !297, file: !378, line: 116, type: !635, isLocal: true, isDefinition: true, align: 64)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 8192, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 256)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "process_lock", scope: !640, file: !378, line: 157, type: !453, isLocal: true, isDefinition: true)
!640 = distinct !DISubprogram(name: "z_log_msg_post_finalize", scope: !378, file: !378, line: 152, type: !641, scopeLine: 153, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !297, retainedNodes: !643)
!641 = !DISubroutineType(types: !642)
!642 = !{null}
!643 = !{!644, !646}
!644 = !DILocalVariable(name: "cnt", scope: !640, file: !378, line: 154, type: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_val_t", file: !425, line: 23, baseType: !424)
!646 = !DILocalVariable(name: "key", scope: !647, file: !378, line: 158, type: !649)
!647 = distinct !DILexicalBlock(scope: !648, file: !378, line: 156, column: 18)
!648 = distinct !DILexicalBlock(scope: !640, file: !378, line: 156, column: 6)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !454, line: 106, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !454, line: 32, size: 32, elements: !651)
!651 = !{!652}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !650, file: !454, line: 33, baseType: !49, size: 32)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "proc_tid", scope: !297, file: !378, line: 100, type: !655, isLocal: true, isDefinition: true)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !490, line: 347, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "log_process_thread_timer", scope: !297, file: !378, line: 101, type: !659, isLocal: true, isDefinition: true)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !380, line: 1318, size: 448, elements: !660)
!660 = !{!661, !662, !663, !668, !669, !674, !675}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !659, file: !380, line: 1324, baseType: !527, size: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !659, file: !380, line: 1327, baseType: !383, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !659, file: !380, line: 1330, baseType: !664, size: 32, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 32)
!665 = !DISubroutineType(types: !666)
!666 = !{null, !667}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !659, file: !380, line: 1333, baseType: !664, size: 32, offset: 288)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !659, file: !380, line: 1336, baseType: !670, size: 64, offset: 320)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !367, line: 67, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 65, size: 64, elements: !672)
!672 = !{!673}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !671, file: !367, line: 66, baseType: !366, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !659, file: !380, line: 1339, baseType: !85, size: 32, offset: 384)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !659, file: !380, line: 1342, baseType: !38, size: 32, offset: 416)
!676 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!677 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "log_const_log_mgmt", scope: !680, file: !689, line: 14, type: !920, isLocal: false, isDefinition: true)
!680 = distinct !DICompileUnit(language: DW_LANG_C99, file: !681, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !682, retainedTypes: !683, globals: !686, splitDebugInlining: false, nameTableKind: None)
!681 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bme280")
!682 = !{!300, !120}
!683 = !{!38, !49, !684, !57, !44, !22}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!686 = !{!678, !687, !715, !897, !899, !911, !913, !918}
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "sname_cache", scope: !680, file: !689, line: 44, type: !690, isLocal: true, isDefinition: true)
!689 = !DIFile(filename: "zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache", file: !691, line: 30, size: 256, elements: !692)
!691 = !DIFile(filename: "zephyr/subsys/logging/log_cache.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!692 = !{!693, !706, !707, !712, !713, !714}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !690, file: !691, line: 31, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !695, line: 40, baseType: !696)
!695 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !695, line: 35, size: 64, elements: !697)
!697 = !{!698, !705}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !696, file: !695, line: 36, baseType: !699, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !695, line: 33, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !695, line: 29, size: 32, elements: !702)
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !701, file: !695, line: 30, baseType: !704, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !696, file: !695, line: 37, baseType: !699, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !690, file: !691, line: 32, baseType: !694, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !690, file: !691, line: 33, baseType: !708, size: 32, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_cache_cmp_func_t", file: !691, line: 21, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = !DISubroutineType(types: !711)
!711 = !{!286, !22, !22}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !690, file: !691, line: 34, baseType: !85, size: 32, offset: 160)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "miss", scope: !690, file: !691, line: 35, baseType: !85, size: 32, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !690, file: !691, line: 36, baseType: !47, size: 32, offset: 224)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "invalid_domain", scope: !717, file: !689, line: 261, type: !44, isLocal: true, isDefinition: true)
!717 = distinct !DISubprogram(name: "link_domain_name_get", scope: !689, file: !689, line: 256, type: !718, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !680, retainedNodes: !720)
!718 = !DISubroutineType(types: !719)
!719 = !{!44, !58}
!720 = !{!721, !722, !723, !724, !725, !728, !896}
!721 = !DILocalVariable(name: "domain_id", arg: 1, scope: !717, file: !689, line: 256, type: !58)
!722 = !DILocalVariable(name: "cached", scope: !717, file: !689, line: 258, type: !57)
!723 = !DILocalVariable(name: "cache_size", scope: !717, file: !689, line: 259, type: !47)
!724 = !DILocalVariable(name: "id", scope: !717, file: !689, line: 260, type: !22)
!725 = !DILocalVariable(name: "rel_domain_id", scope: !726, file: !689, line: 265, type: !58)
!726 = distinct !DILexicalBlock(scope: !727, file: !689, line: 264, column: 49)
!727 = distinct !DILexicalBlock(scope: !717, file: !689, line: 264, column: 6)
!728 = !DILocalVariable(name: "link", scope: !726, file: !689, line: 266, type: !729)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link", file: !732, line: 61, size: 192, elements: !733)
!732 = !DIFile(filename: "zephyr/include/zephyr/logging/log_link.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!733 = !{!734, !823, !824, !833, !834, !886}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !731, file: !732, line: 62, baseType: !735, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !737)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_api", file: !732, line: 38, size: 192, elements: !738)
!738 = !{!739, !802, !806, !811, !815, !819}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "initiate", scope: !737, file: !732, line: 39, baseType: !740, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 32)
!741 = !DISubroutineType(types: !742)
!742 = !{!49, !729, !743}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 32)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_config", file: !732, line: 33, size: 64, elements: !745)
!745 = !{!746, !797}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "msg_cb", scope: !744, file: !732, line: 34, baseType: !747, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_callback_t", file: !732, line: 27, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !729, !751}
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!752 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !753)
!753 = !{!754, !770, !776}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !752, file: !31, line: 112, baseType: !755, size: 32)
!755 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !344, line: 49, size: 32, elements: !756)
!756 = !{!757, !763, !769}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !755, file: !344, line: 50, baseType: !758, size: 32)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !344, line: 37, size: 32, elements: !759)
!759 = !{!760, !761, !762}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !758, file: !344, line: 38, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !758, file: !344, line: 38, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !758, file: !344, line: 39, baseType: !85, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !755, file: !344, line: 51, baseType: !764, size: 32)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !344, line: 43, size: 32, elements: !765)
!765 = !{!766, !767, !768}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !764, file: !344, line: 44, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !764, file: !344, line: 44, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !764, file: !344, line: 45, baseType: !85, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !755, file: !344, line: 52, baseType: !85, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !752, file: !31, line: 113, baseType: !771, size: 32)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !772)
!772 = !{!773, !774, !775}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !771, file: !31, line: 108, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !771, file: !31, line: 108, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !771, file: !31, line: 108, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !752, file: !31, line: 114, baseType: !777, size: 128)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !778)
!778 = !{!779, !795, !796}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !777, file: !31, line: 89, baseType: !780, size: 96)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !781)
!781 = !{!782, !793, !794}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !780, file: !31, line: 67, baseType: !783, size: 32)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !784)
!784 = !{!785, !786, !787, !788, !789, !790, !791, !792}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !783, file: !31, line: 52, baseType: !85, size: 1, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !783, file: !31, line: 52, baseType: !85, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !783, file: !31, line: 52, baseType: !85, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !783, file: !31, line: 53, baseType: !85, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !783, file: !31, line: 54, baseType: !85, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !783, file: !31, line: 55, baseType: !85, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !783, file: !31, line: 56, baseType: !85, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !783, file: !31, line: 57, baseType: !85, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !780, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !780, file: !31, line: 76, baseType: !95, size: 32, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !777, file: !31, line: 93, baseType: !97, size: 32, offset: 96)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !777, file: !31, line: 94, baseType: !101, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "dropped_cb", scope: !744, file: !732, line: 35, baseType: !798, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_dropped_cb_t", file: !732, line: 30, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DISubroutineType(types: !801)
!801 = !{null, !729, !85}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !737, file: !732, line: 40, baseType: !803, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!804 = !DISubroutineType(types: !805)
!805 = !{!49, !729}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "get_domain_name", scope: !737, file: !732, line: 41, baseType: !807, size: 32, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!808 = !DISubroutineType(types: !809)
!809 = !{!49, !729, !85, !56, !810}
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "get_source_name", scope: !737, file: !732, line: 43, baseType: !812, size: 32, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = !DISubroutineType(types: !814)
!814 = !{!49, !729, !85, !60, !56, !810}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "get_levels", scope: !737, file: !732, line: 45, baseType: !816, size: 32, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = !DISubroutineType(types: !818)
!818 = !{!49, !729, !85, !60, !57, !57}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "set_runtime_level", scope: !737, file: !732, line: 48, baseType: !820, size: 32, offset: 160)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = !DISubroutineType(types: !822)
!822 = !{!49, !729, !85, !60, !58}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !731, file: !732, line: 63, baseType: !44, size: 32, offset: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl_blk", scope: !731, file: !732, line: 64, baseType: !825, size: 32, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_ctrl_blk", file: !732, line: 52, size: 128, elements: !827)
!827 = !{!828, !829, !831, !832}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "domain_cnt", scope: !826, file: !732, line: 53, baseType: !85, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "source_cnt", scope: !826, file: !732, line: 54, baseType: !830, size: 16, offset: 32)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 16, elements: !222)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "domain_offset", scope: !826, file: !732, line: 57, baseType: !85, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !826, file: !732, line: 58, baseType: !471, size: 32, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !731, file: !732, line: 65, baseType: !38, size: 32, offset: 96)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf", scope: !731, file: !732, line: 66, baseType: !835, size: 32, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 32)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !445, line: 87, size: 448, elements: !837)
!837 = !{!838, !839, !840, !841, !842, !843, !845, !854, !859, !860, !861, !862}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !836, file: !445, line: 89, baseType: !85, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !836, file: !445, line: 92, baseType: !85, size: 32, offset: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !836, file: !445, line: 95, baseType: !85, size: 32, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !836, file: !445, line: 98, baseType: !85, size: 32, offset: 96)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !836, file: !445, line: 101, baseType: !85, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !836, file: !445, line: 104, baseType: !844, offset: 160)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !454, line: 43, elements: !455)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !836, file: !445, line: 110, baseType: !846, size: 32, offset: 160)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !445, line: 83, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !850, !852}
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !836)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !755)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !836, file: !445, line: 113, baseType: !855, size: 32, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !445, line: 75, baseType: !856)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DISubroutineType(types: !858)
!858 = !{!85, !852}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !836, file: !445, line: 116, baseType: !471, size: 32, offset: 224)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !836, file: !445, line: 119, baseType: !85, size: 32, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !836, file: !445, line: 122, baseType: !85, size: 32, offset: 288)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !836, file: !445, line: 124, baseType: !863, size: 128, offset: 320)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !380, line: 2909, size: 128, elements: !864)
!864 = !{!865, !884, !885}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !863, file: !380, line: 2910, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !384, line: 233, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !384, line: 231, size: 64, elements: !868)
!868 = !{!869}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !867, file: !384, line: 232, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !389, line: 48, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !389, line: 37, size: 64, elements: !872)
!872 = !{!873, !879}
!873 = !DIDerivedType(tag: DW_TAG_member, scope: !871, file: !389, line: 38, baseType: !874, size: 32)
!874 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !871, file: !389, line: 38, size: 32, elements: !875)
!875 = !{!876, !878}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !874, file: !389, line: 39, baseType: !877, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !874, file: !389, line: 40, baseType: !877, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, scope: !871, file: !389, line: 42, baseType: !880, size: 32, offset: 32)
!880 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !871, file: !389, line: 42, size: 32, elements: !881)
!881 = !{!882, !883}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !880, file: !389, line: 43, baseType: !877, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !880, file: !389, line: 44, baseType: !877, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !863, file: !380, line: 2911, baseType: !32, size: 32, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !863, file: !380, line: 2912, baseType: !32, size: 32, offset: 96)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf_config", scope: !731, file: !732, line: 67, baseType: !887, size: 32, offset: 160)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !445, line: 128, size: 160, elements: !890)
!890 = !{!891, !892, !893, !894, !895}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !889, file: !445, line: 130, baseType: !471, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !889, file: !445, line: 133, baseType: !85, size: 32, offset: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !889, file: !445, line: 136, baseType: !846, size: 32, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !889, file: !445, line: 137, baseType: !855, size: 32, offset: 96)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !889, file: !445, line: 140, baseType: !85, size: 32, offset: 128)
!896 = !DILocalVariable(name: "err", scope: !726, file: !689, line: 267, type: !49)
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "dname_cache", scope: !680, file: !689, line: 43, type: !690, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(name: "dname_cache_config", scope: !901, file: !689, line: 152, type: !904, isLocal: true, isDefinition: true)
!901 = distinct !DISubprogram(name: "cache_init", scope: !689, file: !689, line: 149, type: !641, scopeLine: 150, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !680, retainedNodes: !902)
!902 = !{!903}
!903 = !DILocalVariable(name: "err", scope: !901, file: !689, line: 151, type: !49)
!904 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache_config", file: !691, line: 23, size: 128, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !905, file: !691, line: 24, baseType: !38, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !905, file: !691, line: 25, baseType: !47, size: 32, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !905, file: !691, line: 26, baseType: !47, size: 32, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !905, file: !691, line: 27, baseType: !708, size: 32, offset: 96)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(name: "sname_cache_config", scope: !901, file: !689, line: 158, type: !904, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "dname_cache_buffer", scope: !680, file: !689, line: 40, type: !915, isLocal: true, isDefinition: true, align: 32)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 72, elements: !916)
!916 = !{!917}
!917 = !DISubrange(count: 9)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(name: "sname_cache_buffer", scope: !680, file: !689, line: 41, type: !915, isLocal: true, isDefinition: true, align: 32)
!920 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !111, line: 16, size: 64, elements: !922)
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !921, file: !111, line: 17, baseType: !44, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !921, file: !111, line: 18, baseType: !58, size: 8, offset: 32)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(name: "prefix", scope: !927, file: !928, line: 562, type: !971, isLocal: true, isDefinition: true)
!927 = distinct !DISubprogram(name: "log_output_dropped_process", scope: !928, file: !928, line: 558, type: !929, scopeLine: 559, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !945, retainedNodes: !964)
!928 = !DIFile(filename: "zephyr/subsys/logging/log_output.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!929 = !DISubroutineType(types: !930)
!930 = !{null, !931, !85}
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !584, line: 89, size: 128, elements: !934)
!934 = !{!935, !936, !943, !944}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !933, file: !584, line: 90, baseType: !593, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !933, file: !584, line: 91, baseType: !937, size: 32, offset: 32)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 32)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !584, line: 82, size: 96, elements: !939)
!939 = !{!940, !941, !942}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !938, file: !584, line: 83, baseType: !424, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !938, file: !584, line: 84, baseType: !38, size: 32, offset: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !938, file: !584, line: 85, baseType: !44, size: 32, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !933, file: !584, line: 92, baseType: !57, size: 32, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !933, file: !584, line: 93, baseType: !47, size: 32, offset: 96)
!945 = distinct !DICompileUnit(language: DW_LANG_C99, file: !946, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !119, retainedTypes: !947, globals: !948, splitDebugInlining: false, nameTableKind: None)
!946 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_output.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bme280")
!947 = !{!22, !38, !57, !369, !49, !85, !931, !58, !59, !32, !684}
!948 = !{!925, !949, !954, !956, !958, !962}
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "postfix", scope: !927, file: !928, line: 563, type: !951, isLocal: true, isDefinition: true)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 224, elements: !952)
!952 = !{!953}
!953 = !DISubrange(count: 28)
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(name: "freq", scope: !945, file: !928, line: 46, type: !85, isLocal: true, isDefinition: true)
!956 = !DIGlobalVariableExpression(var: !957, expr: !DIExpression())
!957 = distinct !DIGlobalVariable(name: "timestamp_div", scope: !945, file: !928, line: 47, type: !95, isLocal: true, isDefinition: true)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "colors", scope: !945, file: !928, line: 38, type: !960, isLocal: true, isDefinition: true)
!960 = !DICompositeType(tag: DW_TAG_array_type, baseType: !961, size: 160, elements: !242)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "severity", scope: !945, file: !928, line: 30, type: !960, isLocal: true, isDefinition: true)
!964 = !{!965, !966, !967, !969, !970}
!965 = !DILocalVariable(name: "output", arg: 1, scope: !927, file: !928, line: 558, type: !931)
!966 = !DILocalVariable(name: "cnt", arg: 2, scope: !927, file: !928, line: 558, type: !85)
!967 = !DILocalVariable(name: "buf", scope: !927, file: !928, line: 560, type: !968)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 40, elements: !242)
!969 = !DILocalVariable(name: "len", scope: !927, file: !928, line: 561, type: !49)
!970 = !DILocalVariable(name: "outf", scope: !927, file: !928, line: 565, type: !593)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 96, elements: !972)
!972 = !{!973}
!973 = !DISubrange(count: 12)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(name: "log_const_log_uart", scope: !976, file: !1033, line: 16, type: !1161, isLocal: false, isDefinition: true)
!976 = distinct !DICompileUnit(language: DW_LANG_C99, file: !977, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !682, retainedTypes: !978, globals: !1030, splitDebugInlining: false, nameTableKind: None)
!977 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/backends/log_backend_uart.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/sensor/bme280")
!978 = !{!38, !49, !979}
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !982, line: 336, size: 160, elements: !983)
!982 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!983 = !{!984, !1004, !1008, !1012, !1025}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !981, file: !982, line: 365, baseType: !985, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 32)
!986 = !DISubroutineType(types: !987)
!987 = !{!49, !988, !1003}
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !275, line: 378, size: 192, elements: !991)
!991 = !{!992, !993, !994, !995, !1001, !1002}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !990, file: !275, line: 380, baseType: !44, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !990, file: !275, line: 382, baseType: !13, size: 32, offset: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !990, file: !275, line: 384, baseType: !13, size: 32, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !990, file: !275, line: 386, baseType: !996, size: 32, offset: 96)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 32)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !275, line: 351, size: 16, elements: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !997, file: !275, line: 359, baseType: !58, size: 8)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !997, file: !275, line: 364, baseType: !286, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !990, file: !275, line: 388, baseType: !38, size: 32, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !990, file: !275, line: 396, baseType: !289, size: 32, offset: 160)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !981, file: !982, line: 366, baseType: !1005, size: 32, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 32)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{null, !988, !59}
