; ModuleID = 'build/96b_meerkat96/benchmark/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.zbus_observer = type { i8, %struct.k_msgq*, void (%struct.zbus_channel*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type {}
%struct.zbus_channel = type { i16, i8*, i8*, i1 (i8*, i32)*, %struct.k_mutex*, %struct.zbus_observer** }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/benchmark/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/benchmark")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/benchmark")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_mutex_bm_channel", scope: !27, file: !114, line: 16, type: !136, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/benchmark/src/benchmark.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/benchmark")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !104, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !105, line: 46, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !107)
!107 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112, !284, !286, !288, !290, !292, !294, !296, !298, !300, !333, !337, !342, !344, !351, !356}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "bm_channel", scope: !27, file: !114, line: 16, type: !115, isLocal: false, isDefinition: true, align: 32)
!114 = !DIFile(filename: "zephyr/samples/subsys/zbus/benchmark/src/benchmark.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !117, line: 29, size: 192, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !123, !125, !126, !134, !253}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !116, file: !117, line: 35, baseType: !120, size: 16)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !122)
!122 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !116, file: !117, line: 40, baseType: !124, size: 32, offset: 32)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !102)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !116, file: !117, line: 45, baseType: !124, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !116, file: !117, line: 51, baseType: !127, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 32)
!129 = !DISubroutineType(types: !130)
!130 = !{!131, !13, !132}
!131 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !133, line: 214, baseType: !32)
!133 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!134 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !116, file: !117, line: 56, baseType: !135, size: 32, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !137, line: 2720, size: 160, elements: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = !{!139, !160, !251, !252}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !136, file: !137, line: 2722, baseType: !140, size: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !141, line: 233, baseType: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !141, line: 231, size: 64, elements: !143)
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !142, file: !141, line: 232, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !146, line: 48, baseType: !147)
!146 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !146, line: 37, size: 64, elements: !148)
!148 = !{!149, !155}
!149 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !146, line: 38, baseType: !150, size: 32)
!150 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !146, line: 38, size: 32, elements: !151)
!151 = !{!152, !154}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !150, file: !146, line: 39, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !146, line: 40, baseType: !153, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !146, line: 42, baseType: !156, size: 32, offset: 32)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !147, file: !146, line: 42, size: 32, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !156, file: !146, line: 43, baseType: !153, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !156, file: !146, line: 44, baseType: !153, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !136, file: !137, line: 2724, baseType: !161, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !163, line: 245, size: 896, elements: !164)
!163 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!164 = !{!165, !212, !225, !226, !227, !228, !246}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !162, file: !163, line: 247, baseType: !166, size: 384)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !163, line: 57, size: 384, elements: !167)
!167 = !{!168, !182, !184, !187, !188, !199, !200, !201}
!168 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !163, line: 60, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !163, line: 60, size: 64, elements: !170)
!170 = !{!171, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !169, file: !163, line: 61, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !146, line: 49, baseType: !147)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !169, file: !163, line: 62, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !175, line: 49, size: 64, elements: !176)
!175 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !174, file: !175, line: 50, baseType: !178, size: 64)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 64, elements: !180)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!180 = !{!181}
!181 = !DISubrange(count: 2)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !166, file: !163, line: 68, baseType: !183, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !166, file: !163, line: 71, baseType: !185, size: 8, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !186)
!186 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !166, file: !163, line: 74, baseType: !185, size: 8, offset: 104)
!188 = !DIDerivedType(tag: DW_TAG_member, scope: !166, file: !163, line: 90, baseType: !189, size: 16, offset: 112)
!189 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !163, line: 90, size: 16, elements: !190)
!190 = !{!191, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !163, line: 91, baseType: !192, size: 16)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !163, line: 91, size: 16, elements: !193)
!193 = !{!194, !197}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !192, file: !163, line: 96, baseType: !195, size: 8)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !196)
!196 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !192, file: !163, line: 97, baseType: !185, size: 8, offset: 8)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !189, file: !163, line: 100, baseType: !121, size: 16)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !166, file: !163, line: 107, baseType: !108, size: 32, offset: 128)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !166, file: !163, line: 127, baseType: !102, size: 32, offset: 160)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !166, file: !163, line: 131, baseType: !202, size: 192, offset: 192)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !141, line: 244, size: 192, elements: !203)
!203 = !{!204, !205, !211}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !202, file: !141, line: 245, baseType: !172, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !202, file: !141, line: 246, baseType: !206, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !141, line: 242, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DISubroutineType(types: !209)
!209 = !{null, !210}
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !202, file: !141, line: 249, baseType: !106, size: 64, offset: 128)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !162, file: !163, line: 250, baseType: !213, size: 288, offset: 384)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !214, line: 25, size: 288, elements: !215)
!214 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !213, file: !214, line: 26, baseType: !108, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !213, file: !214, line: 27, baseType: !108, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !213, file: !214, line: 28, baseType: !108, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !213, file: !214, line: 29, baseType: !108, size: 32, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !213, file: !214, line: 30, baseType: !108, size: 32, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !213, file: !214, line: 31, baseType: !108, size: 32, offset: 160)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !213, file: !214, line: 32, baseType: !108, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !213, file: !214, line: 33, baseType: !108, size: 32, offset: 224)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !213, file: !214, line: 34, baseType: !108, size: 32, offset: 256)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !162, file: !163, line: 253, baseType: !102, size: 32, offset: 672)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !162, file: !163, line: 256, baseType: !140, size: 64, offset: 704)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !162, file: !163, line: 294, baseType: !103, size: 32, offset: 768)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !162, file: !163, line: 325, baseType: !229, size: 32, offset: 800)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !137, line: 5073, size: 160, elements: !231)
!231 = !{!232, !241, !242}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !230, file: !137, line: 5074, baseType: !233, size: 96)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !234, line: 56, size: 96, elements: !235)
!234 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = !{!236, !239, !240}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !233, file: !234, line: 57, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !234, line: 57, flags: DIFlagFwdDecl)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !233, file: !234, line: 58, baseType: !102, size: 32, offset: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !233, file: !234, line: 59, baseType: !132, size: 32, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !230, file: !137, line: 5075, baseType: !140, size: 64, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !230, file: !137, line: 5076, baseType: !243, offset: 160)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !244, line: 43, elements: !245)
!244 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!245 = !{}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !162, file: !163, line: 343, baseType: !247, size: 64, offset: 832)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !214, line: 60, size: 64, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !247, file: !214, line: 63, baseType: !108, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !247, file: !214, line: 66, baseType: !108, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !136, file: !137, line: 2727, baseType: !108, size: 32, offset: 96)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !136, file: !137, line: 2730, baseType: !103, size: 32, offset: 128)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !116, file: !117, line: 67, baseType: !254, size: 32, offset: 160)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !117, line: 85, size: 96, elements: !259)
!259 = !{!260, !261, !278}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !258, file: !117, line: 91, baseType: !131, size: 8)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !258, file: !117, line: 93, baseType: !262, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !137, line: 4204, size: 320, elements: !265)
!265 = !{!266, !267, !268, !269, !270, !273, !274, !275, !276, !277}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !264, file: !137, line: 4206, baseType: !140, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !264, file: !137, line: 4208, baseType: !243, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !264, file: !137, line: 4210, baseType: !132, size: 32, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !264, file: !137, line: 4212, baseType: !108, size: 32, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !264, file: !137, line: 4214, baseType: !271, size: 32, offset: 128)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !264, file: !137, line: 4216, baseType: !271, size: 32, offset: 160)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !264, file: !137, line: 4218, baseType: !271, size: 32, offset: 192)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !264, file: !137, line: 4220, baseType: !271, size: 32, offset: 224)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !264, file: !137, line: 4222, baseType: !108, size: 32, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !264, file: !137, line: 4227, baseType: !185, size: 8, offset: 288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !258, file: !117, line: 96, baseType: !279, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DISubroutineType(types: !282)
!282 = !{null, !283}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "s1", scope: !27, file: !114, line: 126, type: !258, isLocal: false, isDefinition: true, align: 32)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "s2", scope: !27, file: !114, line: 129, type: !258, isLocal: false, isDefinition: true, align: 32)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "s3", scope: !27, file: !114, line: 131, type: !258, isLocal: false, isDefinition: true, align: 32)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "s4", scope: !27, file: !114, line: 132, type: !258, isLocal: false, isDefinition: true, align: 32)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "s5", scope: !27, file: !114, line: 134, type: !258, isLocal: false, isDefinition: true, align: 32)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "s6", scope: !27, file: !114, line: 135, type: !258, isLocal: false, isDefinition: true, align: 32)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "s7", scope: !27, file: !114, line: 136, type: !258, isLocal: false, isDefinition: true, align: 32)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "s8", scope: !27, file: !114, line: 137, type: !258, isLocal: false, isDefinition: true, align: 32)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "_k_thread_data_producer_thread_id", scope: !27, file: !114, line: 216, type: !302, isLocal: false, isDefinition: true, align: 32)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !137, line: 620, size: 384, elements: !303)
!303 = !{!304, !305, !313, !314, !319, !320, !321, !322, !323, !324, !326, !330}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !302, file: !137, line: 621, baseType: !161, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !302, file: !137, line: 622, baseType: !306, size: 32, offset: 32)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !308, line: 44, baseType: !309)
!308 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !310, line: 47, size: 8, elements: !311)
!310 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !309, file: !310, line: 48, baseType: !272, size: 8)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !302, file: !137, line: 623, baseType: !32, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !302, file: !137, line: 624, baseType: !315, size: 32, offset: 96)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !308, line: 46, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !102, !102, !102}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !302, file: !137, line: 625, baseType: !102, size: 32, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !302, file: !137, line: 626, baseType: !102, size: 32, offset: 160)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !302, file: !137, line: 627, baseType: !102, size: 32, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !302, file: !137, line: 628, baseType: !103, size: 32, offset: 224)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !302, file: !137, line: 629, baseType: !108, size: 32, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !302, file: !137, line: 630, baseType: !325, size: 32, offset: 288)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !302, file: !137, line: 631, baseType: !327, size: 32, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DISubroutineType(types: !329)
!329 = !{null}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !302, file: !137, line: 632, baseType: !331, size: 32, offset: 352)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !272)
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "producer_thread_id", scope: !27, file: !114, line: 216, type: !335, isLocal: false, isDefinition: true)
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !336)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !163, line: 347, baseType: !161)
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "_k_thread_stack_producer_thread_id", scope: !27, file: !114, line: 216, type: !339, isLocal: false, isDefinition: true, align: 64)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !309, size: 8192, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 1024)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "_k_thread_obj_producer_thread_id", scope: !27, file: !114, line: 216, type: !162, isLocal: false, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "_zbus_message_bm_channel", scope: !27, file: !114, line: 16, type: !346, isLocal: true, isDefinition: true)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "external_data_msg", file: !347, line: 10, size: 64, elements: !348)
!347 = !DIFile(filename: "zephyr/samples/subsys/zbus/benchmark/src/messages.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!348 = !{!349, !350}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !346, file: !347, line: 11, baseType: !102, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !346, file: !347, line: 12, baseType: !132, size: 32, offset: 32)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "_zbus_observers_bm_channel", scope: !27, file: !114, line: 16, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 288, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 9)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !114, line: 44, type: !109, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !360, file: !375, line: 18, type: !376, isLocal: false, isDefinition: true)
!360 = distinct !DICompileUnit(language: DW_LANG_C99, file: !361, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !362, globals: !374, splitDebugInlining: false, nameTableKind: None)
!361 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/benchmark")
!362 = !{!22, !102, !24, !363, !365, !367, !132, !103, !368, !369, !371, !372, !271, !373, !121, !331}
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 32)
!364 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 32)
!370 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!374 = !{!358}
!375 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !378, line: 16, size: 64, elements: !379)
!378 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!379 = !{!380, !381}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !377, file: !378, line: 17, baseType: !331, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !377, file: !378, line: 18, baseType: !185, size: 8, offset: 32)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "_char_out", scope: !384, file: !388, line: 54, type: !389, isLocal: false, isDefinition: true)
!384 = distinct !DICompileUnit(language: DW_LANG_C99, file: !385, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !386, globals: !387, splitDebugInlining: false, nameTableKind: None)
!385 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/benchmark")
!386 = !{!102, !103}
!387 = !{!382}
!388 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!390 = !DISubroutineType(types: !391)
!391 = !{!103, !103}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !394, file: !808, line: 258, type: !809, isLocal: true, isDefinition: true, align: 32)
!394 = distinct !DICompileUnit(language: DW_LANG_C99, file: !395, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !396, retainedTypes: !679, globals: !807, splitDebugInlining: false, nameTableKind: None)
!395 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/benchmark")
!396 = !{!397, !429, !439, !488, !494, !615, !650}
!397 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !398, line: 54, baseType: !32, size: 32, elements: !399)
!398 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!399 = !{!400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428}
!400 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!401 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!402 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!403 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!404 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!405 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!406 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!407 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!408 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!409 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!410 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!411 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!412 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!413 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!414 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!415 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!416 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!417 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!418 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!419 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!420 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!421 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!422 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!423 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!424 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!425 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!426 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!427 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!428 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!429 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !398, line: 224, baseType: !32, size: 32, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436, !437, !438}
!431 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!432 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!433 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!434 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!435 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!436 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!437 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!438 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!439 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !398, line: 275, baseType: !32, size: 32, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487}
!441 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!442 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!443 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!444 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!445 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!446 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!447 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!448 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!449 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!450 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!451 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!452 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!453 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!454 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!455 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!456 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!457 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!458 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!459 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!460 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!461 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!462 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!463 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!464 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!465 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!466 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!467 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!468 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!469 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!470 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!471 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!472 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!473 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!474 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!475 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!476 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!477 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!478 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!479 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!480 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!481 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!482 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!483 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!484 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!485 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!486 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!487 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!488 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !398, line: 327, baseType: !32, size: 32, elements: !489)
!489 = !{!490, !491, !492, !493}
!490 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!491 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!492 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!493 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!494 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !495, line: 76, baseType: !32, size: 32, elements: !496)
!495 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!496 = !{!497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614}
!497 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!498 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!499 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!500 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!501 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!502 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!503 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!504 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!505 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!506 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!507 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!508 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!509 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!510 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!511 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!512 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!513 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!514 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!515 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!516 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!517 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!518 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!519 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!520 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!521 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!522 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!523 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!524 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!525 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!526 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!527 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!528 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!529 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!530 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!531 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!532 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!533 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!534 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!535 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!536 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!537 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!538 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!539 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!540 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!541 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!542 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!543 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!544 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!545 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!546 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!547 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!548 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!549 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!550 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!551 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!552 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!553 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!554 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!555 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!556 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!557 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!558 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!559 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!560 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!561 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!562 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!563 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!564 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!565 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!566 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!567 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!568 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!569 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!570 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!571 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!572 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!573 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!574 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!575 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!576 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!577 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!578 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!579 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!580 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!581 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!582 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!583 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!584 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!585 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!586 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!587 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!588 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!589 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!590 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!591 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!592 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!593 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!594 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!595 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!596 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!597 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!598 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!599 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!600 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!601 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!602 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!603 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!604 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!605 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!606 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!607 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!608 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!609 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!610 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!611 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!612 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!613 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!614 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!615 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !398, line: 237, baseType: !32, size: 32, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649}
!617 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!618 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!619 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!620 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!621 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!622 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!623 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!624 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!625 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!626 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!627 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!628 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!629 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!630 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!631 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!632 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!633 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!634 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!635 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!636 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!637 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!638 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!639 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!640 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!641 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!642 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!643 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!644 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!645 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!646 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!647 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!648 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!649 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!650 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !495, line: 44, baseType: !32, size: 32, elements: !651)
!651 = !{!652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678}
!652 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!653 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!654 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!655 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!656 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!657 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!658 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!659 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!660 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!661 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!662 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!663 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!664 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!665 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!666 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!667 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!668 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!669 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!670 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!671 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!672 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!673 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!674 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!675 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!676 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!677 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!678 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!679 = !{!680, !752, !795, !806, !108}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !682, line: 4575, baseType: !683)
!682 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !682, line: 4532, size: 390144, elements: !684)
!684 = !{!685, !687, !688, !689, !690, !694, !704, !708, !718, !722}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !683, file: !682, line: 4533, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !683, file: !682, line: 4534, baseType: !686, size: 32, offset: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !683, file: !682, line: 4535, baseType: !686, size: 32, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !683, file: !682, line: 4536, baseType: !686, size: 32, offset: 96)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !683, file: !682, line: 4537, baseType: !691, size: 16256, offset: 128)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 16256, elements: !692)
!692 = !{!693}
!693 = !DISubrange(count: 2032)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !683, file: !682, line: 4543, baseType: !695, size: 4224, offset: 16384)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 4224, elements: !702)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !683, file: !682, line: 4538, size: 128, elements: !697)
!697 = !{!698, !699, !700, !701}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !696, file: !682, line: 4539, baseType: !686, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_SET", scope: !696, file: !682, line: 4540, baseType: !686, size: 32, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_CLR", scope: !696, file: !682, line: 4541, baseType: !686, size: 32, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_TOG", scope: !696, file: !682, line: 4542, baseType: !686, size: 32, offset: 96)
!702 = !{!703}
!703 = !DISubrange(count: 33)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !683, file: !682, line: 4544, baseType: !705, size: 110464, offset: 20608)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 110464, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 13808)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !683, file: !682, line: 4550, baseType: !709, size: 24448, offset: 131072)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !710, size: 24448, elements: !716)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !683, file: !682, line: 4545, size: 128, elements: !711)
!711 = !{!712, !713, !714, !715}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !710, file: !682, line: 4546, baseType: !686, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_SET", scope: !710, file: !682, line: 4547, baseType: !686, size: 32, offset: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_CLR", scope: !710, file: !682, line: 4548, baseType: !686, size: 32, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_TOG", scope: !710, file: !682, line: 4549, baseType: !686, size: 32, offset: 96)
!716 = !{!717}
!717 = !DISubrange(count: 191)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !683, file: !682, line: 4551, baseType: !719, size: 106624, offset: 155520)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 106624, elements: !720)
!720 = !{!721}
!721 = !DISubrange(count: 13328)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !683, file: !682, line: 4574, baseType: !723, size: 128000, offset: 262144)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 128000, elements: !750)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !683, file: !682, line: 4552, size: 1024, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !746, !747, !748, !749}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT", scope: !724, file: !682, line: 4553, baseType: !686, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_SET", scope: !724, file: !682, line: 4554, baseType: !686, size: 32, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_CLR", scope: !724, file: !682, line: 4555, baseType: !686, size: 32, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_TOG", scope: !724, file: !682, line: 4556, baseType: !686, size: 32, offset: 96)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "MISC", scope: !724, file: !682, line: 4557, baseType: !686, size: 32, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_SET", scope: !724, file: !682, line: 4558, baseType: !686, size: 32, offset: 160)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_CLR", scope: !724, file: !682, line: 4559, baseType: !686, size: 32, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_TOG", scope: !724, file: !682, line: 4560, baseType: !686, size: 32, offset: 224)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "POST", scope: !724, file: !682, line: 4561, baseType: !686, size: 32, offset: 256)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_SET", scope: !724, file: !682, line: 4562, baseType: !686, size: 32, offset: 288)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_CLR", scope: !724, file: !682, line: 4563, baseType: !686, size: 32, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_TOG", scope: !724, file: !682, line: 4564, baseType: !686, size: 32, offset: 352)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "PRE", scope: !724, file: !682, line: 4565, baseType: !686, size: 32, offset: 384)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_SET", scope: !724, file: !682, line: 4566, baseType: !686, size: 32, offset: 416)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_CLR", scope: !724, file: !682, line: 4567, baseType: !686, size: 32, offset: 448)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_TOG", scope: !724, file: !682, line: 4568, baseType: !686, size: 32, offset: 480)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !724, file: !682, line: 4569, baseType: !743, size: 384, offset: 512)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 384, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 48)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL", scope: !724, file: !682, line: 4570, baseType: !686, size: 32, offset: 896)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_SET", scope: !724, file: !682, line: 4571, baseType: !686, size: 32, offset: 928)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_CLR", scope: !724, file: !682, line: 4572, baseType: !686, size: 32, offset: 960)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !724, file: !682, line: 4573, baseType: !686, size: 32, offset: 992)
!750 = !{!751}
!751 = !DISubrange(count: 125)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDC_Type", file: !682, line: 38320, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !682, line: 38303, size: 23040, elements: !755)
!755 = !{!756, !758, !762, !763, !764, !765, !769, !773, !777, !781, !785}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "VIR", scope: !754, file: !682, line: 38304, baseType: !757, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !686)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !754, file: !682, line: 38305, baseType: !759, size: 256, offset: 32)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 256, elements: !760)
!760 = !{!761}
!761 = !DISubrange(count: 32)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "STAT", scope: !754, file: !682, line: 38306, baseType: !686, size: 32, offset: 288)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "INTCTRL", scope: !754, file: !682, line: 38307, baseType: !686, size: 32, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "INTSTAT", scope: !754, file: !682, line: 38308, baseType: !686, size: 32, offset: 352)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !754, file: !682, line: 38309, baseType: !766, size: 3712, offset: 384)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 3712, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 464)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "MDA", scope: !754, file: !682, line: 38310, baseType: !770, size: 864, offset: 4096)
!770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 864, elements: !771)
!771 = !{!772}
!772 = !DISubrange(count: 27)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !754, file: !682, line: 38311, baseType: !774, size: 3232, offset: 4960)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 3232, elements: !775)
!775 = !{!776}
!776 = !DISubrange(count: 404)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "PDAP", scope: !754, file: !682, line: 38312, baseType: !778, size: 3776, offset: 8192)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 3776, elements: !779)
!779 = !{!780}
!780 = !DISubrange(count: 118)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_3", scope: !754, file: !682, line: 38313, baseType: !782, size: 4416, offset: 11968)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 4416, elements: !783)
!783 = !{!784}
!784 = !DISubrange(count: 552)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "MR", scope: !754, file: !682, line: 38319, baseType: !786, size: 6656, offset: 16384)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !787, size: 6656, elements: !793)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !754, file: !682, line: 38314, size: 128, elements: !788)
!788 = !{!789, !790, !791, !792}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "MRSA", scope: !787, file: !682, line: 38315, baseType: !686, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "MREA", scope: !787, file: !682, line: 38316, baseType: !686, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "MRC", scope: !787, file: !682, line: 38317, baseType: !686, size: 32, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "MRVS", scope: !787, file: !682, line: 38318, baseType: !686, size: 32, offset: 96)
!793 = !{!794}
!794 = !DISubrange(count: 52)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "WDOG_Type", file: !682, line: 43319, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !682, line: 43313, size: 80, elements: !798)
!798 = !{!799, !801, !802, !804, !805}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "WCR", scope: !797, file: !682, line: 43314, baseType: !800, size: 16)
!800 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "WSR", scope: !797, file: !682, line: 43315, baseType: !800, size: 16, offset: 16)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "WRSR", scope: !797, file: !682, line: 43316, baseType: !803, size: 16, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !800)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "WICR", scope: !797, file: !682, line: 43317, baseType: !800, size: 16, offset: 48)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "WMCR", scope: !797, file: !682, line: 43318, baseType: !800, size: 16, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!807 = !{!392}
!808 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !811, line: 51, size: 64, elements: !812)
!811 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!812 = !{!813, !820}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !810, file: !811, line: 60, baseType: !814, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DISubroutineType(types: !816)
!816 = !{!103, !817}
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !819)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !811, line: 48, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !810, file: !811, line: 65, baseType: !817, size: 32, offset: 32)
!821 = !DIGlobalVariableExpression(var: !822, expr: !DIExpression())
!822 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !823, file: !830, line: 21, type: !389, isLocal: true, isDefinition: true)
!823 = distinct !DICompileUnit(language: DW_LANG_C99, file: !824, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !825, globals: !829, splitDebugInlining: false, nameTableKind: None)
!824 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/benchmark")
!825 = !{!826, !103, !102}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !828, line: 22, baseType: !103)
!828 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!829 = !{!821}
!830 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "log_const_zbus", scope: !833, file: !837, line: 10, type: !838, isLocal: false, isDefinition: true)
!833 = distinct !DICompileUnit(language: DW_LANG_C99, file: !834, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !835, globals: !836, splitDebugInlining: false, nameTableKind: None)
!834 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/benchmark")
!835 = !{!104, !102, !103}
!836 = !{!831}
!837 = !DIFile(filename: "zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!838 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !378, line: 16, size: 64, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !839, file: !378, line: 17, baseType: !331, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !839, file: !378, line: 18, baseType: !185, size: 8, offset: 32)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !845, file: !941, line: 603, type: !943, isLocal: true, isDefinition: true, align: 32)
!845 = distinct !DICompileUnit(language: DW_LANG_C99, file: !846, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !847, globals: !938, splitDebugInlining: false, nameTableKind: None)
!846 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/benchmark")
!847 = !{!102, !103, !848}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !851, line: 336, size: 608, elements: !852)
!851 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!852 = !{!853, !879, !883, !887, !900, !905, !911, !916, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !850, file: !851, line: 365, baseType: !854, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!855 = !DISubroutineType(types: !856)
!856 = !{!103, !857, !878}
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !860, line: 378, size: 192, elements: !861)
!860 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!861 = !{!862, !863, !864, !865, !871, !872}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !859, file: !860, line: 380, baseType: !331, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !859, file: !860, line: 382, baseType: !13, size: 32, offset: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !859, file: !860, line: 384, baseType: !13, size: 32, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !859, file: !860, line: 386, baseType: !866, size: 32, offset: 96)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !860, line: 351, size: 16, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !867, file: !860, line: 359, baseType: !185, size: 8)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !867, file: !860, line: 364, baseType: !131, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !859, file: !860, line: 388, baseType: !102, size: 32, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !859, file: !860, line: 396, baseType: !873, size: 32, offset: 160)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !860, line: 43, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !877)
!877 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !850, file: !851, line: 366, baseType: !880, size: 32, offset: 32)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 32)
!881 = !DISubroutineType(types: !882)
!882 = !{null, !857, !186}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !850, file: !851, line: 374, baseType: !884, size: 32, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = !DISubroutineType(types: !886)
!886 = !{!103, !857}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !850, file: !851, line: 377, baseType: !888, size: 32, offset: 96)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = !DISubroutineType(types: !890)
!890 = !{!103, !857, !891}
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 32)
!892 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !893)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !851, line: 122, size: 64, elements: !894)
!894 = !{!895, !896, !897, !898, !899}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !893, file: !851, line: 123, baseType: !108, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !893, file: !851, line: 124, baseType: !185, size: 8, offset: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !893, file: !851, line: 125, baseType: !185, size: 8, offset: 40)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !893, file: !851, line: 126, baseType: !185, size: 8, offset: 48)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !893, file: !851, line: 127, baseType: !185, size: 8, offset: 56)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !850, file: !851, line: 379, baseType: !901, size: 32, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DISubroutineType(types: !903)
!903 = !{!103, !857, !904}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !850, file: !851, line: 384, baseType: !906, size: 32, offset: 160)
!906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !907, size: 32)
!907 = !DISubroutineType(types: !908)
!908 = !{!103, !857, !909, !103}
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !850, file: !851, line: 393, baseType: !912, size: 32, offset: 192)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!913 = !DISubroutineType(types: !914)
!914 = !{!103, !857, !373, !915}
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !850, file: !851, line: 402, baseType: !917, size: 32, offset: 224)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = !DISubroutineType(types: !919)
!919 = !{null, !857}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !850, file: !851, line: 405, baseType: !917, size: 32, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !850, file: !851, line: 408, baseType: !884, size: 32, offset: 288)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !850, file: !851, line: 411, baseType: !917, size: 32, offset: 320)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !850, file: !851, line: 414, baseType: !917, size: 32, offset: 352)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !850, file: !851, line: 417, baseType: !884, size: 32, offset: 384)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !850, file: !851, line: 420, baseType: !884, size: 32, offset: 416)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !850, file: !851, line: 423, baseType: !917, size: 32, offset: 448)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !850, file: !851, line: 426, baseType: !917, size: 32, offset: 480)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !850, file: !851, line: 429, baseType: !884, size: 32, offset: 512)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !850, file: !851, line: 432, baseType: !884, size: 32, offset: 544)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !850, file: !851, line: 435, baseType: !931, size: 32, offset: 576)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 32)
!932 = !DISubroutineType(types: !933)
!933 = !{null, !857, !934, !102}
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !851, line: 142, baseType: !935)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = !DISubroutineType(types: !937)
!937 = !{null, !857, !102}
!938 = !{!843, !939}
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !845, file: !941, line: 38, type: !942, isLocal: true, isDefinition: true)
!941 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !857)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !811, line: 51, size: 64, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !944, file: !811, line: 60, baseType: !884, size: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !944, file: !811, line: 65, baseType: !857, size: 32, offset: 32)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(name: "mcux_igpio_pinmux_0", scope: !950, file: !1054, line: 318, type: !1130, isLocal: false, isDefinition: true)
!950 = distinct !DICompileUnit(language: DW_LANG_C99, file: !951, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !952, retainedTypes: !969, globals: !1051, splitDebugInlining: false, nameTableKind: None)
!951 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/benchmark")
!952 = !{!953, !959, !964}
!953 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !954, line: 506, baseType: !32, size: 32, elements: !955)
!954 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!955 = !{!956, !957, !958}
!956 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!957 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!958 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!959 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !954, line: 512, baseType: !32, size: 32, elements: !960)
!960 = !{!961, !962, !963}
!961 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!962 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!963 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!964 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_gpio_pin_action", file: !965, line: 66, baseType: !32, size: 32, elements: !966)
!965 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./gpio_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!966 = !{!967, !968}
!967 = !DIEnumerator(name: "gpioPinClear", value: 0)
!968 = !DIEnumerator(name: "gpioPinSet", value: 1)
!969 = !{!970, !1040, !1045, !1005, !959, !953, !1050, !102, !806, !1020, !271}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !954, line: 523, size: 288, elements: !973)
!973 = !{!974, !995, !1001, !1006, !1010, !1011, !1012, !1016, !1036}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !972, file: !954, line: 524, baseType: !975, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!976 = !DISubroutineType(types: !977)
!977 = !{!103, !978, !993, !994}
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !860, line: 378, size: 192, elements: !981)
!981 = !{!982, !983, !984, !985, !991, !992}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !980, file: !860, line: 380, baseType: !331, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !980, file: !860, line: 382, baseType: !13, size: 32, offset: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !980, file: !860, line: 384, baseType: !13, size: 32, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !980, file: !860, line: 386, baseType: !986, size: 32, offset: 96)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !860, line: 351, size: 16, elements: !988)
!988 = !{!989, !990}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !987, file: !860, line: 359, baseType: !185, size: 8)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !987, file: !860, line: 364, baseType: !131, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !980, file: !860, line: 388, baseType: !102, size: 32, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !980, file: !860, line: 396, baseType: !873, size: 32, offset: 160)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !954, line: 237, baseType: !185)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !954, line: 257, baseType: !108)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !972, file: !954, line: 530, baseType: !996, size: 32, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 32)
!997 = !DISubroutineType(types: !998)
!998 = !{!103, !978, !999}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !954, line: 229, baseType: !108)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !972, file: !954, line: 532, baseType: !1002, size: 32, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 32)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!103, !978, !1005, !1000}
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !954, line: 216, baseType: !108)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !972, file: !954, line: 535, baseType: !1007, size: 32, offset: 96)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 32)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!103, !978, !1005}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !972, file: !954, line: 537, baseType: !1007, size: 32, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !972, file: !954, line: 539, baseType: !1007, size: 32, offset: 160)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !972, file: !954, line: 541, baseType: !1013, size: 32, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!103, !978, !993, !953, !959}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !972, file: !954, line: 544, baseType: !1017, size: 32, offset: 224)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 32)
!1018 = !DISubroutineType(types: !1019)
!1019 = !{!103, !978, !1020, !131}
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 32)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !954, line: 478, size: 96, elements: !1022)
!1022 = !{!1023, !1030, !1035}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1021, file: !954, line: 482, baseType: !1024, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !1025, line: 33, baseType: !1026)
!1025 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !1025, line: 29, size: 32, elements: !1027)
!1027 = !{!1028}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1026, file: !1025, line: 30, baseType: !1029, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1021, file: !954, line: 485, baseType: !1031, size: 32, offset: 32)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !954, line: 464, baseType: !1032)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 32)
!1033 = !DISubroutineType(types: !1034)
!1034 = !{null, !978, !1020, !1005}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !1021, file: !954, line: 493, baseType: !1005, size: 32, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !972, file: !954, line: 547, baseType: !1037, size: 32, offset: 256)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 32)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!108, !978}
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 32)
!1041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !954, line: 428, size: 32, elements: !1043)
!1043 = !{!1044}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !1042, file: !954, line: 434, baseType: !1005, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 32)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !954, line: 441, size: 32, elements: !1048)
!1048 = !{!1049}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1047, file: !954, line: 447, baseType: !1005, size: 32)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 32)
!1051 = !{!948, !1052, !1058, !1060, !1070, !1082, !1084, !1115, !1117, !1128}
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !950, file: !1054, line: 318, type: !1055, isLocal: false, isDefinition: true, align: 16)
!1054 = !DIFile(filename: "zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !874, size: 400, elements: !1056)
!1056 = !{!1057}
!1057 = !DISubrange(count: 25)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(name: "__device_dts_ord_25", scope: !950, file: !1054, line: 318, type: !979, isLocal: false, isDefinition: true, align: 32)
!1060 = !DIGlobalVariableExpression(var: !1061, expr: !DIExpression())
!1061 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_25", scope: !950, file: !1054, line: 318, type: !1062, isLocal: true, isDefinition: true, align: 32)
!1062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !811, line: 51, size: 64, elements: !1064)
!1064 = !{!1065, !1069}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1063, file: !811, line: 60, baseType: !1066, size: 32)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 32)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!103, !978}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1063, file: !811, line: 65, baseType: !978, size: 32, offset: 32)
!1070 = !DIGlobalVariableExpression(var: !1071, expr: !DIExpression())
!1071 = distinct !DIGlobalVariable(name: "imx_gpio_0_data", scope: !950, file: !1054, line: 318, type: !1072, isLocal: true, isDefinition: true)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_data", file: !1054, line: 33, size: 96, elements: !1073)
!1073 = !{!1074, !1075}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1072, file: !1054, line: 35, baseType: !1047, size: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !1072, file: !1054, line: 37, baseType: !1076, size: 64, offset: 32)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !1025, line: 40, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !1025, line: 35, size: 64, elements: !1078)
!1078 = !{!1079, !1081}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1077, file: !1025, line: 36, baseType: !1080, size: 32)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1077, file: !1025, line: 37, baseType: !1080, size: 32, offset: 32)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_25", scope: !950, file: !1054, line: 318, type: !987, isLocal: true, isDefinition: true, align: 8)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(name: "imx_gpio_0_config", scope: !950, file: !1054, line: 318, type: !1086, isLocal: true, isDefinition: true)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_config", file: !1054, line: 23, size: 128, elements: !1088)
!1088 = !{!1089, !1090, !1103, !1114}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1087, file: !1054, line: 25, baseType: !1042, size: 32)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1087, file: !1054, line: 26, baseType: !1091, size: 32, offset: 32)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 32)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_Type", file: !682, line: 19729, baseType: !1093)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !682, line: 19720, size: 256, elements: !1094)
!1094 = !{!1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !1093, file: !682, line: 19721, baseType: !686, size: 32)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "GDIR", scope: !1093, file: !682, line: 19722, baseType: !686, size: 32, offset: 32)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "PSR", scope: !1093, file: !682, line: 19723, baseType: !757, size: 32, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "ICR1", scope: !1093, file: !682, line: 19724, baseType: !686, size: 32, offset: 96)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ICR2", scope: !1093, file: !682, line: 19725, baseType: !686, size: 32, offset: 128)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !1093, file: !682, line: 19726, baseType: !686, size: 32, offset: 160)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ISR", scope: !1093, file: !682, line: 19727, baseType: !686, size: 32, offset: 192)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "EDGE_SEL", scope: !1093, file: !682, line: 19728, baseType: !686, size: 32, offset: 224)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "pin_muxes", scope: !1087, file: !1054, line: 28, baseType: !1104, size: 32, offset: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 32)
!1105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_soc_pinmux", file: !1107, line: 51, size: 128, elements: !1108)
!1107 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/pinctrl_soc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1108 = !{!1109, !1110, !1111, !1112, !1113}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "mux_register", scope: !1106, file: !1107, line: 52, baseType: !108, size: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "config_register", scope: !1106, file: !1107, line: 53, baseType: !108, size: 32, offset: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "input_register", scope: !1106, file: !1107, line: 54, baseType: !108, size: 32, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "mux_mode", scope: !1106, file: !1107, line: 55, baseType: !185, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "input_daisy", scope: !1106, file: !1107, line: 56, baseType: !108, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "mux_count", scope: !1087, file: !1054, line: 29, baseType: !185, size: 8, offset: 96)
!1115 = !DIGlobalVariableExpression(var: !1116, expr: !DIExpression())
!1116 = distinct !DIGlobalVariable(name: "imx_gpio_driver_api", scope: !950, file: !1054, line: 249, type: !971, isLocal: true, isDefinition: true)
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(name: "__isr_imx_gpio_port_isr_irq_0", scope: !1119, file: !1054, line: 318, type: !1122, isLocal: true, isDefinition: true, align: 32)
!1119 = distinct !DISubprogram(name: "imx_gpio_0_init", scope: !1054, file: !1054, line: 318, type: !1067, scopeLine: 318, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !950, retainedNodes: !1120)
!1120 = !{!1121}
!1121 = !DILocalVariable(name: "port", arg: 1, scope: !1119, file: !1054, line: 318, type: !978)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !1123)
!1123 = !{!1124, !1125, !1126, !1127}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !1122, file: !10, line: 55, baseType: !325, size: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1122, file: !10, line: 57, baseType: !325, size: 32, offset: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1122, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
