; ModuleID = 'build/96b_meerkat96/integration/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.ztest_suite_stats = type { i32, i32, i32 }
%struct.ztest_suite_node = type { i8*, i8* ()*, void (i8*)*, void (i8*)*, void (i8*)*, i1 (i8*)*, %struct.ztest_suite_stats* }
%struct.ztest_unit_test_stats = type { i32, i32, i32, i32, i32 }
%struct.ztest_unit_test = type { i8*, i8*, void (i8*)*, i32, %struct.ztest_unit_test_stats* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_thread_stack_element = type { i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, [32 x i8], i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/integration/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/integration")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/integration")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "z_ztest_suite_node_stats_framework_tests", scope: !27, file: !111, line: 10, type: !149, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !108, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/testsuite/integration/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/integration")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_ZTEST_SUITE_NODE", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_ZTEST_SUITE_STATS", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_ZTEST_UNIT_TEST", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_ZTEST_TEST_RULE", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 67)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 68)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 69)
!104 = !DIEnumerator(name: "K_OBJ_LAST", value: 70)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !{!109, !155, !25, !173}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "z_ztest_test_node_framework_tests", scope: !27, file: !111, line: 10, type: !112, isLocal: true, isDefinition: true, align: 32)
!111 = !DIFile(filename: "zephyr/samples/subsys/testsuite/integration/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_node", file: !114, line: 177, size: 224, elements: !115)
!114 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/include/zephyr/ztest_test_new.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !{!116, !121, !127, !133, !136, !139, !146}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !114, line: 179, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !113, file: !114, line: 182, baseType: !122, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_setup_t", file: !114, line: 141, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DISubroutineType(types: !126)
!126 = !{!106}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !113, file: !114, line: 185, baseType: !128, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_before_t", file: !114, line: 148, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !106}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !113, file: !114, line: 188, baseType: !134, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_after_t", file: !114, line: 155, baseType: !130)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "teardown", scope: !113, file: !114, line: 191, baseType: !137, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_teardown_t", file: !114, line: 162, baseType: !130)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !113, file: !114, line: 194, baseType: !140, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_predicate_t", file: !114, line: 171, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !13}
!145 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !113, file: !114, line: 197, baseType: !147, size: 32, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_stats", file: !114, line: 114, size: 96, elements: !150)
!150 = !{!151, !153, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !149, file: !114, line: 116, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !149, file: !114, line: 118, baseType: !152, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !149, file: !114, line: 120, baseType: !152, size: 32, offset: 64)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "z_ztest_unit_test__framework_tests__test_assert", scope: !27, file: !111, line: 18, type: !157, isLocal: true, isDefinition: true, align: 32)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_unit_test", file: !114, line: 97, size: 160, elements: !158)
!158 = !{!159, !160, !161, !162, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "test_suite_name", scope: !157, file: !114, line: 98, baseType: !118, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !114, line: 99, baseType: !118, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !157, file: !114, line: 100, baseType: !130, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "thread_options", scope: !157, file: !114, line: 101, baseType: !152, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !157, file: !114, line: 104, baseType: !164, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_unit_test_stats", file: !114, line: 123, size: 160, elements: !167)
!167 = !{!168, !169, !170, !171, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !166, file: !114, line: 125, baseType: !152, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !166, file: !114, line: 127, baseType: !152, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !166, file: !114, line: 129, baseType: !152, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pass_count", scope: !166, file: !114, line: 131, baseType: !152, size: 32, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "duration_worst_ms", scope: !166, file: !114, line: 133, baseType: !152, size: 32, offset: 128)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "z_ztest_unit_test_stats_framework_tests_test_assert", scope: !27, file: !111, line: 18, type: !166, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !177, file: !200, line: 18, type: !201, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !179, globals: !199, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/integration")
!179 = !{!22, !106, !24, !180, !182, !184, !185, !107, !187, !188, !190, !192, !193, !194, !197, !118}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !186, line: 214, baseType: !32)
!186 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !196)
!196 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !198)
!198 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!199 = !{!175}
!200 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !204)
!203 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !203, line: 17, baseType: !118, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !202, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "_char_out", scope: !209, file: !212, line: 54, type: !213, isLocal: false, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !211, splitDebugInlining: false, nameTableKind: None)
!210 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/integration")
!211 = !{!207}
!212 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DISubroutineType(types: !215)
!215 = !{!107, !107}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !218, file: !632, line: 258, type: !633, isLocal: true, isDefinition: true, align: 32)
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !220, retainedTypes: !503, globals: !631, splitDebugInlining: false, nameTableKind: None)
!219 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/integration")
!220 = !{!221, !253, !263, !312, !318, !439, !474}
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !222, line: 54, baseType: !32, size: 32, elements: !223)
!222 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252}
!224 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!225 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!226 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!227 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!228 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!229 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!230 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!231 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!232 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!233 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!234 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!235 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!236 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!237 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!238 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!239 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!240 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!241 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!242 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!243 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!244 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!245 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!246 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!247 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!248 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!249 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!250 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!251 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!252 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!253 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !222, line: 224, baseType: !32, size: 32, elements: !254)
!254 = !{!255, !256, !257, !258, !259, !260, !261, !262}
!255 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!256 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!257 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!258 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!259 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!260 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!261 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!262 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !222, line: 275, baseType: !32, size: 32, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311}
!265 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!266 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!267 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!268 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!269 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!270 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!271 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!272 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!273 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!274 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!275 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!276 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!277 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!278 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!279 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!280 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!281 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!282 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!283 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!284 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!285 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!286 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!287 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!288 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!289 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!290 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!291 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!292 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!293 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!294 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!295 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!296 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!297 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!298 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!299 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!300 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!301 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!302 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!303 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!304 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!305 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!306 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!307 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!308 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!309 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!310 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!311 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!312 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !222, line: 327, baseType: !32, size: 32, elements: !313)
!313 = !{!314, !315, !316, !317}
!314 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!315 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!316 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!317 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!318 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !319, line: 76, baseType: !32, size: 32, elements: !320)
!319 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!320 = !{!321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438}
!321 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!322 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!323 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!324 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!325 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!326 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!327 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!328 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!329 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!330 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!331 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!332 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!333 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!334 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!335 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!336 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!337 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!338 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!339 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!340 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!341 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!342 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!343 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!344 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!345 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!346 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!347 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!348 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!349 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!350 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!351 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!352 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!353 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!354 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!355 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!356 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!357 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!358 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!359 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!360 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!361 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!362 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!363 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!364 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!365 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!366 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!367 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!368 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!369 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!370 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!371 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!372 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!373 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!374 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!375 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!376 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!377 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!378 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!379 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!380 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!381 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!382 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!383 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!384 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!385 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!386 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!387 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!388 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!389 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!390 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!391 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!392 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!393 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!394 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!395 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!396 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!397 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!398 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!399 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!400 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!401 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!402 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!403 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!404 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!405 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!406 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!407 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!408 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!409 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!410 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!411 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!412 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!413 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!414 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!415 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!416 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!417 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!418 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!419 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!420 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!421 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!422 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!423 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!424 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!425 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!426 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!427 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!428 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!429 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!430 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!431 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!432 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!433 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!434 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!435 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!436 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!437 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!438 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!439 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !222, line: 237, baseType: !32, size: 32, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473}
!441 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!442 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!443 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!444 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!445 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!446 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!447 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!448 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!449 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!450 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!451 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!452 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!453 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!454 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!455 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!456 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!457 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!458 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!459 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!460 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!461 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!462 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!463 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!464 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!465 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!466 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!467 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!468 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!469 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!470 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!471 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!472 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!473 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!474 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !319, line: 44, baseType: !32, size: 32, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502}
!476 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!477 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!478 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!479 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!480 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!481 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!482 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!483 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!484 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!485 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!486 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!487 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!488 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!489 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!490 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!491 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!492 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!493 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!494 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!495 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!496 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!497 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!498 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!499 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!500 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!501 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!502 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!503 = !{!504, !576, !619, !630, !152}
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !506, line: 4575, baseType: !507)
!506 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !506, line: 4532, size: 390144, elements: !508)
!508 = !{!509, !511, !512, !513, !514, !518, !528, !532, !542, !546}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !507, file: !506, line: 4533, baseType: !510, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !152)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !507, file: !506, line: 4534, baseType: !510, size: 32, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !507, file: !506, line: 4535, baseType: !510, size: 32, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !507, file: !506, line: 4536, baseType: !510, size: 32, offset: 96)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !507, file: !506, line: 4537, baseType: !515, size: 16256, offset: 128)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 16256, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 2032)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !507, file: !506, line: 4543, baseType: !519, size: 4224, offset: 16384)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 4224, elements: !526)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !507, file: !506, line: 4538, size: 128, elements: !521)
!521 = !{!522, !523, !524, !525}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !520, file: !506, line: 4539, baseType: !510, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_SET", scope: !520, file: !506, line: 4540, baseType: !510, size: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_CLR", scope: !520, file: !506, line: 4541, baseType: !510, size: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_TOG", scope: !520, file: !506, line: 4542, baseType: !510, size: 32, offset: 96)
!526 = !{!527}
!527 = !DISubrange(count: 33)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !507, file: !506, line: 4544, baseType: !529, size: 110464, offset: 20608)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 110464, elements: !530)
!530 = !{!531}
!531 = !DISubrange(count: 13808)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !507, file: !506, line: 4550, baseType: !533, size: 24448, offset: 131072)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 24448, elements: !540)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !507, file: !506, line: 4545, size: 128, elements: !535)
!535 = !{!536, !537, !538, !539}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !534, file: !506, line: 4546, baseType: !510, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_SET", scope: !534, file: !506, line: 4547, baseType: !510, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_CLR", scope: !534, file: !506, line: 4548, baseType: !510, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_TOG", scope: !534, file: !506, line: 4549, baseType: !510, size: 32, offset: 96)
!540 = !{!541}
!541 = !DISubrange(count: 191)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !507, file: !506, line: 4551, baseType: !543, size: 106624, offset: 155520)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 106624, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 13328)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !507, file: !506, line: 4574, baseType: !547, size: 128000, offset: 262144)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 128000, elements: !574)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !507, file: !506, line: 4552, size: 1024, elements: !549)
!549 = !{!550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !570, !571, !572, !573}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT", scope: !548, file: !506, line: 4553, baseType: !510, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_SET", scope: !548, file: !506, line: 4554, baseType: !510, size: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_CLR", scope: !548, file: !506, line: 4555, baseType: !510, size: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_TOG", scope: !548, file: !506, line: 4556, baseType: !510, size: 32, offset: 96)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "MISC", scope: !548, file: !506, line: 4557, baseType: !510, size: 32, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_SET", scope: !548, file: !506, line: 4558, baseType: !510, size: 32, offset: 160)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_CLR", scope: !548, file: !506, line: 4559, baseType: !510, size: 32, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_TOG", scope: !548, file: !506, line: 4560, baseType: !510, size: 32, offset: 224)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "POST", scope: !548, file: !506, line: 4561, baseType: !510, size: 32, offset: 256)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_SET", scope: !548, file: !506, line: 4562, baseType: !510, size: 32, offset: 288)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_CLR", scope: !548, file: !506, line: 4563, baseType: !510, size: 32, offset: 320)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_TOG", scope: !548, file: !506, line: 4564, baseType: !510, size: 32, offset: 352)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "PRE", scope: !548, file: !506, line: 4565, baseType: !510, size: 32, offset: 384)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_SET", scope: !548, file: !506, line: 4566, baseType: !510, size: 32, offset: 416)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_CLR", scope: !548, file: !506, line: 4567, baseType: !510, size: 32, offset: 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_TOG", scope: !548, file: !506, line: 4568, baseType: !510, size: 32, offset: 480)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !548, file: !506, line: 4569, baseType: !567, size: 384, offset: 512)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 384, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 48)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL", scope: !548, file: !506, line: 4570, baseType: !510, size: 32, offset: 896)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_SET", scope: !548, file: !506, line: 4571, baseType: !510, size: 32, offset: 928)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_CLR", scope: !548, file: !506, line: 4572, baseType: !510, size: 32, offset: 960)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !548, file: !506, line: 4573, baseType: !510, size: 32, offset: 992)
!574 = !{!575}
!575 = !DISubrange(count: 125)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDC_Type", file: !506, line: 38320, baseType: !578)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !506, line: 38303, size: 23040, elements: !579)
!579 = !{!580, !582, !586, !587, !588, !589, !593, !597, !601, !605, !609}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "VIR", scope: !578, file: !506, line: 38304, baseType: !581, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !510)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !578, file: !506, line: 38305, baseType: !583, size: 256, offset: 32)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 256, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "STAT", scope: !578, file: !506, line: 38306, baseType: !510, size: 32, offset: 288)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "INTCTRL", scope: !578, file: !506, line: 38307, baseType: !510, size: 32, offset: 320)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "INTSTAT", scope: !578, file: !506, line: 38308, baseType: !510, size: 32, offset: 352)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !578, file: !506, line: 38309, baseType: !590, size: 3712, offset: 384)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 3712, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 464)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "MDA", scope: !578, file: !506, line: 38310, baseType: !594, size: 864, offset: 4096)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 864, elements: !595)
!595 = !{!596}
!596 = !DISubrange(count: 27)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !578, file: !506, line: 38311, baseType: !598, size: 3232, offset: 4960)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 3232, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 404)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "PDAP", scope: !578, file: !506, line: 38312, baseType: !602, size: 3776, offset: 8192)
!602 = !DICompositeType(tag: DW_TAG_array_type, baseType: !510, size: 3776, elements: !603)
!603 = !{!604}
!604 = !DISubrange(count: 118)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_3", scope: !578, file: !506, line: 38313, baseType: !606, size: 4416, offset: 11968)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 4416, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 552)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "MR", scope: !578, file: !506, line: 38319, baseType: !610, size: 6656, offset: 16384)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 6656, elements: !617)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !578, file: !506, line: 38314, size: 128, elements: !612)
!612 = !{!613, !614, !615, !616}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "MRSA", scope: !611, file: !506, line: 38315, baseType: !510, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "MREA", scope: !611, file: !506, line: 38316, baseType: !510, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "MRC", scope: !611, file: !506, line: 38317, baseType: !510, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "MRVS", scope: !611, file: !506, line: 38318, baseType: !510, size: 32, offset: 96)
!617 = !{!618}
!618 = !DISubrange(count: 52)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "WDOG_Type", file: !506, line: 43319, baseType: !621)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !506, line: 43313, size: 80, elements: !622)
!622 = !{!623, !625, !626, !628, !629}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "WCR", scope: !621, file: !506, line: 43314, baseType: !624, size: 16)
!624 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !197)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "WSR", scope: !621, file: !506, line: 43315, baseType: !624, size: 16, offset: 16)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "WRSR", scope: !621, file: !506, line: 43316, baseType: !627, size: 16, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !624)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "WICR", scope: !621, file: !506, line: 43317, baseType: !624, size: 16, offset: 48)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "WMCR", scope: !621, file: !506, line: 43318, baseType: !624, size: 16, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!631 = !{!216}
!632 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !635, line: 51, size: 64, elements: !636)
!635 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!636 = !{!637, !644}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !634, file: !635, line: 60, baseType: !638, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = !DISubroutineType(types: !640)
!640 = !{!107, !641}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !643)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !635, line: 48, flags: DIFlagFwdDecl)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !634, file: !635, line: 65, baseType: !641, size: 32, offset: 32)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !647, file: !654, line: 21, type: !213, isLocal: true, isDefinition: true)
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !649, globals: !653, splitDebugInlining: false, nameTableKind: None)
!648 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/integration")
!649 = !{!650, !107, !106}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !652, line: 22, baseType: !107)
!652 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!653 = !{!645}
!654 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "phase", scope: !657, file: !661, line: 61, type: !660, isLocal: false, isDefinition: true)
!657 = distinct !DICompileUnit(language: DW_LANG_C99, file: !658, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !659, retainedTypes: !686, globals: !697, splitDebugInlining: false, nameTableKind: None)
!658 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/testsuite/ztest/src/ztest_new.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/integration")
!659 = !{!660, !669, !677, !30, !682}
!660 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_phase", file: !661, line: 40, baseType: !32, size: 32, elements: !662)
!661 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/src/ztest_new.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!662 = !{!663, !664, !665, !666, !667, !668}
!663 = !DIEnumerator(name: "TEST_PHASE_SETUP", value: 0)
!664 = !DIEnumerator(name: "TEST_PHASE_BEFORE", value: 1)
!665 = !DIEnumerator(name: "TEST_PHASE_TEST", value: 2)
!666 = !DIEnumerator(name: "TEST_PHASE_AFTER", value: 3)
!667 = !DIEnumerator(name: "TEST_PHASE_TEARDOWN", value: 4)
!668 = !DIEnumerator(name: "TEST_PHASE_FRAMEWORK", value: 5)
!669 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_result", file: !661, line: 226, baseType: !32, size: 32, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676}
!671 = !DIEnumerator(name: "ZTEST_RESULT_PENDING", value: 0)
!672 = !DIEnumerator(name: "ZTEST_RESULT_PASS", value: 1)
!673 = !DIEnumerator(name: "ZTEST_RESULT_FAIL", value: 2)
!674 = !DIEnumerator(name: "ZTEST_RESULT_SKIP", value: 3)
!675 = !DIEnumerator(name: "ZTEST_RESULT_SUITE_SKIP", value: 4)
!676 = !DIEnumerator(name: "ZTEST_RESULT_SUITE_FAIL", value: 5)
!677 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_status", file: !661, line: 52, baseType: !32, size: 32, elements: !678)
!678 = !{!679, !680, !681}
!679 = !DIEnumerator(name: "ZTEST_STATUS_OK", value: 0)
!680 = !DIEnumerator(name: "ZTEST_STATUS_HAS_FAILURE", value: 1)
!681 = !DIEnumerator(name: "ZTEST_STATUS_CRITICAL_ERROR", value: 2)
!682 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_expected_result", file: !114, line: 36, baseType: !32, size: 32, elements: !683)
!683 = !{!684, !685}
!684 = !DIEnumerator(name: "ZTEST_EXPECTED_RESULT_FAIL", value: 0)
!685 = !DIEnumerator(name: "ZTEST_EXPECTED_RESULT_SKIP", value: 1)
!686 = !{!106, !107, !185, !687, !692, !152, !695}
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !688, line: 46, baseType: !689)
!688 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 32)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !106, !106, !106}
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !693, line: 46, baseType: !694)
!693 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !191)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !696)
!696 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!697 = !{!655, !698, !700, !702, !711, !713, !826, !829}
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "test_result", scope: !657, file: !661, line: 234, type: !669, isLocal: true, isDefinition: true)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "current_test_failed_assumption", scope: !657, file: !661, line: 294, type: !145, isLocal: true, isDefinition: true)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "ztest_thread_stack", scope: !657, file: !661, line: 430, type: !704, isLocal: false, isDefinition: true, align: 64)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 8192, elements: !709)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !706, line: 47, size: 8, elements: !707)
!706 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!707 = !{!708}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !705, file: !706, line: 48, baseType: !120, size: 8)
!709 = !{!710}
!710 = !DISubrange(count: 1024)
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "test_status", scope: !657, file: !661, line: 63, type: !677, isLocal: true, isDefinition: true)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "ztest_thread", scope: !657, file: !661, line: 17, type: !715, isLocal: true, isDefinition: true)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !716, line: 245, size: 1152, elements: !717)
!716 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!717 = !{!718, !783, !796, !797, !798, !800, !801, !821}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !715, file: !716, line: 247, baseType: !719, size: 384)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !716, line: 57, size: 384, elements: !720)
!720 = !{!721, !749, !757, !758, !759, !770, !771, !772}
!721 = !DIDerivedType(tag: DW_TAG_member, scope: !719, file: !716, line: 60, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !719, file: !716, line: 60, size: 64, elements: !723)
!723 = !{!724, !740}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !722, file: !716, line: 61, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !726, line: 49, baseType: !727)
!726 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !726, line: 37, size: 64, elements: !728)
!728 = !{!729, !735}
!729 = !DIDerivedType(tag: DW_TAG_member, scope: !727, file: !726, line: 38, baseType: !730, size: 32)
!730 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !727, file: !726, line: 38, size: 32, elements: !731)
!731 = !{!732, !734}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !730, file: !726, line: 39, baseType: !733, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !730, file: !726, line: 40, baseType: !733, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, scope: !727, file: !726, line: 42, baseType: !736, size: 32, offset: 32)
!736 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !727, file: !726, line: 42, size: 32, elements: !737)
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !736, file: !726, line: 43, baseType: !733, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !736, file: !726, line: 44, baseType: !733, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !722, file: !716, line: 62, baseType: !741, size: 64)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !742, line: 49, size: 64, elements: !743)
!742 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!743 = !{!744}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !741, file: !742, line: 50, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 64, elements: !747)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 32)
!747 = !{!748}
!748 = !DISubrange(count: 2)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !719, file: !716, line: 68, baseType: !750, size: 32, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !752, line: 233, baseType: !753)
!752 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !752, line: 231, size: 64, elements: !754)
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !753, file: !752, line: 232, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !726, line: 48, baseType: !727)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !719, file: !716, line: 71, baseType: !195, size: 8, offset: 96)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !719, file: !716, line: 74, baseType: !195, size: 8, offset: 104)
!759 = !DIDerivedType(tag: DW_TAG_member, scope: !719, file: !716, line: 90, baseType: !760, size: 16, offset: 112)
!760 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !719, file: !716, line: 90, size: 16, elements: !761)
!761 = !{!762, !769}
!762 = !DIDerivedType(tag: DW_TAG_member, scope: !760, file: !716, line: 91, baseType: !763, size: 16)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !760, file: !716, line: 91, size: 16, elements: !764)
!764 = !{!765, !768}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !763, file: !716, line: 96, baseType: !766, size: 8)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !767)
!767 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !763, file: !716, line: 97, baseType: !195, size: 8, offset: 8)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !760, file: !716, line: 100, baseType: !197, size: 16)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !719, file: !716, line: 107, baseType: !152, size: 32, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !719, file: !716, line: 127, baseType: !106, size: 32, offset: 160)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !719, file: !716, line: 131, baseType: !773, size: 192, offset: 192)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !752, line: 244, size: 192, elements: !774)
!774 = !{!775, !776, !782}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !773, file: !752, line: 245, baseType: !725, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !773, file: !752, line: 246, baseType: !777, size: 32, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !752, line: 242, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 32)
!779 = !DISubroutineType(types: !780)
!780 = !{null, !781}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !773, file: !752, line: 249, baseType: !694, size: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !715, file: !716, line: 250, baseType: !784, size: 288, offset: 384)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !785, line: 25, size: 288, elements: !786)
!785 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !784, file: !785, line: 26, baseType: !152, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !784, file: !785, line: 27, baseType: !152, size: 32, offset: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !784, file: !785, line: 28, baseType: !152, size: 32, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !784, file: !785, line: 29, baseType: !152, size: 32, offset: 96)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !784, file: !785, line: 30, baseType: !152, size: 32, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !784, file: !785, line: 31, baseType: !152, size: 32, offset: 160)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !784, file: !785, line: 32, baseType: !152, size: 32, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !784, file: !785, line: 33, baseType: !152, size: 32, offset: 224)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !784, file: !785, line: 34, baseType: !152, size: 32, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !715, file: !716, line: 253, baseType: !106, size: 32, offset: 672)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !715, file: !716, line: 256, baseType: !751, size: 64, offset: 704)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !715, file: !716, line: 279, baseType: !799, size: 256, offset: 768)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 256, elements: !584)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !715, file: !716, line: 294, baseType: !107, size: 32, offset: 1024)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !715, file: !716, line: 325, baseType: !802, size: 32, offset: 1056)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !804, line: 5073, size: 192, elements: !805)
!804 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!805 = !{!806, !815, !816}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !803, file: !804, line: 5074, baseType: !807, size: 96)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !808, line: 56, size: 96, elements: !809)
!808 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!809 = !{!810, !813, !814}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !807, file: !808, line: 57, baseType: !811, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 32)
!812 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !808, line: 57, flags: DIFlagFwdDecl)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !807, file: !808, line: 58, baseType: !106, size: 32, offset: 32)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !807, file: !808, line: 59, baseType: !185, size: 32, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !803, file: !804, line: 5075, baseType: !751, size: 64, offset: 96)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !803, file: !804, line: 5076, baseType: !817, size: 32, offset: 160)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !818, line: 43, size: 32, elements: !819)
!818 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!819 = !{!820}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !817, file: !818, line: 52, baseType: !22, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !715, file: !716, line: 343, baseType: !822, size: 64, offset: 1088)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !785, line: 60, size: 64, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !822, file: !785, line: 63, baseType: !152, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !822, file: !785, line: 66, baseType: !152, size: 32, offset: 32)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "tc_start_time", scope: !657, file: !828, line: 95, type: !152, isLocal: true, isDefinition: true)
!828 = !DIFile(filename: "zephyr/subsys/testsuite/include/zephyr/tc_util.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "tc_spend_time", scope: !657, file: !828, line: 96, type: !152, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "ztest_api", scope: !834, file: !837, line: 70, type: !838, isLocal: false, isDefinition: true)
!834 = distinct !DICompileUnit(language: DW_LANG_C99, file: !835, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !836, splitDebugInlining: false, nameTableKind: None)
!835 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/testsuite/ztest/src/ztest_defaults.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/integration")
!836 = !{!832}
!837 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/src/ztest_defaults.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!838 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_arch_api", file: !114, line: 499, size: 96, elements: !840)
!840 = !{!841, !842, !863}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "run_all", scope: !839, file: !114, line: 500, baseType: !16, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "should_suite_run", scope: !839, file: !114, line: 501, baseType: !843, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DISubroutineType(types: !845)
!845 = !{!145, !13, !846}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_node", file: !114, line: 177, size: 224, elements: !848)
!848 = !{!849, !850, !851, !852, !853, !854, !855}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !847, file: !114, line: 179, baseType: !117, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !847, file: !114, line: 182, baseType: !122, size: 32, offset: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !847, file: !114, line: 185, baseType: !128, size: 32, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !847, file: !114, line: 188, baseType: !134, size: 32, offset: 96)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "teardown", scope: !847, file: !114, line: 191, baseType: !137, size: 32, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !847, file: !114, line: 194, baseType: !140, size: 32, offset: 160)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !847, file: !114, line: 197, baseType: !856, size: 32, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_stats", file: !114, line: 114, size: 96, elements: !859)
!859 = !{!860, !861, !862}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !858, file: !114, line: 116, baseType: !152, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !858, file: !114, line: 118, baseType: !152, size: 32, offset: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !858, file: !114, line: 120, baseType: !152, size: 32, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "should_test_run", scope: !839, file: !114, line: 502, baseType: !864, size: 32, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!865 = !DISubroutineType(types: !866)
!866 = !{!145, !118, !118}
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !869, file: !965, line: 603, type: !967, isLocal: true, isDefinition: true, align: 32)
!869 = distinct !DICompileUnit(language: DW_LANG_C99, file: !870, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !871, globals: !962, splitDebugInlining: false, nameTableKind: None)
!870 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/integration")
!871 = !{!106, !107, !872}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !875, line: 336, size: 608, elements: !876)
!875 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!876 = !{!877, !903, !907, !911, !924, !929, !935, !940, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !874, file: !875, line: 365, baseType: !878, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 32)
!879 = !DISubroutineType(types: !880)
!880 = !{!107, !881, !902}
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !884, line: 378, size: 192, elements: !885)
!884 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!885 = !{!886, !887, !888, !889, !895, !896}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !883, file: !884, line: 380, baseType: !118, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !883, file: !884, line: 382, baseType: !13, size: 32, offset: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !883, file: !884, line: 384, baseType: !13, size: 32, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !883, file: !884, line: 386, baseType: !890, size: 32, offset: 96)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 32)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !884, line: 351, size: 16, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !891, file: !884, line: 359, baseType: !195, size: 8)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !891, file: !884, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !883, file: !884, line: 388, baseType: !106, size: 32, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !883, file: !884, line: 396, baseType: !897, size: 32, offset: 160)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !884, line: 43, baseType: !900)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !901)
!901 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !874, file: !875, line: 366, baseType: !904, size: 32, offset: 32)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = !DISubroutineType(types: !906)
!906 = !{null, !881, !196}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !874, file: !875, line: 374, baseType: !908, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DISubroutineType(types: !910)
!910 = !{!107, !881}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !874, file: !875, line: 377, baseType: !912, size: 32, offset: 96)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!913 = !DISubroutineType(types: !914)
!914 = !{!107, !881, !915}
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !875, line: 122, size: 64, elements: !918)
!918 = !{!919, !920, !921, !922, !923}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !917, file: !875, line: 123, baseType: !152, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !917, file: !875, line: 124, baseType: !195, size: 8, offset: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !917, file: !875, line: 125, baseType: !195, size: 8, offset: 40)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !917, file: !875, line: 126, baseType: !195, size: 8, offset: 48)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !917, file: !875, line: 127, baseType: !195, size: 8, offset: 56)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !874, file: !875, line: 379, baseType: !925, size: 32, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = !DISubroutineType(types: !927)
!927 = !{!107, !881, !928}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !874, file: !875, line: 384, baseType: !930, size: 32, offset: 160)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!931 = !DISubroutineType(types: !932)
!932 = !{!107, !881, !933, !107}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !874, file: !875, line: 393, baseType: !936, size: 32, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!937 = !DISubroutineType(types: !938)
!938 = !{!107, !881, !194, !939}
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !874, file: !875, line: 402, baseType: !941, size: 32, offset: 224)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!942 = !DISubroutineType(types: !943)
!943 = !{null, !881}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !874, file: !875, line: 405, baseType: !941, size: 32, offset: 256)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !874, file: !875, line: 408, baseType: !908, size: 32, offset: 288)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !874, file: !875, line: 411, baseType: !941, size: 32, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !874, file: !875, line: 414, baseType: !941, size: 32, offset: 352)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !874, file: !875, line: 417, baseType: !908, size: 32, offset: 384)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !874, file: !875, line: 420, baseType: !908, size: 32, offset: 416)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !874, file: !875, line: 423, baseType: !941, size: 32, offset: 448)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !874, file: !875, line: 426, baseType: !941, size: 32, offset: 480)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !874, file: !875, line: 429, baseType: !908, size: 32, offset: 512)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !874, file: !875, line: 432, baseType: !908, size: 32, offset: 544)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !874, file: !875, line: 435, baseType: !955, size: 32, offset: 576)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !881, !958, !106}
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !875, line: 142, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!960 = !DISubroutineType(types: !961)
!961 = !{null, !881, !106}
!962 = !{!867, !963}
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !869, file: !965, line: 38, type: !966, isLocal: true, isDefinition: true)
!965 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !881)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !635, line: 51, size: 64, elements: !969)
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !968, file: !635, line: 60, baseType: !908, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !968, file: !635, line: 65, baseType: !881, size: 32, offset: 32)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "mcux_igpio_pinmux_0", scope: !974, file: !1078, line: 318, type: !1155, isLocal: false, isDefinition: true)
!974 = distinct !DICompileUnit(language: DW_LANG_C99, file: !975, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !976, retainedTypes: !993, globals: !1075, splitDebugInlining: false, nameTableKind: None)
!975 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/integration")
!976 = !{!977, !983, !988}
!977 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !978, line: 506, baseType: !32, size: 32, elements: !979)
!978 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!979 = !{!980, !981, !982}
!980 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!981 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!982 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!983 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !978, line: 512, baseType: !32, size: 32, elements: !984)
!984 = !{!985, !986, !987}
!985 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!986 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!987 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!988 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_gpio_pin_action", file: !989, line: 66, baseType: !32, size: 32, elements: !990)
!989 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./gpio_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!990 = !{!991, !992}
!991 = !DIEnumerator(name: "gpioPinClear", value: 0)
!992 = !DIEnumerator(name: "gpioPinSet", value: 1)
!993 = !{!994, !1064, !1069, !1029, !983, !977, !1074, !106, !630, !1044, !193}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !978, line: 523, size: 288, elements: !997)
!997 = !{!998, !1019, !1025, !1030, !1034, !1035, !1036, !1040, !1060}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !996, file: !978, line: 524, baseType: !999, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 32)
!1000 = !DISubroutineType(types: !1001)
!1001 = !{!107, !1002, !1017, !1018}
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !884, line: 378, size: 192, elements: !1005)
!1005 = !{!1006, !1007, !1008, !1009, !1015, !1016}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1004, file: !884, line: 380, baseType: !118, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1004, file: !884, line: 382, baseType: !13, size: 32, offset: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1004, file: !884, line: 384, baseType: !13, size: 32, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1004, file: !884, line: 386, baseType: !1010, size: 32, offset: 96)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 32)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !884, line: 351, size: 16, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1011, file: !884, line: 359, baseType: !195, size: 8)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1011, file: !884, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1004, file: !884, line: 388, baseType: !106, size: 32, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1004, file: !884, line: 396, baseType: !897, size: 32, offset: 160)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !978, line: 237, baseType: !195)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !978, line: 257, baseType: !152)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !996, file: !978, line: 530, baseType: !1020, size: 32, offset: 32)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 32)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!107, !1002, !1023}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !978, line: 229, baseType: !152)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !996, file: !978, line: 532, baseType: !1026, size: 32, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 32)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{!107, !1002, !1029, !1024}
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !978, line: 216, baseType: !152)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !996, file: !978, line: 535, baseType: !1031, size: 32, offset: 96)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 32)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!107, !1002, !1029}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !996, file: !978, line: 537, baseType: !1031, size: 32, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !996, file: !978, line: 539, baseType: !1031, size: 32, offset: 160)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !996, file: !978, line: 541, baseType: !1037, size: 32, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 32)
!1038 = !DISubroutineType(types: !1039)
!1039 = !{!107, !1002, !1017, !977, !983}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !996, file: !978, line: 544, baseType: !1041, size: 32, offset: 224)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 32)
!1042 = !DISubroutineType(types: !1043)
!1043 = !{!107, !1002, !1044, !145}
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 32)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !978, line: 478, size: 96, elements: !1046)
!1046 = !{!1047, !1054, !1059}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1045, file: !978, line: 482, baseType: !1048, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !1049, line: 33, baseType: !1050)
!1049 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !1049, line: 29, size: 32, elements: !1051)
!1051 = !{!1052}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1050, file: !1049, line: 30, baseType: !1053, size: 32)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1045, file: !978, line: 485, baseType: !1055, size: 32, offset: 32)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !978, line: 464, baseType: !1056)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 32)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{null, !1002, !1044, !1029}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !1045, file: !978, line: 493, baseType: !1029, size: 32, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !996, file: !978, line: 547, baseType: !1061, size: 32, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 32)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!152, !1002}
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 32)
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !978, line: 428, size: 32, elements: !1067)
!1067 = !{!1068}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !1066, file: !978, line: 434, baseType: !1029, size: 32)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 32)
!1070 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !978, line: 441, size: 32, elements: !1072)
!1072 = !{!1073}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1071, file: !978, line: 447, baseType: !1029, size: 32)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 32)
!1075 = !{!972, !1076, !1082, !1084, !1094, !1106, !1108, !1139, !1141, !1153}
!1076 = !DIGlobalVariableExpression(var: !1077, expr: !DIExpression())
!1077 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !974, file: !1078, line: 318, type: !1079, isLocal: false, isDefinition: true, align: 16)
!1078 = !DIFile(filename: "zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 400, elements: !1080)
!1080 = !{!1081}
!1081 = !DISubrange(count: 25)
!1082 = !DIGlobalVariableExpression(var: !1083, expr: !DIExpression())
!1083 = distinct !DIGlobalVariable(name: "__device_dts_ord_25", scope: !974, file: !1078, line: 318, type: !1003, isLocal: false, isDefinition: true, align: 32)
!1084 = !DIGlobalVariableExpression(var: !1085, expr: !DIExpression())
!1085 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_25", scope: !974, file: !1078, line: 318, type: !1086, isLocal: true, isDefinition: true, align: 32)
!1086 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !635, line: 51, size: 64, elements: !1088)
!1088 = !{!1089, !1093}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1087, file: !635, line: 60, baseType: !1090, size: 32)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 32)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{!107, !1002}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1087, file: !635, line: 65, baseType: !1002, size: 32, offset: 32)
!1094 = !DIGlobalVariableExpression(var: !1095, expr: !DIExpression())
!1095 = distinct !DIGlobalVariable(name: "imx_gpio_0_data", scope: !974, file: !1078, line: 318, type: !1096, isLocal: true, isDefinition: true)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_data", file: !1078, line: 33, size: 96, elements: !1097)
!1097 = !{!1098, !1099}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1096, file: !1078, line: 35, baseType: !1071, size: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !1096, file: !1078, line: 37, baseType: !1100, size: 64, offset: 32)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !1049, line: 40, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !1049, line: 35, size: 64, elements: !1102)
!1102 = !{!1103, !1105}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1101, file: !1049, line: 36, baseType: !1104, size: 32)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 32)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1101, file: !1049, line: 37, baseType: !1104, size: 32, offset: 32)
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_25", scope: !974, file: !1078, line: 318, type: !1011, isLocal: true, isDefinition: true, align: 8)
!1108 = !DIGlobalVariableExpression(var: !1109, expr: !DIExpression())
!1109 = distinct !DIGlobalVariable(name: "imx_gpio_0_config", scope: !974, file: !1078, line: 318, type: !1110, isLocal: true, isDefinition: true)
!1110 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_config", file: !1078, line: 23, size: 128, elements: !1112)
!1112 = !{!1113, !1114, !1127, !1138}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1111, file: !1078, line: 25, baseType: !1066, size: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1111, file: !1078, line: 26, baseType: !1115, size: 32, offset: 32)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 32)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_Type", file: !506, line: 19729, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !506, line: 19720, size: 256, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !1117, file: !506, line: 19721, baseType: !510, size: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "GDIR", scope: !1117, file: !506, line: 19722, baseType: !510, size: 32, offset: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "PSR", scope: !1117, file: !506, line: 19723, baseType: !581, size: 32, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "ICR1", scope: !1117, file: !506, line: 19724, baseType: !510, size: 32, offset: 96)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ICR2", scope: !1117, file: !506, line: 19725, baseType: !510, size: 32, offset: 128)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !1117, file: !506, line: 19726, baseType: !510, size: 32, offset: 160)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "ISR", scope: !1117, file: !506, line: 19727, baseType: !510, size: 32, offset: 192)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "EDGE_SEL", scope: !1117, file: !506, line: 19728, baseType: !510, size: 32, offset: 224)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "pin_muxes", scope: !1111, file: !1078, line: 28, baseType: !1128, size: 32, offset: 64)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 32)
!1129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1130)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_soc_pinmux", file: !1131, line: 51, size: 128, elements: !1132)
!1131 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/pinctrl_soc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1132 = !{!1133, !1134, !1135, !1136, !1137}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "mux_register", scope: !1130, file: !1131, line: 52, baseType: !152, size: 32)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "config_register", scope: !1130, file: !1131, line: 53, baseType: !152, size: 32, offset: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "input_register", scope: !1130, file: !1131, line: 54, baseType: !152, size: 32, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "mux_mode", scope: !1130, file: !1131, line: 55, baseType: !195, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
