; ModuleID = 'build/actinius_icarus/threads/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_fifo = type { %struct.k_queue }
%struct.k_queue = type { %struct._sflist, %struct._sfnode, %struct._wait_q_t }
%struct._sflist = type { %struct._sfnode*, %struct._sfnode* }
%struct._sfnode = type { i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.led = type { %struct.gpio_dt_spec, i8 }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct._sfnode }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/threads/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/threads")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/threads")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "printk_fifo", scope: !27, file: !218, line: 37, type: !410, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !112, globals: !215, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/basic/threads/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/threads")
!29 = !{!30, !101, !107}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !102, line: 506, baseType: !32, size: 32, elements: !103)
!102 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!103 = !{!104, !105, !106}
!104 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!105 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!106 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!107 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !102, line: 512, baseType: !32, size: 32, elements: !108)
!108 = !{!109, !110, !111}
!109 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!110 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!111 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!112 = !{!113, !117, !118, !119, !202, !207, !167, !107, !101, !212, !156, !213}
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !114, line: 46, baseType: !115)
!114 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !116)
!116 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!118 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !102, line: 523, size: 288, elements: !122)
!122 = !{!123, !157, !163, !168, !172, !173, !174, !178, !198}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !121, file: !102, line: 524, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DISubroutineType(types: !126)
!126 = !{!118, !127, !154, !155}
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !130, line: 378, size: 192, elements: !131)
!130 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!131 = !{!132, !136, !137, !138, !147, !148}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !129, file: !130, line: 380, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !129, file: !130, line: 382, baseType: !13, size: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !129, file: !130, line: 384, baseType: !13, size: 32, offset: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !129, file: !130, line: 386, baseType: !139, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !130, line: 351, size: 16, elements: !141)
!141 = !{!142, !145}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !140, file: !130, line: 359, baseType: !143, size: 8)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !144)
!144 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !140, file: !130, line: 364, baseType: !146, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!146 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !129, file: !130, line: 388, baseType: !117, size: 32, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !129, file: !130, line: 396, baseType: !149, size: 32, offset: 160)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !130, line: 43, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !153)
!153 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !102, line: 237, baseType: !143)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !102, line: 257, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !121, file: !102, line: 530, baseType: !158, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!159 = !DISubroutineType(types: !160)
!160 = !{!118, !127, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !102, line: 229, baseType: !156)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !121, file: !102, line: 532, baseType: !164, size: 32, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = !DISubroutineType(types: !166)
!166 = !{!118, !127, !167, !162}
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !102, line: 216, baseType: !156)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !121, file: !102, line: 535, baseType: !169, size: 32, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = !DISubroutineType(types: !171)
!171 = !{!118, !127, !167}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !121, file: !102, line: 537, baseType: !169, size: 32, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !121, file: !102, line: 539, baseType: !169, size: 32, offset: 160)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !121, file: !102, line: 541, baseType: !175, size: 32, offset: 192)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!176 = !DISubroutineType(types: !177)
!177 = !{!118, !127, !154, !101, !107}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !121, file: !102, line: 544, baseType: !179, size: 32, offset: 224)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!118, !127, !182, !146}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !102, line: 478, size: 96, elements: !184)
!184 = !{!185, !192, !197}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !183, file: !102, line: 482, baseType: !186, size: 32)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !187, line: 33, baseType: !188)
!187 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !187, line: 29, size: 32, elements: !189)
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !188, file: !187, line: 30, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !183, file: !102, line: 485, baseType: !193, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !102, line: 464, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DISubroutineType(types: !196)
!196 = !{null, !127, !182, !167}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !183, file: !102, line: 493, baseType: !167, size: 32, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !121, file: !102, line: 547, baseType: !199, size: 32, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!156, !127}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !102, line: 428, size: 32, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !204, file: !102, line: 434, baseType: !167, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !102, line: 441, size: 32, elements: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !209, file: !102, line: 447, baseType: !167, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !214)
!214 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!215 = !{!25, !216, !368, !372, !374, !376, !378, !380, !385, !387, !389, !391, !393, !395, !408}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "_k_thread_data_blink0_id", scope: !27, file: !218, line: 111, type: !219, isLocal: false, isDefinition: true, align: 32)
!218 = !DIFile(filename: "zephyr/samples/basic/threads/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !220, line: 620, size: 384, elements: !221)
!220 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!221 = !{!222, !342, !350, !351, !356, !357, !358, !359, !360, !361, !363, !367}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !219, file: !220, line: 621, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 32)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !225, line: 245, size: 1024, elements: !226)
!225 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!226 = !{!227, !294, !307, !308, !309, !310, !318, !337}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !224, file: !225, line: 247, baseType: !228, size: 384)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !225, line: 57, size: 384, elements: !229)
!229 = !{!230, !258, !266, !267, !268, !281, !282, !283}
!230 = !DIDerivedType(tag: DW_TAG_member, scope: !228, file: !225, line: 60, baseType: !231, size: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !228, file: !225, line: 60, size: 64, elements: !232)
!232 = !{!233, !249}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !231, file: !225, line: 61, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !235, line: 49, baseType: !236)
!235 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !235, line: 37, size: 64, elements: !237)
!237 = !{!238, !244}
!238 = !DIDerivedType(tag: DW_TAG_member, scope: !236, file: !235, line: 38, baseType: !239, size: 32)
!239 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !236, file: !235, line: 38, size: 32, elements: !240)
!240 = !{!241, !243}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !239, file: !235, line: 39, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !239, file: !235, line: 40, baseType: !242, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, scope: !236, file: !235, line: 42, baseType: !245, size: 32, offset: 32)
!245 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !236, file: !235, line: 42, size: 32, elements: !246)
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !245, file: !235, line: 43, baseType: !242, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !245, file: !235, line: 44, baseType: !242, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !231, file: !225, line: 62, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !251, line: 49, size: 64, elements: !252)
!251 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !250, file: !251, line: 50, baseType: !254, size: 64)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !255, size: 64, elements: !256)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!256 = !{!257}
!257 = !DISubrange(count: 2)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !228, file: !225, line: 68, baseType: !259, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !261, line: 233, baseType: !262)
!261 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !261, line: 231, size: 64, elements: !263)
!263 = !{!264}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !262, file: !261, line: 232, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !235, line: 48, baseType: !236)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !228, file: !225, line: 71, baseType: !143, size: 8, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !228, file: !225, line: 74, baseType: !143, size: 8, offset: 104)
!268 = !DIDerivedType(tag: DW_TAG_member, scope: !228, file: !225, line: 90, baseType: !269, size: 16, offset: 112)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !228, file: !225, line: 90, size: 16, elements: !270)
!270 = !{!271, !278}
!271 = !DIDerivedType(tag: DW_TAG_member, scope: !269, file: !225, line: 91, baseType: !272, size: 16)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !269, file: !225, line: 91, size: 16, elements: !273)
!273 = !{!274, !277}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !272, file: !225, line: 96, baseType: !275, size: 8)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !276)
!276 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !272, file: !225, line: 97, baseType: !143, size: 8, offset: 8)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !269, file: !225, line: 100, baseType: !279, size: 16)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !280)
!280 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !228, file: !225, line: 107, baseType: !156, size: 32, offset: 128)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !228, file: !225, line: 127, baseType: !117, size: 32, offset: 160)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !228, file: !225, line: 131, baseType: !284, size: 192, offset: 192)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !261, line: 244, size: 192, elements: !285)
!285 = !{!286, !287, !293}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !284, file: !261, line: 245, baseType: !234, size: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !284, file: !261, line: 246, baseType: !288, size: 32, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !261, line: 242, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!290 = !DISubroutineType(types: !291)
!291 = !{null, !292}
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !284, file: !261, line: 249, baseType: !115, size: 64, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !224, file: !225, line: 250, baseType: !295, size: 288, offset: 384)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !296, line: 25, size: 288, elements: !297)
!296 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!297 = !{!298, !299, !300, !301, !302, !303, !304, !305, !306}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !295, file: !296, line: 26, baseType: !156, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !295, file: !296, line: 27, baseType: !156, size: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !295, file: !296, line: 28, baseType: !156, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !295, file: !296, line: 29, baseType: !156, size: 32, offset: 96)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !295, file: !296, line: 30, baseType: !156, size: 32, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !295, file: !296, line: 31, baseType: !156, size: 32, offset: 160)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !295, file: !296, line: 32, baseType: !156, size: 32, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !295, file: !296, line: 33, baseType: !156, size: 32, offset: 224)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !295, file: !296, line: 34, baseType: !156, size: 32, offset: 256)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !224, file: !225, line: 253, baseType: !117, size: 32, offset: 672)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !224, file: !225, line: 256, baseType: !260, size: 64, offset: 704)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !224, file: !225, line: 294, baseType: !118, size: 32, offset: 768)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !224, file: !225, line: 300, baseType: !311, size: 96, offset: 800)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !225, line: 149, size: 96, elements: !312)
!312 = !{!313, !314, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !311, file: !225, line: 153, baseType: !22, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !311, file: !225, line: 162, baseType: !315, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !316, line: 214, baseType: !32)
!316 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !311, file: !225, line: 168, baseType: !315, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !224, file: !225, line: 325, baseType: !319, size: 32, offset: 896)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !220, line: 5073, size: 192, elements: !321)
!321 = !{!322, !331, !332}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !320, file: !220, line: 5074, baseType: !323, size: 96)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !324, line: 56, size: 96, elements: !325)
!324 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!325 = !{!326, !329, !330}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !323, file: !324, line: 57, baseType: !327, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !324, line: 57, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !323, file: !324, line: 58, baseType: !117, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !323, file: !324, line: 59, baseType: !315, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !320, file: !220, line: 5075, baseType: !260, size: 64, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !320, file: !220, line: 5076, baseType: !333, size: 32, offset: 160)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !334, line: 43, size: 32, elements: !335)
!334 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = !{!336}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !333, file: !334, line: 52, baseType: !22, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !224, file: !225, line: 343, baseType: !338, size: 64, offset: 928)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !296, line: 60, size: 64, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !338, file: !296, line: 63, baseType: !156, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !338, file: !296, line: 66, baseType: !156, size: 32, offset: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !219, file: !220, line: 622, baseType: !343, size: 32, offset: 32)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 32)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !345, line: 44, baseType: !346)
!345 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !347, line: 47, size: 8, elements: !348)
!347 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!348 = !{!349}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !346, file: !347, line: 48, baseType: !135, size: 8)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !219, file: !220, line: 623, baseType: !32, size: 32, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !219, file: !220, line: 624, baseType: !352, size: 32, offset: 96)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !345, line: 46, baseType: !353)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !354, size: 32)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !117, !117, !117}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !219, file: !220, line: 625, baseType: !117, size: 32, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !219, file: !220, line: 626, baseType: !117, size: 32, offset: 160)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !219, file: !220, line: 627, baseType: !117, size: 32, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !219, file: !220, line: 628, baseType: !118, size: 32, offset: 224)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !219, file: !220, line: 629, baseType: !156, size: 32, offset: 256)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !219, file: !220, line: 630, baseType: !362, size: 32, offset: 288)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !118)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !219, file: !220, line: 631, baseType: !364, size: 32, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = !DISubroutineType(types: !366)
!366 = !{null}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !219, file: !220, line: 632, baseType: !133, size: 32, offset: 352)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "blink0_id", scope: !27, file: !218, line: 111, type: !370, isLocal: false, isDefinition: true)
!370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !371)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !225, line: 347, baseType: !223)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "_k_thread_data_blink1_id", scope: !27, file: !218, line: 113, type: !219, isLocal: false, isDefinition: true, align: 32)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "blink1_id", scope: !27, file: !218, line: 113, type: !370, isLocal: false, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "_k_thread_data_uart_out_id", scope: !27, file: !218, line: 115, type: !219, isLocal: false, isDefinition: true, align: 32)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "uart_out_id", scope: !27, file: !218, line: 115, type: !370, isLocal: false, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "_k_thread_stack_blink0_id", scope: !27, file: !218, line: 111, type: !382, isLocal: false, isDefinition: true, align: 64)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !346, size: 8192, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 1024)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "_k_thread_obj_blink0_id", scope: !27, file: !218, line: 111, type: !224, isLocal: false, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "_k_thread_stack_blink1_id", scope: !27, file: !218, line: 113, type: !382, isLocal: false, isDefinition: true, align: 64)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "_k_thread_obj_blink1_id", scope: !27, file: !218, line: 113, type: !224, isLocal: false, isDefinition: true)
!391 = !DIGlobalVariableExpression(var: !392, expr: !DIExpression())
!392 = distinct !DIGlobalVariable(name: "_k_thread_stack_uart_out_id", scope: !27, file: !218, line: 115, type: !382, isLocal: false, isDefinition: true, align: 64)
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "_k_thread_obj_uart_out_id", scope: !27, file: !218, line: 115, type: !224, isLocal: false, isDefinition: true)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "led0", scope: !27, file: !218, line: 44, type: !397, isLocal: true, isDefinition: true)
!397 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "led", file: !218, line: 39, size: 96, elements: !399)
!399 = !{!400, !407}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "spec", scope: !398, file: !218, line: 40, baseType: !401, size: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_dt_spec", file: !102, line: 271, size: 64, elements: !402)
!402 = !{!403, !404, !405}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !401, file: !102, line: 273, baseType: !127, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !401, file: !102, line: 275, baseType: !154, size: 8, offset: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "dt_flags", scope: !401, file: !102, line: 277, baseType: !406, size: 16, offset: 48)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_dt_flags_t", file: !102, line: 249, baseType: !279)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !398, file: !218, line: 41, baseType: !143, size: 8, offset: 64)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "led1", scope: !27, file: !218, line: 49, type: !397, isLocal: true, isDefinition: true)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_fifo", file: !220, line: 2208, size: 160, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_queue", scope: !410, file: !220, line: 2209, baseType: !413, size: 160)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !220, line: 1709, size: 160, elements: !414)
!414 = !{!415, !428, !429}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !413, file: !220, line: 1710, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !417, line: 46, baseType: !418)
!417 = !DIFile(filename: "zephyr/include/zephyr/sys/sflist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !417, line: 41, size: 64, elements: !419)
!419 = !{!420, !427}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !418, file: !417, line: 42, baseType: !421, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !417, line: 39, baseType: !423)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !417, line: 35, size: 32, elements: !424)
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !423, file: !417, line: 36, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !417, line: 32, baseType: !156)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !418, file: !417, line: 43, baseType: !421, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !413, file: !220, line: 1711, baseType: !333, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !413, file: !220, line: 1712, baseType: !260, size: 64, offset: 96)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "_char_out", scope: !432, file: !437, line: 54, type: !438, isLocal: false, isDefinition: true)
!432 = distinct !DICompileUnit(language: DW_LANG_C99, file: !433, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !434, retainedTypes: !435, globals: !436, splitDebugInlining: false, nameTableKind: None)
!433 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/threads")
!434 = !{!30}
!435 = !{!117, !118}
!436 = !{!430}
!437 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 32)
!439 = !DISubroutineType(types: !440)
!440 = !{!118, !118}
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !443, file: !502, line: 65, type: !503, isLocal: true, isDefinition: true, align: 32)
!443 = distinct !DICompileUnit(language: DW_LANG_C99, file: !444, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !434, retainedTypes: !445, globals: !497, splitDebugInlining: false, nameTableKind: None)
!444 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/threads")
!445 = !{!117, !118, !446, !156, !457}
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !448, file: !447, line: 167, baseType: !456)
!447 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!448 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !447, file: !447, line: 134, type: !449, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !443, retainedNodes: !451)
!449 = !DISubroutineType(types: !450)
!450 = !{null, !156}
!451 = !{!452, !453, !455}
!452 = !DILocalVariable(name: "time_us", arg: 1, scope: !448, file: !447, line: 134, type: !156)
!453 = !DILocalVariable(name: "delay_cycles", scope: !448, file: !447, line: 168, type: !454)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!455 = !DILocalVariable(name: "cycles", scope: !448, file: !447, line: 171, type: !156)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !459, line: 1928, baseType: !460)
!459 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !459, line: 1909, size: 11360, elements: !461)
!461 = !{!462, !468, !469, !470, !471, !475, !476, !477, !478, !482, !483, !487, !488, !489, !490, !491, !495, !496}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !460, file: !459, line: 1910, baseType: !463, size: 8192)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 8192, elements: !466)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !156)
!466 = !{!467}
!467 = !DISubrange(count: 256)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !460, file: !459, line: 1911, baseType: !464, size: 32, offset: 8192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !460, file: !459, line: 1912, baseType: !464, size: 32, offset: 8224)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !460, file: !459, line: 1913, baseType: !464, size: 32, offset: 8256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !460, file: !459, line: 1914, baseType: !472, size: 1984, offset: 8288)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 1984, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 62)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !460, file: !459, line: 1915, baseType: !465, size: 32, offset: 10272)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !460, file: !459, line: 1916, baseType: !464, size: 32, offset: 10304)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !460, file: !459, line: 1917, baseType: !465, size: 32, offset: 10336)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !460, file: !459, line: 1918, baseType: !479, size: 96, offset: 10368)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 96, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 3)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !460, file: !459, line: 1919, baseType: !465, size: 32, offset: 10464)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !460, file: !459, line: 1920, baseType: !484, size: 256, offset: 10496)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 256, elements: !485)
!485 = !{!486}
!486 = !DISubrange(count: 8)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !460, file: !459, line: 1921, baseType: !465, size: 32, offset: 10752)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !460, file: !459, line: 1922, baseType: !464, size: 32, offset: 10784)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !460, file: !459, line: 1923, baseType: !465, size: 32, offset: 10816)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !460, file: !459, line: 1924, baseType: !465, size: 32, offset: 10848)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !460, file: !459, line: 1925, baseType: !492, size: 416, offset: 10880)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 416, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 13)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !460, file: !459, line: 1926, baseType: !465, size: 32, offset: 11296)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !460, file: !459, line: 1927, baseType: !465, size: 32, offset: 11328)
!497 = !{!441, !498}
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !448, file: !447, line: 161, type: !500, isLocal: true, isDefinition: true, align: 128)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, size: 48, elements: !480)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !279)
!502 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !505, line: 51, size: 64, elements: !506)
!505 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!506 = !{!507, !514}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !504, file: !505, line: 60, baseType: !508, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 32)
!509 = !DISubroutineType(types: !510)
!510 = !{!118, !511}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !513)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !505, line: 48, flags: DIFlagFwdDecl)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !504, file: !505, line: 65, baseType: !511, size: 32, offset: 32)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !517, file: !551, line: 27, type: !578, isLocal: true, isDefinition: true)
!517 = distinct !DICompileUnit(language: DW_LANG_C99, file: !518, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !519, retainedTypes: !531, globals: !548, splitDebugInlining: false, nameTableKind: None)
!518 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/threads")
!519 = !{!520, !30}
!520 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !521, line: 27, baseType: !32, size: 32, elements: !522)
!521 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!522 = !{!523, !524, !525, !526, !527, !528, !529, !530}
!523 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!524 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!525 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!526 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!527 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!528 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!529 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!530 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!531 = !{!117, !113, !118, !24, !532, !547, !156, !213}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !534, line: 54, size: 96, elements: !535)
!534 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!535 = !{!536, !542, !546}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !533, file: !534, line: 55, baseType: !537, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !187, line: 33, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !187, line: 29, size: 32, elements: !539)
!539 = !{!540}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !538, file: !187, line: 30, baseType: !541, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !533, file: !534, line: 60, baseType: !543, size: 32, offset: 32)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !520}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !533, file: !534, line: 65, baseType: !543, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!548 = !{!515, !549, !555, !557, !568, !570}
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !517, file: !551, line: 44, type: !552, isLocal: true, isDefinition: true)
!551 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !334, line: 43, size: 32, elements: !553)
!553 = !{!554}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !552, file: !334, line: 52, baseType: !22, size: 32)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !517, file: !551, line: 49, type: !552, isLocal: true, isDefinition: true)
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !517, file: !551, line: 36, type: !559, isLocal: true, isDefinition: true)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 128, elements: !566)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !521, line: 114, size: 128, elements: !561)
!561 = !{!562, !563, !564, !565}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !560, file: !521, line: 115, baseType: !520, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !560, file: !521, line: 141, baseType: !143, size: 8, offset: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !560, file: !521, line: 149, baseType: !156, size: 32, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !560, file: !521, line: 156, baseType: !156, size: 32, offset: 96)
!566 = !{!567}
!567 = !DISubrange(count: 1)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !517, file: !551, line: 40, type: !559, isLocal: true, isDefinition: true)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !517, file: !551, line: 28, type: !572, isLocal: true, isDefinition: true)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !187, line: 40, baseType: !573)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !187, line: 35, size: 64, elements: !574)
!574 = !{!575, !577}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !573, file: !187, line: 36, baseType: !576, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !573, file: !187, line: 37, baseType: !576, size: 32, offset: 32)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 32, elements: !566)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !580, line: 22, baseType: !581)
!580 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!581 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!582 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!583 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !586, file: !612, line: 50, type: !362, isLocal: true, isDefinition: true)
!586 = distinct !DICompileUnit(language: DW_LANG_C99, file: !587, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !519, retainedTypes: !588, globals: !609, splitDebugInlining: false, nameTableKind: None)
!587 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/threads")
!588 = !{!152, !113, !315, !118, !117, !156, !213, !589, !547, !362, !600}
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 32)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !591, line: 45, size: 64, elements: !592)
!591 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!592 = !{!593, !599}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !590, file: !591, line: 46, baseType: !594, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !187, line: 33, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !187, line: 29, size: 32, elements: !596)
!596 = !{!597}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !595, file: !187, line: 30, baseType: !598, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !590, file: !591, line: 48, baseType: !156, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !591, line: 38, size: 64, elements: !602)
!602 = !{!603, !604}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !601, file: !591, line: 39, baseType: !594, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !601, file: !591, line: 41, baseType: !605, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !591, line: 35, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 32)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !362}
!609 = !{!610, !616, !624, !584, !626, !636}
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "latency_lock", scope: !586, file: !612, line: 44, type: !613, isLocal: true, isDefinition: true)
!612 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !334, line: 43, size: 32, elements: !614)
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !613, file: !334, line: 52, baseType: !22, size: 32)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !586, file: !612, line: 46, type: !618, isLocal: true, isDefinition: true)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !187, line: 40, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !187, line: 35, size: 64, elements: !620)
!620 = !{!621, !623}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !619, file: !187, line: 36, baseType: !622, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !619, file: !187, line: 37, baseType: !622, size: 32, offset: 32)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "latency_subs", scope: !586, file: !612, line: 52, type: !618, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !586, file: !612, line: 39, type: !628, isLocal: true, isDefinition: true)
!628 = !DICompositeType(tag: DW_TAG_array_type, baseType: !629, elements: !634)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !612, line: 35, size: 96, elements: !630)
!630 = !{!631, !632, !633}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !629, file: !612, line: 36, baseType: !520, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !629, file: !612, line: 37, baseType: !143, size: 8, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !629, file: !612, line: 38, baseType: !579, size: 32, offset: 64)
!634 = !{!635}
!635 = !DISubrange(count: 0)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !586, file: !612, line: 48, type: !362, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !640, file: !647, line: 47, type: !661, isLocal: true, isDefinition: true)
!640 = distinct !DICompileUnit(language: DW_LANG_C99, file: !641, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !642, retainedTypes: !643, globals: !644, splitDebugInlining: false, nameTableKind: None)
!641 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/threads")
!642 = !{!520}
!643 = !{!315, !118}
!644 = !{!645, !638, !657}
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "cpus_states", scope: !640, file: !647, line: 50, type: !648, isLocal: true, isDefinition: true)
!647 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 32, elements: !566)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !521, line: 114, size: 128, elements: !652)
!652 = !{!653, !654, !655, !656}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !651, file: !521, line: 115, baseType: !520, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !651, file: !521, line: 141, baseType: !143, size: 8, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !651, file: !521, line: 149, baseType: !156, size: 32, offset: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !651, file: !521, line: 156, baseType: !156, size: 32, offset: 96)
!657 = !DIGlobalVariableExpression(var: !658, expr: !DIExpression())
!658 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !640, file: !647, line: 55, type: !659, isLocal: true, isDefinition: true)
!659 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 8, elements: !566)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !143)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, elements: !634)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "static_regions", scope: !664, file: !671, line: 62, type: !792, isLocal: true, isDefinition: true)
!664 = distinct !DICompileUnit(language: DW_LANG_C99, file: !665, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !434, retainedTypes: !666, globals: !667, splitDebugInlining: false, nameTableKind: None)
!665 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/threads")
!666 = !{!315, !118, !156, !117}
!667 = !{!668, !662}
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !670, file: !671, line: 198, type: !779, isLocal: true, isDefinition: true)
!670 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !671, file: !671, line: 175, type: !672, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !664, retainedNodes: !776)
!671 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!672 = !DISubroutineType(types: !673)
!673 = !{null, !674}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 32)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !225, line: 245, size: 1024, elements: !676)
!676 = !{!677, !735, !747, !748, !749, !750, !756, !771}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !675, file: !225, line: 247, baseType: !678, size: 384)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !225, line: 57, size: 384, elements: !679)
!679 = !{!680, !704, !711, !712, !713, !722, !723, !724}
!680 = !DIDerivedType(tag: DW_TAG_member, scope: !678, file: !225, line: 60, baseType: !681, size: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !678, file: !225, line: 60, size: 64, elements: !682)
!682 = !{!683, !698}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !681, file: !225, line: 61, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !235, line: 49, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !235, line: 37, size: 64, elements: !686)
!686 = !{!687, !693}
!687 = !DIDerivedType(tag: DW_TAG_member, scope: !685, file: !235, line: 38, baseType: !688, size: 32)
!688 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !685, file: !235, line: 38, size: 32, elements: !689)
!689 = !{!690, !692}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !688, file: !235, line: 39, baseType: !691, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !688, file: !235, line: 40, baseType: !691, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, scope: !685, file: !235, line: 42, baseType: !694, size: 32, offset: 32)
!694 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !685, file: !235, line: 42, size: 32, elements: !695)
!695 = !{!696, !697}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !694, file: !235, line: 43, baseType: !691, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !694, file: !235, line: 44, baseType: !691, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !681, file: !225, line: 62, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !251, line: 49, size: 64, elements: !700)
!700 = !{!701}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !699, file: !251, line: 50, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 64, elements: !256)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !678, file: !225, line: 68, baseType: !705, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !261, line: 233, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !261, line: 231, size: 64, elements: !708)
!708 = !{!709}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !707, file: !261, line: 232, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !235, line: 48, baseType: !685)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !678, file: !225, line: 71, baseType: !143, size: 8, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !678, file: !225, line: 74, baseType: !143, size: 8, offset: 104)
!713 = !DIDerivedType(tag: DW_TAG_member, scope: !678, file: !225, line: 90, baseType: !714, size: 16, offset: 112)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !678, file: !225, line: 90, size: 16, elements: !715)
!715 = !{!716, !721}
!716 = !DIDerivedType(tag: DW_TAG_member, scope: !714, file: !225, line: 91, baseType: !717, size: 16)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !225, line: 91, size: 16, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !717, file: !225, line: 96, baseType: !275, size: 8)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !717, file: !225, line: 97, baseType: !143, size: 8, offset: 8)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !714, file: !225, line: 100, baseType: !279, size: 16)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !678, file: !225, line: 107, baseType: !156, size: 32, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !678, file: !225, line: 127, baseType: !117, size: 32, offset: 160)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !678, file: !225, line: 131, baseType: !725, size: 192, offset: 192)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !261, line: 244, size: 192, elements: !726)
!726 = !{!727, !728, !734}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !725, file: !261, line: 245, baseType: !684, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !725, file: !261, line: 246, baseType: !729, size: 32, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !261, line: 242, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!731 = !DISubroutineType(types: !732)
!732 = !{null, !733}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !725, file: !261, line: 249, baseType: !115, size: 64, offset: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !675, file: !225, line: 250, baseType: !736, size: 288, offset: 384)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !296, line: 25, size: 288, elements: !737)
!737 = !{!738, !739, !740, !741, !742, !743, !744, !745, !746}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !736, file: !296, line: 26, baseType: !156, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !736, file: !296, line: 27, baseType: !156, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !736, file: !296, line: 28, baseType: !156, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !736, file: !296, line: 29, baseType: !156, size: 32, offset: 96)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !736, file: !296, line: 30, baseType: !156, size: 32, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !736, file: !296, line: 31, baseType: !156, size: 32, offset: 160)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !736, file: !296, line: 32, baseType: !156, size: 32, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !736, file: !296, line: 33, baseType: !156, size: 32, offset: 224)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !736, file: !296, line: 34, baseType: !156, size: 32, offset: 256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !675, file: !225, line: 253, baseType: !117, size: 32, offset: 672)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !675, file: !225, line: 256, baseType: !706, size: 64, offset: 704)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !675, file: !225, line: 294, baseType: !118, size: 32, offset: 768)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !675, file: !225, line: 300, baseType: !751, size: 96, offset: 800)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !225, line: 149, size: 96, elements: !752)
!752 = !{!753, !754, !755}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !751, file: !225, line: 153, baseType: !22, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !751, file: !225, line: 162, baseType: !315, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !751, file: !225, line: 168, baseType: !315, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !675, file: !225, line: 325, baseType: !757, size: 32, offset: 896)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !220, line: 5073, size: 192, elements: !759)
!759 = !{!760, !766, !767}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !758, file: !220, line: 5074, baseType: !761, size: 96)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !324, line: 56, size: 96, elements: !762)
!762 = !{!763, !764, !765}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !761, file: !324, line: 57, baseType: !327, size: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !761, file: !324, line: 58, baseType: !117, size: 32, offset: 32)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !761, file: !324, line: 59, baseType: !315, size: 32, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !758, file: !220, line: 5075, baseType: !706, size: 64, offset: 96)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !758, file: !220, line: 5076, baseType: !768, size: 32, offset: 160)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !334, line: 43, size: 32, elements: !769)
!769 = !{!770}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !768, file: !334, line: 52, baseType: !22, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !675, file: !225, line: 343, baseType: !772, size: 64, offset: 928)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !296, line: 60, size: 64, elements: !773)
!773 = !{!774, !775}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !772, file: !296, line: 63, baseType: !156, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !772, file: !296, line: 66, baseType: !156, size: 32, offset: 32)
!776 = !{!777, !778}
!777 = !DILocalVariable(name: "thread", arg: 1, scope: !670, file: !671, line: 175, type: !674)
!778 = !DILocalVariable(name: "region_num", scope: !670, file: !671, line: 200, type: !143)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, elements: !634)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !781, line: 52, size: 96, elements: !782)
!781 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!782 = !{!783, !784, !785}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !780, file: !781, line: 53, baseType: !22, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !780, file: !781, line: 54, baseType: !315, size: 32, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !780, file: !781, line: 55, baseType: !786, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !787, line: 304, baseType: !788)
!787 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !787, line: 301, size: 32, elements: !789)
!789 = !{!790, !791}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !788, file: !787, line: 302, baseType: !279, size: 16)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !788, file: !787, line: 303, baseType: !279, size: 16, offset: 16)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !793, size: 96, elements: !566)
!793 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !796, file: !850, line: 39, type: !143, isLocal: true, isDefinition: true)
!796 = distinct !DICompileUnit(language: DW_LANG_C99, file: !797, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !434, retainedTypes: !798, globals: !841, splitDebugInlining: false, nameTableKind: None)
!797 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/threads")
!798 = !{!799, !117, !118, !827}
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !801, line: 1495, baseType: !802)
!801 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !801, line: 1474, size: 448, elements: !803)
!803 = !{!804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !817}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !802, file: !801, line: 1476, baseType: !464, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !802, file: !801, line: 1477, baseType: !465, size: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !802, file: !801, line: 1478, baseType: !465, size: 32, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !802, file: !801, line: 1479, baseType: !465, size: 32, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !802, file: !801, line: 1480, baseType: !465, size: 32, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !802, file: !801, line: 1481, baseType: !465, size: 32, offset: 160)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !802, file: !801, line: 1482, baseType: !465, size: 32, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !802, file: !801, line: 1483, baseType: !465, size: 32, offset: 224)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !802, file: !801, line: 1484, baseType: !465, size: 32, offset: 256)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !802, file: !801, line: 1485, baseType: !465, size: 32, offset: 288)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !802, file: !801, line: 1486, baseType: !465, size: 32, offset: 320)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !802, file: !801, line: 1487, baseType: !816, size: 32, offset: 352)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 32, elements: !566)
!817 = !DIDerivedType(tag: DW_TAG_member, scope: !802, file: !801, line: 1488, baseType: !818, size: 64, offset: 384)
!818 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !802, file: !801, line: 1488, size: 64, elements: !819)
!819 = !{!820, !822}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !818, file: !801, line: 1489, baseType: !821, size: 64)
!821 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 64, elements: !256)
!822 = !DIDerivedType(tag: DW_TAG_member, scope: !818, file: !801, line: 1490, baseType: !823, size: 64)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !818, file: !801, line: 1490, size: 64, elements: !824)
!824 = !{!825, !826}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !823, file: !801, line: 1491, baseType: !465, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !823, file: !801, line: 1492, baseType: !465, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !828, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !829)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !830, line: 27, size: 128, elements: !831)
!830 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!831 = !{!832, !833, !834}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !829, file: !830, line: 29, baseType: !156, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !829, file: !830, line: 31, baseType: !133, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !829, file: !830, line: 37, baseType: !835, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !787, line: 298, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !787, line: 289, size: 64, elements: !837)
!837 = !{!838, !839, !840}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !836, file: !787, line: 291, baseType: !143, size: 5, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !836, file: !787, line: 293, baseType: !143, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !836, file: !787, line: 295, baseType: !156, size: 32, offset: 32)
!841 = !{!794, !842}
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !796, file: !844, line: 31, type: !845, isLocal: true, isDefinition: true)
!844 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !846, size: 160, elements: !566)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !844, line: 21, size: 160, elements: !847)
!847 = !{!848, !849}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !846, file: !844, line: 22, baseType: !118, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !846, file: !844, line: 23, baseType: !829, size: 128, offset: 32)
!850 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !853, file: !860, line: 21, type: !438, isLocal: true, isDefinition: true)
!853 = distinct !DICompileUnit(language: DW_LANG_C99, file: !854, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !434, retainedTypes: !855, globals: !859, splitDebugInlining: false, nameTableKind: None)
!854 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/threads")
!855 = !{!856, !118, !117}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !858, line: 22, baseType: !118)
!858 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!859 = !{!851}
!860 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !863, file: !868, line: 13, type: !887, isLocal: true, isDefinition: true)
!863 = distinct !DICompileUnit(language: DW_LANG_C99, file: !864, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !865, splitDebugInlining: false, nameTableKind: None)
!864 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/threads")
!865 = !{!866, !861}
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "mpu_config", scope: !863, file: !868, line: 37, type: !869, isLocal: false, isDefinition: true)
!868 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!869 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !830, line: 41, size: 64, elements: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !870, file: !830, line: 43, baseType: !156, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !870, file: !830, line: 45, baseType: !874, size: 32, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !830, line: 27, size: 128, elements: !877)
!877 = !{!878, !879, !880}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !876, file: !830, line: 29, baseType: !156, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !876, file: !830, line: 31, baseType: !133, size: 32, offset: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !876, file: !830, line: 37, baseType: !881, size: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !787, line: 298, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !787, line: 289, size: 64, elements: !883)
!883 = !{!884, !885, !886}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !882, file: !787, line: 291, baseType: !143, size: 5, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !882, file: !787, line: 293, baseType: !143, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !882, file: !787, line: 295, baseType: !156, size: 32, offset: 32)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !875, size: 256, elements: !256)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "__device_dts_ord_65", scope: !890, file: !1094, line: 733, type: !1199, isLocal: false, isDefinition: true, align: 32)
!890 = distinct !DICompileUnit(language: DW_LANG_C99, file: !891, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !892, retainedTypes: !1010, globals: !1090, splitDebugInlining: false, nameTableKind: None)
!891 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/threads")
!892 = !{!893, !899, !30, !904, !909, !913, !917, !921, !927, !931, !975, !982, !1001}
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !894, line: 23, baseType: !32, size: 32, elements: !895)
!894 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!895 = !{!896, !897, !898}
!896 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!897 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!898 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!899 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !894, line: 48, baseType: !32, size: 32, elements: !900)
!900 = !{!901, !902, !903}
!901 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!902 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!903 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!904 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !905, line: 167, baseType: !32, size: 32, elements: !906)
!905 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!906 = !{!907, !908}
!907 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!908 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !905, line: 107, baseType: !32, size: 32, elements: !910)
!910 = !{!911, !912}
!911 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!912 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!913 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !905, line: 208, baseType: !32, size: 32, elements: !914)
!914 = !{!915, !916}
!915 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!916 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!917 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !905, line: 261, baseType: !32, size: 32, elements: !918)
!918 = !{!919, !920}
!919 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!920 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!921 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !905, line: 237, baseType: !32, size: 32, elements: !922)
!922 = !{!923, !924, !925, !926}
!923 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!924 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!925 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!926 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !905, line: 152, baseType: !32, size: 32, elements: !928)
!928 = !{!929, !930}
!929 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!930 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!931 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !459, line: 71, baseType: !118, size: 32, elements: !932)
!932 = !{!933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974}
!933 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!934 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!935 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!936 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!937 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!938 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!939 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!940 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!941 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!942 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!943 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!944 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!945 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!946 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!947 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!948 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!949 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!950 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!951 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!952 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!953 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!954 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!955 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!956 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!957 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!958 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!959 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!960 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!961 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!962 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!963 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!964 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!965 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!966 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!967 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!968 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!969 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!970 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!971 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!972 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!973 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!974 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!975 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !976, line: 44, baseType: !32, size: 32, elements: !977)
!976 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!977 = !{!978, !979, !980, !981}
!978 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!979 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!980 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!981 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!982 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !983, line: 54, baseType: !32, size: 32, elements: !984)
!983 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!984 = !{!985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000}
!985 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!986 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!987 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!988 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!989 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!990 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!991 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!992 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!993 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!994 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!995 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!996 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!997 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!998 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!999 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!1000 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!1001 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1002, line: 53, baseType: !32, size: 32, elements: !1003)
!1002 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1003 = !{!1004, !1005, !1006, !1007, !1008, !1009}
!1004 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!1005 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!1006 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!1007 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!1008 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!1009 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!1010 = !{!893, !117, !118, !1011, !1053, !1054, !1055, !1056, !113, !156, !213, !146, !1057, !1058, !362, !1059, !1089, !315}
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !459, line: 923, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !459, line: 883, size: 10464, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1034, !1035, !1036, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !1013, file: !459, line: 884, baseType: !465, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !1013, file: !459, line: 885, baseType: !465, size: 32, offset: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !1013, file: !459, line: 886, baseType: !465, size: 32, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !1013, file: !459, line: 887, baseType: !465, size: 32, offset: 96)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !1013, file: !459, line: 888, baseType: !1020, size: 896, offset: 128)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 896, elements: !1021)
!1021 = !{!1022}
!1022 = !DISubrange(count: 28)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !1013, file: !459, line: 889, baseType: !465, size: 32, offset: 1024)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !1013, file: !459, line: 890, baseType: !465, size: 32, offset: 1056)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !1013, file: !459, line: 891, baseType: !465, size: 32, offset: 1088)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !1013, file: !459, line: 892, baseType: !465, size: 32, offset: 1120)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !1013, file: !459, line: 893, baseType: !1020, size: 896, offset: 1152)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !1013, file: !459, line: 894, baseType: !465, size: 32, offset: 2048)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !1013, file: !459, line: 895, baseType: !465, size: 32, offset: 2080)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1013, file: !459, line: 896, baseType: !1031, size: 960, offset: 2112)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 960, elements: !1032)
!1032 = !{!1033}
!1033 = !DISubrange(count: 30)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !1013, file: !459, line: 897, baseType: !465, size: 32, offset: 3072)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !1013, file: !459, line: 898, baseType: !465, size: 32, offset: 3104)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1013, file: !459, line: 899, baseType: !1037, size: 3008, offset: 3136)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 3008, elements: !1038)
!1038 = !{!1039}
!1039 = !DISubrange(count: 94)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !1013, file: !459, line: 900, baseType: !465, size: 32, offset: 6144)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !1013, file: !459, line: 901, baseType: !465, size: 32, offset: 6176)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !1013, file: !459, line: 902, baseType: !465, size: 32, offset: 6208)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !1013, file: !459, line: 903, baseType: !464, size: 32, offset: 6240)
