; ModuleID = 'build/96b_neonkey/subsys/portability/cmsis_rtos_v2/philosophers/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.osSemaphoreAttr_t = type { i8*, i32, i8*, i32 }
%struct.osThreadAttr_t = type { i8*, i32, i8*, i32, i8*, i32, i32, i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.z_poller*, i8*, i16* }
%struct.z_poller = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_spinlock }
%struct.k_spinlock = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.k_spinlock }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.cv2_thread = type { %struct._dnode, %struct.k_thread, %struct.k_poll_signal, %struct.k_poll_event, i32, [16 x i8], i32, %struct.k_sem, i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, %struct.z_poller, %struct.__thread_entry, %struct.k_thread*, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_neonkey/subsys/portability/cmsis_rtos_v2/philosophers/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_neonkey/subsys/portability/cmsis_rtos_v2/philosophers")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 98, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_neonkey/subsys/portability/cmsis_rtos_v2/philosophers")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5504, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 86)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2752, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "sema_attr", scope: !27, file: !212, line: 36, type: !213, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !168, globals: !175, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/portability/cmsis_rtos_v2/philosophers/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_neonkey/subsys/portability/cmsis_rtos_v2/philosophers")
!29 = !{!30, !42, !113}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 195, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/portability/cmsis_os2.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41}
!34 = !DIEnumerator(name: "osOK", value: 0)
!35 = !DIEnumerator(name: "osError", value: -1)
!36 = !DIEnumerator(name: "osErrorTimeout", value: -2)
!37 = !DIEnumerator(name: "osErrorResource", value: -3)
!38 = !DIEnumerator(name: "osErrorParameter", value: -4)
!39 = !DIEnumerator(name: "osErrorNoMemory", value: -5)
!40 = !DIEnumerator(name: "osErrorISR", value: -6)
!41 = !DIEnumerator(name: "osStatusReserved", value: 2147483647)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !43, line: 27, baseType: !44, size: 32, elements: !45)
!43 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!44 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!45 = !{!46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!46 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!47 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!48 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!49 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!50 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!51 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!52 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!53 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!54 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!55 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!56 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!57 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!58 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!59 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!60 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!61 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!62 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!112 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 101, baseType: !32, size: 32, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167}
!115 = !DIEnumerator(name: "osPriorityNone", value: 0)
!116 = !DIEnumerator(name: "osPriorityIdle", value: 1)
!117 = !DIEnumerator(name: "osPriorityLow", value: 8)
!118 = !DIEnumerator(name: "osPriorityLow1", value: 9)
!119 = !DIEnumerator(name: "osPriorityLow2", value: 10)
!120 = !DIEnumerator(name: "osPriorityLow3", value: 11)
!121 = !DIEnumerator(name: "osPriorityLow4", value: 12)
!122 = !DIEnumerator(name: "osPriorityLow5", value: 13)
!123 = !DIEnumerator(name: "osPriorityLow6", value: 14)
!124 = !DIEnumerator(name: "osPriorityLow7", value: 15)
!125 = !DIEnumerator(name: "osPriorityBelowNormal", value: 16)
!126 = !DIEnumerator(name: "osPriorityBelowNormal1", value: 17)
!127 = !DIEnumerator(name: "osPriorityBelowNormal2", value: 18)
!128 = !DIEnumerator(name: "osPriorityBelowNormal3", value: 19)
!129 = !DIEnumerator(name: "osPriorityBelowNormal4", value: 20)
!130 = !DIEnumerator(name: "osPriorityBelowNormal5", value: 21)
!131 = !DIEnumerator(name: "osPriorityBelowNormal6", value: 22)
!132 = !DIEnumerator(name: "osPriorityBelowNormal7", value: 23)
!133 = !DIEnumerator(name: "osPriorityNormal", value: 24)
!134 = !DIEnumerator(name: "osPriorityNormal1", value: 25)
!135 = !DIEnumerator(name: "osPriorityNormal2", value: 26)
!136 = !DIEnumerator(name: "osPriorityNormal3", value: 27)
!137 = !DIEnumerator(name: "osPriorityNormal4", value: 28)
!138 = !DIEnumerator(name: "osPriorityNormal5", value: 29)
!139 = !DIEnumerator(name: "osPriorityNormal6", value: 30)
!140 = !DIEnumerator(name: "osPriorityNormal7", value: 31)
!141 = !DIEnumerator(name: "osPriorityAboveNormal", value: 32)
!142 = !DIEnumerator(name: "osPriorityAboveNormal1", value: 33)
!143 = !DIEnumerator(name: "osPriorityAboveNormal2", value: 34)
!144 = !DIEnumerator(name: "osPriorityAboveNormal3", value: 35)
!145 = !DIEnumerator(name: "osPriorityAboveNormal4", value: 36)
!146 = !DIEnumerator(name: "osPriorityAboveNormal5", value: 37)
!147 = !DIEnumerator(name: "osPriorityAboveNormal6", value: 38)
!148 = !DIEnumerator(name: "osPriorityAboveNormal7", value: 39)
!149 = !DIEnumerator(name: "osPriorityHigh", value: 40)
!150 = !DIEnumerator(name: "osPriorityHigh1", value: 41)
!151 = !DIEnumerator(name: "osPriorityHigh2", value: 42)
!152 = !DIEnumerator(name: "osPriorityHigh3", value: 43)
!153 = !DIEnumerator(name: "osPriorityHigh4", value: 44)
!154 = !DIEnumerator(name: "osPriorityHigh5", value: 45)
!155 = !DIEnumerator(name: "osPriorityHigh6", value: 46)
!156 = !DIEnumerator(name: "osPriorityHigh7", value: 47)
!157 = !DIEnumerator(name: "osPriorityRealtime", value: 48)
!158 = !DIEnumerator(name: "osPriorityRealtime1", value: 49)
!159 = !DIEnumerator(name: "osPriorityRealtime2", value: 50)
!160 = !DIEnumerator(name: "osPriorityRealtime3", value: 51)
!161 = !DIEnumerator(name: "osPriorityRealtime4", value: 52)
!162 = !DIEnumerator(name: "osPriorityRealtime5", value: 53)
!163 = !DIEnumerator(name: "osPriorityRealtime6", value: 54)
!164 = !DIEnumerator(name: "osPriorityRealtime7", value: 55)
!165 = !DIEnumerator(name: "osPriorityISR", value: 56)
!166 = !DIEnumerator(name: "osPriorityError", value: -1)
!167 = !DIEnumerator(name: "osPriorityReserved", value: 2147483647)
!168 = !{!169, !171, !32, !172, !173}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !170)
!170 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !44)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !174)
!174 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!175 = !{!25, !176, !183, !203}
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "forks", scope: !27, file: !178, line: 66, type: !179, isLocal: false, isDefinition: true)
!178 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v2/philosophers/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 192, elements: !181)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "osSemaphoreId_t", file: !31, line: 220, baseType: !171)
!181 = !{!182}
!182 = !DISubrange(count: 6)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "thread_attr", scope: !27, file: !178, line: 72, type: !185, isLocal: true, isDefinition: true)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 1728, elements: !181)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "osThreadAttr_t", file: !31, line: 247, baseType: !187)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 237, size: 288, elements: !188)
!188 = !{!189, !193, !194, !195, !196, !197, !198, !200, !202}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !187, file: !31, line: 238, baseType: !190, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !187, file: !31, line: 239, baseType: !172, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !187, file: !31, line: 240, baseType: !171, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !187, file: !31, line: 241, baseType: !172, size: 32, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "stack_mem", scope: !187, file: !31, line: 242, baseType: !171, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !187, file: !31, line: 243, baseType: !172, size: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !187, file: !31, line: 244, baseType: !199, size: 32, offset: 192)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "osPriority_t", file: !31, line: 155, baseType: !113)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tz_module", scope: !187, file: !31, line: 245, baseType: !201, size: 32, offset: 224)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "TZ_ModuleId_t", file: !31, line: 232, baseType: !172)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !187, file: !31, line: 246, baseType: !172, size: 32, offset: 256)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "stacks", scope: !27, file: !178, line: 71, type: !205, isLocal: true, isDefinition: true, align: 512)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 101376, elements: !210)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !207, line: 47, size: 8, elements: !208)
!207 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !206, file: !207, line: 48, baseType: !192, size: 8)
!210 = !{!182, !211}
!211 = !DISubrange(count: 2112)
!212 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v2/philosophers/src/phil_obj_abstract.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 768, elements: !181)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "osSemaphoreAttr_t", file: !31, line: 279, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 274, size: 128, elements: !216)
!216 = !{!217, !218, !219, !220}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !31, line: 275, baseType: !190, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !215, file: !31, line: 276, baseType: !172, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !215, file: !31, line: 277, baseType: !171, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !215, file: !31, line: 278, baseType: !172, size: 32, offset: 96)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "_char_out", scope: !223, file: !228, line: 54, type: !229, isLocal: false, isDefinition: true)
!223 = distinct !DICompileUnit(language: DW_LANG_C99, file: !224, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !225, retainedTypes: !226, globals: !227, splitDebugInlining: false, nameTableKind: None)
!224 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_neonkey/subsys/portability/cmsis_rtos_v2/philosophers")
!225 = !{!42}
!226 = !{!171, !32}
!227 = !{!221}
!228 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DISubroutineType(types: !231)
!231 = !{!32, !32}
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !234, file: !251, line: 56, type: !252, isLocal: true, isDefinition: true, align: 32)
!234 = distinct !DICompileUnit(language: DW_LANG_C99, file: !235, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !236, globals: !250, splitDebugInlining: false, nameTableKind: None)
!235 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_neonkey/subsys/portability/cmsis_rtos_v2/philosophers")
!236 = !{!237}
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !239, line: 259, baseType: !240)
!239 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f411xe.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 250, size: 224, elements: !241)
!241 = !{!242, !244, !245, !246, !247, !248, !249}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !240, file: !239, line: 252, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !172)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !240, file: !239, line: 253, baseType: !243, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !240, file: !239, line: 254, baseType: !243, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !240, file: !239, line: 255, baseType: !243, size: 32, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !240, file: !239, line: 256, baseType: !243, size: 32, offset: 128)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !240, file: !239, line: 257, baseType: !243, size: 32, offset: 160)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !240, file: !239, line: 258, baseType: !243, size: 32, offset: 192)
!250 = !{!232}
!251 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !253)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !254, line: 51, size: 64, elements: !255)
!254 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!255 = !{!256, !284}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !253, file: !254, line: 60, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DISubroutineType(types: !259)
!259 = !{!32, !260}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !263, line: 378, size: 192, elements: !264)
!263 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!264 = !{!265, !266, !267, !268, !277, !278}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !262, file: !263, line: 380, baseType: !190, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !262, file: !263, line: 382, baseType: !13, size: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !262, file: !263, line: 384, baseType: !13, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !262, file: !263, line: 386, baseType: !269, size: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !263, line: 351, size: 16, elements: !271)
!271 = !{!272, !275}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !270, file: !263, line: 359, baseType: !273, size: 8)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !274)
!274 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !270, file: !263, line: 364, baseType: !276, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!276 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !262, file: !263, line: 388, baseType: !171, size: 32, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !262, file: !263, line: 396, baseType: !279, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !281)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !263, line: 43, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !283)
!283 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !253, file: !254, line: 65, baseType: !260, size: 32, offset: 32)
!285 = !DIGlobalVariableExpression(var: !286, expr: !DIExpression())
!286 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !287, file: !290, line: 71, type: !291, isLocal: true, isDefinition: true, align: 32)
!287 = distinct !DICompileUnit(language: DW_LANG_C99, file: !288, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !289, splitDebugInlining: false, nameTableKind: None)
!288 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_neonkey/subsys/portability/cmsis_rtos_v2/philosophers")
!289 = !{!285}
!290 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !254, line: 51, size: 64, elements: !293)
!293 = !{!294, !313}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !292, file: !254, line: 60, baseType: !295, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DISubroutineType(types: !297)
!297 = !{!32, !298}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !263, line: 378, size: 192, elements: !301)
!301 = !{!302, !303, !304, !305, !311, !312}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !300, file: !263, line: 380, baseType: !190, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !300, file: !263, line: 382, baseType: !13, size: 32, offset: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !300, file: !263, line: 384, baseType: !13, size: 32, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !300, file: !263, line: 386, baseType: !306, size: 32, offset: 96)
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !307, size: 32)
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !263, line: 351, size: 16, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !307, file: !263, line: 359, baseType: !273, size: 8)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !307, file: !263, line: 364, baseType: !276, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !300, file: !263, line: 388, baseType: !171, size: 32, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !300, file: !263, line: 396, baseType: !279, size: 32, offset: 160)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !292, file: !254, line: 65, baseType: !298, size: 32, offset: 32)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "static_regions", scope: !316, file: !325, line: 62, type: !489, isLocal: true, isDefinition: true)
!316 = distinct !DICompileUnit(language: DW_LANG_C99, file: !317, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !225, retainedTypes: !318, globals: !321, splitDebugInlining: false, nameTableKind: None)
!317 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_neonkey/subsys/portability/cmsis_rtos_v2/philosophers")
!318 = !{!319, !32, !172, !171}
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !320, line: 214, baseType: !44)
!320 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!321 = !{!322, !314}
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !324, file: !325, line: 198, type: !475, isLocal: true, isDefinition: true)
!324 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !325, file: !325, line: 175, type: !326, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !316, retainedNodes: !470)
!325 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!326 = !DISubroutineType(types: !327)
!327 = !{null, !328}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !330, line: 245, size: 1472, elements: !331)
!330 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!331 = !{!332, !401, !414, !415, !416, !421, !433, !434, !438, !439, !445, !465}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !329, file: !330, line: 247, baseType: !333, size: 384)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !330, line: 57, size: 384, elements: !334)
!334 = !{!335, !363, !371, !372, !373, !386, !387, !388}
!335 = !DIDerivedType(tag: DW_TAG_member, scope: !333, file: !330, line: 60, baseType: !336, size: 64)
!336 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !333, file: !330, line: 60, size: 64, elements: !337)
!337 = !{!338, !354}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !336, file: !330, line: 61, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !340, line: 49, baseType: !341)
!340 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !340, line: 37, size: 64, elements: !342)
!342 = !{!343, !349}
!343 = !DIDerivedType(tag: DW_TAG_member, scope: !341, file: !340, line: 38, baseType: !344, size: 32)
!344 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !341, file: !340, line: 38, size: 32, elements: !345)
!345 = !{!346, !348}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !344, file: !340, line: 39, baseType: !347, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !344, file: !340, line: 40, baseType: !347, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, scope: !341, file: !340, line: 42, baseType: !350, size: 32, offset: 32)
!350 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !341, file: !340, line: 42, size: 32, elements: !351)
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !350, file: !340, line: 43, baseType: !347, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !350, file: !340, line: 44, baseType: !347, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !336, file: !330, line: 62, baseType: !355, size: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !356, line: 49, size: 64, elements: !357)
!356 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!357 = !{!358}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !355, file: !356, line: 50, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !360, size: 64, elements: !361)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!361 = !{!362}
!362 = !DISubrange(count: 2)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !333, file: !330, line: 68, baseType: !364, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !366, line: 233, baseType: !367)
!366 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !366, line: 231, size: 64, elements: !368)
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !367, file: !366, line: 232, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !340, line: 48, baseType: !341)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !333, file: !330, line: 71, baseType: !273, size: 8, offset: 96)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !333, file: !330, line: 74, baseType: !273, size: 8, offset: 104)
!373 = !DIDerivedType(tag: DW_TAG_member, scope: !333, file: !330, line: 90, baseType: !374, size: 16, offset: 112)
!374 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !333, file: !330, line: 90, size: 16, elements: !375)
!375 = !{!376, !383}
!376 = !DIDerivedType(tag: DW_TAG_member, scope: !374, file: !330, line: 91, baseType: !377, size: 16)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !374, file: !330, line: 91, size: 16, elements: !378)
!378 = !{!379, !382}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !377, file: !330, line: 96, baseType: !380, size: 8)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !381)
!381 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !377, file: !330, line: 97, baseType: !273, size: 8, offset: 8)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !374, file: !330, line: 100, baseType: !384, size: 16)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !385)
!385 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !333, file: !330, line: 107, baseType: !172, size: 32, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !333, file: !330, line: 127, baseType: !171, size: 32, offset: 160)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !333, file: !330, line: 131, baseType: !389, size: 192, offset: 192)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !366, line: 244, size: 192, elements: !390)
!390 = !{!391, !392, !398}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !389, file: !366, line: 245, baseType: !339, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !389, file: !366, line: 246, baseType: !393, size: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !366, line: 242, baseType: !394)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !397}
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !389, file: !366, line: 249, baseType: !399, size: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !400)
!400 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !329, file: !330, line: 250, baseType: !402, size: 288, offset: 384)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !403, line: 25, size: 288, elements: !404)
!403 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!404 = !{!405, !406, !407, !408, !409, !410, !411, !412, !413}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !402, file: !403, line: 26, baseType: !172, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !402, file: !403, line: 27, baseType: !172, size: 32, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !402, file: !403, line: 28, baseType: !172, size: 32, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !402, file: !403, line: 29, baseType: !172, size: 32, offset: 96)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !402, file: !403, line: 30, baseType: !172, size: 32, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !402, file: !403, line: 31, baseType: !172, size: 32, offset: 160)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !402, file: !403, line: 32, baseType: !172, size: 32, offset: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !402, file: !403, line: 33, baseType: !172, size: 32, offset: 224)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !402, file: !403, line: 34, baseType: !172, size: 32, offset: 256)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !329, file: !330, line: 253, baseType: !171, size: 32, offset: 672)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !329, file: !330, line: 256, baseType: !365, size: 64, offset: 704)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !329, file: !330, line: 259, baseType: !417, size: 16, offset: 768)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_poller", file: !330, line: 236, size: 16, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "is_polling", scope: !417, file: !330, line: 237, baseType: !276, size: 8)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !417, file: !330, line: 238, baseType: !273, size: 8, offset: 8)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !329, file: !330, line: 271, baseType: !422, size: 128, offset: 800)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !330, line: 34, size: 128, elements: !423)
!423 = !{!424, !430, !431, !432}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !422, file: !330, line: 35, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !426, line: 46, baseType: !427)
!426 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !171, !171, !171}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !422, file: !330, line: 36, baseType: !171, size: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !422, file: !330, line: 37, baseType: !171, size: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !422, file: !330, line: 38, baseType: !171, size: 32, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !329, file: !330, line: 274, baseType: !328, size: 32, offset: 928)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !329, file: !330, line: 279, baseType: !435, size: 256, offset: 960)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 256, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !329, file: !330, line: 294, baseType: !32, size: 32, offset: 1216)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !329, file: !330, line: 300, baseType: !440, size: 96, offset: 1248)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !330, line: 149, size: 96, elements: !441)
!441 = !{!442, !443, !444}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !440, file: !330, line: 153, baseType: !22, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !440, file: !330, line: 162, baseType: !319, size: 32, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !440, file: !330, line: 168, baseType: !319, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !329, file: !330, line: 325, baseType: !446, size: 32, offset: 1344)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 32)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !448, line: 5073, size: 192, elements: !449)
!448 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!449 = !{!450, !459, !460}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !447, file: !448, line: 5074, baseType: !451, size: 96)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !452, line: 56, size: 96, elements: !453)
!452 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!453 = !{!454, !457, !458}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !451, file: !452, line: 57, baseType: !455, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 32)
!456 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !452, line: 57, flags: DIFlagFwdDecl)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !451, file: !452, line: 58, baseType: !171, size: 32, offset: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !451, file: !452, line: 59, baseType: !319, size: 32, offset: 64)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !447, file: !448, line: 5075, baseType: !365, size: 64, offset: 96)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !447, file: !448, line: 5076, baseType: !461, size: 32, offset: 160)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !462, line: 43, size: 32, elements: !463)
!462 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!463 = !{!464}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !461, file: !462, line: 52, baseType: !22, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !329, file: !330, line: 343, baseType: !466, size: 64, offset: 1376)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !403, line: 60, size: 64, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !466, file: !403, line: 63, baseType: !172, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !466, file: !403, line: 66, baseType: !172, size: 32, offset: 32)
!470 = !{!471, !472, !473, !474}
!471 = !DILocalVariable(name: "thread", arg: 1, scope: !324, file: !325, line: 175, type: !328)
!472 = !DILocalVariable(name: "region_num", scope: !324, file: !325, line: 200, type: !273)
!473 = !DILocalVariable(name: "guard_start", scope: !324, file: !325, line: 265, type: !22)
!474 = !DILocalVariable(name: "guard_size", scope: !324, file: !325, line: 266, type: !319)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 96, elements: !487)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !477, line: 52, size: 96, elements: !478)
!477 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!478 = !{!479, !480, !481}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !476, file: !477, line: 53, baseType: !22, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !476, file: !477, line: 54, baseType: !319, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !476, file: !477, line: 55, baseType: !482, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !483, line: 151, baseType: !484)
!483 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !483, line: 149, size: 32, elements: !485)
!485 = !{!486}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !484, file: !483, line: 150, baseType: !172, size: 32)
!487 = !{!488}
!488 = !DISubrange(count: 1)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !490, size: 96, elements: !487)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !493, file: !526, line: 39, type: !273, isLocal: true, isDefinition: true)
!493 = distinct !DICompileUnit(language: DW_LANG_C99, file: !494, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !225, retainedTypes: !495, globals: !525, splitDebugInlining: false, nameTableKind: None)
!494 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_neonkey/subsys/portability/cmsis_rtos_v2/philosophers")
!495 = !{!496, !171, !32, !513, !273}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !498, line: 1226, baseType: !499)
!498 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !498, line: 1213, size: 352, elements: !500)
!500 = !{!501, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !499, file: !498, line: 1215, baseType: !502, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !499, file: !498, line: 1216, baseType: !243, size: 32, offset: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !499, file: !498, line: 1217, baseType: !243, size: 32, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !499, file: !498, line: 1218, baseType: !243, size: 32, offset: 96)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !499, file: !498, line: 1219, baseType: !243, size: 32, offset: 128)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !499, file: !498, line: 1220, baseType: !243, size: 32, offset: 160)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !499, file: !498, line: 1221, baseType: !243, size: 32, offset: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !499, file: !498, line: 1222, baseType: !243, size: 32, offset: 224)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !499, file: !498, line: 1223, baseType: !243, size: 32, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !499, file: !498, line: 1224, baseType: !243, size: 32, offset: 288)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !499, file: !498, line: 1225, baseType: !243, size: 32, offset: 320)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !516, line: 27, size: 96, elements: !517)
!516 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!517 = !{!518, !519, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !515, file: !516, line: 29, baseType: !172, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !515, file: !516, line: 31, baseType: !190, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !515, file: !516, line: 37, baseType: !521, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !483, line: 146, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !483, line: 141, size: 32, elements: !523)
!523 = !{!524}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !522, file: !483, line: 143, baseType: !172, size: 32)
!525 = !{!491}
!526 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !529, file: !536, line: 21, type: !229, isLocal: true, isDefinition: true)
!529 = distinct !DICompileUnit(language: DW_LANG_C99, file: !530, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !225, retainedTypes: !531, globals: !535, splitDebugInlining: false, nameTableKind: None)
!530 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_neonkey/subsys/portability/cmsis_rtos_v2/philosophers")
!531 = !{!532, !32, !171}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !534, line: 22, baseType: !32)
!534 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!535 = !{!527}
!536 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !539, file: !544, line: 13, type: !561, isLocal: true, isDefinition: true)
!539 = distinct !DICompileUnit(language: DW_LANG_C99, file: !540, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !541, splitDebugInlining: false, nameTableKind: None)
!540 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_neonkey/subsys/portability/cmsis_rtos_v2/philosophers")
!541 = !{!542, !537}
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "mpu_config", scope: !539, file: !544, line: 37, type: !545, isLocal: false, isDefinition: true)
!544 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!545 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !516, line: 41, size: 64, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !546, file: !516, line: 43, baseType: !172, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !546, file: !516, line: 45, baseType: !550, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !516, line: 27, size: 96, elements: !553)
!553 = !{!554, !555, !556}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !552, file: !516, line: 29, baseType: !172, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !552, file: !516, line: 31, baseType: !190, size: 32, offset: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !552, file: !516, line: 37, baseType: !557, size: 32, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !483, line: 146, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !483, line: 141, size: 32, elements: !559)
!559 = !{!560}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !558, file: !483, line: 143, baseType: !172, size: 32)
!561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 192, elements: !361)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "thread_list", scope: !564, file: !804, line: 27, type: !631, isLocal: true, isDefinition: true)
!564 = distinct !DICompileUnit(language: DW_LANG_C99, file: !565, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !566, retainedTypes: !589, globals: !800, splitDebugInlining: false, nameTableKind: None)
!565 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/portability/cmsis_rtos_v2/thread.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_neonkey/subsys/portability/cmsis_rtos_v2/philosophers")
!566 = !{!113, !567, !576, !30, !580, !42}
!567 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_poll_types_bits", file: !448, line: 5298, baseType: !44, size: 32, elements: !568)
!568 = !{!569, !570, !571, !572, !573, !574, !575}
!569 = !DIEnumerator(name: "_POLL_TYPE_IGNORE", value: 0)
!570 = !DIEnumerator(name: "_POLL_TYPE_SIGNAL", value: 1)
!571 = !DIEnumerator(name: "_POLL_TYPE_SEM_AVAILABLE", value: 2)
!572 = !DIEnumerator(name: "_POLL_TYPE_DATA_AVAILABLE", value: 3)
!573 = !DIEnumerator(name: "_POLL_TYPE_MSGQ_DATA_AVAILABLE", value: 4)
!574 = !DIEnumerator(name: "_POLL_TYPE_PIPE_DATA_AVAILABLE", value: 5)
!575 = !DIEnumerator(name: "_POLL_NUM_TYPES", value: 6)
!576 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_poll_modes", file: !448, line: 5379, baseType: !44, size: 32, elements: !577)
!577 = !{!578, !579}
!578 = !DIEnumerator(name: "K_POLL_MODE_NOTIFY_ONLY", value: 0)
!579 = !DIEnumerator(name: "K_POLL_NUM_MODES", value: 1)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 90, baseType: !32, size: 32, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588}
!582 = !DIEnumerator(name: "osThreadInactive", value: 0)
!583 = !DIEnumerator(name: "osThreadReady", value: 1)
!584 = !DIEnumerator(name: "osThreadRunning", value: 2)
!585 = !DIEnumerator(name: "osThreadBlocked", value: 3)
!586 = !DIEnumerator(name: "osThreadTerminated", value: 4)
!587 = !DIEnumerator(name: "osThreadError", value: -1)
!588 = !DIEnumerator(name: "osThreadReserved", value: 2147483647)
!589 = !{!171, !590, !777, !792, !793, !425, !796, !172, !797, !32, !799}
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 32)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv2_thread", file: !592, line: 16, size: 2240, elements: !593)
!592 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v2/wrapper.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!593 = !{!594, !609, !712, !718, !784, !785, !789, !790, !791}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !591, file: !592, line: 17, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !340, line: 49, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !340, line: 37, size: 64, elements: !597)
!597 = !{!598, !604}
!598 = !DIDerivedType(tag: DW_TAG_member, scope: !596, file: !340, line: 38, baseType: !599, size: 32)
!599 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !596, file: !340, line: 38, size: 32, elements: !600)
!600 = !{!601, !603}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !599, file: !340, line: 39, baseType: !602, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !599, file: !340, line: 40, baseType: !602, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, scope: !596, file: !340, line: 42, baseType: !605, size: 32, offset: 32)
!605 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !596, file: !340, line: 42, size: 32, elements: !606)
!606 = !{!607, !608}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !605, file: !340, line: 43, baseType: !602, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !605, file: !340, line: 44, baseType: !602, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "z_thread", scope: !591, file: !592, line: 18, baseType: !610, size: 1472, offset: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !330, line: 245, size: 1472, elements: !611)
!611 = !{!612, !656, !668, !669, !670, !675, !682, !684, !685, !686, !692, !707}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !610, file: !330, line: 247, baseType: !613, size: 384)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !330, line: 57, size: 384, elements: !614)
!614 = !{!615, !625, !632, !633, !634, !643, !644, !645}
!615 = !DIDerivedType(tag: DW_TAG_member, scope: !613, file: !330, line: 60, baseType: !616, size: 64)
!616 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !613, file: !330, line: 60, size: 64, elements: !617)
!617 = !{!618, !619}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !616, file: !330, line: 61, baseType: !595, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !616, file: !330, line: 62, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !356, line: 49, size: 64, elements: !621)
!621 = !{!622}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !620, file: !356, line: 50, baseType: !623, size: 64)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !624, size: 64, elements: !361)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !613, file: !330, line: 68, baseType: !626, size: 32, offset: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !366, line: 233, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !366, line: 231, size: 64, elements: !629)
!629 = !{!630}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !628, file: !366, line: 232, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !340, line: 48, baseType: !596)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !613, file: !330, line: 71, baseType: !273, size: 8, offset: 96)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !613, file: !330, line: 74, baseType: !273, size: 8, offset: 104)
!634 = !DIDerivedType(tag: DW_TAG_member, scope: !613, file: !330, line: 90, baseType: !635, size: 16, offset: 112)
!635 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !613, file: !330, line: 90, size: 16, elements: !636)
!636 = !{!637, !642}
!637 = !DIDerivedType(tag: DW_TAG_member, scope: !635, file: !330, line: 91, baseType: !638, size: 16)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !635, file: !330, line: 91, size: 16, elements: !639)
!639 = !{!640, !641}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !638, file: !330, line: 96, baseType: !380, size: 8)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !638, file: !330, line: 97, baseType: !273, size: 8, offset: 8)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !635, file: !330, line: 100, baseType: !384, size: 16)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !613, file: !330, line: 107, baseType: !172, size: 32, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !613, file: !330, line: 127, baseType: !171, size: 32, offset: 160)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !613, file: !330, line: 131, baseType: !646, size: 192, offset: 192)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !366, line: 244, size: 192, elements: !647)
!647 = !{!648, !649, !655}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !646, file: !366, line: 245, baseType: !595, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !646, file: !366, line: 246, baseType: !650, size: 32, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !366, line: 242, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 32)
!652 = !DISubroutineType(types: !653)
!653 = !{null, !654}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !646, file: !366, line: 249, baseType: !399, size: 64, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !610, file: !330, line: 250, baseType: !657, size: 288, offset: 384)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !403, line: 25, size: 288, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !657, file: !403, line: 26, baseType: !172, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !657, file: !403, line: 27, baseType: !172, size: 32, offset: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !657, file: !403, line: 28, baseType: !172, size: 32, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !657, file: !403, line: 29, baseType: !172, size: 32, offset: 96)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !657, file: !403, line: 30, baseType: !172, size: 32, offset: 128)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !657, file: !403, line: 31, baseType: !172, size: 32, offset: 160)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !657, file: !403, line: 32, baseType: !172, size: 32, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !657, file: !403, line: 33, baseType: !172, size: 32, offset: 224)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !657, file: !403, line: 34, baseType: !172, size: 32, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !610, file: !330, line: 253, baseType: !171, size: 32, offset: 672)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !610, file: !330, line: 256, baseType: !627, size: 64, offset: 704)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !610, file: !330, line: 259, baseType: !671, size: 16, offset: 768)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_poller", file: !330, line: 236, size: 16, elements: !672)
!672 = !{!673, !674}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "is_polling", scope: !671, file: !330, line: 237, baseType: !276, size: 8)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !671, file: !330, line: 238, baseType: !273, size: 8, offset: 8)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !610, file: !330, line: 271, baseType: !676, size: 128, offset: 800)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !330, line: 34, size: 128, elements: !677)
!677 = !{!678, !679, !680, !681}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !676, file: !330, line: 35, baseType: !425, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !676, file: !330, line: 36, baseType: !171, size: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !676, file: !330, line: 37, baseType: !171, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !676, file: !330, line: 38, baseType: !171, size: 32, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !610, file: !330, line: 274, baseType: !683, size: 32, offset: 928)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !610, file: !330, line: 279, baseType: !435, size: 256, offset: 960)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !610, file: !330, line: 294, baseType: !32, size: 32, offset: 1216)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !610, file: !330, line: 300, baseType: !687, size: 96, offset: 1248)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !330, line: 149, size: 96, elements: !688)
!688 = !{!689, !690, !691}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !687, file: !330, line: 153, baseType: !22, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !687, file: !330, line: 162, baseType: !319, size: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !687, file: !330, line: 168, baseType: !319, size: 32, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !610, file: !330, line: 325, baseType: !693, size: 32, offset: 1344)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 32)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !448, line: 5073, size: 192, elements: !695)
!695 = !{!696, !702, !703}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !694, file: !448, line: 5074, baseType: !697, size: 96)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !452, line: 56, size: 96, elements: !698)
!698 = !{!699, !700, !701}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !697, file: !452, line: 57, baseType: !455, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !697, file: !452, line: 58, baseType: !171, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !697, file: !452, line: 59, baseType: !319, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !694, file: !448, line: 5075, baseType: !627, size: 64, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !694, file: !448, line: 5076, baseType: !704, size: 32, offset: 160)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !462, line: 43, size: 32, elements: !705)
!705 = !{!706}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !704, file: !462, line: 52, baseType: !22, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !610, file: !330, line: 343, baseType: !708, size: 64, offset: 1376)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !403, line: 60, size: 64, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !708, file: !403, line: 63, baseType: !172, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !708, file: !403, line: 66, baseType: !172, size: 32, offset: 32)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "poll_signal", scope: !591, file: !592, line: 19, baseType: !713, size: 128, offset: 1536)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !448, line: 5397, size: 128, elements: !714)
!714 = !{!715, !716, !717}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !713, file: !448, line: 5399, baseType: !631, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !713, file: !448, line: 5405, baseType: !44, size: 32, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !713, file: !448, line: 5408, baseType: !32, size: 32, offset: 96)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "poll_event", scope: !591, file: !592, line: 20, baseType: !719, size: 160, offset: 1664)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_event", file: !448, line: 5421, size: 160, elements: !720)
!720 = !{!721, !722, !724, !725, !726, !727, !728, !729}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !719, file: !448, line: 5423, baseType: !595, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !719, file: !448, line: 5426, baseType: !723, size: 32, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !719, file: !448, line: 5429, baseType: !172, size: 8, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !719, file: !448, line: 5432, baseType: !172, size: 6, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !719, file: !448, line: 5435, baseType: !172, size: 7, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !719, file: !448, line: 5438, baseType: !172, size: 1, offset: 117, flags: DIFlagBitField, extraData: i64 96)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !719, file: !448, line: 5441, baseType: !172, size: 10, offset: 118, flags: DIFlagBitField, extraData: i64 96)
!729 = !DIDerivedType(tag: DW_TAG_member, scope: !719, file: !448, line: 5444, baseType: !730, size: 32, offset: 128)
!730 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !719, file: !448, line: 5444, size: 32, elements: !731)
!731 = !{!732, !733, !735, !743, !766, !768}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !730, file: !448, line: 5445, baseType: !171, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !730, file: !448, line: 5446, baseType: !734, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !730, file: !448, line: 5447, baseType: !736, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 32)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !448, line: 2909, size: 192, elements: !738)
!738 = !{!739, !740, !741, !742}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !737, file: !448, line: 2910, baseType: !627, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !737, file: !448, line: 2911, baseType: !44, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !737, file: !448, line: 2912, baseType: !44, size: 32, offset: 96)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !737, file: !448, line: 2914, baseType: !631, size: 64, offset: 128)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "fifo", scope: !730, file: !448, line: 5448, baseType: !744, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_fifo", file: !448, line: 2208, size: 224, elements: !746)
!746 = !{!747}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_queue", scope: !745, file: !448, line: 2209, baseType: !748, size: 224)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !448, line: 1709, size: 224, elements: !749)
!749 = !{!750, !763, !764, !765}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !748, file: !448, line: 1710, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !752, line: 46, baseType: !753)
!752 = !DIFile(filename: "zephyr/include/zephyr/sys/sflist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !752, line: 41, size: 64, elements: !754)
!754 = !{!755, !762}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !753, file: !752, line: 42, baseType: !756, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !752, line: 39, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !752, line: 35, size: 32, elements: !759)
!759 = !{!760}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !758, file: !752, line: 36, baseType: !761, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !752, line: 32, baseType: !172)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !753, file: !752, line: 43, baseType: !756, size: 32, offset: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !748, file: !448, line: 1711, baseType: !704, size: 32, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !748, file: !448, line: 1712, baseType: !627, size: 64, offset: 96)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !748, file: !448, line: 1714, baseType: !631, size: 64, offset: 160)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !730, file: !448, line: 5449, baseType: !767, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "msgq", scope: !730, file: !448, line: 5450, baseType: !769, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 32)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !448, line: 4204, size: 416, elements: !771)
!771 = !{!772, !773, !774, !775, !776, !778, !779, !780, !781, !782, !783}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !770, file: !448, line: 4206, baseType: !627, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !770, file: !448, line: 4208, baseType: !704, size: 32, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !770, file: !448, line: 4210, baseType: !319, size: 32, offset: 96)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !770, file: !448, line: 4212, baseType: !172, size: 32, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !770, file: !448, line: 4214, baseType: !777, size: 32, offset: 160)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !770, file: !448, line: 4216, baseType: !777, size: 32, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !770, file: !448, line: 4218, baseType: !777, size: 32, offset: 224)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !770, file: !448, line: 4220, baseType: !777, size: 32, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !770, file: !448, line: 4222, baseType: !172, size: 32, offset: 288)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !770, file: !448, line: 4224, baseType: !631, size: 64, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !770, file: !448, line: 4227, baseType: !273, size: 8, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "signal_results", scope: !591, file: !592, line: 21, baseType: !172, size: 32, offset: 1824)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !591, file: !592, line: 22, baseType: !786, size: 128, offset: 1856)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 128, elements: !787)
!787 = !{!788}
!788 = !DISubrange(count: 16)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !591, file: !592, line: 23, baseType: !172, size: 32, offset: 1984)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "join_guard", scope: !591, file: !592, line: 24, baseType: !737, size: 192, offset: 2016)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "has_joined", scope: !591, file: !592, line: 25, baseType: !192, size: 8, offset: 2208)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "osThreadId_t", file: !31, line: 208, baseType: !171)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !795, line: 22, baseType: !170)
!795 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !330, line: 347, baseType: !683)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !798, line: 46, baseType: !399)
!798 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!800 = !{!801, !562, !836, !841, !843, !845}
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "one_time", scope: !803, file: !804, line: 109, type: !172, isLocal: true, isDefinition: true)
!803 = distinct !DISubprogram(name: "osThreadNew", scope: !804, file: !804, line: 103, type: !805, scopeLine: 105, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !564, retainedNodes: !825)
!804 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v2/thread.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!805 = !DISubroutineType(types: !806)
!806 = !{!792, !807, !171, !811}
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "osThreadFunc_t", file: !31, line: 158, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DISubroutineType(types: !810)
!810 = !{null, !171}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "osThreadAttr_t", file: !31, line: 247, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 237, size: 288, elements: !815)
!815 = !{!816, !817, !818, !819, !820, !821, !822, !823, !824}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !814, file: !31, line: 238, baseType: !190, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !814, file: !31, line: 239, baseType: !172, size: 32, offset: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !814, file: !31, line: 240, baseType: !171, size: 32, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !814, file: !31, line: 241, baseType: !172, size: 32, offset: 96)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "stack_mem", scope: !814, file: !31, line: 242, baseType: !171, size: 32, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !814, file: !31, line: 243, baseType: !172, size: 32, offset: 160)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !814, file: !31, line: 244, baseType: !199, size: 32, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "tz_module", scope: !814, file: !31, line: 245, baseType: !201, size: 32, offset: 224)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !814, file: !31, line: 246, baseType: !172, size: 32, offset: 256)
!825 = !{!826, !827, !828, !829, !831, !832, !833, !834, !835}
!826 = !DILocalVariable(name: "threadfunc", arg: 1, scope: !803, file: !804, line: 103, type: !807)
!827 = !DILocalVariable(name: "arg", arg: 2, scope: !803, file: !804, line: 103, type: !171)
!828 = !DILocalVariable(name: "attr", arg: 3, scope: !803, file: !804, line: 104, type: !811)
!829 = !DILocalVariable(name: "prio", scope: !803, file: !804, line: 106, type: !830)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !32)
!831 = !DILocalVariable(name: "cv2_prio", scope: !803, file: !804, line: 107, type: !199)
!832 = !DILocalVariable(name: "tid", scope: !803, file: !804, line: 108, type: !590)
!833 = !DILocalVariable(name: "stack", scope: !803, file: !804, line: 110, type: !171)
!834 = !DILocalVariable(name: "stack_size", scope: !803, file: !804, line: 111, type: !319)
!835 = !DILocalVariable(name: "this_thread_num", scope: !803, file: !804, line: 112, type: !172)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "cv2_thread_pool", scope: !564, file: !804, line: 28, type: !838, isLocal: true, isDefinition: true)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 33600, elements: !839)
!839 = !{!840}
!840 = !DISubrange(count: 15)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "thread_num", scope: !564, file: !804, line: 29, type: !794, isLocal: true, isDefinition: true)
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "thread_num_dynamic", scope: !564, file: !804, line: 30, type: !794, isLocal: true, isDefinition: true)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "init_thread_attrs", scope: !564, file: !804, line: 15, type: !812, isLocal: true, isDefinition: true)
!847 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "cv2_semaphore_slab", scope: !850, file: !887, line: 11, type: !901, isLocal: false, isDefinition: true, align: 32)
!850 = distinct !DICompileUnit(language: DW_LANG_C99, file: !851, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !852, retainedTypes: !853, globals: !884, splitDebugInlining: false, nameTableKind: None)
!851 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/portability/cmsis_rtos_v2/semaphore.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_neonkey/subsys/portability/cmsis_rtos_v2/philosophers")
!852 = !{!30, !42}
!853 = !{!171, !854, !797, !180, !855, !32, !172, !173}
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 32)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv2_sem", file: !592, line: 43, size: 320, elements: !857)
!857 = !{!858, !883}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "z_semaphore", scope: !856, file: !592, line: 44, baseType: !859, size: 192)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !448, line: 2909, size: 192, elements: !860)
!860 = !{!861, !880, !881, !882}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !859, file: !448, line: 2910, baseType: !862, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !366, line: 233, baseType: !863)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !366, line: 231, size: 64, elements: !864)
!864 = !{!865}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !863, file: !366, line: 232, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !340, line: 48, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !340, line: 37, size: 64, elements: !868)
!868 = !{!869, !875}
!869 = !DIDerivedType(tag: DW_TAG_member, scope: !867, file: !340, line: 38, baseType: !870, size: 32)
!870 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !867, file: !340, line: 38, size: 32, elements: !871)
!871 = !{!872, !874}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !870, file: !340, line: 39, baseType: !873, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !870, file: !340, line: 40, baseType: !873, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, scope: !867, file: !340, line: 42, baseType: !876, size: 32, offset: 32)
!876 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !867, file: !340, line: 42, size: 32, elements: !877)
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !876, file: !340, line: 43, baseType: !873, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !876, file: !340, line: 44, baseType: !873, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !859, file: !448, line: 2911, baseType: !44, size: 32, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !859, file: !448, line: 2912, baseType: !44, size: 32, offset: 96)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !859, file: !448, line: 2914, baseType: !866, size: 64, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !856, file: !592, line: 45, baseType: !786, size: 128, offset: 192)
!884 = !{!848, !885, !891}
!885 = !DIGlobalVariableExpression(var: !886, expr: !DIExpression())
!886 = distinct !DIGlobalVariable(name: "_k_mem_slab_buf_cv2_semaphore_slab", scope: !850, file: !887, line: 11, type: !888, isLocal: false, isDefinition: true, align: 32)
!887 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v2/semaphore.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 1600, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 200)
!891 = !DIGlobalVariableExpression(var: !892, expr: !DIExpression())
!892 = distinct !DIGlobalVariable(name: "init_sema_attrs", scope: !850, file: !887, line: 14, type: !893, isLocal: true, isDefinition: true)
!893 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "osSemaphoreAttr_t", file: !31, line: 279, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 274, size: 128, elements: !896)
!896 = !{!897, !898, !899, !900}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !895, file: !31, line: 275, baseType: !190, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !895, file: !31, line: 276, baseType: !172, size: 32, offset: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !895, file: !31, line: 277, baseType: !171, size: 32, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !895, file: !31, line: 278, baseType: !172, size: 32, offset: 96)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_slab", file: !448, line: 4836, size: 256, elements: !902)
!902 = !{!903, !904, !908, !909, !910, !911, !912}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !901, file: !448, line: 4837, baseType: !862, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !901, file: !448, line: 4838, baseType: !905, size: 32, offset: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !462, line: 43, size: 32, elements: !906)
!906 = !{!907}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !905, file: !462, line: 52, baseType: !22, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !901, file: !448, line: 4839, baseType: !172, size: 32, offset: 96)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !901, file: !448, line: 4840, baseType: !319, size: 32, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !901, file: !448, line: 4841, baseType: !777, size: 32, offset: 160)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "free_list", scope: !901, file: !448, line: 4842, baseType: !777, size: 32, offset: 192)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "num_used", scope: !901, file: !448, line: 4843, baseType: !172, size: 32, offset: 224)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !915, file: !999, line: 72, type: !1082, isLocal: true, isDefinition: true)
!915 = distinct !DICompileUnit(language: DW_LANG_C99, file: !916, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !917, retainedTypes: !985, globals: !996, splitDebugInlining: false, nameTableKind: None)
!916 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_neonkey/subsys/portability/cmsis_rtos_v2/philosophers")
!917 = !{!42, !918}
!918 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !239, line: 65, baseType: !32, size: 32, elements: !919)
!919 = !{!920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984}
!920 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!921 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!922 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!923 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!924 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!925 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!926 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!927 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!928 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!929 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!930 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!931 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!932 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!933 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!934 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!935 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!936 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!937 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!938 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!939 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!940 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!941 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!942 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!943 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!944 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!945 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!946 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!947 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!948 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!949 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!950 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!951 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!952 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!953 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!954 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!955 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!956 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!957 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!958 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!959 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!960 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!961 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!962 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!963 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!964 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!965 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!966 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!967 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!968 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!969 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!970 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!971 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!972 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!973 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!974 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!975 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!976 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!977 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!978 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!979 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!980 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!981 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!982 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!983 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!984 = !DIEnumerator(name: "SPI5_IRQn", value: 85)
!985 = !{!319, !32, !171, !986}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !239, line: 244, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !239, line: 236, size: 192, elements: !989)
!989 = !{!990, !991, !992, !993, !994, !995}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !988, file: !239, line: 238, baseType: !243, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !988, file: !239, line: 239, baseType: !243, size: 32, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !988, file: !239, line: 240, baseType: !243, size: 32, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !988, file: !239, line: 241, baseType: !243, size: 32, offset: 96)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !988, file: !239, line: 242, baseType: !243, size: 32, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !988, file: !239, line: 243, baseType: !243, size: 32, offset: 160)
!996 = !{!997, !1003, !1019, !1030, !1047, !913, !1049, !1062, !1064, !1066, !1068, !1070, !1072, !1074, !1076, !1078, !1080}
!997 = !DIGlobalVariableExpression(var: !998, expr: !DIExpression())
!998 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !915, file: !999, line: 424, type: !1000, isLocal: false, isDefinition: true, align: 16)
!999 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !280, size: 64, elements: !1001)
!1001 = !{!1002}
!1002 = !DISubrange(count: 4)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(name: "__device_dts_ord_39", scope: !915, file: !999, line: 424, type: !1005, isLocal: false, isDefinition: true, align: 32)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !263, line: 378, size: 192, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1017, !1018}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1006, file: !263, line: 380, baseType: !190, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1006, file: !263, line: 382, baseType: !13, size: 32, offset: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1006, file: !263, line: 384, baseType: !13, size: 32, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1006, file: !263, line: 386, baseType: !1012, size: 32, offset: 96)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 32)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !263, line: 351, size: 16, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1013, file: !263, line: 359, baseType: !273, size: 8)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1013, file: !263, line: 364, baseType: !276, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1006, file: !263, line: 388, baseType: !171, size: 32, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1006, file: !263, line: 396, baseType: !279, size: 32, offset: 160)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_39", scope: !915, file: !999, line: 424, type: !1021, isLocal: true, isDefinition: true, align: 32)
!1021 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1022)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !254, line: 51, size: 64, elements: !1023)
!1023 = !{!1024, !1029}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1022, file: !254, line: 60, baseType: !1025, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 32)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!32, !1028}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1022, file: !254, line: 65, baseType: !1028, size: 32, offset: 32)
!1030 = !DIGlobalVariableExpression(var: !1031, expr: !DIExpression())
!1031 = distinct !DIGlobalVariable(name: "exti_data", scope: !915, file: !999, line: 423, type: !1032, isLocal: true, isDefinition: true)
