; ModuleID = 'build/actinius_icarus_som_ns/subsys/logging/syst/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.3, i8*, i32 }
%union.anon.3 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon.3 }
%struct.mpsc_pbuf_buffer_config = type { i32*, i32, void (%struct.mpsc_pbuf_buffer*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }
%union.log_msg_generic = type { %struct.log_msg }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/logging/syst/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/logging/syst")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/logging/syst")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 256, baseType: !24)
!23 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stdint.h", directory: "")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_syst", scope: !27, file: !123, line: 15, type: !125, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !112, globals: !120, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/logging/syst/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/logging/syst")
!29 = !{!30, !37, !42}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !38, line: 33, baseType: !32, size: 32, elements: !39)
!38 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!39 = !{!40, !41}
!40 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!41 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !43, line: 27, baseType: !32, size: 32, elements: !44)
!43 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!45 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!46 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!47 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!48 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!49 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!50 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!51 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!52 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!53 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!54 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!55 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!56 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!57 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!58 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!59 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!60 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!61 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!111 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!112 = !{!113, !114, !117, !119}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 226, baseType: !116)
!116 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!119 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!120 = !{!25, !121}
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !123, line: 15, type: !124, isLocal: true, isDefinition: true)
!123 = !DIFile(filename: "zephyr/samples/subsys/logging/syst/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !127, line: 16, size: 64, elements: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !{!129, !133}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !127, line: 17, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !126, file: !127, line: 18, baseType: !115, size: 8, offset: 32)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !136, file: !159, line: 18, type: !161, isLocal: false, isDefinition: true)
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !138, retainedTypes: !139, globals: !156, splitDebugInlining: false, nameTableKind: None)
!137 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/logging/syst")
!138 = !{!30}
!139 = !{!22, !113, !24, !140, !142, !144, !145, !119, !147, !148, !150, !152, !153, !114, !154, !130}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !146, line: 46, baseType: !32)
!146 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 207, baseType: !155)
!155 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!156 = !{!134, !157}
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !136, file: !159, line: 18, type: !160, isLocal: true, isDefinition: true)
!159 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !127, line: 16, size: 64, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !127, line: 17, baseType: !130, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !162, file: !127, line: 18, baseType: !115, size: 8, offset: 32)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "_char_out", scope: !168, file: !173, line: 54, type: !174, isLocal: false, isDefinition: true)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, retainedTypes: !171, globals: !172, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/logging/syst")
!170 = !{!42}
!171 = !{!113, !119}
!172 = !{!166}
!173 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DISubroutineType(types: !176)
!176 = !{!119, !119}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !179, file: !237, line: 35, type: !254, isLocal: false, isDefinition: true)
!179 = distinct !DICompileUnit(language: DW_LANG_C99, file: !180, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, retainedTypes: !181, globals: !234, splitDebugInlining: false, nameTableKind: None)
!180 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/logging/syst")
!181 = !{!113, !119, !182, !187, !194}
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !184, file: !183, line: 167, baseType: !193)
!183 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!184 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !183, file: !183, line: 134, type: !185, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !179, retainedNodes: !188)
!185 = !DISubroutineType(types: !186)
!186 = !{null, !187}
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 172, baseType: !32)
!188 = !{!189, !190, !192}
!189 = !DILocalVariable(name: "time_us", arg: 1, scope: !184, file: !183, line: 134, type: !187)
!190 = !DILocalVariable(name: "delay_cycles", scope: !184, file: !183, line: 168, type: !191)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!192 = !DILocalVariable(name: "cycles", scope: !184, file: !183, line: 171, type: !187)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !196, line: 1928, baseType: !197)
!196 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !196, line: 1909, size: 11360, elements: !198)
!198 = !{!199, !205, !206, !207, !208, !212, !213, !214, !215, !219, !220, !224, !225, !226, !227, !228, !232, !233}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !197, file: !196, line: 1910, baseType: !200, size: 8192)
!200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 8192, elements: !203)
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !187)
!203 = !{!204}
!204 = !DISubrange(count: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !197, file: !196, line: 1911, baseType: !201, size: 32, offset: 8192)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !197, file: !196, line: 1912, baseType: !201, size: 32, offset: 8224)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !197, file: !196, line: 1913, baseType: !201, size: 32, offset: 8256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !197, file: !196, line: 1914, baseType: !209, size: 1984, offset: 8288)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 1984, elements: !210)
!210 = !{!211}
!211 = !DISubrange(count: 62)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !197, file: !196, line: 1915, baseType: !202, size: 32, offset: 10272)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !197, file: !196, line: 1916, baseType: !201, size: 32, offset: 10304)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !197, file: !196, line: 1917, baseType: !202, size: 32, offset: 10336)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !197, file: !196, line: 1918, baseType: !216, size: 96, offset: 10368)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 96, elements: !217)
!217 = !{!218}
!218 = !DISubrange(count: 3)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !197, file: !196, line: 1919, baseType: !202, size: 32, offset: 10464)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !197, file: !196, line: 1920, baseType: !221, size: 256, offset: 10496)
!221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 256, elements: !222)
!222 = !{!223}
!223 = !DISubrange(count: 8)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !197, file: !196, line: 1921, baseType: !202, size: 32, offset: 10752)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !197, file: !196, line: 1922, baseType: !201, size: 32, offset: 10784)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !197, file: !196, line: 1923, baseType: !202, size: 32, offset: 10816)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !197, file: !196, line: 1924, baseType: !202, size: 32, offset: 10848)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !197, file: !196, line: 1925, baseType: !229, size: 416, offset: 10880)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !201, size: 416, elements: !230)
!230 = !{!231}
!231 = !DISubrange(count: 13)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !197, file: !196, line: 1926, baseType: !202, size: 32, offset: 11296)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !197, file: !196, line: 1927, baseType: !202, size: 32, offset: 11328)
!234 = !{!177, !235, !250}
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !179, file: !237, line: 65, type: !238, isLocal: true, isDefinition: true, align: 32)
!237 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!238 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !240, line: 51, size: 64, elements: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !{!242, !249}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !239, file: !240, line: 60, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DISubroutineType(types: !245)
!245 = !{!119, !246}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!248 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !240, line: 48, flags: DIFlagFwdDecl)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !239, file: !240, line: 65, baseType: !246, size: 32, offset: 32)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !184, file: !183, line: 161, type: !252, isLocal: true, isDefinition: true, align: 128)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !253, size: 48, elements: !217)
!253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!254 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !255)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !127, line: 16, size: 64, elements: !256)
!256 = !{!257, !258}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !255, file: !127, line: 17, baseType: !130, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !255, file: !127, line: 18, baseType: !115, size: 8, offset: 32)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "log_const_log", scope: !261, file: !335, line: 25, type: !571, isLocal: false, isDefinition: true)
!261 = distinct !DICompileUnit(language: DW_LANG_C99, file: !262, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !263, retainedTypes: !264, globals: !332, splitDebugInlining: false, nameTableKind: None)
!262 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/logging/syst")
!263 = !{!37, !30, !42}
!264 = !{!145, !119, !113, !114, !265, !22, !319, !24, !187, !320, !322, !328, !330}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !267)
!267 = !{!268, !285, !291}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !266, file: !31, line: 112, baseType: !269, size: 32)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !270, line: 49, size: 32, elements: !271)
!270 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_packet.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!271 = !{!272, !278, !284}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !269, file: !270, line: 50, baseType: !273, size: 32)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !270, line: 37, size: 32, elements: !274)
!274 = !{!275, !276, !277}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !273, file: !270, line: 38, baseType: !187, size: 1, flags: DIFlagBitField, extraData: i64 0)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !273, file: !270, line: 38, baseType: !187, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !273, file: !270, line: 39, baseType: !187, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !269, file: !270, line: 51, baseType: !279, size: 32)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !270, line: 43, size: 32, elements: !280)
!280 = !{!281, !282, !283}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !279, file: !270, line: 44, baseType: !187, size: 1, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !279, file: !270, line: 44, baseType: !187, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !279, file: !270, line: 45, baseType: !187, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !269, file: !270, line: 52, baseType: !187, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !266, file: !31, line: 113, baseType: !286, size: 32)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !287)
!287 = !{!288, !289, !290}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !286, file: !31, line: 108, baseType: !187, size: 1, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !286, file: !31, line: 108, baseType: !187, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !286, file: !31, line: 108, baseType: !187, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !266, file: !31, line: 114, baseType: !292, size: 128)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !293)
!293 = !{!294, !311, !315}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !292, file: !31, line: 89, baseType: !295, size: 96)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !296)
!296 = !{!297, !308, !309}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !295, file: !31, line: 67, baseType: !298, size: 32)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !305, !306, !307}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !298, file: !31, line: 52, baseType: !187, size: 1, flags: DIFlagBitField, extraData: i64 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !298, file: !31, line: 52, baseType: !187, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !298, file: !31, line: 52, baseType: !187, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !298, file: !31, line: 53, baseType: !187, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !298, file: !31, line: 54, baseType: !187, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !298, file: !31, line: 55, baseType: !187, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !298, file: !31, line: 56, baseType: !187, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !298, file: !31, line: 57, baseType: !187, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !295, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !295, file: !31, line: 76, baseType: !310, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !187)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !292, file: !31, line: 93, baseType: !312, size: 32, offset: 96)
!312 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 32, elements: !313)
!313 = !{!314}
!314 = !DISubrange(count: 4)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !292, file: !31, line: 94, baseType: !316, offset: 128)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: -1)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 98, baseType: !321)
!321 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !323, line: 46, baseType: !324)
!323 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !325, line: 56, baseType: !326)
!325 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/../../../../arm-zephyr-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !327, line: 103, baseType: !151)
!327 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/../../../../arm-zephyr-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !292)
!332 = !{!259, !333, !362, !369, !372, !374, !378, !380, !382, !384, !386, !392, !425, !428, !435, !528, !555, !562, !564, !568, !576, !586}
!333 = !DIGlobalVariableExpression(var: !334, expr: !DIExpression())
!334 = distinct !DIGlobalVariable(name: "log_process_thread_sem", scope: !261, file: !335, line: 93, type: !336, isLocal: false, isDefinition: true, align: 32)
!335 = !DIFile(filename: "zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !337, line: 2909, size: 128, elements: !338)
!337 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!338 = !{!339, !360, !361}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !336, file: !337, line: 2910, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !341, line: 233, baseType: !342)
!341 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 231, size: 64, elements: !343)
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !342, file: !341, line: 232, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !346, line: 48, baseType: !347)
!346 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !346, line: 37, size: 64, elements: !348)
!348 = !{!349, !355}
!349 = !DIDerivedType(tag: DW_TAG_member, scope: !347, file: !346, line: 38, baseType: !350, size: 32)
!350 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !347, file: !346, line: 38, size: 32, elements: !351)
!351 = !{!352, !354}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !350, file: !346, line: 39, baseType: !353, size: 32)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !350, file: !346, line: 40, baseType: !353, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, scope: !347, file: !346, line: 42, baseType: !356, size: 32, offset: 32)
!356 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !347, file: !346, line: 42, size: 32, elements: !357)
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !356, file: !346, line: 43, baseType: !353, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !356, file: !346, line: 44, baseType: !353, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !336, file: !337, line: 2911, baseType: !32, size: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !336, file: !337, line: 2912, baseType: !32, size: 32, offset: 96)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "__init_enable_logger", scope: !261, file: !335, line: 910, type: !364, isLocal: true, isDefinition: true, align: 32)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !240, line: 51, size: 64, elements: !366)
!366 = !{!367, !368}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !365, file: !240, line: 60, baseType: !243, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !365, file: !240, line: 65, baseType: !246, size: 32, offset: 32)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "panic_mode", scope: !261, file: !335, line: 96, type: !371, isLocal: true, isDefinition: true)
!371 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "backend_attached", scope: !261, file: !335, line: 97, type: !371, isLocal: true, isDefinition: true)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "buffered_cnt", scope: !261, file: !335, line: 98, type: !376, isLocal: true, isDefinition: true)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !377, line: 22, baseType: !149)
!377 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "dropped_cnt", scope: !261, file: !335, line: 99, type: !376, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "timestamp_freq", scope: !261, file: !335, line: 105, type: !187, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "prev_timestamp", scope: !261, file: !335, line: 107, type: !310, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "unordered_cnt", scope: !261, file: !335, line: 108, type: !376, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "log_msg_ptr", scope: !261, file: !335, line: 111, type: !388, isLocal: true, isDefinition: true, align: 32)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_ptr", file: !389, line: 29, size: 32, elements: !390)
!389 = !DIFile(filename: "zephyr/include/zephyr/logging/log_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!390 = !{!391}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !388, file: !389, line: 30, baseType: !265, size: 32)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "log_buffer", scope: !261, file: !335, line: 112, type: !394, isLocal: true, isDefinition: true, align: 32)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !395, line: 87, size: 448, elements: !396)
!395 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_pbuf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!396 = !{!397, !398, !399, !400, !401, !402, !406, !415, !420, !422, !423, !424}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !394, file: !395, line: 89, baseType: !187, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !394, file: !395, line: 92, baseType: !187, size: 32, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !394, file: !395, line: 95, baseType: !187, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !394, file: !395, line: 98, baseType: !187, size: 32, offset: 96)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !394, file: !395, line: 101, baseType: !187, size: 32, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !394, file: !395, line: 104, baseType: !403, offset: 160)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !404, line: 43, elements: !405)
!404 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!405 = !{}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !394, file: !395, line: 110, baseType: !407, size: 32, offset: 160)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !395, line: 83, baseType: !408)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !411, !413}
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !394, file: !395, line: 113, baseType: !416, size: 32, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !395, line: 75, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DISubroutineType(types: !419)
!419 = !{!187, !413}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !394, file: !395, line: 116, baseType: !421, size: 32, offset: 224)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !394, file: !395, line: 119, baseType: !187, size: 32, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !394, file: !395, line: 122, baseType: !187, size: 32, offset: 288)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !394, file: !395, line: 124, baseType: !336, size: 128, offset: 320)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "curr_log_buffer", scope: !261, file: !335, line: 113, type: !427, isLocal: true, isDefinition: true)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "logging_stack", scope: !261, file: !335, line: 884, type: !430, isLocal: false, isDefinition: true, align: 64)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 64, elements: !222)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !432, line: 47, size: 8, elements: !433)
!432 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !431, file: !432, line: 48, baseType: !132, size: 8)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "logging_thread", scope: !261, file: !335, line: 885, type: !437, isLocal: false, isDefinition: true)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !438, line: 245, size: 1024, elements: !439)
!438 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!439 = !{!440, !486, !499, !500, !501, !502, !508, !523}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !437, file: !438, line: 247, baseType: !441, size: 384)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !438, line: 57, size: 384, elements: !442)
!442 = !{!443, !457, !459, !460, !461, !473, !474, !475}
!443 = !DIDerivedType(tag: DW_TAG_member, scope: !441, file: !438, line: 60, baseType: !444, size: 64)
!444 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !441, file: !438, line: 60, size: 64, elements: !445)
!445 = !{!446, !448}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !444, file: !438, line: 61, baseType: !447, size: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !346, line: 49, baseType: !347)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !444, file: !438, line: 62, baseType: !449, size: 64)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !450, line: 49, size: 64, elements: !451)
!450 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !449, file: !450, line: 50, baseType: !453, size: 64)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 64, elements: !455)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!455 = !{!456}
!456 = !DISubrange(count: 2)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !441, file: !438, line: 68, baseType: !458, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !441, file: !438, line: 71, baseType: !115, size: 8, offset: 96)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !441, file: !438, line: 74, baseType: !115, size: 8, offset: 104)
!461 = !DIDerivedType(tag: DW_TAG_member, scope: !441, file: !438, line: 90, baseType: !462, size: 16, offset: 112)
!462 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !441, file: !438, line: 90, size: 16, elements: !463)
!463 = !{!464, !472}
!464 = !DIDerivedType(tag: DW_TAG_member, scope: !462, file: !438, line: 91, baseType: !465, size: 16)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !462, file: !438, line: 91, size: 16, elements: !466)
!466 = !{!467, !471}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !465, file: !438, line: 96, baseType: !468, size: 8)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !325, line: 20, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !327, line: 41, baseType: !470)
!470 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !465, file: !438, line: 97, baseType: !115, size: 8, offset: 8)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !462, file: !438, line: 100, baseType: !154, size: 16)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !441, file: !438, line: 107, baseType: !187, size: 32, offset: 128)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !441, file: !438, line: 127, baseType: !113, size: 32, offset: 160)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !441, file: !438, line: 131, baseType: !476, size: 192, offset: 192)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !341, line: 244, size: 192, elements: !477)
!477 = !{!478, !479, !485}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !476, file: !341, line: 245, baseType: !447, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !476, file: !341, line: 246, baseType: !480, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !341, line: 242, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !484}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !476, file: !341, line: 249, baseType: !324, size: 64, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !437, file: !438, line: 250, baseType: !487, size: 288, offset: 384)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !488, line: 25, size: 288, elements: !489)
!488 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497, !498}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !487, file: !488, line: 26, baseType: !187, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !487, file: !488, line: 27, baseType: !187, size: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !487, file: !488, line: 28, baseType: !187, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !487, file: !488, line: 29, baseType: !187, size: 32, offset: 96)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !487, file: !488, line: 30, baseType: !187, size: 32, offset: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !487, file: !488, line: 31, baseType: !187, size: 32, offset: 160)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !487, file: !488, line: 32, baseType: !187, size: 32, offset: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !487, file: !488, line: 33, baseType: !187, size: 32, offset: 224)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !487, file: !488, line: 34, baseType: !187, size: 32, offset: 256)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !437, file: !438, line: 253, baseType: !113, size: 32, offset: 672)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !437, file: !438, line: 256, baseType: !340, size: 64, offset: 704)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !437, file: !438, line: 294, baseType: !119, size: 32, offset: 768)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !437, file: !438, line: 300, baseType: !503, size: 96, offset: 800)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !438, line: 149, size: 96, elements: !504)
!504 = !{!505, !506, !507}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !503, file: !438, line: 153, baseType: !22, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !503, file: !438, line: 162, baseType: !145, size: 32, offset: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !503, file: !438, line: 168, baseType: !145, size: 32, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !437, file: !438, line: 325, baseType: !509, size: 32, offset: 896)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !337, line: 5073, size: 160, elements: !511)
!511 = !{!512, !521, !522}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !510, file: !337, line: 5074, baseType: !513, size: 96)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !514, line: 56, size: 96, elements: !515)
!514 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!515 = !{!516, !519, !520}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !513, file: !514, line: 57, baseType: !517, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 32)
!518 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !514, line: 57, flags: DIFlagFwdDecl)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !513, file: !514, line: 58, baseType: !113, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !513, file: !514, line: 59, baseType: !145, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !510, file: !337, line: 5075, baseType: !340, size: 64, offset: 96)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !510, file: !337, line: 5076, baseType: !403, offset: 160)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !437, file: !438, line: 343, baseType: !524, size: 64, offset: 928)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !488, line: 60, size: 64, elements: !525)
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !524, file: !488, line: 63, baseType: !187, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !524, file: !488, line: 66, baseType: !187, size: 32, offset: 32)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "format_table", scope: !261, file: !335, line: 72, type: !530, isLocal: true, isDefinition: true)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 128, elements: !313)
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_format_func_t", file: !533, line: 105, baseType: !534)
!533 = !DIFile(filename: "zephyr/include/zephyr/logging/log_output.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = !DISubroutineType(types: !536)
!536 = !{null, !537, !319, !187}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !533, line: 89, size: 128, elements: !540)
!540 = !{!541, !546, !553, !554}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !539, file: !533, line: 90, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_output_func_t", file: !533, line: 79, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = !DISubroutineType(types: !545)
!545 = !{!119, !114, !145, !113}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !539, file: !533, line: 91, baseType: !547, size: 32, offset: 32)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !533, line: 82, size: 96, elements: !549)
!549 = !{!550, !551, !552}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !548, file: !533, line: 83, baseType: !376, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !548, file: !533, line: 84, baseType: !113, size: 32, offset: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !548, file: !533, line: 85, baseType: !130, size: 32, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !539, file: !533, line: 92, baseType: !114, size: 32, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !539, file: !533, line: 93, baseType: !145, size: 32, offset: 96)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "timestamp_func", scope: !261, file: !335, line: 104, type: !557, isLocal: true, isDefinition: true)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_get_t", file: !558, line: 33, baseType: !559)
!558 = !DIFile(filename: "zephyr/include/zephyr/logging/log_ctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DISubroutineType(types: !561)
!561 = !{!310}
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "initialized", scope: !261, file: !335, line: 95, type: !376, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "proc_tid", scope: !261, file: !335, line: 100, type: !566, isLocal: true, isDefinition: true)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !438, line: 347, baseType: !567)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !261, file: !335, line: 25, type: !570, isLocal: true, isDefinition: true)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !127, line: 16, size: 64, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !572, file: !127, line: 17, baseType: !130, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !572, file: !127, line: 18, baseType: !115, size: 8, offset: 32)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "mpsc_config", scope: !261, file: !335, line: 121, type: !578, isLocal: true, isDefinition: true)
!578 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !395, line: 128, size: 160, elements: !580)
!580 = !{!581, !582, !583, !584, !585}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !579, file: !395, line: 130, baseType: !421, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !579, file: !395, line: 133, baseType: !187, size: 32, offset: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !579, file: !395, line: 136, baseType: !407, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !579, file: !395, line: 137, baseType: !416, size: 32, offset: 96)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !579, file: !395, line: 140, baseType: !187, size: 32, offset: 128)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "buf32", scope: !261, file: !335, line: 116, type: !588, isLocal: true, isDefinition: true, align: 64)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 32, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 1)
!591 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "log_const_log_mgmt", scope: !594, file: !601, line: 14, type: !834, isLocal: false, isDefinition: true)
!594 = distinct !DICompileUnit(language: DW_LANG_C99, file: !595, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !596, retainedTypes: !597, globals: !598, splitDebugInlining: false, nameTableKind: None)
!595 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/logging/syst")
!596 = !{!37, !42}
!597 = !{!113, !119, !117, !114, !130, !22}
!598 = !{!592, !599, !627, !809, !811, !825, !827, !832}
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "sname_cache", scope: !594, file: !601, line: 44, type: !602, isLocal: true, isDefinition: true)
!601 = !DIFile(filename: "zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache", file: !603, line: 30, size: 256, elements: !604)
!603 = !DIFile(filename: "zephyr/subsys/logging/log_cache.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!604 = !{!605, !618, !619, !624, !625, !626}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !602, file: !603, line: 31, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !607, line: 40, baseType: !608)
!607 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !607, line: 35, size: 64, elements: !609)
!609 = !{!610, !617}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !608, file: !607, line: 36, baseType: !611, size: 32)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !607, line: 33, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !607, line: 29, size: 32, elements: !614)
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !613, file: !607, line: 30, baseType: !616, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !608, file: !607, line: 37, baseType: !611, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !602, file: !603, line: 32, baseType: !606, size: 64, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !602, file: !603, line: 33, baseType: !620, size: 32, offset: 128)
!620 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_cache_cmp_func_t", file: !603, line: 21, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!622 = !DISubroutineType(types: !623)
!623 = !{!371, !22, !22}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !602, file: !603, line: 34, baseType: !187, size: 32, offset: 160)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "miss", scope: !602, file: !603, line: 35, baseType: !187, size: 32, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !602, file: !603, line: 36, baseType: !145, size: 32, offset: 224)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "invalid_domain", scope: !629, file: !601, line: 261, type: !130, isLocal: true, isDefinition: true)
!629 = distinct !DISubprogram(name: "link_domain_name_get", scope: !601, file: !601, line: 256, type: !630, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !594, retainedNodes: !632)
!630 = !DISubroutineType(types: !631)
!631 = !{!130, !115}
!632 = !{!633, !634, !635, !636, !637, !640, !808}
!633 = !DILocalVariable(name: "domain_id", arg: 1, scope: !629, file: !601, line: 256, type: !115)
!634 = !DILocalVariable(name: "cached", scope: !629, file: !601, line: 258, type: !114)
!635 = !DILocalVariable(name: "cache_size", scope: !629, file: !601, line: 259, type: !145)
!636 = !DILocalVariable(name: "id", scope: !629, file: !601, line: 260, type: !22)
!637 = !DILocalVariable(name: "rel_domain_id", scope: !638, file: !601, line: 265, type: !115)
!638 = distinct !DILexicalBlock(scope: !639, file: !601, line: 264, column: 49)
!639 = distinct !DILexicalBlock(scope: !629, file: !601, line: 264, column: 6)
!640 = !DILocalVariable(name: "link", scope: !638, file: !601, line: 266, type: !641)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link", file: !644, line: 61, size: 192, elements: !645)
!644 = !DIFile(filename: "zephyr/include/zephyr/logging/log_link.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!645 = !{!646, !735, !736, !745, !746, !798}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !643, file: !644, line: 62, baseType: !647, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_api", file: !644, line: 38, size: 192, elements: !650)
!650 = !{!651, !714, !718, !723, !727, !731}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "initiate", scope: !649, file: !644, line: 39, baseType: !652, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 32)
!653 = !DISubroutineType(types: !654)
!654 = !{!119, !641, !655}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_config", file: !644, line: 33, size: 64, elements: !657)
!657 = !{!658, !709}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "msg_cb", scope: !656, file: !644, line: 34, baseType: !659, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_callback_t", file: !644, line: 27, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 32)
!661 = !DISubroutineType(types: !662)
!662 = !{null, !641, !663}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 32)
!664 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !665)
!665 = !{!666, !682, !688}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !664, file: !31, line: 112, baseType: !667, size: 32)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !270, line: 49, size: 32, elements: !668)
!668 = !{!669, !675, !681}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !667, file: !270, line: 50, baseType: !670, size: 32)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !270, line: 37, size: 32, elements: !671)
!671 = !{!672, !673, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !670, file: !270, line: 38, baseType: !187, size: 1, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !670, file: !270, line: 38, baseType: !187, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !670, file: !270, line: 39, baseType: !187, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !667, file: !270, line: 51, baseType: !676, size: 32)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !270, line: 43, size: 32, elements: !677)
!677 = !{!678, !679, !680}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !676, file: !270, line: 44, baseType: !187, size: 1, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !676, file: !270, line: 44, baseType: !187, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !676, file: !270, line: 45, baseType: !187, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !667, file: !270, line: 52, baseType: !187, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !664, file: !31, line: 113, baseType: !683, size: 32)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !684)
!684 = !{!685, !686, !687}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !683, file: !31, line: 108, baseType: !187, size: 1, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !683, file: !31, line: 108, baseType: !187, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !683, file: !31, line: 108, baseType: !187, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !664, file: !31, line: 114, baseType: !689, size: 128)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !690)
!690 = !{!691, !707, !708}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !689, file: !31, line: 89, baseType: !692, size: 96)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !693)
!693 = !{!694, !705, !706}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !692, file: !31, line: 67, baseType: !695, size: 32)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !695, file: !31, line: 52, baseType: !187, size: 1, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !695, file: !31, line: 52, baseType: !187, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !695, file: !31, line: 52, baseType: !187, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !695, file: !31, line: 53, baseType: !187, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !695, file: !31, line: 54, baseType: !187, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !695, file: !31, line: 55, baseType: !187, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !695, file: !31, line: 56, baseType: !187, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !695, file: !31, line: 57, baseType: !187, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !692, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !692, file: !31, line: 76, baseType: !310, size: 32, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !689, file: !31, line: 93, baseType: !312, size: 32, offset: 96)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !689, file: !31, line: 94, baseType: !316, offset: 128)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "dropped_cb", scope: !656, file: !644, line: 35, baseType: !710, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_dropped_cb_t", file: !644, line: 30, baseType: !711)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !641, !187}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !649, file: !644, line: 40, baseType: !715, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 32)
!716 = !DISubroutineType(types: !717)
!717 = !{!119, !641}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "get_domain_name", scope: !649, file: !644, line: 41, baseType: !719, size: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 32)
!720 = !DISubroutineType(types: !721)
!721 = !{!119, !641, !187, !153, !722}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "get_source_name", scope: !649, file: !644, line: 43, baseType: !724, size: 32, offset: 96)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = !DISubroutineType(types: !726)
!726 = !{!119, !641, !187, !154, !153, !722}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "get_levels", scope: !649, file: !644, line: 45, baseType: !728, size: 32, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 32)
!729 = !DISubroutineType(types: !730)
!730 = !{!119, !641, !187, !154, !114, !114}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "set_runtime_level", scope: !649, file: !644, line: 48, baseType: !732, size: 32, offset: 160)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!733 = !DISubroutineType(types: !734)
!734 = !{!119, !641, !187, !154, !115}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !643, file: !644, line: 63, baseType: !130, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl_blk", scope: !643, file: !644, line: 64, baseType: !737, size: 32, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 32)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_ctrl_blk", file: !644, line: 52, size: 128, elements: !739)
!739 = !{!740, !741, !743, !744}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "domain_cnt", scope: !738, file: !644, line: 53, baseType: !187, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "source_cnt", scope: !738, file: !644, line: 54, baseType: !742, size: 16, offset: 32)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 16, elements: !589)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "domain_offset", scope: !738, file: !644, line: 57, baseType: !187, size: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !738, file: !644, line: 58, baseType: !421, size: 32, offset: 96)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !643, file: !644, line: 65, baseType: !113, size: 32, offset: 96)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf", scope: !643, file: !644, line: 66, baseType: !747, size: 32, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !395, line: 87, size: 448, elements: !749)
!749 = !{!750, !751, !752, !753, !754, !755, !757, !766, !771, !772, !773, !774}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !748, file: !395, line: 89, baseType: !187, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !748, file: !395, line: 92, baseType: !187, size: 32, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !748, file: !395, line: 95, baseType: !187, size: 32, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !748, file: !395, line: 98, baseType: !187, size: 32, offset: 96)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !748, file: !395, line: 101, baseType: !187, size: 32, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !748, file: !395, line: 104, baseType: !756, offset: 160)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !404, line: 43, elements: !405)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !748, file: !395, line: 110, baseType: !758, size: 32, offset: 160)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !395, line: 83, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!760 = !DISubroutineType(types: !761)
!761 = !{null, !762, !764}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !748)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !748, file: !395, line: 113, baseType: !767, size: 32, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !395, line: 75, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 32)
!769 = !DISubroutineType(types: !770)
!770 = !{!187, !764}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !748, file: !395, line: 116, baseType: !421, size: 32, offset: 224)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !748, file: !395, line: 119, baseType: !187, size: 32, offset: 256)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !748, file: !395, line: 122, baseType: !187, size: 32, offset: 288)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !748, file: !395, line: 124, baseType: !775, size: 128, offset: 320)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !337, line: 2909, size: 128, elements: !776)
!776 = !{!777, !796, !797}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !775, file: !337, line: 2910, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !341, line: 233, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 231, size: 64, elements: !780)
!780 = !{!781}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !779, file: !341, line: 232, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !346, line: 48, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !346, line: 37, size: 64, elements: !784)
!784 = !{!785, !791}
!785 = !DIDerivedType(tag: DW_TAG_member, scope: !783, file: !346, line: 38, baseType: !786, size: 32)
!786 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !783, file: !346, line: 38, size: 32, elements: !787)
!787 = !{!788, !790}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !786, file: !346, line: 39, baseType: !789, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !786, file: !346, line: 40, baseType: !789, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, scope: !783, file: !346, line: 42, baseType: !792, size: 32, offset: 32)
!792 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !783, file: !346, line: 42, size: 32, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !792, file: !346, line: 43, baseType: !789, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !792, file: !346, line: 44, baseType: !789, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !775, file: !337, line: 2911, baseType: !32, size: 32, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !775, file: !337, line: 2912, baseType: !32, size: 32, offset: 96)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf_config", scope: !643, file: !644, line: 67, baseType: !799, size: 32, offset: 160)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !395, line: 128, size: 160, elements: !802)
!802 = !{!803, !804, !805, !806, !807}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !801, file: !395, line: 130, baseType: !421, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !801, file: !395, line: 133, baseType: !187, size: 32, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !801, file: !395, line: 136, baseType: !758, size: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !801, file: !395, line: 137, baseType: !767, size: 32, offset: 96)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !801, file: !395, line: 140, baseType: !187, size: 32, offset: 128)
!808 = !DILocalVariable(name: "err", scope: !638, file: !601, line: 267, type: !119)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "dname_cache", scope: !594, file: !601, line: 43, type: !602, isLocal: true, isDefinition: true)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "dname_cache_config", scope: !813, file: !601, line: 152, type: !818, isLocal: true, isDefinition: true)
!813 = distinct !DISubprogram(name: "cache_init", scope: !601, file: !601, line: 149, type: !814, scopeLine: 150, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !594, retainedNodes: !816)
!814 = !DISubroutineType(types: !815)
!815 = !{null}
!816 = !{!817}
!817 = !DILocalVariable(name: "err", scope: !813, file: !601, line: 151, type: !119)
!818 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !819)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache_config", file: !603, line: 23, size: 128, elements: !820)
!820 = !{!821, !822, !823, !824}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !819, file: !603, line: 24, baseType: !113, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !819, file: !603, line: 25, baseType: !145, size: 32, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !819, file: !603, line: 26, baseType: !145, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !819, file: !603, line: 27, baseType: !620, size: 32, offset: 96)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "sname_cache_config", scope: !813, file: !601, line: 158, type: !818, isLocal: true, isDefinition: true)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "dname_cache_buffer", scope: !594, file: !601, line: 40, type: !829, isLocal: true, isDefinition: true, align: 32)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 72, elements: !830)
!830 = !{!831}
!831 = !DISubrange(count: 9)
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "sname_cache_buffer", scope: !594, file: !601, line: 41, type: !829, isLocal: true, isDefinition: true, align: 32)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !127, line: 16, size: 64, elements: !836)
!836 = !{!837, !838}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !835, file: !127, line: 17, baseType: !130, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !835, file: !127, line: 18, baseType: !115, size: 8, offset: 32)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "prefix", scope: !841, file: !842, line: 562, type: !887, isLocal: true, isDefinition: true)
!841 = distinct !DISubprogram(name: "log_output_dropped_process", scope: !842, file: !842, line: 558, type: !843, scopeLine: 559, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !859, retainedNodes: !880)
!842 = !DIFile(filename: "zephyr/subsys/logging/log_output.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!843 = !DISubroutineType(types: !844)
!844 = !{null, !845, !187}
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !533, line: 89, size: 128, elements: !848)
!848 = !{!849, !850, !857, !858}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !847, file: !533, line: 90, baseType: !542, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !847, file: !533, line: 91, baseType: !851, size: 32, offset: 32)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 32)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !533, line: 82, size: 96, elements: !853)
!853 = !{!854, !855, !856}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !852, file: !533, line: 83, baseType: !376, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !852, file: !533, line: 84, baseType: !113, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !852, file: !533, line: 85, baseType: !130, size: 32, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !847, file: !533, line: 92, baseType: !114, size: 32, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !847, file: !533, line: 93, baseType: !145, size: 32, offset: 96)
!859 = distinct !DICompileUnit(language: DW_LANG_C99, file: !860, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, retainedTypes: !861, globals: !862, splitDebugInlining: false, nameTableKind: None)
!860 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_output.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/logging/syst")
!861 = !{!22, !113, !114, !320, !119, !187, !845, !132, !116, !117}
!862 = !{!839, !863, !868, !870, !872, !878}
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "postfix", scope: !841, file: !842, line: 563, type: !865, isLocal: true, isDefinition: true)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 224, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 28)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "freq", scope: !859, file: !842, line: 46, type: !187, isLocal: true, isDefinition: true)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "timestamp_div", scope: !859, file: !842, line: 47, type: !310, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "colors", scope: !859, file: !842, line: 38, type: !874, isLocal: true, isDefinition: true)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !875, size: 160, elements: !876)
!875 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!876 = !{!877}
!877 = !DISubrange(count: 5)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "severity", scope: !859, file: !842, line: 30, type: !874, isLocal: true, isDefinition: true)
!880 = !{!881, !882, !883, !885, !886}
!881 = !DILocalVariable(name: "output", arg: 1, scope: !841, file: !842, line: 558, type: !845)
!882 = !DILocalVariable(name: "cnt", arg: 2, scope: !841, file: !842, line: 558, type: !187)
!883 = !DILocalVariable(name: "buf", scope: !841, file: !842, line: 560, type: !884)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 40, elements: !876)
!885 = !DILocalVariable(name: "len", scope: !841, file: !842, line: 561, type: !119)
!886 = !DILocalVariable(name: "outf", scope: !841, file: !842, line: 565, type: !542)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 96, elements: !888)
!888 = !{!889}
!889 = !DISubrange(count: 12)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "log_const_log_uart", scope: !892, file: !956, line: 16, type: !1084, isLocal: false, isDefinition: true)
!892 = distinct !DICompileUnit(language: DW_LANG_C99, file: !893, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !596, retainedTypes: !894, globals: !953, splitDebugInlining: false, nameTableKind: None)
!893 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/backends/log_backend_uart.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/subsys/logging/syst")
!894 = !{!113, !119, !895}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !898, line: 336, size: 160, elements: !899)
!898 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!899 = !{!900, !927, !931, !935, !948}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !897, file: !898, line: 365, baseType: !901, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DISubroutineType(types: !903)
!903 = !{!119, !904, !926}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !906)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !907, line: 378, size: 192, elements: !908)
!907 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!908 = !{!909, !910, !911, !912, !918, !919}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !906, file: !907, line: 380, baseType: !130, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !906, file: !907, line: 382, baseType: !13, size: 32, offset: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !906, file: !907, line: 384, baseType: !13, size: 32, offset: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !906, file: !907, line: 386, baseType: !913, size: 32, offset: 96)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !907, line: 351, size: 16, elements: !915)
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !914, file: !907, line: 359, baseType: !115, size: 8)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !914, file: !907, line: 364, baseType: !371, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !906, file: !907, line: 388, baseType: !113, size: 32, offset: 128)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !906, file: !907, line: 396, baseType: !920, size: 32, offset: 160)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !907, line: 43, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !325, line: 32, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !327, line: 55, baseType: !925)
!925 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !897, file: !898, line: 366, baseType: !928, size: 32, offset: 32)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 32)
!929 = !DISubroutineType(types: !930)
!930 = !{null, !904, !116}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !897, file: !898, line: 374, baseType: !932, size: 32, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 32)
!933 = !DISubroutineType(types: !934)
!934 = !{!119, !904}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !897, file: !898, line: 377, baseType: !936, size: 32, offset: 96)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!937 = !DISubroutineType(types: !938)
!938 = !{!119, !904, !939}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !898, line: 122, size: 64, elements: !942)
!942 = !{!943, !944, !945, !946, !947}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !941, file: !898, line: 123, baseType: !187, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !941, file: !898, line: 124, baseType: !115, size: 8, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !941, file: !898, line: 125, baseType: !115, size: 8, offset: 40)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !941, file: !898, line: 126, baseType: !115, size: 8, offset: 48)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !941, file: !898, line: 127, baseType: !115, size: 8, offset: 56)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !897, file: !898, line: 379, baseType: !949, size: 32, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 32)
!950 = !DISubroutineType(types: !951)
!951 = !{!119, !904, !952}
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!953 = !{!890, !954, !1052, !1054, !1056, !1071, !1074, !1076, !1079, !1082}
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(name: "log_backend_uart_api", scope: !892, file: !956, line: 156, type: !957, isLocal: false, isDefinition: true)
!956 = !DIFile(filename: "zephyr/subsys/logging/backends/log_backend_uart.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!957 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_backend_api", file: !38, line: 62, size: 224, elements: !959)
!959 = !{!960, !1027, !1031, !1035, !1036, !1040, !1044}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !958, file: !38, line: 63, baseType: !961, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!962 = !DISubroutineType(types: !963)
!963 = !{null, !964, !981}
!964 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_backend", file: !38, line: 93, size: 128, elements: !968)
!968 = !{!969, !971, !979, !980}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !967, file: !38, line: 94, baseType: !970, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !967, file: !38, line: 95, baseType: !972, size: 32, offset: 32)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_backend_control_block", file: !38, line: 81, size: 64, elements: !974)
!974 = !{!975, !976, !977, !978}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !973, file: !38, line: 82, baseType: !113, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !973, file: !38, line: 83, baseType: !115, size: 8, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !973, file: !38, line: 84, baseType: !371, size: 8, offset: 40)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !973, file: !38, line: 87, baseType: !115, size: 8, offset: 48)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !967, file: !38, line: 96, baseType: !130, size: 32, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "autostart", scope: !967, file: !38, line: 97, baseType: !371, size: 8, offset: 96)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 32)
!982 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !983)
!983 = !{!984, !1000, !1006}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !982, file: !31, line: 112, baseType: !985, size: 32)
!985 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !270, line: 49, size: 32, elements: !986)
!986 = !{!987, !993, !999}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !985, file: !270, line: 50, baseType: !988, size: 32)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !270, line: 37, size: 32, elements: !989)
!989 = !{!990, !991, !992}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !988, file: !270, line: 38, baseType: !187, size: 1, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !988, file: !270, line: 38, baseType: !187, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !988, file: !270, line: 39, baseType: !187, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !985, file: !270, line: 51, baseType: !994, size: 32)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !270, line: 43, size: 32, elements: !995)
!995 = !{!996, !997, !998}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !994, file: !270, line: 44, baseType: !187, size: 1, flags: DIFlagBitField, extraData: i64 0)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !994, file: !270, line: 44, baseType: !187, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !994, file: !270, line: 45, baseType: !187, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !985, file: !270, line: 52, baseType: !187, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !982, file: !31, line: 113, baseType: !1001, size: 32)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !1001, file: !31, line: 108, baseType: !187, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !1001, file: !31, line: 108, baseType: !187, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1001, file: !31, line: 108, baseType: !187, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !982, file: !31, line: 114, baseType: !1007, size: 128)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !1008)
!1008 = !{!1009, !1025, !1026}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !1007, file: !31, line: 89, baseType: !1010, size: 96)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !1011)
!1011 = !{!1012, !1023, !1024}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !1010, file: !31, line: 67, baseType: !1013, size: 32)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !1013, file: !31, line: 52, baseType: !187, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !1013, file: !31, line: 52, baseType: !187, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
