; ModuleID = 'build/adafruit_itsybitsy_m4_express/drivers/led_lp3943/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.3, i8*, i32 }
%union.anon.3 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer.18 = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon.3 }
%struct.mpsc_pbuf_buffer_config.19 = type { i32*, i32, void (%struct.mpsc_pbuf_buffer.18*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/led_lp3943/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/led_lp3943")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 149, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/led_lp3943")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8768, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 137)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4384, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_app", scope: !27, file: !230, line: 15, type: !232, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !107, globals: !227, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/led_lp3943/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/led_lp3943")
!29 = !{!30, !37}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !38, line: 27, baseType: !32, size: 32, elements: !39)
!38 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!40 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!41 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!42 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!43 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!44 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!45 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!46 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!47 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!48 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!49 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!50 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!51 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!52 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!53 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!54 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!55 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!56 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!106 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!107 = !{!108, !109, !123, !124, !117, !125, !135, !154}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !122}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !110, file: !111, line: 80, baseType: !114, size: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !115)
!115 = !{!116, !119, !120, !121}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !114, file: !111, line: 47, baseType: !117, size: 8)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !118)
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !114, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !114, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !114, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !110, file: !111, line: 82, baseType: !108, size: 32)
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !127)
!127 = !{!128, !146, !150}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !126, file: !31, line: 89, baseType: !129, size: 96)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !130)
!130 = !{!131, !143, !144}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !129, file: !31, line: 67, baseType: !132, size: 32)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !133)
!133 = !{!134, !136, !137, !138, !139, !140, !141, !142}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !132, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !132, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !132, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !132, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !132, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !132, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !129, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !129, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !135)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !126, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 32, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 4)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !31, line: 94, baseType: !151, offset: 128)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: -1)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "led_driver_api", file: !157, line: 113, size: 224, elements: !158)
!157 = !DIFile(filename: "zephyr/include/zephyr/drivers/led.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!158 = !{!159, !189, !191, !196, !212, !217, !222}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !156, file: !157, line: 115, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_on", file: !157, line: 89, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{!123, !164, !135}
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !167, line: 378, size: 192, elements: !168)
!167 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!168 = !{!169, !173, !174, !175, !182, !183}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !166, file: !167, line: 380, baseType: !170, size: 32)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !172)
!172 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !166, file: !167, line: 382, baseType: !13, size: 32, offset: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !166, file: !167, line: 384, baseType: !13, size: 32, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !166, file: !167, line: 386, baseType: !176, size: 32, offset: 96)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !167, line: 351, size: 16, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !177, file: !167, line: 359, baseType: !117, size: 8)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !177, file: !167, line: 364, baseType: !181, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!181 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !166, file: !167, line: 388, baseType: !108, size: 32, offset: 128)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !166, file: !167, line: 396, baseType: !184, size: 32, offset: 160)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !167, line: 43, baseType: !187)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !188)
!188 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !156, file: !157, line: 116, baseType: !190, size: 32, offset: 32)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_off", file: !157, line: 97, baseType: !161)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "blink", scope: !156, file: !157, line: 118, baseType: !192, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_blink", file: !157, line: 54, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{!123, !164, !135, !135, !135}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "get_info", scope: !156, file: !157, line: 119, baseType: !197, size: 32, offset: 96)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_get_info", file: !157, line: 63, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{!123, !164, !135, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "led_info", file: !157, line: 41, size: 128, elements: !205)
!205 = !{!206, !207, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !204, file: !157, line: 42, baseType: !170, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !204, file: !157, line: 43, baseType: !135, size: 32, offset: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "num_colors", scope: !204, file: !157, line: 44, baseType: !117, size: 8, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "color_mapping", scope: !204, file: !157, line: 45, baseType: !210, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "set_brightness", scope: !156, file: !157, line: 120, baseType: !213, size: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_set_brightness", file: !157, line: 72, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 32)
!215 = !DISubroutineType(types: !216)
!216 = !{!123, !164, !135, !117}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "set_color", scope: !156, file: !157, line: 121, baseType: !218, size: 32, offset: 160)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_set_color", file: !157, line: 80, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DISubroutineType(types: !221)
!221 = !{!123, !164, !135, !117, !210}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "write_channels", scope: !156, file: !157, line: 122, baseType: !223, size: 32, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "led_api_write_channels", file: !157, line: 105, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DISubroutineType(types: !226)
!226 = !{!123, !164, !135, !135, !210}
!227 = !{!25, !228}
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !230, line: 15, type: !231, isLocal: true, isDefinition: true)
!230 = !DIFile(filename: "zephyr/samples/drivers/led_lp3943/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !234, line: 16, size: 64, elements: !235)
!234 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !234, line: 17, baseType: !170, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !233, file: !234, line: 18, baseType: !117, size: 8, offset: 32)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !240, file: !296, line: 18, type: !298, isLocal: false, isDefinition: true)
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !242, retainedTypes: !243, globals: !293, splitDebugInlining: false, nameTableKind: None)
!241 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/led_lp3943")
!242 = !{!30}
!243 = !{!22, !108, !24, !244, !246, !248, !249, !123, !251, !252, !254, !256, !257, !258, !259, !261, !124, !117, !272, !135, !170}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !250, line: 214, baseType: !32)
!250 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !260)
!260 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !263)
!263 = !{!264, !271}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !262, file: !111, line: 80, baseType: !265, size: 32)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !266)
!266 = !{!267, !268, !269, !270}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !265, file: !111, line: 47, baseType: !117, size: 8)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !265, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !265, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !265, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !262, file: !111, line: 82, baseType: !108, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !274)
!274 = !{!275, !291, !292}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !273, file: !31, line: 89, baseType: !276, size: 96)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !277)
!277 = !{!278, !289, !290}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !276, file: !31, line: 67, baseType: !279, size: 32)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !280)
!280 = !{!281, !282, !283, !284, !285, !286, !287, !288}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !279, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !279, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !279, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !279, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !279, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !279, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !279, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !279, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !276, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !276, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !273, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !273, file: !31, line: 94, baseType: !151, offset: 128)
!293 = !{!238, !294}
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !240, file: !296, line: 18, type: !297, isLocal: true, isDefinition: true)
!296 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !234, line: 16, size: 64, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !299, file: !234, line: 17, baseType: !170, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !299, file: !234, line: 18, baseType: !117, size: 8, offset: 32)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "_char_out", scope: !305, file: !310, line: 54, type: !311, isLocal: false, isDefinition: true)
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !307, retainedTypes: !308, globals: !309, splitDebugInlining: false, nameTableKind: None)
!306 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/led_lp3943")
!307 = !{!37}
!308 = !{!108, !123}
!309 = !{!303}
!310 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DISubroutineType(types: !313)
!313 = !{!123, !123}
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !316, file: !853, line: 149, type: !854, isLocal: true, isDefinition: true, align: 32)
!316 = distinct !DICompileUnit(language: DW_LANG_C99, file: !317, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !307, retainedTypes: !318, globals: !852, splitDebugInlining: false, nameTableKind: None)
!317 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/led_lp3943")
!318 = !{!108, !123, !319, !453, !538}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cmcc", file: !321, line: 352, baseType: !322)
!321 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/cmcc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !321, line: 339, size: 448, elements: !323)
!323 = !{!324, !340, !352, !362, !373, !383, !391, !401, !412, !422, !432, !442}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !322, file: !321, line: 340, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !326)
!326 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_TYPE_Type", file: !321, line: 57, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 44, size: 32, elements: !329)
!329 = !{!330, !339}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !328, file: !321, line: 55, baseType: !331, size: 32)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !321, line: 45, size: 32, elements: !332)
!332 = !{!333, !334, !335, !336, !337, !338}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK", scope: !331, file: !321, line: 47, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "RRP", scope: !331, file: !321, line: 49, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "WAYNUM", scope: !331, file: !321, line: 50, baseType: !135, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "LCKDOWN", scope: !331, file: !321, line: 51, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZE", scope: !331, file: !321, line: 52, baseType: !135, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "CLSIZE", scope: !331, file: !321, line: 53, baseType: !135, size: 3, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !328, file: !321, line: 56, baseType: !135, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "CFG", scope: !322, file: !321, line: 341, baseType: !341, size: 32, offset: 32)
!341 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !342)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CFG_Type", file: !321, line: 124, baseType: !343)
!343 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 114, size: 32, elements: !344)
!344 = !{!345, !351}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !343, file: !321, line: 122, baseType: !346, size: 32)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !343, file: !321, line: 115, size: 32, elements: !347)
!347 = !{!348, !349, !350}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ICDIS", scope: !346, file: !321, line: 117, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "DCDIS", scope: !346, file: !321, line: 118, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZESW", scope: !346, file: !321, line: 120, baseType: !135, size: 3, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !343, file: !321, line: 123, baseType: !135, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !322, file: !321, line: 342, baseType: !353, size: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CTRL_Type", file: !321, line: 161, baseType: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 155, size: 32, elements: !356)
!356 = !{!357, !361}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !355, file: !321, line: 159, baseType: !358, size: 32)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !355, file: !321, line: 156, size: 32, elements: !359)
!359 = !{!360}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !358, file: !321, line: 157, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !355, file: !321, line: 160, baseType: !135, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !322, file: !321, line: 343, baseType: !363, size: 32, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_SR_Type", file: !321, line: 179, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 173, size: 32, elements: !367)
!367 = !{!368, !372}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !366, file: !321, line: 177, baseType: !369, size: 32)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !366, file: !321, line: 174, size: 32, elements: !370)
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "CSTS", scope: !369, file: !321, line: 175, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !366, file: !321, line: 178, baseType: !135, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !322, file: !321, line: 344, baseType: !374, size: 32, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_LCKWAY_Type", file: !321, line: 197, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 191, size: 32, elements: !377)
!377 = !{!378, !382}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !376, file: !321, line: 195, baseType: !379, size: 32)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !376, file: !321, line: 192, size: 32, elements: !380)
!380 = !{!381}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !379, file: !321, line: 193, baseType: !135, size: 4, flags: DIFlagBitField, extraData: i64 0)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !376, file: !321, line: 196, baseType: !135, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !322, file: !321, line: 345, baseType: !384, size: 96, offset: 160)
!384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 96, elements: !389)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !386, line: 53, baseType: !387)
!386 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/samd51g19a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!387 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !388)
!388 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !117)
!389 = !{!390}
!390 = !DISubrange(count: 12)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT0", scope: !322, file: !321, line: 346, baseType: !392, size: 32, offset: 256)
!392 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !393)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT0_Type", file: !321, line: 216, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 210, size: 32, elements: !395)
!395 = !{!396, !400}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !394, file: !321, line: 214, baseType: !397, size: 32)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !394, file: !321, line: 211, size: 32, elements: !398)
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "INVALL", scope: !397, file: !321, line: 212, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !394, file: !321, line: 215, baseType: !135, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT1", scope: !322, file: !321, line: 347, baseType: !402, size: 32, offset: 288)
!402 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT1_Type", file: !321, line: 236, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 228, size: 32, elements: !405)
!405 = !{!406, !411}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !404, file: !321, line: 234, baseType: !407, size: 32)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !404, file: !321, line: 229, size: 32, elements: !408)
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "INDEX", scope: !407, file: !321, line: 231, baseType: !135, size: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "WAY", scope: !407, file: !321, line: 233, baseType: !135, size: 4, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !404, file: !321, line: 235, baseType: !135, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "MCFG", scope: !322, file: !321, line: 348, baseType: !413, size: 32, offset: 320)
!413 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !414)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCFG_Type", file: !321, line: 266, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 260, size: 32, elements: !416)
!416 = !{!417, !421}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !415, file: !321, line: 264, baseType: !418, size: 32)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !415, file: !321, line: 261, size: 32, elements: !419)
!419 = !{!420}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !418, file: !321, line: 262, baseType: !135, size: 2, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !415, file: !321, line: 265, baseType: !135, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "MEN", scope: !322, file: !321, line: 349, baseType: !423, size: 32, offset: 352)
!423 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MEN_Type", file: !321, line: 291, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 285, size: 32, elements: !426)
!426 = !{!427, !431}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !425, file: !321, line: 289, baseType: !428, size: 32)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !425, file: !321, line: 286, size: 32, elements: !429)
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "MENABLE", scope: !428, file: !321, line: 287, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !425, file: !321, line: 290, baseType: !135, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "MCTRL", scope: !322, file: !321, line: 350, baseType: !433, size: 32, offset: 384)
!433 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCTRL_Type", file: !321, line: 309, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 303, size: 32, elements: !436)
!436 = !{!437, !441}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !435, file: !321, line: 307, baseType: !438, size: 32)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !435, file: !321, line: 304, size: 32, elements: !439)
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !438, file: !321, line: 305, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !435, file: !321, line: 308, baseType: !135, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "MSR", scope: !322, file: !321, line: 351, baseType: !443, size: 32, offset: 416)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !445)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MSR_Type", file: !321, line: 326, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !321, line: 321, size: 32, elements: !447)
!447 = !{!448, !452}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !446, file: !321, line: 324, baseType: !449, size: 32)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !446, file: !321, line: 322, size: 32, elements: !450)
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "EVENT_CNT", scope: !449, file: !321, line: 323, baseType: !135, size: 32, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !446, file: !321, line: 325, baseType: !135, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !455, line: 267, baseType: !456)
!455 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !455, line: 259, size: 2560, elements: !457)
!457 = !{!458, !468, !472, !499, !503, !521, !525}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !456, file: !455, line: 260, baseType: !459, size: 8)
!459 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRLA_Type", file: !455, line: 50, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !455, line: 44, size: 8, elements: !462)
!462 = !{!463, !467}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !461, file: !455, line: 48, baseType: !464, size: 8)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !461, file: !455, line: 45, size: 8, elements: !465)
!465 = !{!466}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !464, file: !455, line: 46, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !461, file: !455, line: 49, baseType: !117, size: 8)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !456, file: !455, line: 261, baseType: !469, size: 24, offset: 8)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 24, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 3)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !456, file: !455, line: 262, baseType: !473, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_SYNCBUSY_Type", file: !455, line: 86, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !455, line: 62, size: 32, elements: !477)
!477 = !{!478, !494, !498}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !476, file: !455, line: 79, baseType: !479, size: 32)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !476, file: !455, line: 63, size: 32, elements: !480)
!480 = !{!481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !479, file: !455, line: 64, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL0", scope: !479, file: !455, line: 66, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL1", scope: !479, file: !455, line: 67, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL2", scope: !479, file: !455, line: 68, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL3", scope: !479, file: !455, line: 69, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL4", scope: !479, file: !455, line: 70, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL5", scope: !479, file: !455, line: 71, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL6", scope: !479, file: !455, line: 72, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL7", scope: !479, file: !455, line: 73, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL8", scope: !479, file: !455, line: 74, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL9", scope: !479, file: !455, line: 75, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL10", scope: !479, file: !455, line: 76, baseType: !135, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL11", scope: !479, file: !455, line: 77, baseType: !135, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !476, file: !455, line: 84, baseType: !495, size: 32)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !476, file: !455, line: 80, size: 32, elements: !496)
!496 = !{!497}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !495, file: !455, line: 82, baseType: !135, size: 12, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !476, file: !455, line: 85, baseType: !135, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !456, file: !455, line: 263, baseType: !500, size: 192, offset: 64)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 192, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 24)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !456, file: !455, line: 264, baseType: !504, size: 384, offset: 256)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 384, elements: !389)
!505 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !455, line: 163, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !455, line: 149, size: 32, elements: !508)
!508 = !{!509, !520}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !507, file: !455, line: 161, baseType: !510, size: 32)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !507, file: !455, line: 150, size: 32, elements: !511)
!511 = !{!512, !513, !514, !515, !516, !517, !518, !519}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !510, file: !455, line: 151, baseType: !135, size: 4, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !510, file: !455, line: 153, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !510, file: !455, line: 154, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !510, file: !455, line: 155, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !510, file: !455, line: 156, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !510, file: !455, line: 157, baseType: !135, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !510, file: !455, line: 158, baseType: !135, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !510, file: !455, line: 160, baseType: !135, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !507, file: !455, line: 162, baseType: !135, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !456, file: !455, line: 265, baseType: !522, size: 384, offset: 640)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !385, size: 384, elements: !523)
!523 = !{!524}
!524 = !DISubrange(count: 48)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "PCHCTRL", scope: !456, file: !455, line: 266, baseType: !526, size: 1536, offset: 1024)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 1536, elements: !523)
!527 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_PCHCTRL_Type", file: !455, line: 218, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !455, line: 209, size: 32, elements: !530)
!530 = !{!531, !537}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !529, file: !455, line: 216, baseType: !532, size: 32)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !529, file: !455, line: 210, size: 32, elements: !533)
!533 = !{!534, !535, !536}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !532, file: !455, line: 211, baseType: !135, size: 4, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "CHEN", scope: !532, file: !455, line: 213, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !532, file: !455, line: 214, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !529, file: !455, line: 217, baseType: !135, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "Oscctrl", file: !540, line: 788, baseType: !541)
!540 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/oscctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !540, line: 771, size: 704, elements: !542)
!542 = !{!543, !558, !559, !590, !621, !654, !689, !713, !725, !726, !743, !744, !756, !768, !781, !782}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "EVCTRL", scope: !541, file: !540, line: 772, baseType: !544, size: 8)
!544 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_EVCTRL_Type", file: !540, line: 55, baseType: !546)
!546 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !540, line: 44, size: 8, elements: !547)
!547 = !{!548, !553, !557}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !546, file: !540, line: 49, baseType: !549, size: 8)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !546, file: !540, line: 45, size: 8, elements: !550)
!550 = !{!551, !552}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO0", scope: !549, file: !540, line: 46, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO1", scope: !549, file: !540, line: 47, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !546, file: !540, line: 53, baseType: !554, size: 8)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !546, file: !540, line: 50, size: 8, elements: !555)
!555 = !{!556}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO", scope: !554, file: !540, line: 51, baseType: !117, size: 2, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !546, file: !540, line: 54, baseType: !117, size: 8)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !541, file: !540, line: 773, baseType: !469, size: 24, offset: 8)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !541, file: !540, line: 774, baseType: !560, size: 32, offset: 32)
!560 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENCLR_Type", file: !540, line: 102, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !540, line: 72, size: 32, elements: !563)
!563 = !{!564, !584, !589}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !562, file: !540, line: 95, baseType: !565, size: 32)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !562, file: !540, line: 73, size: 32, elements: !566)
!566 = !{!567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !565, file: !540, line: 74, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !565, file: !540, line: 75, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !565, file: !540, line: 76, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !565, file: !540, line: 77, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !565, file: !540, line: 79, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !565, file: !540, line: 80, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !565, file: !540, line: 81, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !565, file: !540, line: 82, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !565, file: !540, line: 83, baseType: !135, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !565, file: !540, line: 85, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !565, file: !540, line: 86, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !565, file: !540, line: 87, baseType: !135, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !565, file: !540, line: 88, baseType: !135, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !565, file: !540, line: 90, baseType: !135, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !565, file: !540, line: 91, baseType: !135, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !565, file: !540, line: 92, baseType: !135, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !565, file: !540, line: 93, baseType: !135, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !562, file: !540, line: 100, baseType: !585, size: 32)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !562, file: !540, line: 96, size: 32, elements: !586)
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !585, file: !540, line: 97, baseType: !135, size: 2, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !585, file: !540, line: 98, baseType: !135, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !562, file: !540, line: 101, baseType: !135, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !541, file: !540, line: 775, baseType: !591, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENSET_Type", file: !540, line: 182, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !540, line: 152, size: 32, elements: !594)
!594 = !{!595, !615, !620}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !593, file: !540, line: 175, baseType: !596, size: 32)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !593, file: !540, line: 153, size: 32, elements: !597)
!597 = !{!598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !596, file: !540, line: 154, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !596, file: !540, line: 155, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !596, file: !540, line: 156, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !596, file: !540, line: 157, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !596, file: !540, line: 159, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !596, file: !540, line: 160, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !596, file: !540, line: 161, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !596, file: !540, line: 162, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !596, file: !540, line: 163, baseType: !135, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !596, file: !540, line: 165, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !596, file: !540, line: 166, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !596, file: !540, line: 167, baseType: !135, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !596, file: !540, line: 168, baseType: !135, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !596, file: !540, line: 170, baseType: !135, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !596, file: !540, line: 171, baseType: !135, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !596, file: !540, line: 172, baseType: !135, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !596, file: !540, line: 173, baseType: !135, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !593, file: !540, line: 180, baseType: !616, size: 32)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !593, file: !540, line: 176, size: 32, elements: !617)
!617 = !{!618, !619}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !616, file: !540, line: 177, baseType: !135, size: 2, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !616, file: !540, line: 178, baseType: !135, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !593, file: !540, line: 181, baseType: !135, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !541, file: !540, line: 776, baseType: !622, size: 32, offset: 96)
!622 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !623)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTFLAG_Type", file: !540, line: 262, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !540, line: 232, size: 32, elements: !625)
!625 = !{!626, !648, !653}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !624, file: !540, line: 255, baseType: !627, size: 32)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !624, file: !540, line: 233, size: 32, elements: !628)
!628 = !{!629, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !627, file: !540, line: 234, baseType: !630, size: 1, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!631 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !135)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !627, file: !540, line: 235, baseType: !630, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !627, file: !540, line: 236, baseType: !630, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !627, file: !540, line: 237, baseType: !630, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !627, file: !540, line: 239, baseType: !630, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !627, file: !540, line: 240, baseType: !630, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !627, file: !540, line: 241, baseType: !630, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !627, file: !540, line: 242, baseType: !630, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !627, file: !540, line: 243, baseType: !630, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !627, file: !540, line: 245, baseType: !630, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !627, file: !540, line: 246, baseType: !630, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !627, file: !540, line: 247, baseType: !630, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !627, file: !540, line: 248, baseType: !630, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !627, file: !540, line: 250, baseType: !630, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !627, file: !540, line: 251, baseType: !630, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !627, file: !540, line: 252, baseType: !630, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !627, file: !540, line: 253, baseType: !630, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !624, file: !540, line: 260, baseType: !649, size: 32)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !624, file: !540, line: 256, size: 32, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !649, file: !540, line: 257, baseType: !630, size: 2, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !649, file: !540, line: 258, baseType: !630, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !624, file: !540, line: 261, baseType: !135, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !541, file: !540, line: 777, baseType: !655, size: 32, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_STATUS_Type", file: !540, line: 345, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !540, line: 312, size: 32, elements: !659)
!659 = !{!660, !682, !688}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !658, file: !540, line: 337, baseType: !661, size: 32)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !658, file: !540, line: 313, size: 32, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !661, file: !540, line: 314, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !661, file: !540, line: 315, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !661, file: !540, line: 316, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !661, file: !540, line: 317, baseType: !135, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW0", scope: !661, file: !540, line: 318, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW1", scope: !661, file: !540, line: 319, baseType: !135, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !661, file: !540, line: 321, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !661, file: !540, line: 322, baseType: !135, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !661, file: !540, line: 323, baseType: !135, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !661, file: !540, line: 324, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !661, file: !540, line: 325, baseType: !135, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !661, file: !540, line: 327, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !661, file: !540, line: 328, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0TO", scope: !661, file: !540, line: 329, baseType: !135, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !661, file: !540, line: 330, baseType: !135, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !661, file: !540, line: 332, baseType: !135, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !661, file: !540, line: 333, baseType: !135, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1TO", scope: !661, file: !540, line: 334, baseType: !135, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !661, file: !540, line: 335, baseType: !135, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !658, file: !540, line: 343, baseType: !683, size: 32)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !658, file: !540, line: 338, size: 32, elements: !684)
!684 = !{!685, !686, !687}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !683, file: !540, line: 339, baseType: !135, size: 2, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !683, file: !540, line: 340, baseType: !135, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW", scope: !683, file: !540, line: 341, baseType: !135, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !658, file: !540, line: 344, baseType: !135, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCTRL", scope: !541, file: !540, line: 778, baseType: !690, size: 64, offset: 160)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !691, size: 64, elements: !711)
!691 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !692)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_XOSCCTRL_Type", file: !540, line: 422, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !540, line: 402, size: 32, elements: !694)
!694 = !{!695, !710}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !693, file: !540, line: 420, baseType: !696, size: 32)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !693, file: !540, line: 403, size: 32, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !696, file: !540, line: 405, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !696, file: !540, line: 406, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !696, file: !540, line: 408, baseType: !135, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !696, file: !540, line: 409, baseType: !135, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "LOWBUFGAIN", scope: !696, file: !540, line: 410, baseType: !135, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "IPTAT", scope: !696, file: !540, line: 411, baseType: !135, size: 2, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "IMULT", scope: !696, file: !540, line: 412, baseType: !135, size: 4, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "ENALC", scope: !696, file: !540, line: 413, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEN", scope: !696, file: !540, line: 414, baseType: !135, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "SWBEN", scope: !696, file: !540, line: 415, baseType: !135, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !696, file: !540, line: 417, baseType: !135, size: 4, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "CFDPRESC", scope: !696, file: !540, line: 418, baseType: !135, size: 4, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !693, file: !540, line: 421, baseType: !135, size: 32)
!711 = !{!712}
!712 = !DISubrange(count: 2)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLA", scope: !541, file: !540, line: 779, baseType: !714, size: 8, offset: 224)
!714 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !715)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLA_Type", file: !540, line: 469, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !540, line: 460, size: 8, elements: !717)
!717 = !{!718, !724}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !716, file: !540, line: 467, baseType: !719, size: 8)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !716, file: !540, line: 461, size: 8, elements: !720)
!720 = !{!721, !722, !723}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !719, file: !540, line: 463, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !719, file: !540, line: 465, baseType: !117, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !719, file: !540, line: 466, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !716, file: !540, line: 468, baseType: !117, size: 8)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !541, file: !540, line: 780, baseType: !469, size: 24, offset: 232)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !541, file: !540, line: 781, baseType: !727, size: 8, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLB_Type", file: !540, line: 497, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !540, line: 485, size: 8, elements: !730)
!730 = !{!731, !742}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !729, file: !540, line: 495, baseType: !732, size: 8)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !729, file: !540, line: 486, size: 8, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !732, file: !540, line: 487, baseType: !117, size: 1, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !732, file: !540, line: 488, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !732, file: !540, line: 489, baseType: !117, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !732, file: !540, line: 490, baseType: !117, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !732, file: !540, line: 491, baseType: !117, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !732, file: !540, line: 492, baseType: !117, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !732, file: !540, line: 493, baseType: !117, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !732, file: !540, line: 494, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !729, file: !540, line: 496, baseType: !117, size: 8)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !541, file: !540, line: 782, baseType: !469, size: 24, offset: 264)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !541, file: !540, line: 783, baseType: !745, size: 32, offset: 288)
!745 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLVAL_Type", file: !540, line: 531, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !540, line: 523, size: 32, elements: !748)
!748 = !{!749, !755}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !747, file: !540, line: 529, baseType: !750, size: 32)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !747, file: !540, line: 524, size: 32, elements: !751)
!751 = !{!752, !753, !754}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !750, file: !540, line: 525, baseType: !135, size: 8, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !750, file: !540, line: 527, baseType: !135, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !750, file: !540, line: 528, baseType: !135, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !747, file: !540, line: 530, baseType: !135, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !541, file: !540, line: 784, baseType: !757, size: 32, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLMUL_Type", file: !540, line: 558, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !540, line: 550, size: 32, elements: !760)
!760 = !{!761, !767}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !759, file: !540, line: 556, baseType: !762, size: 32)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !759, file: !540, line: 551, size: 32, elements: !763)
!763 = !{!764, !765, !766}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !762, file: !540, line: 552, baseType: !135, size: 16, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !762, file: !540, line: 553, baseType: !135, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !762, file: !540, line: 555, baseType: !135, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !759, file: !540, line: 557, baseType: !135, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !541, file: !540, line: 785, baseType: !769, size: 8, offset: 352)
!769 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLSYNC_Type", file: !540, line: 587, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !540, line: 577, size: 8, elements: !772)
!772 = !{!773, !780}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !771, file: !540, line: 585, baseType: !774, size: 8)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !771, file: !540, line: 578, size: 8, elements: !775)
!775 = !{!776, !777, !778, !779}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !774, file: !540, line: 580, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !774, file: !540, line: 581, baseType: !117, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !774, file: !540, line: 582, baseType: !117, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !774, file: !540, line: 583, baseType: !117, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !771, file: !540, line: 586, baseType: !117, size: 8)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !541, file: !540, line: 786, baseType: !469, size: 24, offset: 360)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "Dpll", scope: !541, file: !540, line: 787, baseType: !783, size: 320, offset: 384)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 320, elements: !711)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "OscctrlDpll", file: !540, line: 766, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !540, line: 759, size: 160, elements: !786)
!786 = !{!787, !799, !800, !811, !828, !840}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !785, file: !540, line: 760, baseType: !788, size: 8)
!788 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLA_Type", file: !540, line: 614, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !540, line: 605, size: 8, elements: !791)
!791 = !{!792, !798}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !790, file: !540, line: 612, baseType: !793, size: 8)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !790, file: !540, line: 606, size: 8, elements: !794)
!794 = !{!795, !796, !797}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !793, file: !540, line: 608, baseType: !117, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !793, file: !540, line: 610, baseType: !117, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !793, file: !540, line: 611, baseType: !117, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !790, file: !540, line: 613, baseType: !117, size: 8)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !785, file: !540, line: 761, baseType: !469, size: 24, offset: 8)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !785, file: !540, line: 762, baseType: !801, size: 32, offset: 32)
!801 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLRATIO_Type", file: !540, line: 638, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !540, line: 630, size: 32, elements: !804)
!804 = !{!805, !810}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !803, file: !540, line: 636, baseType: !806, size: 32)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !803, file: !540, line: 631, size: 32, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !806, file: !540, line: 632, baseType: !135, size: 13, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !806, file: !540, line: 634, baseType: !135, size: 5, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !803, file: !540, line: 637, baseType: !135, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !785, file: !540, line: 763, baseType: !812, size: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLB_Type", file: !540, line: 667, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !540, line: 654, size: 32, elements: !815)
!815 = !{!816, !827}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !814, file: !540, line: 665, baseType: !817, size: 32)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !814, file: !540, line: 655, size: 32, elements: !818)
!818 = !{!819, !820, !821, !822, !823, !824, !825, !826}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !817, file: !540, line: 656, baseType: !135, size: 4, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !817, file: !540, line: 657, baseType: !135, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !817, file: !540, line: 658, baseType: !135, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !817, file: !540, line: 659, baseType: !135, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !817, file: !540, line: 660, baseType: !135, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "DCOFILTER", scope: !817, file: !540, line: 661, baseType: !135, size: 3, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "DCOEN", scope: !817, file: !540, line: 662, baseType: !135, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !817, file: !540, line: 663, baseType: !135, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !814, file: !540, line: 666, baseType: !135, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSYNCBUSY", scope: !785, file: !540, line: 764, baseType: !829, size: 32, offset: 96)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSYNCBUSY_Type", file: !540, line: 724, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !540, line: 716, size: 32, elements: !833)
!833 = !{!834, !839}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !832, file: !540, line: 722, baseType: !835, size: 32)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !832, file: !540, line: 717, size: 32, elements: !836)
!836 = !{!837, !838}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !835, file: !540, line: 719, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !835, file: !540, line: 720, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !832, file: !540, line: 723, baseType: !135, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !785, file: !540, line: 765, baseType: !841, size: 32, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !842)
!842 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSTATUS_Type", file: !540, line: 745, baseType: !844)
!844 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !540, line: 738, size: 32, elements: !845)
!845 = !{!846, !851}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !844, file: !540, line: 743, baseType: !847, size: 32)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !844, file: !540, line: 739, size: 32, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !847, file: !540, line: 740, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !847, file: !540, line: 741, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !844, file: !540, line: 744, baseType: !135, size: 32)
!852 = !{!314}
!853 = !DIFile(filename: "zephyr/soc/arm/atmel_sam0/common/soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!854 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !856, line: 51, size: 64, elements: !857)
!856 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!857 = !{!858, !877}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !855, file: !856, line: 60, baseType: !859, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!860 = !DISubroutineType(types: !861)
!861 = !{!123, !862}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !167, line: 378, size: 192, elements: !865)
!865 = !{!866, !867, !868, !869, !875, !876}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !864, file: !167, line: 380, baseType: !170, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !864, file: !167, line: 382, baseType: !13, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !864, file: !167, line: 384, baseType: !13, size: 32, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !864, file: !167, line: 386, baseType: !870, size: 32, offset: 96)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 32)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !167, line: 351, size: 16, elements: !872)
!872 = !{!873, !874}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !871, file: !167, line: 359, baseType: !117, size: 8)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !871, file: !167, line: 364, baseType: !181, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !864, file: !167, line: 388, baseType: !108, size: 32, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !864, file: !167, line: 396, baseType: !184, size: 32, offset: 160)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !855, file: !856, line: 65, baseType: !862, size: 32, offset: 32)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "log_const_log", scope: !880, file: !961, line: 25, type: !1199, isLocal: false, isDefinition: true)
!880 = distinct !DICompileUnit(language: DW_LANG_C99, file: !881, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !882, retainedTypes: !888, globals: !958, splitDebugInlining: false, nameTableKind: None)
!881 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/led_lp3943")
!882 = !{!883, !30, !37}
!883 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !884, line: 33, baseType: !32, size: 32, elements: !885)
!884 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!885 = !{!886, !887}
!886 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!887 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!888 = !{!249, !123, !108, !889, !124, !900, !117, !901, !135, !922, !22, !24, !949, !952, !954, !956}
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 32)
!890 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !891)
!891 = !{!892, !899}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !890, file: !111, line: 80, baseType: !893, size: 32)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !894)
!894 = !{!895, !896, !897, !898}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !893, file: !111, line: 47, baseType: !117, size: 8)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !893, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !893, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !893, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !890, file: !111, line: 82, baseType: !108, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !903)
!903 = !{!904, !920, !921}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !902, file: !31, line: 89, baseType: !905, size: 96)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !906)
!906 = !{!907, !918, !919}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !905, file: !31, line: 67, baseType: !908, size: 32)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !909)
!909 = !{!910, !911, !912, !913, !914, !915, !916, !917}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !908, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !908, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !908, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !908, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !908, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !908, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
