; ModuleID = 'build/actinius_icarus_bee_ns/lis2dh/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/lis2dh/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/lis2dh")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/lis2dh")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !28, line: 14, type: !64, isLocal: true, isDefinition: true)
!27 = distinct !DISubprogram(name: "fetch_and_display", scope: !28, file: !28, line: 12, type: !29, scopeLine: 13, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !59, retainedNodes: !290)
!28 = !DIFile(filename: "zephyr/samples/sensor/lis2dh/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!29 = !DISubroutineType(types: !30)
!30 = !{null, !31}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !34, line: 378, size: 192, elements: !35)
!34 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!35 = !{!36, !40, !41, !42, !51, !53}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !33, file: !34, line: 380, baseType: !37, size: 32)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !39)
!39 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !33, file: !34, line: 382, baseType: !13, size: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !33, file: !34, line: 384, baseType: !13, size: 32, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !33, file: !34, line: 386, baseType: !43, size: 32, offset: 96)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !34, line: 351, size: 16, elements: !45)
!45 = !{!46, !49}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !44, file: !34, line: 359, baseType: !47, size: 8)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !48)
!48 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !44, file: !34, line: 364, baseType: !50, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!50 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !33, file: !34, line: 388, baseType: !52, size: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !33, file: !34, line: 396, baseType: !54, size: 32, offset: 160)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !56)
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !34, line: 43, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !58)
!58 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!59 = distinct !DICompileUnit(language: DW_LANG_C99, file: !60, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !61, retainedTypes: !232, globals: !289, splitDebugInlining: false, nameTableKind: None)
!60 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/sensor/lis2dh/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/lis2dh")
!61 = !{!62, !133, !197, !217}
!62 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !63, line: 27, baseType: !64, size: 32, elements: !65)
!63 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!64 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132}
!66 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!67 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!68 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!69 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!70 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!71 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!72 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!73 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!74 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!75 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!76 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!77 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!78 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!79 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!80 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!81 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!82 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!115 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!116 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!117 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!118 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!119 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!120 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!121 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!122 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!123 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!124 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!125 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!126 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!127 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!128 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!129 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!130 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!131 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!132 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!133 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_channel", file: !134, line: 53, baseType: !64, size: 32, elements: !135)
!134 = !DIFile(filename: "zephyr/include/zephyr/drivers/sensor.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!135 = !{!136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196}
!136 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_X", value: 0)
!137 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_Y", value: 1)
!138 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_Z", value: 2)
!139 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_XYZ", value: 3)
!140 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_X", value: 4)
!141 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_Y", value: 5)
!142 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_Z", value: 6)
!143 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_XYZ", value: 7)
!144 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_X", value: 8)
!145 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_Y", value: 9)
!146 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_Z", value: 10)
!147 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_XYZ", value: 11)
!148 = !DIEnumerator(name: "SENSOR_CHAN_DIE_TEMP", value: 12)
!149 = !DIEnumerator(name: "SENSOR_CHAN_AMBIENT_TEMP", value: 13)
!150 = !DIEnumerator(name: "SENSOR_CHAN_PRESS", value: 14)
!151 = !DIEnumerator(name: "SENSOR_CHAN_PROX", value: 15)
!152 = !DIEnumerator(name: "SENSOR_CHAN_HUMIDITY", value: 16)
!153 = !DIEnumerator(name: "SENSOR_CHAN_LIGHT", value: 17)
!154 = !DIEnumerator(name: "SENSOR_CHAN_IR", value: 18)
!155 = !DIEnumerator(name: "SENSOR_CHAN_RED", value: 19)
!156 = !DIEnumerator(name: "SENSOR_CHAN_GREEN", value: 20)
!157 = !DIEnumerator(name: "SENSOR_CHAN_BLUE", value: 21)
!158 = !DIEnumerator(name: "SENSOR_CHAN_ALTITUDE", value: 22)
!159 = !DIEnumerator(name: "SENSOR_CHAN_PM_1_0", value: 23)
!160 = !DIEnumerator(name: "SENSOR_CHAN_PM_2_5", value: 24)
!161 = !DIEnumerator(name: "SENSOR_CHAN_PM_10", value: 25)
!162 = !DIEnumerator(name: "SENSOR_CHAN_DISTANCE", value: 26)
!163 = !DIEnumerator(name: "SENSOR_CHAN_CO2", value: 27)
!164 = !DIEnumerator(name: "SENSOR_CHAN_VOC", value: 28)
!165 = !DIEnumerator(name: "SENSOR_CHAN_GAS_RES", value: 29)
!166 = !DIEnumerator(name: "SENSOR_CHAN_VOLTAGE", value: 30)
!167 = !DIEnumerator(name: "SENSOR_CHAN_CURRENT", value: 31)
!168 = !DIEnumerator(name: "SENSOR_CHAN_POWER", value: 32)
!169 = !DIEnumerator(name: "SENSOR_CHAN_RESISTANCE", value: 33)
!170 = !DIEnumerator(name: "SENSOR_CHAN_ROTATION", value: 34)
!171 = !DIEnumerator(name: "SENSOR_CHAN_POS_DX", value: 35)
!172 = !DIEnumerator(name: "SENSOR_CHAN_POS_DY", value: 36)
!173 = !DIEnumerator(name: "SENSOR_CHAN_POS_DZ", value: 37)
!174 = !DIEnumerator(name: "SENSOR_CHAN_RPM", value: 38)
!175 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_VOLTAGE", value: 39)
!176 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_AVG_CURRENT", value: 40)
!177 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STDBY_CURRENT", value: 41)
!178 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_MAX_LOAD_CURRENT", value: 42)
!179 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TEMP", value: 43)
!180 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STATE_OF_CHARGE", value: 44)
!181 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_FULL_CHARGE_CAPACITY", value: 45)
!182 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_REMAINING_CHARGE_CAPACITY", value: 46)
!183 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_NOM_AVAIL_CAPACITY", value: 47)
!184 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_FULL_AVAIL_CAPACITY", value: 48)
!185 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_AVG_POWER", value: 49)
!186 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STATE_OF_HEALTH", value: 50)
!187 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TIME_TO_EMPTY", value: 51)
!188 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TIME_TO_FULL", value: 52)
!189 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_CYCLE_COUNT", value: 53)
!190 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIGN_VOLTAGE", value: 54)
!191 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIRED_VOLTAGE", value: 55)
!192 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIRED_CHARGING_CURRENT", value: 56)
!193 = !DIEnumerator(name: "SENSOR_CHAN_ALL", value: 57)
!194 = !DIEnumerator(name: "SENSOR_CHAN_COMMON_COUNT", value: 58)
!195 = !DIEnumerator(name: "SENSOR_CHAN_PRIV_START", value: 58)
!196 = !DIEnumerator(name: "SENSOR_CHAN_MAX", value: 32767)
!197 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_attribute", file: !134, line: 274, baseType: !64, size: 32, elements: !198)
!198 = !{!199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!199 = !DIEnumerator(name: "SENSOR_ATTR_SAMPLING_FREQUENCY", value: 0)
!200 = !DIEnumerator(name: "SENSOR_ATTR_LOWER_THRESH", value: 1)
!201 = !DIEnumerator(name: "SENSOR_ATTR_UPPER_THRESH", value: 2)
!202 = !DIEnumerator(name: "SENSOR_ATTR_SLOPE_TH", value: 3)
!203 = !DIEnumerator(name: "SENSOR_ATTR_SLOPE_DUR", value: 4)
!204 = !DIEnumerator(name: "SENSOR_ATTR_HYSTERESIS", value: 5)
!205 = !DIEnumerator(name: "SENSOR_ATTR_OVERSAMPLING", value: 6)
!206 = !DIEnumerator(name: "SENSOR_ATTR_FULL_SCALE", value: 7)
!207 = !DIEnumerator(name: "SENSOR_ATTR_OFFSET", value: 8)
!208 = !DIEnumerator(name: "SENSOR_ATTR_CALIB_TARGET", value: 9)
!209 = !DIEnumerator(name: "SENSOR_ATTR_CONFIGURATION", value: 10)
!210 = !DIEnumerator(name: "SENSOR_ATTR_CALIBRATION", value: 11)
!211 = !DIEnumerator(name: "SENSOR_ATTR_FEATURE_MASK", value: 12)
!212 = !DIEnumerator(name: "SENSOR_ATTR_ALERT", value: 13)
!213 = !DIEnumerator(name: "SENSOR_ATTR_FF_DUR", value: 14)
!214 = !DIEnumerator(name: "SENSOR_ATTR_COMMON_COUNT", value: 15)
!215 = !DIEnumerator(name: "SENSOR_ATTR_PRIV_START", value: 15)
!216 = !DIEnumerator(name: "SENSOR_ATTR_MAX", value: 32767)
!217 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_trigger_type", file: !134, line: 203, baseType: !64, size: 32, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231}
!219 = !DIEnumerator(name: "SENSOR_TRIG_TIMER", value: 0)
!220 = !DIEnumerator(name: "SENSOR_TRIG_DATA_READY", value: 1)
!221 = !DIEnumerator(name: "SENSOR_TRIG_DELTA", value: 2)
!222 = !DIEnumerator(name: "SENSOR_TRIG_NEAR_FAR", value: 3)
!223 = !DIEnumerator(name: "SENSOR_TRIG_THRESHOLD", value: 4)
!224 = !DIEnumerator(name: "SENSOR_TRIG_TAP", value: 5)
!225 = !DIEnumerator(name: "SENSOR_TRIG_DOUBLE_TAP", value: 6)
!226 = !DIEnumerator(name: "SENSOR_TRIG_FREEFALL", value: 7)
!227 = !DIEnumerator(name: "SENSOR_TRIG_MOTION", value: 8)
!228 = !DIEnumerator(name: "SENSOR_TRIG_STATIONARY", value: 9)
!229 = !DIEnumerator(name: "SENSOR_TRIG_COMMON_COUNT", value: 10)
!230 = !DIEnumerator(name: "SENSOR_TRIG_PRIV_START", value: 10)
!231 = !DIEnumerator(name: "SENSOR_TRIG_MAX", value: 32767)
!232 = !{!233, !52, !237, !238, !285, !286, !288}
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !234, line: 46, baseType: !235)
!234 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !236)
!236 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!237 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_driver_api", file: !134, line: 397, size: 160, elements: !241)
!241 = !{!242, !254, !260, !275, !280}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "attr_set", scope: !240, file: !134, line: 398, baseType: !243, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_attr_set_t", file: !134, line: 354, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DISubroutineType(types: !246)
!246 = !{!237, !31, !133, !197, !247}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_value", file: !134, line: 43, size: 64, elements: !250)
!250 = !{!251, !253}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !249, file: !134, line: 45, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !237)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !249, file: !134, line: 47, baseType: !252, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "attr_get", scope: !240, file: !134, line: 399, baseType: !255, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_attr_get_t", file: !134, line: 365, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DISubroutineType(types: !258)
!258 = !{!237, !31, !133, !197, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "trigger_set", scope: !240, file: !134, line: 400, baseType: !261, size: 32, offset: 64)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_trigger_set_t", file: !134, line: 376, baseType: !262)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DISubroutineType(types: !264)
!264 = !{!237, !31, !265, !271}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_trigger", file: !134, line: 264, size: 64, elements: !268)
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !267, file: !134, line: 266, baseType: !217, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "chan", scope: !267, file: !134, line: 268, baseType: !133, size: 32, offset: 32)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_trigger_handler_t", file: !134, line: 345, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 32)
!273 = !DISubroutineType(types: !274)
!274 = !{null, !31, !265}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fetch", scope: !240, file: !134, line: 401, baseType: !276, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_sample_fetch_t", file: !134, line: 385, baseType: !277)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DISubroutineType(types: !279)
!279 = !{!237, !31, !133}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "channel_get", scope: !240, file: !134, line: 402, baseType: !281, size: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_channel_get_t", file: !134, line: 393, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = !DISubroutineType(types: !284)
!284 = !{!237, !31, !133, !259}
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !287)
!287 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!288 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!289 = !{!25}
!290 = !{!291, !292, !296, !297, !298}
!291 = !DILocalVariable(name: "sensor", arg: 1, scope: !27, file: !28, line: 12, type: !31)
!292 = !DILocalVariable(name: "accel", scope: !27, file: !28, line: 15, type: !293)
!293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 192, elements: !294)
!294 = !{!295}
!295 = !DISubrange(count: 3)
!296 = !DILocalVariable(name: "temperature", scope: !27, file: !28, line: 16, type: !249)
!297 = !DILocalVariable(name: "overrun", scope: !27, file: !28, line: 17, type: !37)
!298 = !DILocalVariable(name: "rc", scope: !27, file: !28, line: 18, type: !237)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "_char_out", scope: !301, file: !306, line: 54, type: !307, isLocal: false, isDefinition: true)
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !304, globals: !305, splitDebugInlining: false, nameTableKind: None)
!302 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/lis2dh")
!303 = !{!62}
!304 = !{!52, !237}
!305 = !{!299}
!306 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!308 = !DISubroutineType(types: !309)
!309 = !{!237, !237}
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !312, file: !371, line: 65, type: !372, isLocal: true, isDefinition: true, align: 32)
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !314, globals: !364, splitDebugInlining: false, nameTableKind: None)
!313 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/lis2dh")
!314 = !{!52, !237, !315, !285, !326}
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !317, file: !316, line: 167, baseType: !325)
!316 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !316, file: !316, line: 134, type: !318, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !320)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !285}
!320 = !{!321, !322, !324}
!321 = !DILocalVariable(name: "time_us", arg: 1, scope: !317, file: !316, line: 134, type: !285)
!322 = !DILocalVariable(name: "delay_cycles", scope: !317, file: !316, line: 168, type: !323)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!324 = !DILocalVariable(name: "cycles", scope: !317, file: !316, line: 171, type: !285)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !328, line: 1928, baseType: !329)
!328 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 1909, size: 11360, elements: !330)
!330 = !{!331, !337, !338, !339, !340, !344, !345, !346, !347, !349, !350, !354, !355, !356, !357, !358, !362, !363}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !329, file: !328, line: 1910, baseType: !332, size: 8192)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 8192, elements: !335)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !285)
!335 = !{!336}
!336 = !DISubrange(count: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !329, file: !328, line: 1911, baseType: !333, size: 32, offset: 8192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !329, file: !328, line: 1912, baseType: !333, size: 32, offset: 8224)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !329, file: !328, line: 1913, baseType: !333, size: 32, offset: 8256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !329, file: !328, line: 1914, baseType: !341, size: 1984, offset: 8288)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 1984, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 62)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !329, file: !328, line: 1915, baseType: !334, size: 32, offset: 10272)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !329, file: !328, line: 1916, baseType: !333, size: 32, offset: 10304)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !329, file: !328, line: 1917, baseType: !334, size: 32, offset: 10336)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !329, file: !328, line: 1918, baseType: !348, size: 96, offset: 10368)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 96, elements: !294)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !329, file: !328, line: 1919, baseType: !334, size: 32, offset: 10464)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !329, file: !328, line: 1920, baseType: !351, size: 256, offset: 10496)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 256, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 8)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !329, file: !328, line: 1921, baseType: !334, size: 32, offset: 10752)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !329, file: !328, line: 1922, baseType: !333, size: 32, offset: 10784)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !329, file: !328, line: 1923, baseType: !334, size: 32, offset: 10816)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !329, file: !328, line: 1924, baseType: !334, size: 32, offset: 10848)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !329, file: !328, line: 1925, baseType: !359, size: 416, offset: 10880)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 416, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 13)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !329, file: !328, line: 1926, baseType: !334, size: 32, offset: 11296)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !329, file: !328, line: 1927, baseType: !334, size: 32, offset: 11328)
!364 = !{!310, !365}
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !317, file: !316, line: 161, type: !367, isLocal: true, isDefinition: true, align: 128)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 48, elements: !294)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !370)
!370 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!371 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !374, line: 51, size: 64, elements: !375)
!374 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!375 = !{!376, !383}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !373, file: !374, line: 60, baseType: !377, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = !DISubroutineType(types: !379)
!379 = !{!237, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !374, line: 48, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !373, file: !374, line: 65, baseType: !380, size: 32, offset: 32)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !386, file: !421, line: 27, type: !448, isLocal: true, isDefinition: true)
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !388, retainedTypes: !400, globals: !418, splitDebugInlining: false, nameTableKind: None)
!387 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/lis2dh")
!388 = !{!389, !62}
!389 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !390, line: 27, baseType: !64, size: 32, elements: !391)
!390 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399}
!392 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!393 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!394 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!395 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!396 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!397 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!398 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!399 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!400 = !{!52, !233, !237, !24, !401, !417, !285, !286}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 32)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !403, line: 54, size: 96, elements: !404)
!403 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!404 = !{!405, !412, !416}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !402, file: !403, line: 55, baseType: !406, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !407, line: 33, baseType: !408)
!407 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !407, line: 29, size: 32, elements: !409)
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !408, file: !407, line: 30, baseType: !411, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !402, file: !403, line: 60, baseType: !413, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !389}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !402, file: !403, line: 65, baseType: !413, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!418 = !{!384, !419, !425, !427, !438, !440}
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !386, file: !421, line: 44, type: !422, isLocal: true, isDefinition: true)
!421 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !423, line: 43, elements: !424)
!423 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!424 = !{}
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !386, file: !421, line: 49, type: !422, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !386, file: !421, line: 36, type: !429, isLocal: true, isDefinition: true)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 128, elements: !436)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !390, line: 114, size: 128, elements: !431)
!431 = !{!432, !433, !434, !435}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !430, file: !390, line: 115, baseType: !389, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !430, file: !390, line: 141, baseType: !47, size: 8, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !430, file: !390, line: 149, baseType: !285, size: 32, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !430, file: !390, line: 156, baseType: !285, size: 32, offset: 96)
!436 = !{!437}
!437 = !DISubrange(count: 1)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !386, file: !421, line: 40, type: !429, isLocal: true, isDefinition: true)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !386, file: !421, line: 28, type: !442, isLocal: true, isDefinition: true)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !407, line: 40, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !407, line: 35, size: 64, elements: !444)
!444 = !{!445, !447}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !443, file: !407, line: 36, baseType: !446, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !443, file: !407, line: 37, baseType: !446, size: 32, offset: 32)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !449, size: 32, elements: !436)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !450, line: 22, baseType: !451)
!450 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!451 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!452 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!453 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !456, file: !484, line: 50, type: !252, isLocal: true, isDefinition: true)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !388, retainedTypes: !458, globals: !481, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/lis2dh")
!458 = !{!57, !233, !459, !237, !52, !285, !286, !461, !417, !252, !472}
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !460, line: 214, baseType: !64)
!460 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !463, line: 45, size: 64, elements: !464)
!463 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!464 = !{!465, !471}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !462, file: !463, line: 46, baseType: !466, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !407, line: 33, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !407, line: 29, size: 32, elements: !468)
!468 = !{!469}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !467, file: !407, line: 30, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !462, file: !463, line: 48, baseType: !285, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !463, line: 38, size: 64, elements: !474)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !473, file: !463, line: 39, baseType: !466, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !473, file: !463, line: 41, baseType: !477, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !463, line: 35, baseType: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !252}
!481 = !{!482, !486, !494, !454, !496, !506}
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "latency_lock", scope: !456, file: !484, line: 44, type: !485, isLocal: true, isDefinition: true)
!484 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !423, line: 43, elements: !424)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !456, file: !484, line: 46, type: !488, isLocal: true, isDefinition: true)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !407, line: 40, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !407, line: 35, size: 64, elements: !490)
!490 = !{!491, !493}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !489, file: !407, line: 36, baseType: !492, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !489, file: !407, line: 37, baseType: !492, size: 32, offset: 32)
!494 = !DIGlobalVariableExpression(var: !495, expr: !DIExpression())
!495 = distinct !DIGlobalVariable(name: "latency_subs", scope: !456, file: !484, line: 52, type: !488, isLocal: true, isDefinition: true)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !456, file: !484, line: 39, type: !498, isLocal: true, isDefinition: true)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, elements: !504)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !484, line: 35, size: 96, elements: !500)
!500 = !{!501, !502, !503}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !499, file: !484, line: 36, baseType: !389, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !499, file: !484, line: 37, baseType: !47, size: 8, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !499, file: !484, line: 38, baseType: !449, size: 32, offset: 64)
!504 = !{!505}
!505 = !DISubrange(count: 0)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !456, file: !484, line: 48, type: !252, isLocal: true, isDefinition: true)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !510, file: !517, line: 47, type: !531, isLocal: true, isDefinition: true)
!510 = distinct !DICompileUnit(language: DW_LANG_C99, file: !511, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !512, retainedTypes: !513, globals: !514, splitDebugInlining: false, nameTableKind: None)
!511 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/lis2dh")
!512 = !{!389}
!513 = !{!459, !237}
!514 = !{!515, !508, !527}
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "cpus_states", scope: !510, file: !517, line: 50, type: !518, isLocal: true, isDefinition: true)
!517 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 32, elements: !436)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !390, line: 114, size: 128, elements: !522)
!522 = !{!523, !524, !525, !526}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !521, file: !390, line: 115, baseType: !389, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !521, file: !390, line: 141, baseType: !47, size: 8, offset: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !521, file: !390, line: 149, baseType: !285, size: 32, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !521, file: !390, line: 156, baseType: !285, size: 32, offset: 96)
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !510, file: !517, line: 55, type: !529, isLocal: true, isDefinition: true)
!529 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 8, elements: !436)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, elements: !504)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "static_regions", scope: !534, file: !541, line: 62, type: !673, isLocal: true, isDefinition: true)
!534 = distinct !DICompileUnit(language: DW_LANG_C99, file: !535, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !536, globals: !537, splitDebugInlining: false, nameTableKind: None)
!535 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/lis2dh")
!536 = !{!459, !237, !285, !52}
!537 = !{!538, !532}
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !540, file: !541, line: 198, type: !660, isLocal: true, isDefinition: true)
!540 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !541, file: !541, line: 175, type: !542, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !534, retainedNodes: !657)
!541 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!542 = !DISubroutineType(types: !543)
!543 = !{null, !544}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 32)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !546, line: 245, size: 1024, elements: !547)
!546 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!547 = !{!548, !613, !626, !627, !628, !629, !635, !652}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !545, file: !546, line: 247, baseType: !549, size: 384)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !546, line: 57, size: 384, elements: !550)
!550 = !{!551, !579, !587, !588, !589, !600, !601, !602}
!551 = !DIDerivedType(tag: DW_TAG_member, scope: !549, file: !546, line: 60, baseType: !552, size: 64)
!552 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !549, file: !546, line: 60, size: 64, elements: !553)
!553 = !{!554, !570}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !552, file: !546, line: 61, baseType: !555, size: 64)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !556, line: 49, baseType: !557)
!556 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !556, line: 37, size: 64, elements: !558)
!558 = !{!559, !565}
!559 = !DIDerivedType(tag: DW_TAG_member, scope: !557, file: !556, line: 38, baseType: !560, size: 32)
!560 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !557, file: !556, line: 38, size: 32, elements: !561)
!561 = !{!562, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !560, file: !556, line: 39, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !560, file: !556, line: 40, baseType: !563, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, scope: !557, file: !556, line: 42, baseType: !566, size: 32, offset: 32)
!566 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !557, file: !556, line: 42, size: 32, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !566, file: !556, line: 43, baseType: !563, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !566, file: !556, line: 44, baseType: !563, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !552, file: !546, line: 62, baseType: !571, size: 64)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !572, line: 49, size: 64, elements: !573)
!572 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!573 = !{!574}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !571, file: !572, line: 50, baseType: !575, size: 64)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 64, elements: !577)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 32)
!577 = !{!578}
!578 = !DISubrange(count: 2)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !549, file: !546, line: 68, baseType: !580, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !582, line: 233, baseType: !583)
!582 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !582, line: 231, size: 64, elements: !584)
!584 = !{!585}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !583, file: !582, line: 232, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !556, line: 48, baseType: !557)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !549, file: !546, line: 71, baseType: !47, size: 8, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !549, file: !546, line: 74, baseType: !47, size: 8, offset: 104)
!589 = !DIDerivedType(tag: DW_TAG_member, scope: !549, file: !546, line: 90, baseType: !590, size: 16, offset: 112)
!590 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !549, file: !546, line: 90, size: 16, elements: !591)
!591 = !{!592, !599}
!592 = !DIDerivedType(tag: DW_TAG_member, scope: !590, file: !546, line: 91, baseType: !593, size: 16)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !590, file: !546, line: 91, size: 16, elements: !594)
!594 = !{!595, !598}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !593, file: !546, line: 96, baseType: !596, size: 8)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !597)
!597 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !593, file: !546, line: 97, baseType: !47, size: 8, offset: 8)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !590, file: !546, line: 100, baseType: !369, size: 16)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !549, file: !546, line: 107, baseType: !285, size: 32, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !549, file: !546, line: 127, baseType: !52, size: 32, offset: 160)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !549, file: !546, line: 131, baseType: !603, size: 192, offset: 192)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !582, line: 244, size: 192, elements: !604)
!604 = !{!605, !606, !612}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !603, file: !582, line: 245, baseType: !555, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !603, file: !582, line: 246, baseType: !607, size: 32, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !582, line: 242, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !611}
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !603, file: !582, line: 249, baseType: !235, size: 64, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !545, file: !546, line: 250, baseType: !614, size: 288, offset: 384)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !615, line: 25, size: 288, elements: !616)
!615 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !614, file: !615, line: 26, baseType: !285, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !614, file: !615, line: 27, baseType: !285, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !614, file: !615, line: 28, baseType: !285, size: 32, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !614, file: !615, line: 29, baseType: !285, size: 32, offset: 96)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !614, file: !615, line: 30, baseType: !285, size: 32, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !614, file: !615, line: 31, baseType: !285, size: 32, offset: 160)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !614, file: !615, line: 32, baseType: !285, size: 32, offset: 192)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !614, file: !615, line: 33, baseType: !285, size: 32, offset: 224)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !614, file: !615, line: 34, baseType: !285, size: 32, offset: 256)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !545, file: !546, line: 253, baseType: !52, size: 32, offset: 672)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !545, file: !546, line: 256, baseType: !581, size: 64, offset: 704)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !545, file: !546, line: 294, baseType: !237, size: 32, offset: 768)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !545, file: !546, line: 300, baseType: !630, size: 96, offset: 800)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !546, line: 149, size: 96, elements: !631)
!631 = !{!632, !633, !634}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !630, file: !546, line: 153, baseType: !22, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !630, file: !546, line: 162, baseType: !459, size: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !630, file: !546, line: 168, baseType: !459, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !545, file: !546, line: 325, baseType: !636, size: 32, offset: 896)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 32)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !638, line: 5073, size: 160, elements: !639)
!638 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!639 = !{!640, !649, !650}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !637, file: !638, line: 5074, baseType: !641, size: 96)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !642, line: 56, size: 96, elements: !643)
!642 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!643 = !{!644, !647, !648}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !641, file: !642, line: 57, baseType: !645, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 32)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !642, line: 57, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !641, file: !642, line: 58, baseType: !52, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !641, file: !642, line: 59, baseType: !459, size: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !637, file: !638, line: 5075, baseType: !581, size: 64, offset: 96)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !637, file: !638, line: 5076, baseType: !651, offset: 160)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !423, line: 43, elements: !424)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !545, file: !546, line: 343, baseType: !653, size: 64, offset: 928)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !615, line: 60, size: 64, elements: !654)
!654 = !{!655, !656}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !653, file: !615, line: 63, baseType: !285, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !653, file: !615, line: 66, baseType: !285, size: 32, offset: 32)
!657 = !{!658, !659}
!658 = !DILocalVariable(name: "thread", arg: 1, scope: !540, file: !541, line: 175, type: !544)
!659 = !DILocalVariable(name: "region_num", scope: !540, file: !541, line: 200, type: !47)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, elements: !504)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !662, line: 52, size: 96, elements: !663)
!662 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!663 = !{!664, !665, !666}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !661, file: !662, line: 53, baseType: !22, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !661, file: !662, line: 54, baseType: !459, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !661, file: !662, line: 55, baseType: !667, size: 32, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !668, line: 304, baseType: !669)
!668 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !668, line: 301, size: 32, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !669, file: !668, line: 302, baseType: !369, size: 16)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !669, file: !668, line: 303, baseType: !369, size: 16, offset: 16)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 96, elements: !436)
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !677, file: !731, line: 39, type: !47, isLocal: true, isDefinition: true)
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !678, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !679, globals: !722, splitDebugInlining: false, nameTableKind: None)
!678 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/lis2dh")
!679 = !{!680, !52, !237, !708}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !682, line: 1495, baseType: !683)
!682 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !682, line: 1474, size: 448, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !698}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !683, file: !682, line: 1476, baseType: !333, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !683, file: !682, line: 1477, baseType: !334, size: 32, offset: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !683, file: !682, line: 1478, baseType: !334, size: 32, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !683, file: !682, line: 1479, baseType: !334, size: 32, offset: 96)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !683, file: !682, line: 1480, baseType: !334, size: 32, offset: 128)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !683, file: !682, line: 1481, baseType: !334, size: 32, offset: 160)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !683, file: !682, line: 1482, baseType: !334, size: 32, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !683, file: !682, line: 1483, baseType: !334, size: 32, offset: 224)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !683, file: !682, line: 1484, baseType: !334, size: 32, offset: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !683, file: !682, line: 1485, baseType: !334, size: 32, offset: 288)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !683, file: !682, line: 1486, baseType: !334, size: 32, offset: 320)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !683, file: !682, line: 1487, baseType: !697, size: 32, offset: 352)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 32, elements: !436)
!698 = !DIDerivedType(tag: DW_TAG_member, scope: !683, file: !682, line: 1488, baseType: !699, size: 64, offset: 384)
!699 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !683, file: !682, line: 1488, size: 64, elements: !700)
!700 = !{!701, !703}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !699, file: !682, line: 1489, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 64, elements: !577)
!703 = !DIDerivedType(tag: DW_TAG_member, scope: !699, file: !682, line: 1490, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !699, file: !682, line: 1490, size: 64, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !704, file: !682, line: 1491, baseType: !334, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !704, file: !682, line: 1492, baseType: !334, size: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !711, line: 27, size: 128, elements: !712)
!711 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!712 = !{!713, !714, !715}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !710, file: !711, line: 29, baseType: !285, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !710, file: !711, line: 31, baseType: !37, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !710, file: !711, line: 37, baseType: !716, size: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !668, line: 298, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !668, line: 289, size: 64, elements: !718)
!718 = !{!719, !720, !721}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !717, file: !668, line: 291, baseType: !47, size: 5, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !717, file: !668, line: 293, baseType: !47, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !717, file: !668, line: 295, baseType: !285, size: 32, offset: 32)
!722 = !{!675, !723}
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !677, file: !725, line: 31, type: !726, isLocal: true, isDefinition: true)
!725 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, size: 160, elements: !436)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !725, line: 21, size: 160, elements: !728)
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !727, file: !725, line: 22, baseType: !237, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !727, file: !725, line: 23, baseType: !710, size: 128, offset: 32)
!731 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !734, file: !741, line: 21, type: !307, isLocal: true, isDefinition: true)
!734 = distinct !DICompileUnit(language: DW_LANG_C99, file: !735, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !736, globals: !740, splitDebugInlining: false, nameTableKind: None)
!735 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/lis2dh")
!736 = !{!737, !237, !52}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !739, line: 22, baseType: !237)
!739 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!740 = !{!732}
!741 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !744, file: !749, line: 13, type: !768, isLocal: true, isDefinition: true)
!744 = distinct !DICompileUnit(language: DW_LANG_C99, file: !745, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !746, splitDebugInlining: false, nameTableKind: None)
!745 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/lis2dh")
!746 = !{!747, !742}
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "mpu_config", scope: !744, file: !749, line: 37, type: !750, isLocal: false, isDefinition: true)
!749 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!750 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !711, line: 41, size: 64, elements: !752)
!752 = !{!753, !754}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !751, file: !711, line: 43, baseType: !285, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !751, file: !711, line: 45, baseType: !755, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !757)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !711, line: 27, size: 128, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !757, file: !711, line: 29, baseType: !285, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !757, file: !711, line: 31, baseType: !37, size: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !757, file: !711, line: 37, baseType: !762, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !668, line: 298, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !668, line: 289, size: 64, elements: !764)
!764 = !{!765, !766, !767}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !763, file: !668, line: 291, baseType: !47, size: 5, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !763, file: !668, line: 293, baseType: !47, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !763, file: !668, line: 295, baseType: !285, size: 32, offset: 32)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !756, size: 256, elements: !577)
!769 = !DIGlobalVariableExpression(var: !770, expr: !DIExpression())
!770 = distinct !DIGlobalVariable(name: "__init_board_actinius_icarus_bee_init", scope: !771, file: !867, line: 39, type: !868, isLocal: true, isDefinition: true, align: 32)
!771 = distinct !DICompileUnit(language: DW_LANG_C99, file: !772, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !773, retainedTypes: !785, globals: !866, splitDebugInlining: false, nameTableKind: None)
!772 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/actinius_icarus_bee/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/lis2dh")
!773 = !{!774, !780}
!774 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !775, line: 506, baseType: !64, size: 32, elements: !776)
!775 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!776 = !{!777, !778, !779}
!777 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!778 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!779 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!780 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !775, line: 512, baseType: !64, size: 32, elements: !781)
!781 = !{!782, !783, !784}
!782 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!783 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!784 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!785 = !{!786, !855, !860, !821, !780, !774, !865, !52}
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !788)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !775, line: 523, size: 288, elements: !789)
!789 = !{!790, !811, !817, !822, !826, !827, !828, !832, !851}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !788, file: !775, line: 524, baseType: !791, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = !DISubroutineType(types: !793)
!793 = !{!237, !794, !809, !810}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !34, line: 378, size: 192, elements: !797)
!797 = !{!798, !799, !800, !801, !807, !808}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !796, file: !34, line: 380, baseType: !37, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !796, file: !34, line: 382, baseType: !13, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !796, file: !34, line: 384, baseType: !13, size: 32, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !796, file: !34, line: 386, baseType: !802, size: 32, offset: 96)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !34, line: 351, size: 16, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !803, file: !34, line: 359, baseType: !47, size: 8)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !803, file: !34, line: 364, baseType: !50, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !796, file: !34, line: 388, baseType: !52, size: 32, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !796, file: !34, line: 396, baseType: !54, size: 32, offset: 160)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !775, line: 237, baseType: !47)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !775, line: 257, baseType: !285)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !788, file: !775, line: 530, baseType: !812, size: 32, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = !DISubroutineType(types: !814)
!814 = !{!237, !794, !815}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !775, line: 229, baseType: !285)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !788, file: !775, line: 532, baseType: !818, size: 32, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DISubroutineType(types: !820)
!820 = !{!237, !794, !821, !816}
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !775, line: 216, baseType: !285)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !788, file: !775, line: 535, baseType: !823, size: 32, offset: 96)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DISubroutineType(types: !825)
!825 = !{!237, !794, !821}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !788, file: !775, line: 537, baseType: !823, size: 32, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !788, file: !775, line: 539, baseType: !823, size: 32, offset: 160)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !788, file: !775, line: 541, baseType: !829, size: 32, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32)
!830 = !DISubroutineType(types: !831)
!831 = !{!237, !794, !809, !774, !780}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !788, file: !775, line: 544, baseType: !833, size: 32, offset: 224)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 32)
!834 = !DISubroutineType(types: !835)
!835 = !{!237, !794, !836, !50}
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !775, line: 478, size: 96, elements: !838)
!838 = !{!839, !845, !850}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !837, file: !775, line: 482, baseType: !840, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !407, line: 33, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !407, line: 29, size: 32, elements: !842)
!842 = !{!843}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !841, file: !407, line: 30, baseType: !844, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !837, file: !775, line: 485, baseType: !846, size: 32, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !775, line: 464, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !794, !836, !821}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !837, file: !775, line: 493, baseType: !821, size: 32, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !788, file: !775, line: 547, baseType: !852, size: 32, offset: 256)
!852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 32)
!853 = !DISubroutineType(types: !854)
!854 = !{!285, !794}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !775, line: 428, size: 32, elements: !858)
!858 = !{!859}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !857, file: !775, line: 434, baseType: !821, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !775, line: 441, size: 32, elements: !863)
!863 = !{!864}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !862, file: !775, line: 447, baseType: !821, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!866 = !{!769}
!867 = !DIFile(filename: "zephyr/boards/arm/actinius_icarus_bee/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!868 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !374, line: 51, size: 64, elements: !870)
!870 = !{!871, !875}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !869, file: !374, line: 60, baseType: !872, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!873 = !DISubroutineType(types: !874)
!874 = !{!237, !794}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !869, file: !374, line: 65, baseType: !794, size: 32, offset: 32)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "__device_dts_ord_48", scope: !878, file: !1082, line: 733, type: !1185, isLocal: false, isDefinition: true, align: 32)
!878 = distinct !DICompileUnit(language: DW_LANG_C99, file: !879, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !880, retainedTypes: !998, globals: !1078, splitDebugInlining: false, nameTableKind: None)
!879 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/lis2dh")
!880 = !{!881, !887, !62, !892, !897, !901, !905, !909, !915, !919, !963, !970, !989}
!881 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !882, line: 23, baseType: !64, size: 32, elements: !883)
!882 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!883 = !{!884, !885, !886}
!884 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!885 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!886 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !882, line: 48, baseType: !64, size: 32, elements: !888)
!888 = !{!889, !890, !891}
!889 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!890 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!891 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!892 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !893, line: 167, baseType: !64, size: 32, elements: !894)
!893 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!894 = !{!895, !896}
!895 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!896 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !893, line: 107, baseType: !64, size: 32, elements: !898)
!898 = !{!899, !900}
!899 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!900 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!901 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !893, line: 208, baseType: !64, size: 32, elements: !902)
!902 = !{!903, !904}
!903 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!904 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !893, line: 261, baseType: !64, size: 32, elements: !906)
!906 = !{!907, !908}
!907 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!908 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!909 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !893, line: 237, baseType: !64, size: 32, elements: !910)
!910 = !{!911, !912, !913, !914}
!911 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!912 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!913 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!914 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!915 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !893, line: 152, baseType: !64, size: 32, elements: !916)
!916 = !{!917, !918}
!917 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!918 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!919 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !328, line: 71, baseType: !237, size: 32, elements: !920)
!920 = !{!921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962}
!921 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!922 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!923 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!924 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!925 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!926 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!927 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!928 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!929 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!930 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!931 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!932 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!933 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!934 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!935 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!936 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!937 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!938 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!939 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!940 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!941 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!942 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!943 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!944 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!945 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!946 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!947 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!948 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!949 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!950 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!951 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!952 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!953 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!954 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!955 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!956 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!957 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!958 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!959 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!960 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!961 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!962 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!963 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !964, line: 44, baseType: !64, size: 32, elements: !965)
!964 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!965 = !{!966, !967, !968, !969}
!966 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!967 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!968 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!969 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!970 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !971, line: 54, baseType: !64, size: 32, elements: !972)
!971 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!972 = !{!973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988}
!973 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!974 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!975 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!976 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!977 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!978 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!979 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!980 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!981 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!982 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!983 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!984 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!985 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!986 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!987 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!988 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!989 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !990, line: 53, baseType: !64, size: 32, elements: !991)
!990 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!991 = !{!992, !993, !994, !995, !996, !997}
!992 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!993 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!994 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!995 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!996 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!997 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!998 = !{!881, !52, !237, !999, !1041, !1042, !1043, !1044, !233, !285, !286, !50, !1045, !1046, !252, !1047, !1077, !459}
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !328, line: 923, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 883, size: 10464, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006, !1007, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1022, !1023, !1024, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !1001, file: !328, line: 884, baseType: !334, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !1001, file: !328, line: 885, baseType: !334, size: 32, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !1001, file: !328, line: 886, baseType: !334, size: 32, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !1001, file: !328, line: 887, baseType: !334, size: 32, offset: 96)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !1001, file: !328, line: 888, baseType: !1008, size: 896, offset: 128)
!1008 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 896, elements: !1009)
!1009 = !{!1010}
!1010 = !DISubrange(count: 28)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !1001, file: !328, line: 889, baseType: !334, size: 32, offset: 1024)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !1001, file: !328, line: 890, baseType: !334, size: 32, offset: 1056)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !1001, file: !328, line: 891, baseType: !334, size: 32, offset: 1088)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !1001, file: !328, line: 892, baseType: !334, size: 32, offset: 1120)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !1001, file: !328, line: 893, baseType: !1008, size: 896, offset: 1152)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !1001, file: !328, line: 894, baseType: !334, size: 32, offset: 2048)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !1001, file: !328, line: 895, baseType: !334, size: 32, offset: 2080)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1001, file: !328, line: 896, baseType: !1019, size: 960, offset: 2112)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 960, elements: !1020)
!1020 = !{!1021}
!1021 = !DISubrange(count: 30)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !1001, file: !328, line: 897, baseType: !334, size: 32, offset: 3072)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !1001, file: !328, line: 898, baseType: !334, size: 32, offset: 3104)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1001, file: !328, line: 899, baseType: !1025, size: 3008, offset: 3136)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 3008, elements: !1026)
!1026 = !{!1027}
!1027 = !DISubrange(count: 94)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !1001, file: !328, line: 900, baseType: !334, size: 32, offset: 6144)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !1001, file: !328, line: 901, baseType: !334, size: 32, offset: 6176)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !1001, file: !328, line: 902, baseType: !334, size: 32, offset: 6208)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !1001, file: !328, line: 903, baseType: !333, size: 32, offset: 6240)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1001, file: !328, line: 904, baseType: !341, size: 1984, offset: 6272)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !1001, file: !328, line: 905, baseType: !333, size: 32, offset: 8256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !1001, file: !328, line: 907, baseType: !333, size: 32, offset: 8288)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !1001, file: !328, line: 910, baseType: !333, size: 32, offset: 8320)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !1001, file: !328, line: 911, baseType: !333, size: 32, offset: 8352)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !1001, file: !328, line: 913, baseType: !333, size: 32, offset: 8384)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !1001, file: !328, line: 917, baseType: !333, size: 32, offset: 8416)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !1001, file: !328, line: 919, baseType: !341, size: 1984, offset: 8448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !1001, file: !328, line: 920, baseType: !334, size: 32, offset: 10432)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !893, line: 146, baseType: !897)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !893, line: 164, baseType: !915)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 32)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !682, line: 485, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !682, line: 468, size: 28704, elements: !1050)
!1050 = !{!1051, !1055, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1072, !1076}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !1049, file: !682, line: 470, baseType: !1052, size: 512)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 512, elements: !1053)
!1053 = !{!1054}
!1054 = !DISubrange(count: 16)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1049, file: !682, line: 471, baseType: !1056, size: 512, offset: 512)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 512, elements: !1053)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !1049, file: !682, line: 472, baseType: !1052, size: 512, offset: 1024)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !1049, file: !682, line: 473, baseType: !1056, size: 512, offset: 1536)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !1049, file: !682, line: 474, baseType: !1052, size: 512, offset: 2048)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1049, file: !682, line: 475, baseType: !1056, size: 512, offset: 2560)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !1049, file: !682, line: 476, baseType: !1052, size: 512, offset: 3072)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1049, file: !682, line: 477, baseType: !1056, size: 512, offset: 3584)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !1049, file: !682, line: 478, baseType: !1052, size: 512, offset: 4096)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1049, file: !682, line: 479, baseType: !1056, size: 512, offset: 4608)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !1049, file: !682, line: 480, baseType: !1052, size: 512, offset: 5120)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !1049, file: !682, line: 481, baseType: !1056, size: 512, offset: 5632)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !1049, file: !682, line: 482, baseType: !1068, size: 3968, offset: 6144)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1069, size: 3968, elements: !1070)
!1069 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !47)
!1070 = !{!1071}
!1071 = !DISubrange(count: 496)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !1049, file: !682, line: 483, baseType: !1073, size: 18560, offset: 10112)
!1073 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 18560, elements: !1074)
!1074 = !{!1075}
!1075 = !DISubrange(count: 580)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !1049, file: !682, line: 484, baseType: !334, size: 32, offset: 28672)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !964, line: 56, baseType: !52)
!1078 = !{!1079, !1129, !1170, !876, !1175, !1200, !1202, !1219, !1221, !1231, !1234, !1249, !1287, !1301}
!1079 = !DIGlobalVariableExpression(var: !1080, expr: !DIExpression())
!1080 = distinct !DIGlobalVariable(name: "on", scope: !1081, file: !1082, line: 549, type: !449, isLocal: true, isDefinition: true)
!1081 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !1082, file: !1082, line: 547, type: !1083, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !878, retainedNodes: !1085)
