; ModuleID = 'build/96b_wistrio/simple/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.k_condvar = type { %struct._wait_q_t }
%struct.z_thread_stack_element = type { i8 }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "mutex", scope: !27, file: !116, line: 18, type: !262, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/condition_variables/simple/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108, !109, !110, !111}
!102 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !102)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!25, !114, !141, !152, !260}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "condvar", scope: !27, file: !116, line: 19, type: !117, isLocal: false, isDefinition: true, align: 32)
!116 = !DIFile(filename: "zephyr/samples/kernel/condition_variables/simple/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !118, line: 2828, size: 64, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !117, file: !118, line: 2829, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !123, file: !122, line: 232, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !129)
!129 = !{!130, !136}
!130 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 38, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 38, size: 32, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !127, line: 39, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !127, line: 40, baseType: !134, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 42, baseType: !137, size: 32, offset: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 42, size: 32, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !137, file: !127, line: 43, baseType: !134, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !127, line: 44, baseType: !134, size: 32)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "tstacks", scope: !27, file: !116, line: 14, type: !143, isLocal: false, isDefinition: true, align: 512)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 174080, elements: !149)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !145, line: 47, size: 8, elements: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !144, file: !145, line: 48, baseType: !148, size: 8)
!148 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!149 = !{!150, !151}
!150 = !DISubrange(count: 20)
!151 = !DISubrange(count: 1088)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "t", scope: !27, file: !116, line: 16, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 25600, elements: !259)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !156, line: 245, size: 1280, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{!158, !207, !220, !221, !222, !226, !227, !235, !254}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !155, file: !156, line: 247, baseType: !159, size: 384)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !156, line: 57, size: 384, elements: !160)
!160 = !{!161, !175, !177, !180, !181, !194, !195, !196}
!161 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 60, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 60, size: 64, elements: !163)
!163 = !{!164, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !162, file: !156, line: 61, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !162, file: !156, line: 62, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 49, size: 64, elements: !169)
!168 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !167, file: !168, line: 50, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!173 = !{!174}
!174 = !DISubrange(count: 2)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !159, file: !156, line: 68, baseType: !176, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !159, file: !156, line: 71, baseType: !178, size: 8, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !179)
!179 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !159, file: !156, line: 74, baseType: !178, size: 8, offset: 104)
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 90, baseType: !182, size: 16, offset: 112)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 90, size: 16, elements: !183)
!183 = !{!184, !191}
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !182, file: !156, line: 91, baseType: !185, size: 16)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !182, file: !156, line: 91, size: 16, elements: !186)
!186 = !{!187, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !185, file: !156, line: 96, baseType: !188, size: 8)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !189)
!189 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !185, file: !156, line: 97, baseType: !178, size: 8, offset: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !182, file: !156, line: 100, baseType: !192, size: 16)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !193)
!193 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !159, file: !156, line: 107, baseType: !110, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !159, file: !156, line: 127, baseType: !107, size: 32, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !159, file: !156, line: 131, baseType: !197, size: 192, offset: 192)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !198)
!198 = !{!199, !200, !206}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !197, file: !122, line: 245, baseType: !165, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !197, file: !122, line: 246, baseType: !201, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !197, file: !122, line: 249, baseType: !105, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !155, file: !156, line: 250, baseType: !208, size: 288, offset: 384)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !209, line: 25, size: 288, elements: !210)
!209 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !208, file: !209, line: 26, baseType: !110, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !208, file: !209, line: 27, baseType: !110, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !208, file: !209, line: 28, baseType: !110, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !208, file: !209, line: 29, baseType: !110, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !208, file: !209, line: 30, baseType: !110, size: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !208, file: !209, line: 31, baseType: !110, size: 32, offset: 160)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !208, file: !209, line: 32, baseType: !110, size: 32, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !208, file: !209, line: 33, baseType: !110, size: 32, offset: 224)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !208, file: !209, line: 34, baseType: !110, size: 32, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !155, file: !156, line: 253, baseType: !107, size: 32, offset: 672)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !155, file: !156, line: 256, baseType: !121, size: 64, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !155, file: !156, line: 279, baseType: !223, size: 256, offset: 768)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 256, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !155, file: !156, line: 294, baseType: !109, size: 32, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !155, file: !156, line: 300, baseType: !228, size: 96, offset: 1056)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !156, line: 149, size: 96, elements: !229)
!229 = !{!230, !231, !234}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !228, file: !156, line: 153, baseType: !22, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !228, file: !156, line: 162, baseType: !232, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !233, line: 214, baseType: !32)
!233 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!234 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !228, file: !156, line: 168, baseType: !232, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !155, file: !156, line: 325, baseType: !236, size: 32, offset: 1152)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 192, elements: !238)
!238 = !{!239, !248, !249}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !237, file: !118, line: 5074, baseType: !240, size: 96)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !241, line: 56, size: 96, elements: !242)
!241 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!242 = !{!243, !246, !247}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !240, file: !241, line: 57, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !241, line: 57, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !240, file: !241, line: 58, baseType: !107, size: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !240, file: !241, line: 59, baseType: !232, size: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !237, file: !118, line: 5075, baseType: !121, size: 64, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !237, file: !118, line: 5076, baseType: !250, size: 32, offset: 160)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !251, line: 43, size: 32, elements: !252)
!251 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !250, file: !251, line: 52, baseType: !22, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !155, file: !156, line: 343, baseType: !255, size: 64, offset: 1184)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !209, line: 60, size: 64, elements: !256)
!256 = !{!257, !258}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !255, file: !209, line: 63, baseType: !110, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !255, file: !209, line: 66, baseType: !110, size: 32, offset: 32)
!259 = !{!150}
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "done", scope: !27, file: !116, line: 21, type: !109, isLocal: true, isDefinition: true)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !118, line: 2720, size: 160, elements: !263)
!263 = !{!264, !265, !267, !268}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !262, file: !118, line: 2722, baseType: !121, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !262, file: !118, line: 2724, baseType: !266, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !262, file: !118, line: 2727, baseType: !110, size: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !262, file: !118, line: 2730, baseType: !109, size: 32, offset: 128)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !271, file: !288, line: 18, type: !289, isLocal: false, isDefinition: true)
!271 = distinct !DICompileUnit(language: DW_LANG_C99, file: !272, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !273, globals: !287, splitDebugInlining: false, nameTableKind: None)
!272 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple")
!273 = !{!22, !107, !24, !274, !276, !278, !232, !109, !281, !282, !283, !284, !285, !286, !192, !279}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!287 = !{!269}
!288 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !291, line: 16, size: 64, elements: !292)
!291 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 17, baseType: !279, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !290, file: !291, line: 18, baseType: !178, size: 8, offset: 32)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "_char_out", scope: !297, file: !301, line: 54, type: !302, isLocal: false, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !299, globals: !300, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple")
!299 = !{!107, !109}
!300 = !{!295}
!301 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = !DISubroutineType(types: !304)
!304 = !{!109, !109}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "__init_stm32l1_init", scope: !307, file: !337, line: 60, type: !338, isLocal: true, isDefinition: true, align: 32)
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !309, globals: !336, splitDebugInlining: false, nameTableKind: None)
!308 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple")
!309 = !{!310, !330}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !312, line: 386, baseType: !313)
!312 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l151xba.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !312, line: 370, size: 448, elements: !314)
!314 = !{!315, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !313, file: !312, line: 372, baseType: !316, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !313, file: !312, line: 373, baseType: !316, size: 32, offset: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !313, file: !312, line: 374, baseType: !316, size: 32, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !313, file: !312, line: 375, baseType: !316, size: 32, offset: 96)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !313, file: !312, line: 376, baseType: !316, size: 32, offset: 128)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !313, file: !312, line: 377, baseType: !316, size: 32, offset: 160)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !313, file: !312, line: 378, baseType: !316, size: 32, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !313, file: !312, line: 379, baseType: !316, size: 32, offset: 224)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !313, file: !312, line: 380, baseType: !316, size: 32, offset: 256)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !313, file: !312, line: 381, baseType: !316, size: 32, offset: 288)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !313, file: !312, line: 382, baseType: !316, size: 32, offset: 320)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !313, file: !312, line: 383, baseType: !316, size: 32, offset: 352)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !313, file: !312, line: 384, baseType: !316, size: 32, offset: 384)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !313, file: !312, line: 385, baseType: !316, size: 32, offset: 416)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !312, line: 364, baseType: !332)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !312, line: 360, size: 64, elements: !333)
!333 = !{!334, !335}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !332, file: !312, line: 362, baseType: !316, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !332, file: !312, line: 363, baseType: !316, size: 32, offset: 32)
!336 = !{!305}
!337 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !340, line: 51, size: 64, elements: !341)
!340 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!341 = !{!342, !368}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !339, file: !340, line: 60, baseType: !343, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 32)
!344 = !DISubroutineType(types: !345)
!345 = !{!109, !346}
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !349, line: 378, size: 192, elements: !350)
!349 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!350 = !{!351, !352, !353, !354, !361, !362}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !348, file: !349, line: 380, baseType: !279, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !348, file: !349, line: 382, baseType: !13, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !348, file: !349, line: 384, baseType: !13, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !348, file: !349, line: 386, baseType: !355, size: 32, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 32)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !349, line: 351, size: 16, elements: !357)
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !356, file: !349, line: 359, baseType: !178, size: 8)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !356, file: !349, line: 364, baseType: !360, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!360 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !348, file: !349, line: 388, baseType: !107, size: 32, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !348, file: !349, line: 396, baseType: !363, size: 32, offset: 160)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !349, line: 43, baseType: !366)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !367)
!367 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !339, file: !340, line: 65, baseType: !346, size: 32, offset: 32)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !371, file: !374, line: 71, type: !375, isLocal: true, isDefinition: true, align: 32)
!371 = distinct !DICompileUnit(language: DW_LANG_C99, file: !372, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !373, splitDebugInlining: false, nameTableKind: None)
!372 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple")
!373 = !{!369}
!374 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !376)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !340, line: 51, size: 64, elements: !377)
!377 = !{!378, !397}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !376, file: !340, line: 60, baseType: !379, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 32)
!380 = !DISubroutineType(types: !381)
!381 = !{!109, !382}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !384)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !349, line: 378, size: 192, elements: !385)
!385 = !{!386, !387, !388, !389, !395, !396}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !384, file: !349, line: 380, baseType: !279, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !384, file: !349, line: 382, baseType: !13, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !384, file: !349, line: 384, baseType: !13, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !384, file: !349, line: 386, baseType: !390, size: 32, offset: 96)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !349, line: 351, size: 16, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !391, file: !349, line: 359, baseType: !178, size: 8)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !391, file: !349, line: 364, baseType: !360, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !384, file: !349, line: 388, baseType: !107, size: 32, offset: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !384, file: !349, line: 396, baseType: !363, size: 32, offset: 160)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !376, file: !340, line: 65, baseType: !382, size: 32, offset: 32)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !400, file: !407, line: 17, type: !536, isLocal: false, isDefinition: true)
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !402, globals: !403, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple")
!402 = !{!232, !109, !110, !107}
!403 = !{!398, !404, !532}
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !406, file: !407, line: 198, type: !518, isLocal: true, isDefinition: true)
!406 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !407, file: !407, line: 175, type: !408, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !400, retainedNodes: !513)
!407 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!408 = !DISubroutineType(types: !409)
!409 = !{null, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 32)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !156, line: 245, size: 1280, elements: !412)
!412 = !{!413, !471, !483, !484, !485, !486, !487, !493, !508}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !411, file: !156, line: 247, baseType: !414, size: 384)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !156, line: 57, size: 384, elements: !415)
!415 = !{!416, !440, !447, !448, !449, !458, !459, !460}
!416 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !156, line: 60, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !414, file: !156, line: 60, size: 64, elements: !418)
!418 = !{!419, !434}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !417, file: !156, line: 61, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !421)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !422)
!422 = !{!423, !429}
!423 = !DIDerivedType(tag: DW_TAG_member, scope: !421, file: !127, line: 38, baseType: !424, size: 32)
!424 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !421, file: !127, line: 38, size: 32, elements: !425)
!425 = !{!426, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !424, file: !127, line: 39, baseType: !427, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !424, file: !127, line: 40, baseType: !427, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, scope: !421, file: !127, line: 42, baseType: !430, size: 32, offset: 32)
!430 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !421, file: !127, line: 42, size: 32, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !430, file: !127, line: 43, baseType: !427, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !430, file: !127, line: 44, baseType: !427, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !417, file: !156, line: 62, baseType: !435, size: 64)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 49, size: 64, elements: !436)
!436 = !{!437}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !435, file: !168, line: 50, baseType: !438, size: 64)
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 64, elements: !173)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !414, file: !156, line: 68, baseType: !441, size: 32, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !444)
!444 = !{!445}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !443, file: !122, line: 232, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !421)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !414, file: !156, line: 71, baseType: !178, size: 8, offset: 96)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !414, file: !156, line: 74, baseType: !178, size: 8, offset: 104)
!449 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !156, line: 90, baseType: !450, size: 16, offset: 112)
!450 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !414, file: !156, line: 90, size: 16, elements: !451)
!451 = !{!452, !457}
!452 = !DIDerivedType(tag: DW_TAG_member, scope: !450, file: !156, line: 91, baseType: !453, size: 16)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !450, file: !156, line: 91, size: 16, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !453, file: !156, line: 96, baseType: !188, size: 8)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !453, file: !156, line: 97, baseType: !178, size: 8, offset: 8)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !450, file: !156, line: 100, baseType: !192, size: 16)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !414, file: !156, line: 107, baseType: !110, size: 32, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !414, file: !156, line: 127, baseType: !107, size: 32, offset: 160)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !414, file: !156, line: 131, baseType: !461, size: 192, offset: 192)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !462)
!462 = !{!463, !464, !470}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !461, file: !122, line: 245, baseType: !420, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !461, file: !122, line: 246, baseType: !465, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !469}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !461, file: !122, line: 249, baseType: !105, size: 64, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !411, file: !156, line: 250, baseType: !472, size: 288, offset: 384)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !209, line: 25, size: 288, elements: !473)
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !472, file: !209, line: 26, baseType: !110, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !472, file: !209, line: 27, baseType: !110, size: 32, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !472, file: !209, line: 28, baseType: !110, size: 32, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !472, file: !209, line: 29, baseType: !110, size: 32, offset: 96)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !472, file: !209, line: 30, baseType: !110, size: 32, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !472, file: !209, line: 31, baseType: !110, size: 32, offset: 160)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !472, file: !209, line: 32, baseType: !110, size: 32, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !472, file: !209, line: 33, baseType: !110, size: 32, offset: 224)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !472, file: !209, line: 34, baseType: !110, size: 32, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !411, file: !156, line: 253, baseType: !107, size: 32, offset: 672)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !411, file: !156, line: 256, baseType: !442, size: 64, offset: 704)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !411, file: !156, line: 279, baseType: !223, size: 256, offset: 768)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !411, file: !156, line: 294, baseType: !109, size: 32, offset: 1024)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !411, file: !156, line: 300, baseType: !488, size: 96, offset: 1056)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !156, line: 149, size: 96, elements: !489)
!489 = !{!490, !491, !492}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !488, file: !156, line: 153, baseType: !22, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !488, file: !156, line: 162, baseType: !232, size: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !488, file: !156, line: 168, baseType: !232, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !411, file: !156, line: 325, baseType: !494, size: 32, offset: 1152)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 192, elements: !496)
!496 = !{!497, !503, !504}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !495, file: !118, line: 5074, baseType: !498, size: 96)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !241, line: 56, size: 96, elements: !499)
!499 = !{!500, !501, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !498, file: !241, line: 57, baseType: !244, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !498, file: !241, line: 58, baseType: !107, size: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !498, file: !241, line: 59, baseType: !232, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !495, file: !118, line: 5075, baseType: !442, size: 64, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !495, file: !118, line: 5076, baseType: !505, size: 32, offset: 160)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !251, line: 43, size: 32, elements: !506)
!506 = !{!507}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !505, file: !251, line: 52, baseType: !22, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !411, file: !156, line: 343, baseType: !509, size: 64, offset: 1184)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !209, line: 60, size: 64, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !509, file: !209, line: 63, baseType: !110, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !509, file: !209, line: 66, baseType: !110, size: 32, offset: 32)
!513 = !{!514, !515, !516, !517}
!514 = !DILocalVariable(name: "thread", arg: 1, scope: !406, file: !407, line: 175, type: !410)
!515 = !DILocalVariable(name: "region_num", scope: !406, file: !407, line: 200, type: !178)
!516 = !DILocalVariable(name: "guard_start", scope: !406, file: !407, line: 265, type: !22)
!517 = !DILocalVariable(name: "guard_size", scope: !406, file: !407, line: 266, type: !232)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, size: 96, elements: !530)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !520, line: 52, size: 96, elements: !521)
!520 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!521 = !{!522, !523, !524}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !519, file: !520, line: 53, baseType: !22, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !519, file: !520, line: 54, baseType: !232, size: 32, offset: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !519, file: !520, line: 55, baseType: !525, size: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !526, line: 151, baseType: !527)
!526 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !526, line: 149, size: 32, elements: !528)
!528 = !{!529}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !527, file: !526, line: 150, baseType: !110, size: 32)
!530 = !{!531}
!531 = !DISubrange(count: 1)
!532 = !DIGlobalVariableExpression(var: !533, expr: !DIExpression())
!533 = distinct !DIGlobalVariable(name: "static_regions", scope: !400, file: !407, line: 62, type: !534, isLocal: true, isDefinition: true)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !535, size: 96, elements: !530)
!535 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !519)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !291, line: 16, size: 64, elements: !538)
!538 = !{!539, !540}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !537, file: !291, line: 17, baseType: !279, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !537, file: !291, line: 18, baseType: !178, size: 8, offset: 32)
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !543, file: !576, line: 39, type: !178, isLocal: true, isDefinition: true)
!543 = distinct !DICompileUnit(language: DW_LANG_C99, file: !544, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !545, globals: !575, splitDebugInlining: false, nameTableKind: None)
!544 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple")
!545 = !{!546, !107, !109, !563, !178}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !548, line: 1168, baseType: !549)
!548 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !548, line: 1155, size: 352, elements: !550)
!550 = !{!551, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !549, file: !548, line: 1157, baseType: !552, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !549, file: !548, line: 1158, baseType: !316, size: 32, offset: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !549, file: !548, line: 1159, baseType: !316, size: 32, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !549, file: !548, line: 1160, baseType: !316, size: 32, offset: 96)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !549, file: !548, line: 1161, baseType: !316, size: 32, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !549, file: !548, line: 1162, baseType: !316, size: 32, offset: 160)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !549, file: !548, line: 1163, baseType: !316, size: 32, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !549, file: !548, line: 1164, baseType: !316, size: 32, offset: 224)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !549, file: !548, line: 1165, baseType: !316, size: 32, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !549, file: !548, line: 1166, baseType: !316, size: 32, offset: 288)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !549, file: !548, line: 1167, baseType: !316, size: 32, offset: 320)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !566, line: 27, size: 96, elements: !567)
!566 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!567 = !{!568, !569, !570}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !565, file: !566, line: 29, baseType: !110, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !565, file: !566, line: 31, baseType: !279, size: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !565, file: !566, line: 37, baseType: !571, size: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !526, line: 146, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !526, line: 141, size: 32, elements: !573)
!573 = !{!574}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !572, file: !526, line: 143, baseType: !110, size: 32)
!575 = !{!541}
!576 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !579, file: !586, line: 21, type: !302, isLocal: true, isDefinition: true)
!579 = distinct !DICompileUnit(language: DW_LANG_C99, file: !580, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !581, globals: !585, splitDebugInlining: false, nameTableKind: None)
!580 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple")
!581 = !{!582, !109, !107}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !584, line: 22, baseType: !109)
!584 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!585 = !{!577}
!586 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !589, file: !594, line: 13, type: !611, isLocal: true, isDefinition: true)
!589 = distinct !DICompileUnit(language: DW_LANG_C99, file: !590, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !591, splitDebugInlining: false, nameTableKind: None)
!590 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple")
!591 = !{!592, !587}
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "mpu_config", scope: !589, file: !594, line: 37, type: !595, isLocal: false, isDefinition: true)
!594 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !566, line: 41, size: 64, elements: !597)
!597 = !{!598, !599}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !596, file: !566, line: 43, baseType: !110, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !596, file: !566, line: 45, baseType: !600, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !566, line: 27, size: 96, elements: !603)
!603 = !{!604, !605, !606}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !602, file: !566, line: 29, baseType: !110, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !602, file: !566, line: 31, baseType: !279, size: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !602, file: !566, line: 37, baseType: !607, size: 32, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !526, line: 146, baseType: !608)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !526, line: 141, size: 32, elements: !609)
!609 = !{!610}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !608, file: !526, line: 143, baseType: !110, size: 32)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 192, elements: !173)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "__init_rf_init", scope: !614, file: !711, line: 36, type: !712, isLocal: true, isDefinition: true, align: 32)
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !615, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !616, retainedTypes: !628, globals: !710, splitDebugInlining: false, nameTableKind: None)
!615 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple")
!616 = !{!617, !623}
!617 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !618, line: 506, baseType: !32, size: 32, elements: !619)
!618 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!619 = !{!620, !621, !622}
!620 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!621 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!622 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!623 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !618, line: 512, baseType: !32, size: 32, elements: !624)
!624 = !{!625, !626, !627}
!625 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!626 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!627 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!628 = !{!629, !699, !704, !664, !623, !617, !709, !107}
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !618, line: 523, size: 288, elements: !632)
!632 = !{!633, !654, !660, !665, !669, !670, !671, !675, !695}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !631, file: !618, line: 524, baseType: !634, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!635 = !DISubroutineType(types: !636)
!636 = !{!109, !637, !652, !653}
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !349, line: 378, size: 192, elements: !640)
!640 = !{!641, !642, !643, !644, !650, !651}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !639, file: !349, line: 380, baseType: !279, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !639, file: !349, line: 382, baseType: !13, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !639, file: !349, line: 384, baseType: !13, size: 32, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !639, file: !349, line: 386, baseType: !645, size: 32, offset: 96)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 32)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !349, line: 351, size: 16, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !646, file: !349, line: 359, baseType: !178, size: 8)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !646, file: !349, line: 364, baseType: !360, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !639, file: !349, line: 388, baseType: !107, size: 32, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !639, file: !349, line: 396, baseType: !363, size: 32, offset: 160)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !618, line: 237, baseType: !178)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !618, line: 257, baseType: !110)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !631, file: !618, line: 530, baseType: !655, size: 32, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!656 = !DISubroutineType(types: !657)
!657 = !{!109, !637, !658}
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 32)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !618, line: 229, baseType: !110)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !631, file: !618, line: 532, baseType: !661, size: 32, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!662 = !DISubroutineType(types: !663)
!663 = !{!109, !637, !664, !659}
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !618, line: 216, baseType: !110)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !631, file: !618, line: 535, baseType: !666, size: 32, offset: 96)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 32)
!667 = !DISubroutineType(types: !668)
!668 = !{!109, !637, !664}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !631, file: !618, line: 537, baseType: !666, size: 32, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !631, file: !618, line: 539, baseType: !666, size: 32, offset: 160)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !631, file: !618, line: 541, baseType: !672, size: 32, offset: 192)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!673 = !DISubroutineType(types: !674)
!674 = !{!109, !637, !652, !617, !623}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !631, file: !618, line: 544, baseType: !676, size: 32, offset: 224)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!677 = !DISubroutineType(types: !678)
!678 = !{!109, !637, !679, !360}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !618, line: 478, size: 96, elements: !681)
!681 = !{!682, !689, !694}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !680, file: !618, line: 482, baseType: !683, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !684, line: 33, baseType: !685)
!684 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !684, line: 29, size: 32, elements: !686)
!686 = !{!687}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !685, file: !684, line: 30, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !680, file: !618, line: 485, baseType: !690, size: 32, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !618, line: 464, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !637, !679, !664}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !680, file: !618, line: 493, baseType: !664, size: 32, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !631, file: !618, line: 547, baseType: !696, size: 32, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = !DISubroutineType(types: !698)
!698 = !{!110, !637}
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !618, line: 428, size: 32, elements: !702)
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !701, file: !618, line: 434, baseType: !664, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !618, line: 441, size: 32, elements: !707)
!707 = !{!708}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !706, file: !618, line: 447, baseType: !664, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!710 = !{!612}
!711 = !DIFile(filename: "zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !340, line: 51, size: 64, elements: !714)
!714 = !{!715, !719}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !713, file: !340, line: 60, baseType: !716, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!717 = !DISubroutineType(types: !718)
!718 = !{!109, !637}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !713, file: !340, line: 65, baseType: !637, size: 32, offset: 32)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !722, file: !794, line: 48, type: !870, isLocal: true, isDefinition: true)
!722 = distinct !DICompileUnit(language: DW_LANG_C99, file: !723, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !724, retainedTypes: !780, globals: !791, splitDebugInlining: false, nameTableKind: None)
!723 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple")
!724 = !{!30, !725}
!725 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !312, line: 69, baseType: !109, size: 32, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779}
!727 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!728 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!729 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!730 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!731 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!732 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!733 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!734 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!735 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!736 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!737 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!738 = !DIEnumerator(name: "TAMPER_STAMP_IRQn", value: 2)
!739 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!740 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!741 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!742 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!743 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!744 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!745 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!746 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!747 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!748 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!749 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!750 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!751 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!752 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!753 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!754 = !DIEnumerator(name: "ADC1_IRQn", value: 18)
!755 = !DIEnumerator(name: "USB_HP_IRQn", value: 19)
!756 = !DIEnumerator(name: "USB_LP_IRQn", value: 20)
!757 = !DIEnumerator(name: "DAC_IRQn", value: 21)
!758 = !DIEnumerator(name: "COMP_IRQn", value: 22)
!759 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!760 = !DIEnumerator(name: "TIM9_IRQn", value: 25)
!761 = !DIEnumerator(name: "TIM10_IRQn", value: 26)
!762 = !DIEnumerator(name: "TIM11_IRQn", value: 27)
!763 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!764 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!765 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!766 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!767 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!768 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!769 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!770 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!771 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!772 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!773 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!774 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!775 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!776 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!777 = !DIEnumerator(name: "USB_FS_WKUP_IRQn", value: 42)
!778 = !DIEnumerator(name: "TIM6_IRQn", value: 43)
!779 = !DIEnumerator(name: "TIM7_IRQn", value: 44)
!780 = !{!232, !109, !107, !781}
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !312, line: 270, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !312, line: 262, size: 192, elements: !784)
!784 = !{!785, !786, !787, !788, !789, !790}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !783, file: !312, line: 264, baseType: !316, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !783, file: !312, line: 265, baseType: !316, size: 32, offset: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !783, file: !312, line: 266, baseType: !316, size: 32, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !783, file: !312, line: 267, baseType: !316, size: 32, offset: 96)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !783, file: !312, line: 268, baseType: !316, size: 32, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !783, file: !312, line: 269, baseType: !316, size: 32, offset: 160)
!791 = !{!792, !798, !814, !825, !842, !720, !844, !858, !860, !862, !864, !866, !868}
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !722, file: !794, line: 424, type: !795, isLocal: false, isDefinition: true, align: 16)
!794 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 64, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 4)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "__device_dts_ord_32", scope: !722, file: !794, line: 424, type: !800, isLocal: false, isDefinition: true, align: 32)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !349, line: 378, size: 192, elements: !802)
!802 = !{!803, !804, !805, !806, !812, !813}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !801, file: !349, line: 380, baseType: !279, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !801, file: !349, line: 382, baseType: !13, size: 32, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !801, file: !349, line: 384, baseType: !13, size: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !801, file: !349, line: 386, baseType: !807, size: 32, offset: 96)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !349, line: 351, size: 16, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !808, file: !349, line: 359, baseType: !178, size: 8)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !808, file: !349, line: 364, baseType: !360, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !801, file: !349, line: 388, baseType: !107, size: 32, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !801, file: !349, line: 396, baseType: !363, size: 32, offset: 160)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_32", scope: !722, file: !794, line: 424, type: !816, isLocal: true, isDefinition: true, align: 32)
!816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !340, line: 51, size: 64, elements: !818)
!818 = !{!819, !824}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !817, file: !340, line: 60, baseType: !820, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = !DISubroutineType(types: !822)
!822 = !{!109, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !817, file: !340, line: 65, baseType: !823, size: 32, offset: 32)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "exti_data", scope: !722, file: !794, line: 423, type: !827, isLocal: true, isDefinition: true)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !794, line: 107, size: 1024, elements: !828)
!828 = !{!829}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !827, file: !794, line: 109, baseType: !830, size: 1024)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !831, size: 1024, elements: !840)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !794, line: 101, size: 64, elements: !832)
!832 = !{!833, !839}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !831, file: !794, line: 102, baseType: !834, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !835, line: 63, baseType: !836)
!835 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!837 = !DISubroutineType(types: !838)
!838 = !{null, !109, !107}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !831, file: !794, line: 103, baseType: !107, size: 32, offset: 32)
!840 = !{!841}
!841 = !DISubrange(count: 16)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_32", scope: !722, file: !794, line: 424, type: !808, isLocal: true, isDefinition: true, align: 8)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !846, file: !794, line: 493, type: !851, isLocal: true, isDefinition: true, align: 32)
!846 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !794, file: !794, line: 460, type: !847, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !722, retainedNodes: !849)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !823}
!849 = !{!850}
!850 = !DILocalVariable(name: "dev", arg: 1, scope: !846, file: !794, line: 460, type: !823)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !852)
!852 = !{!853, !855, !856, !857}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !851, file: !10, line: 55, baseType: !854, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !109)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !851, file: !10, line: 57, baseType: !854, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !851, file: !10, line: 59, baseType: !107, size: 32, offset: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !851, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !846, file: !794, line: 497, type: !851, isLocal: true, isDefinition: true, align: 32)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !846, file: !794, line: 507, type: !851, isLocal: true, isDefinition: true, align: 32)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !846, file: !794, line: 512, type: !851, isLocal: true, isDefinition: true, align: 32)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !846, file: !794, line: 516, type: !851, isLocal: true, isDefinition: true, align: 32)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !846, file: !794, line: 523, type: !851, isLocal: true, isDefinition: true, align: 32)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !846, file: !794, line: 527, type: !851, isLocal: true, isDefinition: true, align: 32)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !871, size: 512, elements: !840)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !312, line: 127, baseType: !725)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !875, file: !880, line: 21, type: !900, isLocal: false, isDefinition: true, align: 16)
!875 = distinct !DICompileUnit(language: DW_LANG_C99, file: !876, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !877, splitDebugInlining: false, nameTableKind: None)
!876 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple")
!877 = !{!878, !873, !884, !886, !888, !890, !892, !894, !896, !898}
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !875, file: !880, line: 16, type: !881, isLocal: false, isDefinition: true, align: 16)
!880 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple")
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 176, elements: !882)
!882 = !{!883}
!883 = !DISubrange(count: 11)
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_17", scope: !875, file: !880, line: 28, type: !795, isLocal: false, isDefinition: true, align: 16)
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !875, file: !880, line: 35, type: !795, isLocal: false, isDefinition: true, align: 16)
!888 = !DIGlobalVariableExpression(var: !889, expr: !DIExpression())
!889 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_53", scope: !875, file: !880, line: 42, type: !795, isLocal: false, isDefinition: true, align: 16)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_59", scope: !875, file: !880, line: 49, type: !795, isLocal: false, isDefinition: true, align: 16)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_15", scope: !875, file: !880, line: 56, type: !795, isLocal: false, isDefinition: true, align: 16)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !875, file: !880, line: 63, type: !795, isLocal: false, isDefinition: true, align: 16)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !875, file: !880, line: 70, type: !795, isLocal: false, isDefinition: true, align: 16)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !875, file: !880, line: 77, type: !795, isLocal: false, isDefinition: true, align: 16)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 48, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 3)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !905, file: !949, line: 398, type: !980, isLocal: true, isDefinition: true)
!905 = distinct !DICompileUnit(language: DW_LANG_C99, file: !906, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !907, retainedTypes: !920, globals: !946, splitDebugInlining: false, nameTableKind: None)
!906 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple")
!907 = !{!908, !30, !913}
!908 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !909, line: 190, baseType: !32, size: 32, elements: !910)
!909 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l1xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!910 = !{!911, !912}
!911 = !DIEnumerator(name: "SUCCESS", value: 0)
!912 = !DIEnumerator(name: "ERROR", value: 1)
!913 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !914, line: 44, baseType: !32, size: 32, elements: !915)
!914 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!915 = !{!916, !917, !918, !919}
!916 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!917 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!918 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!919 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!920 = !{!107, !109, !110, !921, !939, !945}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !312, line: 386, baseType: !923)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !312, line: 370, size: 448, elements: !924)
!924 = !{!925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !923, file: !312, line: 372, baseType: !316, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !923, file: !312, line: 373, baseType: !316, size: 32, offset: 32)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !923, file: !312, line: 374, baseType: !316, size: 32, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !923, file: !312, line: 375, baseType: !316, size: 32, offset: 96)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !923, file: !312, line: 376, baseType: !316, size: 32, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !923, file: !312, line: 377, baseType: !316, size: 32, offset: 160)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !923, file: !312, line: 378, baseType: !316, size: 32, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !923, file: !312, line: 379, baseType: !316, size: 32, offset: 224)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !923, file: !312, line: 380, baseType: !316, size: 32, offset: 256)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !923, file: !312, line: 381, baseType: !316, size: 32, offset: 288)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !923, file: !312, line: 382, baseType: !316, size: 32, offset: 320)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !923, file: !312, line: 383, baseType: !316, size: 32, offset: 352)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !923, file: !312, line: 384, baseType: !316, size: 32, offset: 384)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !923, file: !312, line: 385, baseType: !316, size: 32, offset: 416)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !941, line: 343, size: 64, elements: !942)
!941 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !940, file: !941, line: 344, baseType: !110, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !940, file: !941, line: 345, baseType: !110, size: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!946 = !{!947, !951, !967, !978, !903}
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !905, file: !949, line: 752, type: !950, isLocal: false, isDefinition: true, align: 16)
!949 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 512, elements: !224)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !905, file: !949, line: 752, type: !953, isLocal: false, isDefinition: true, align: 32)
!953 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !349, line: 378, size: 192, elements: !955)
!955 = !{!956, !957, !958, !959, !965, !966}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !954, file: !349, line: 380, baseType: !279, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !954, file: !349, line: 382, baseType: !13, size: 32, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !954, file: !349, line: 384, baseType: !13, size: 32, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !954, file: !349, line: 386, baseType: !960, size: 32, offset: 96)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !349, line: 351, size: 16, elements: !962)
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !961, file: !349, line: 359, baseType: !178, size: 8)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !961, file: !349, line: 364, baseType: !360, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !954, file: !349, line: 388, baseType: !107, size: 32, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !954, file: !349, line: 396, baseType: !363, size: 32, offset: 160)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !905, file: !949, line: 752, type: !969, isLocal: true, isDefinition: true, align: 32)
!969 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !340, line: 51, size: 64, elements: !971)
!971 = !{!972, !977}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !970, file: !340, line: 60, baseType: !973, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 32)
!974 = !DISubroutineType(types: !975)
!975 = !{!109, !976}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !970, file: !340, line: 65, baseType: !976, size: 32, offset: 32)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !905, file: !949, line: 752, type: !961, isLocal: true, isDefinition: true, align: 8)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !914, line: 100, size: 224, elements: !981)
!981 = !{!982, !988, !989, !998, !1003, !1008, !1014}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !980, file: !914, line: 101, baseType: !983, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !914, line: 76, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DISubroutineType(types: !986)
!986 = !{!109, !976, !987}
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !914, line: 56, baseType: !107)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !980, file: !914, line: 102, baseType: !983, size: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !980, file: !914, line: 103, baseType: !990, size: 32, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !914, line: 83, baseType: !991)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = !DISubroutineType(types: !993)
!993 = !{!109, !976, !987, !994, !107}
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !914, line: 72, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DISubroutineType(types: !997)
!997 = !{null, !976, !987, !107}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !980, file: !914, line: 104, baseType: !999, size: 32, offset: 96)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !914, line: 79, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!109, !976, !987, !945}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !980, file: !914, line: 105, baseType: !1004, size: 32, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !914, line: 88, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 32)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!913, !976, !987}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !980, file: !914, line: 106, baseType: !1009, size: 32, offset: 160)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !914, line: 92, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 32)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!109, !976, !987, !1013}
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !914, line: 64, baseType: !107)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !980, file: !914, line: 107, baseType: !1015, size: 32, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !914, line: 96, baseType: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 32)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!109, !976, !987, !107}
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !1021, file: !1078, line: 603, type: !1080, isLocal: true, isDefinition: true, align: 32)
!1021 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1022, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !1023, globals: !1075, splitDebugInlining: false, nameTableKind: None)
!1022 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/simple")
!1023 = !{!107, !109, !1024}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !1027, line: 336, size: 160, elements: !1028)
!1027 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1028 = !{!1029, !1049, !1053, !1057, !1070}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !1026, file: !1027, line: 365, baseType: !1030, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 32)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!109, !1033, !1048}
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 32)
!1034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !349, line: 378, size: 192, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1040, !1046, !1047}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1035, file: !349, line: 380, baseType: !279, size: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1035, file: !349, line: 382, baseType: !13, size: 32, offset: 32)
