; ModuleID = 'build/96b_wistrio/subsys/zbus/hello_world/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.version_msg = type { i8, i8, i16 }
%struct.zbus_observer = type { i8*, i8, %struct.k_msgq*, void (%struct.zbus_channel*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/zbus/hello_world/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/zbus/hello_world")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/zbus/hello_world")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_mutex_version_chan", scope: !27, file: !114, line: 25, type: !141, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/hello_world/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/zbus/hello_world")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !106, !107, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !103, line: 46, baseType: !104)
!103 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !105)
!105 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112, !295, !297, !299, !301, !303, !305, !307, !309, !340, !344, !349, !354, !356, !358, !365, !370, !377, !382, !384}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "version_chan", scope: !27, file: !114, line: 25, type: !115, isLocal: false, isDefinition: true, align: 32)
!114 = !DIFile(filename: "zephyr/samples/subsys/zbus/hello_world/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !117, line: 29, size: 224, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !124, !128, !130, !131, !139, !264}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !117, line: 32, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !116, file: !117, line: 35, baseType: !125, size: 16, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !127)
!127 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !116, file: !117, line: 40, baseType: !129, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !116, file: !117, line: 45, baseType: !129, size: 32, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !116, file: !117, line: 51, baseType: !132, size: 32, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !13, !137}
!136 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !138, line: 214, baseType: !32)
!138 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !116, file: !117, line: 56, baseType: !140, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !142, line: 2720, size: 160, elements: !143)
!142 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !165, !262, !263}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !141, file: !142, line: 2722, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !146, line: 233, baseType: !147)
!146 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 231, size: 64, elements: !148)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !147, file: !146, line: 232, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !151, line: 48, baseType: !152)
!151 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !151, line: 37, size: 64, elements: !153)
!153 = !{!154, !160}
!154 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !151, line: 38, baseType: !155, size: 32)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !151, line: 38, size: 32, elements: !156)
!156 = !{!157, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !155, file: !151, line: 39, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !151, line: 40, baseType: !158, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !151, line: 42, baseType: !161, size: 32, offset: 32)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !151, line: 42, size: 32, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !161, file: !151, line: 43, baseType: !158, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !161, file: !151, line: 44, baseType: !158, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !141, file: !142, line: 2724, baseType: !166, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !168, line: 245, size: 1024, elements: !169)
!168 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!169 = !{!170, !217, !230, !231, !232, !233, !239, !257}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !167, file: !168, line: 247, baseType: !171, size: 384)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !168, line: 57, size: 384, elements: !172)
!172 = !{!173, !187, !189, !192, !193, !204, !205, !206}
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !168, line: 60, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !168, line: 60, size: 64, elements: !175)
!175 = !{!176, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !174, file: !168, line: 61, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !151, line: 49, baseType: !152)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !174, file: !168, line: 62, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !180, line: 49, size: 64, elements: !181)
!180 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = !{!182}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !179, file: !180, line: 50, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, elements: !185)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!185 = !{!186}
!186 = !DISubrange(count: 2)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !171, file: !168, line: 68, baseType: !188, size: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !171, file: !168, line: 71, baseType: !190, size: 8, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !191)
!191 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !171, file: !168, line: 74, baseType: !190, size: 8, offset: 104)
!193 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !168, line: 90, baseType: !194, size: 16, offset: 112)
!194 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !168, line: 90, size: 16, elements: !195)
!195 = !{!196, !203}
!196 = !DIDerivedType(tag: DW_TAG_member, scope: !194, file: !168, line: 91, baseType: !197, size: 16)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !194, file: !168, line: 91, size: 16, elements: !198)
!198 = !{!199, !202}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !197, file: !168, line: 96, baseType: !200, size: 8)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !201)
!201 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !197, file: !168, line: 97, baseType: !190, size: 8, offset: 8)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !194, file: !168, line: 100, baseType: !126, size: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !171, file: !168, line: 107, baseType: !108, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !171, file: !168, line: 127, baseType: !106, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !171, file: !168, line: 131, baseType: !207, size: 192, offset: 192)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !146, line: 244, size: 192, elements: !208)
!208 = !{!209, !210, !216}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !207, file: !146, line: 245, baseType: !177, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !207, file: !146, line: 246, baseType: !211, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !146, line: 242, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !207, file: !146, line: 249, baseType: !104, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !167, file: !168, line: 250, baseType: !218, size: 288, offset: 384)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !219, line: 25, size: 288, elements: !220)
!219 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!220 = !{!221, !222, !223, !224, !225, !226, !227, !228, !229}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !218, file: !219, line: 26, baseType: !108, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !218, file: !219, line: 27, baseType: !108, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !218, file: !219, line: 28, baseType: !108, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !218, file: !219, line: 29, baseType: !108, size: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !218, file: !219, line: 30, baseType: !108, size: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !218, file: !219, line: 31, baseType: !108, size: 32, offset: 160)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !218, file: !219, line: 32, baseType: !108, size: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !218, file: !219, line: 33, baseType: !108, size: 32, offset: 224)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !218, file: !219, line: 34, baseType: !108, size: 32, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !167, file: !168, line: 253, baseType: !106, size: 32, offset: 672)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !167, file: !168, line: 256, baseType: !145, size: 64, offset: 704)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !167, file: !168, line: 294, baseType: !107, size: 32, offset: 768)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !167, file: !168, line: 300, baseType: !234, size: 96, offset: 800)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !168, line: 149, size: 96, elements: !235)
!235 = !{!236, !237, !238}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !234, file: !168, line: 153, baseType: !22, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !234, file: !168, line: 162, baseType: !137, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !234, file: !168, line: 168, baseType: !137, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !167, file: !168, line: 325, baseType: !240, size: 32, offset: 896)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !142, line: 5073, size: 160, elements: !242)
!242 = !{!243, !252, !253}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !241, file: !142, line: 5074, baseType: !244, size: 96)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !245, line: 56, size: 96, elements: !246)
!245 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!246 = !{!247, !250, !251}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !244, file: !245, line: 57, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !245, line: 57, flags: DIFlagFwdDecl)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !244, file: !245, line: 58, baseType: !106, size: 32, offset: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !244, file: !245, line: 59, baseType: !137, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !241, file: !142, line: 5075, baseType: !145, size: 64, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !241, file: !142, line: 5076, baseType: !254, offset: 160)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !255, line: 43, elements: !256)
!255 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!256 = !{}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !167, file: !168, line: 343, baseType: !258, size: 64, offset: 928)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !219, line: 60, size: 64, elements: !259)
!259 = !{!260, !261}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !258, file: !219, line: 63, baseType: !108, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !258, file: !219, line: 66, baseType: !108, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !141, file: !142, line: 2727, baseType: !108, size: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !141, file: !142, line: 2730, baseType: !107, size: 32, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !116, file: !117, line: 67, baseType: !265, size: 32, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !117, line: 85, size: 128, elements: !270)
!270 = !{!271, !272, !273, !289}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !269, file: !117, line: 88, baseType: !120, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !269, file: !117, line: 91, baseType: !136, size: 8, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !269, file: !117, line: 93, baseType: !274, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !142, line: 4204, size: 320, elements: !277)
!277 = !{!278, !279, !280, !281, !282, !284, !285, !286, !287, !288}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !276, file: !142, line: 4206, baseType: !145, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !276, file: !142, line: 4208, baseType: !254, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !276, file: !142, line: 4210, baseType: !137, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !276, file: !142, line: 4212, baseType: !108, size: 32, offset: 96)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !276, file: !142, line: 4214, baseType: !283, size: 32, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !276, file: !142, line: 4216, baseType: !283, size: 32, offset: 160)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !276, file: !142, line: 4218, baseType: !283, size: 32, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !276, file: !142, line: 4220, baseType: !283, size: 32, offset: 224)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !276, file: !142, line: 4222, baseType: !108, size: 32, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !276, file: !142, line: 4227, baseType: !190, size: 8, offset: 288)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !269, file: !117, line: 96, baseType: !290, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !294}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "_zbus_mutex_acc_data_chan", scope: !27, file: !114, line: 35, type: !141, isLocal: true, isDefinition: true, align: 32)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "acc_data_chan", scope: !27, file: !114, line: 35, type: !115, isLocal: false, isDefinition: true, align: 32)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "_zbus_mutex_simple_chan", scope: !27, file: !114, line: 57, type: !141, isLocal: true, isDefinition: true, align: 32)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "simple_chan", scope: !27, file: !114, line: 57, type: !115, isLocal: false, isDefinition: true, align: 32)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "foo_lis", scope: !27, file: !114, line: 73, type: !269, isLocal: false, isDefinition: true, align: 32)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_bar_sub", scope: !27, file: !114, line: 75, type: !276, isLocal: false, isDefinition: true, align: 32)
!307 = !DIGlobalVariableExpression(var: !308, expr: !DIExpression())
!308 = distinct !DIGlobalVariable(name: "bar_sub", scope: !27, file: !114, line: 75, type: !269, isLocal: false, isDefinition: true, align: 32)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "_k_thread_data_subscriber_task_id", scope: !27, file: !114, line: 92, type: !311, isLocal: false, isDefinition: true, align: 32)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !142, line: 620, size: 384, elements: !312)
!312 = !{!313, !314, !322, !323, !328, !329, !330, !331, !332, !333, !335, !339}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !311, file: !142, line: 621, baseType: !166, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !311, file: !142, line: 622, baseType: !315, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !317, line: 44, baseType: !318)
!317 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !319, line: 47, size: 8, elements: !320)
!319 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!320 = !{!321}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !318, file: !319, line: 48, baseType: !123, size: 8)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !311, file: !142, line: 623, baseType: !32, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !311, file: !142, line: 624, baseType: !324, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !317, line: 46, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !106, !106, !106}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !311, file: !142, line: 625, baseType: !106, size: 32, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !311, file: !142, line: 626, baseType: !106, size: 32, offset: 160)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !311, file: !142, line: 627, baseType: !106, size: 32, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !311, file: !142, line: 628, baseType: !107, size: 32, offset: 224)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !311, file: !142, line: 629, baseType: !108, size: 32, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !311, file: !142, line: 630, baseType: !334, size: 32, offset: 288)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !311, file: !142, line: 631, baseType: !336, size: 32, offset: 320)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 32)
!337 = !DISubroutineType(types: !338)
!338 = !{null}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !311, file: !142, line: 632, baseType: !121, size: 32, offset: 352)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "subscriber_task_id", scope: !27, file: !114, line: 92, type: !342, isLocal: false, isDefinition: true)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !168, line: 347, baseType: !166)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_bar_sub", scope: !27, file: !114, line: 75, type: !346, isLocal: true, isDefinition: true, align: 32)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 16)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "_k_thread_stack_subscriber_task_id", scope: !27, file: !114, line: 92, type: !351, isLocal: false, isDefinition: true, align: 512)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !318, size: 4608, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 576)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "_k_thread_obj_subscriber_task_id", scope: !27, file: !114, line: 92, type: !167, isLocal: false, isDefinition: true)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !114, line: 95, type: !107, isLocal: true, isDefinition: true)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "_zbus_message_version_chan", scope: !27, file: !114, line: 25, type: !360, isLocal: true, isDefinition: true)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "version_msg", file: !114, line: 13, size: 32, elements: !361)
!361 = !{!362, !363, !364}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !360, file: !114, line: 14, baseType: !190, size: 8)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !360, file: !114, line: 15, baseType: !190, size: 8, offset: 8)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "build", scope: !360, file: !114, line: 16, baseType: !126, size: 16, offset: 16)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "_zbus_observers_version_chan", scope: !27, file: !114, line: 25, type: !367, isLocal: true, isDefinition: true)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 32, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 1)
!370 = !DIGlobalVariableExpression(var: !371, expr: !DIExpression())
!371 = distinct !DIGlobalVariable(name: "_zbus_message_acc_data_chan", scope: !27, file: !114, line: 35, type: !372, isLocal: true, isDefinition: true)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acc_msg", file: !114, line: 19, size: 96, elements: !373)
!373 = !{!374, !375, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !372, file: !114, line: 20, baseType: !107, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !372, file: !114, line: 21, baseType: !107, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !372, file: !114, line: 22, baseType: !107, size: 32, offset: 64)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "_zbus_observers_acc_data_chan", scope: !27, file: !114, line: 35, type: !379, isLocal: true, isDefinition: true)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 96, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 3)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "_zbus_message_simple_chan", scope: !27, file: !114, line: 57, type: !107, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "_zbus_observers_simple_chan", scope: !27, file: !114, line: 57, type: !367, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !388, file: !403, line: 18, type: !404, isLocal: false, isDefinition: true)
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !390, globals: !402, splitDebugInlining: false, nameTableKind: None)
!389 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/zbus/hello_world")
!390 = !{!22, !106, !24, !391, !393, !395, !137, !107, !396, !397, !399, !400, !283, !401, !126, !121}
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!394 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!398 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!402 = !{!386}
!403 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!404 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !406, line: 16, size: 64, elements: !407)
!406 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !405, file: !406, line: 17, baseType: !121, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !405, file: !406, line: 18, baseType: !190, size: 8, offset: 32)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "_char_out", scope: !412, file: !416, line: 54, type: !417, isLocal: false, isDefinition: true)
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !414, globals: !415, splitDebugInlining: false, nameTableKind: None)
!413 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/zbus/hello_world")
!414 = !{!106, !107}
!415 = !{!410}
!416 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DISubroutineType(types: !419)
!419 = !{!107, !107}
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "__init_stm32l1_init", scope: !422, file: !452, line: 60, type: !453, isLocal: true, isDefinition: true, align: 32)
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !424, globals: !451, splitDebugInlining: false, nameTableKind: None)
!423 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/zbus/hello_world")
!424 = !{!425, !445}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !427, line: 386, baseType: !428)
!427 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l151xba.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !427, line: 370, size: 448, elements: !429)
!429 = !{!430, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !428, file: !427, line: 372, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !428, file: !427, line: 373, baseType: !431, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !428, file: !427, line: 374, baseType: !431, size: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !428, file: !427, line: 375, baseType: !431, size: 32, offset: 96)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !428, file: !427, line: 376, baseType: !431, size: 32, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !428, file: !427, line: 377, baseType: !431, size: 32, offset: 160)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !428, file: !427, line: 378, baseType: !431, size: 32, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !428, file: !427, line: 379, baseType: !431, size: 32, offset: 224)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !428, file: !427, line: 380, baseType: !431, size: 32, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !428, file: !427, line: 381, baseType: !431, size: 32, offset: 288)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !428, file: !427, line: 382, baseType: !431, size: 32, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !428, file: !427, line: 383, baseType: !431, size: 32, offset: 352)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !428, file: !427, line: 384, baseType: !431, size: 32, offset: 384)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !428, file: !427, line: 385, baseType: !431, size: 32, offset: 416)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !427, line: 364, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !427, line: 360, size: 64, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !447, file: !427, line: 362, baseType: !431, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !447, file: !427, line: 363, baseType: !431, size: 32, offset: 32)
!451 = !{!420}
!452 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !455, line: 51, size: 64, elements: !456)
!455 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!456 = !{!457, !482}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !454, file: !455, line: 60, baseType: !458, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = !DISubroutineType(types: !460)
!460 = !{!107, !461}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !464, line: 378, size: 192, elements: !465)
!464 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!465 = !{!466, !467, !468, !469, !475, !476}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !463, file: !464, line: 380, baseType: !121, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !463, file: !464, line: 382, baseType: !13, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !463, file: !464, line: 384, baseType: !13, size: 32, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !463, file: !464, line: 386, baseType: !470, size: 32, offset: 96)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 32)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !464, line: 351, size: 16, elements: !472)
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !471, file: !464, line: 359, baseType: !190, size: 8)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !471, file: !464, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !463, file: !464, line: 388, baseType: !106, size: 32, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !463, file: !464, line: 396, baseType: !477, size: 32, offset: 160)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !464, line: 43, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !481)
!481 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !454, file: !455, line: 65, baseType: !461, size: 32, offset: 32)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !485, file: !488, line: 71, type: !489, isLocal: true, isDefinition: true, align: 32)
!485 = distinct !DICompileUnit(language: DW_LANG_C99, file: !486, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !487, splitDebugInlining: false, nameTableKind: None)
!486 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/zbus/hello_world")
!487 = !{!483}
!488 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !455, line: 51, size: 64, elements: !491)
!491 = !{!492, !511}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !490, file: !455, line: 60, baseType: !493, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = !DISubroutineType(types: !495)
!495 = !{!107, !496}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !464, line: 378, size: 192, elements: !499)
!499 = !{!500, !501, !502, !503, !509, !510}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !498, file: !464, line: 380, baseType: !121, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !498, file: !464, line: 382, baseType: !13, size: 32, offset: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !498, file: !464, line: 384, baseType: !13, size: 32, offset: 64)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !498, file: !464, line: 386, baseType: !504, size: 32, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !464, line: 351, size: 16, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !505, file: !464, line: 359, baseType: !190, size: 8)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !505, file: !464, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !498, file: !464, line: 388, baseType: !106, size: 32, offset: 128)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !498, file: !464, line: 396, baseType: !477, size: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !490, file: !455, line: 65, baseType: !496, size: 32, offset: 32)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !514, file: !521, line: 17, type: !645, isLocal: false, isDefinition: true)
!514 = distinct !DICompileUnit(language: DW_LANG_C99, file: !515, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !516, globals: !517, splitDebugInlining: false, nameTableKind: None)
!515 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/zbus/hello_world")
!516 = !{!137, !107, !108, !106}
!517 = !{!512, !518, !641}
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !520, file: !521, line: 198, type: !629, isLocal: true, isDefinition: true)
!520 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !521, file: !521, line: 175, type: !522, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !514, retainedNodes: !624)
!521 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!522 = !DISubroutineType(types: !523)
!523 = !{null, !524}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !168, line: 245, size: 1024, elements: !526)
!526 = !{!527, !585, !597, !598, !599, !600, !606, !619}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !525, file: !168, line: 247, baseType: !528, size: 384)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !168, line: 57, size: 384, elements: !529)
!529 = !{!530, !554, !561, !562, !563, !572, !573, !574}
!530 = !DIDerivedType(tag: DW_TAG_member, scope: !528, file: !168, line: 60, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !528, file: !168, line: 60, size: 64, elements: !532)
!532 = !{!533, !548}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !531, file: !168, line: 61, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !151, line: 49, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !151, line: 37, size: 64, elements: !536)
!536 = !{!537, !543}
!537 = !DIDerivedType(tag: DW_TAG_member, scope: !535, file: !151, line: 38, baseType: !538, size: 32)
!538 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !535, file: !151, line: 38, size: 32, elements: !539)
!539 = !{!540, !542}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !538, file: !151, line: 39, baseType: !541, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !538, file: !151, line: 40, baseType: !541, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, scope: !535, file: !151, line: 42, baseType: !544, size: 32, offset: 32)
!544 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !535, file: !151, line: 42, size: 32, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !544, file: !151, line: 43, baseType: !541, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !544, file: !151, line: 44, baseType: !541, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !531, file: !168, line: 62, baseType: !549, size: 64)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !180, line: 49, size: 64, elements: !550)
!550 = !{!551}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !549, file: !180, line: 50, baseType: !552, size: 64)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 64, elements: !185)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !528, file: !168, line: 68, baseType: !555, size: 32, offset: 64)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !146, line: 233, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 231, size: 64, elements: !558)
!558 = !{!559}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !557, file: !146, line: 232, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !151, line: 48, baseType: !535)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !528, file: !168, line: 71, baseType: !190, size: 8, offset: 96)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !528, file: !168, line: 74, baseType: !190, size: 8, offset: 104)
!563 = !DIDerivedType(tag: DW_TAG_member, scope: !528, file: !168, line: 90, baseType: !564, size: 16, offset: 112)
!564 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !528, file: !168, line: 90, size: 16, elements: !565)
!565 = !{!566, !571}
!566 = !DIDerivedType(tag: DW_TAG_member, scope: !564, file: !168, line: 91, baseType: !567, size: 16)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !564, file: !168, line: 91, size: 16, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !567, file: !168, line: 96, baseType: !200, size: 8)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !567, file: !168, line: 97, baseType: !190, size: 8, offset: 8)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !564, file: !168, line: 100, baseType: !126, size: 16)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !528, file: !168, line: 107, baseType: !108, size: 32, offset: 128)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !528, file: !168, line: 127, baseType: !106, size: 32, offset: 160)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !528, file: !168, line: 131, baseType: !575, size: 192, offset: 192)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !146, line: 244, size: 192, elements: !576)
!576 = !{!577, !578, !584}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !575, file: !146, line: 245, baseType: !534, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !575, file: !146, line: 246, baseType: !579, size: 32, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !146, line: 242, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DISubroutineType(types: !582)
!582 = !{null, !583}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !575, file: !146, line: 249, baseType: !104, size: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !525, file: !168, line: 250, baseType: !586, size: 288, offset: 384)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !219, line: 25, size: 288, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !596}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !586, file: !219, line: 26, baseType: !108, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !586, file: !219, line: 27, baseType: !108, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !586, file: !219, line: 28, baseType: !108, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !586, file: !219, line: 29, baseType: !108, size: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !586, file: !219, line: 30, baseType: !108, size: 32, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !586, file: !219, line: 31, baseType: !108, size: 32, offset: 160)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !586, file: !219, line: 32, baseType: !108, size: 32, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !586, file: !219, line: 33, baseType: !108, size: 32, offset: 224)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !586, file: !219, line: 34, baseType: !108, size: 32, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !525, file: !168, line: 253, baseType: !106, size: 32, offset: 672)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !525, file: !168, line: 256, baseType: !556, size: 64, offset: 704)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !525, file: !168, line: 294, baseType: !107, size: 32, offset: 768)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !525, file: !168, line: 300, baseType: !601, size: 96, offset: 800)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !168, line: 149, size: 96, elements: !602)
!602 = !{!603, !604, !605}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !601, file: !168, line: 153, baseType: !22, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !601, file: !168, line: 162, baseType: !137, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !601, file: !168, line: 168, baseType: !137, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !525, file: !168, line: 325, baseType: !607, size: 32, offset: 896)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !142, line: 5073, size: 160, elements: !609)
!609 = !{!610, !616, !617}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !608, file: !142, line: 5074, baseType: !611, size: 96)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !245, line: 56, size: 96, elements: !612)
!612 = !{!613, !614, !615}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !611, file: !245, line: 57, baseType: !248, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !611, file: !245, line: 58, baseType: !106, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !611, file: !245, line: 59, baseType: !137, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !608, file: !142, line: 5075, baseType: !556, size: 64, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !608, file: !142, line: 5076, baseType: !618, offset: 160)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !255, line: 43, elements: !256)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !525, file: !168, line: 343, baseType: !620, size: 64, offset: 928)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !219, line: 60, size: 64, elements: !621)
!621 = !{!622, !623}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !620, file: !219, line: 63, baseType: !108, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !620, file: !219, line: 66, baseType: !108, size: 32, offset: 32)
!624 = !{!625, !626, !627, !628}
!625 = !DILocalVariable(name: "thread", arg: 1, scope: !520, file: !521, line: 175, type: !524)
!626 = !DILocalVariable(name: "region_num", scope: !520, file: !521, line: 200, type: !190)
!627 = !DILocalVariable(name: "guard_start", scope: !520, file: !521, line: 265, type: !22)
!628 = !DILocalVariable(name: "guard_size", scope: !520, file: !521, line: 266, type: !137)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 96, elements: !368)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !631, line: 52, size: 96, elements: !632)
!631 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!632 = !{!633, !634, !635}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !630, file: !631, line: 53, baseType: !22, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !630, file: !631, line: 54, baseType: !137, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !630, file: !631, line: 55, baseType: !636, size: 32, offset: 64)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !637, line: 151, baseType: !638)
!637 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !637, line: 149, size: 32, elements: !639)
!639 = !{!640}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !638, file: !637, line: 150, baseType: !108, size: 32)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "static_regions", scope: !514, file: !521, line: 62, type: !643, isLocal: true, isDefinition: true)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 96, elements: !368)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !630)
!645 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !406, line: 16, size: 64, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !646, file: !406, line: 17, baseType: !121, size: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !646, file: !406, line: 18, baseType: !190, size: 8, offset: 32)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !652, file: !685, line: 39, type: !190, isLocal: true, isDefinition: true)
!652 = distinct !DICompileUnit(language: DW_LANG_C99, file: !653, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !654, globals: !684, splitDebugInlining: false, nameTableKind: None)
!653 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/zbus/hello_world")
!654 = !{!655, !106, !107, !672, !190}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !657, line: 1168, baseType: !658)
!657 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !657, line: 1155, size: 352, elements: !659)
!659 = !{!660, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !658, file: !657, line: 1157, baseType: !661, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !658, file: !657, line: 1158, baseType: !431, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !658, file: !657, line: 1159, baseType: !431, size: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !658, file: !657, line: 1160, baseType: !431, size: 32, offset: 96)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !658, file: !657, line: 1161, baseType: !431, size: 32, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !658, file: !657, line: 1162, baseType: !431, size: 32, offset: 160)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !658, file: !657, line: 1163, baseType: !431, size: 32, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !658, file: !657, line: 1164, baseType: !431, size: 32, offset: 224)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !658, file: !657, line: 1165, baseType: !431, size: 32, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !658, file: !657, line: 1166, baseType: !431, size: 32, offset: 288)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !658, file: !657, line: 1167, baseType: !431, size: 32, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !675, line: 27, size: 96, elements: !676)
!675 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!676 = !{!677, !678, !679}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !674, file: !675, line: 29, baseType: !108, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !674, file: !675, line: 31, baseType: !121, size: 32, offset: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !674, file: !675, line: 37, baseType: !680, size: 32, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !637, line: 146, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !637, line: 141, size: 32, elements: !682)
!682 = !{!683}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !681, file: !637, line: 143, baseType: !108, size: 32)
!684 = !{!650}
!685 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !688, file: !695, line: 21, type: !417, isLocal: true, isDefinition: true)
!688 = distinct !DICompileUnit(language: DW_LANG_C99, file: !689, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !690, globals: !694, splitDebugInlining: false, nameTableKind: None)
!689 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/zbus/hello_world")
!690 = !{!691, !107, !106}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !693, line: 22, baseType: !107)
!693 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!694 = !{!686}
!695 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !698, file: !703, line: 13, type: !720, isLocal: true, isDefinition: true)
!698 = distinct !DICompileUnit(language: DW_LANG_C99, file: !699, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !700, splitDebugInlining: false, nameTableKind: None)
!699 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/zbus/hello_world")
!700 = !{!701, !696}
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "mpu_config", scope: !698, file: !703, line: 37, type: !704, isLocal: false, isDefinition: true)
!703 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !675, line: 41, size: 64, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !705, file: !675, line: 43, baseType: !108, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !705, file: !675, line: 45, baseType: !709, size: 32, offset: 32)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !675, line: 27, size: 96, elements: !712)
!712 = !{!713, !714, !715}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !711, file: !675, line: 29, baseType: !108, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !711, file: !675, line: 31, baseType: !121, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !711, file: !675, line: 37, baseType: !716, size: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !637, line: 146, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !637, line: 141, size: 32, elements: !718)
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !717, file: !637, line: 143, baseType: !108, size: 32)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !710, size: 192, elements: !185)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "__init_rf_init", scope: !723, file: !820, line: 36, type: !821, isLocal: true, isDefinition: true, align: 32)
!723 = distinct !DICompileUnit(language: DW_LANG_C99, file: !724, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !725, retainedTypes: !737, globals: !819, splitDebugInlining: false, nameTableKind: None)
!724 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/zbus/hello_world")
!725 = !{!726, !732}
!726 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !727, line: 506, baseType: !32, size: 32, elements: !728)
!727 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!728 = !{!729, !730, !731}
!729 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!730 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!731 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!732 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !727, line: 512, baseType: !32, size: 32, elements: !733)
!733 = !{!734, !735, !736}
!734 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!735 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!736 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!737 = !{!738, !808, !813, !773, !732, !726, !818, !106}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !727, line: 523, size: 288, elements: !741)
!741 = !{!742, !763, !769, !774, !778, !779, !780, !784, !804}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !740, file: !727, line: 524, baseType: !743, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 32)
!744 = !DISubroutineType(types: !745)
!745 = !{!107, !746, !761, !762}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !464, line: 378, size: 192, elements: !749)
!749 = !{!750, !751, !752, !753, !759, !760}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !748, file: !464, line: 380, baseType: !121, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !748, file: !464, line: 382, baseType: !13, size: 32, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !748, file: !464, line: 384, baseType: !13, size: 32, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !748, file: !464, line: 386, baseType: !754, size: 32, offset: 96)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !464, line: 351, size: 16, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !755, file: !464, line: 359, baseType: !190, size: 8)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !755, file: !464, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !748, file: !464, line: 388, baseType: !106, size: 32, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !748, file: !464, line: 396, baseType: !477, size: 32, offset: 160)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !727, line: 237, baseType: !190)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !727, line: 257, baseType: !108)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !740, file: !727, line: 530, baseType: !764, size: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DISubroutineType(types: !766)
!766 = !{!107, !746, !767}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !727, line: 229, baseType: !108)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !740, file: !727, line: 532, baseType: !770, size: 32, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 32)
!771 = !DISubroutineType(types: !772)
!772 = !{!107, !746, !773, !768}
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !727, line: 216, baseType: !108)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !740, file: !727, line: 535, baseType: !775, size: 32, offset: 96)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!776 = !DISubroutineType(types: !777)
!777 = !{!107, !746, !773}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !740, file: !727, line: 537, baseType: !775, size: 32, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !740, file: !727, line: 539, baseType: !775, size: 32, offset: 160)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !740, file: !727, line: 541, baseType: !781, size: 32, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DISubroutineType(types: !783)
!783 = !{!107, !746, !761, !726, !732}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !740, file: !727, line: 544, baseType: !785, size: 32, offset: 224)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 32)
!786 = !DISubroutineType(types: !787)
!787 = !{!107, !746, !788, !136}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 32)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !727, line: 478, size: 96, elements: !790)
!790 = !{!791, !798, !803}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !789, file: !727, line: 482, baseType: !792, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !793, line: 33, baseType: !794)
!793 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !793, line: 29, size: 32, elements: !795)
!795 = !{!796}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !794, file: !793, line: 30, baseType: !797, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !789, file: !727, line: 485, baseType: !799, size: 32, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !727, line: 464, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 32)
!801 = !DISubroutineType(types: !802)
!802 = !{null, !746, !788, !773}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !789, file: !727, line: 493, baseType: !773, size: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !740, file: !727, line: 547, baseType: !805, size: 32, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!806 = !DISubroutineType(types: !807)
!807 = !{!108, !746}
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !810)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !727, line: 428, size: 32, elements: !811)
!811 = !{!812}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !810, file: !727, line: 434, baseType: !773, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !727, line: 441, size: 32, elements: !816)
!816 = !{!817}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !815, file: !727, line: 447, baseType: !773, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!819 = !{!721}
!820 = !DIFile(filename: "zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !455, line: 51, size: 64, elements: !823)
!823 = !{!824, !828}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !822, file: !455, line: 60, baseType: !825, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DISubroutineType(types: !827)
!827 = !{!107, !746}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !822, file: !455, line: 65, baseType: !746, size: 32, offset: 32)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "log_const_zbus", scope: !831, file: !835, line: 10, type: !836, isLocal: false, isDefinition: true)
!831 = distinct !DICompileUnit(language: DW_LANG_C99, file: !832, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !833, globals: !834, splitDebugInlining: false, nameTableKind: None)
!832 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/zbus/hello_world")
!833 = !{!102, !106, !107}
!834 = !{!829}
!835 = !DIFile(filename: "zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!836 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !406, line: 16, size: 64, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !837, file: !406, line: 17, baseType: !121, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !837, file: !406, line: 18, baseType: !190, size: 8, offset: 32)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !843, file: !915, line: 48, type: !988, isLocal: true, isDefinition: true)
!843 = distinct !DICompileUnit(language: DW_LANG_C99, file: !844, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !845, retainedTypes: !901, globals: !912, splitDebugInlining: false, nameTableKind: None)
!844 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/zbus/hello_world")
!845 = !{!30, !846}
!846 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !427, line: 69, baseType: !107, size: 32, elements: !847)
!847 = !{!848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900}
!848 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!849 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!850 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!851 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!852 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!853 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!854 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!855 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!856 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!857 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!858 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!859 = !DIEnumerator(name: "TAMPER_STAMP_IRQn", value: 2)
!860 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!861 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!862 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!863 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!864 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!865 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!866 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!867 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!868 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!869 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!870 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!871 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!872 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!873 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!874 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!875 = !DIEnumerator(name: "ADC1_IRQn", value: 18)
!876 = !DIEnumerator(name: "USB_HP_IRQn", value: 19)
!877 = !DIEnumerator(name: "USB_LP_IRQn", value: 20)
!878 = !DIEnumerator(name: "DAC_IRQn", value: 21)
!879 = !DIEnumerator(name: "COMP_IRQn", value: 22)
!880 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!881 = !DIEnumerator(name: "TIM9_IRQn", value: 25)
!882 = !DIEnumerator(name: "TIM10_IRQn", value: 26)
!883 = !DIEnumerator(name: "TIM11_IRQn", value: 27)
!884 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!885 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!886 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!887 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!888 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!889 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!890 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!891 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!892 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!893 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!894 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!895 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!896 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!897 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!898 = !DIEnumerator(name: "USB_FS_WKUP_IRQn", value: 42)
!899 = !DIEnumerator(name: "TIM6_IRQn", value: 43)
!900 = !DIEnumerator(name: "TIM7_IRQn", value: 44)
!901 = !{!137, !107, !106, !902}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !427, line: 270, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !427, line: 262, size: 192, elements: !905)
!905 = !{!906, !907, !908, !909, !910, !911}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !904, file: !427, line: 264, baseType: !431, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !904, file: !427, line: 265, baseType: !431, size: 32, offset: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !904, file: !427, line: 266, baseType: !431, size: 32, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !904, file: !427, line: 267, baseType: !431, size: 32, offset: 96)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !904, file: !427, line: 268, baseType: !431, size: 32, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !904, file: !427, line: 269, baseType: !431, size: 32, offset: 160)
!912 = !{!913, !919, !935, !946, !961, !841, !963, !976, !978, !980, !982, !984, !986}
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !843, file: !915, line: 424, type: !916, isLocal: false, isDefinition: true, align: 16)
!915 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 64, elements: !917)
!917 = !{!918}
!918 = !DISubrange(count: 4)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(name: "__device_dts_ord_32", scope: !843, file: !915, line: 424, type: !921, isLocal: false, isDefinition: true, align: 32)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !464, line: 378, size: 192, elements: !923)
!923 = !{!924, !925, !926, !927, !933, !934}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !922, file: !464, line: 380, baseType: !121, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !922, file: !464, line: 382, baseType: !13, size: 32, offset: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !922, file: !464, line: 384, baseType: !13, size: 32, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !922, file: !464, line: 386, baseType: !928, size: 32, offset: 96)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 32)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !464, line: 351, size: 16, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !929, file: !464, line: 359, baseType: !190, size: 8)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !929, file: !464, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !922, file: !464, line: 388, baseType: !106, size: 32, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !922, file: !464, line: 396, baseType: !477, size: 32, offset: 160)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_32", scope: !843, file: !915, line: 424, type: !937, isLocal: true, isDefinition: true, align: 32)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !455, line: 51, size: 64, elements: !939)
!939 = !{!940, !945}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !938, file: !455, line: 60, baseType: !941, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!942 = !DISubroutineType(types: !943)
!943 = !{!107, !944}
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !938, file: !455, line: 65, baseType: !944, size: 32, offset: 32)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "exti_data", scope: !843, file: !915, line: 423, type: !948, isLocal: true, isDefinition: true)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !915, line: 107, size: 1024, elements: !949)
!949 = !{!950}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !948, file: !915, line: 109, baseType: !951, size: 1024)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 1024, elements: !347)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !915, line: 101, size: 64, elements: !953)
!953 = !{!954, !960}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !952, file: !915, line: 102, baseType: !955, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !956, line: 63, baseType: !957)
!956 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !107, !106}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !952, file: !915, line: 103, baseType: !106, size: 32, offset: 32)
!961 = !DIGlobalVariableExpression(var: !962, expr: !DIExpression())
!962 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_32", scope: !843, file: !915, line: 424, type: !929, isLocal: true, isDefinition: true, align: 8)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !965, file: !915, line: 493, type: !970, isLocal: true, isDefinition: true, align: 32)
!965 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !915, file: !915, line: 460, type: !966, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !843, retainedNodes: !968)
!966 = !DISubroutineType(types: !967)
!967 = !{null, !944}
!968 = !{!969}
!969 = !DILocalVariable(name: "dev", arg: 1, scope: !965, file: !915, line: 460, type: !944)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !971)
!971 = !{!972, !973, !974, !975}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !970, file: !10, line: 55, baseType: !334, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !970, file: !10, line: 57, baseType: !334, size: 32, offset: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !970, file: !10, line: 59, baseType: !106, size: 32, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !970, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !965, file: !915, line: 497, type: !970, isLocal: true, isDefinition: true, align: 32)
!978 = !DIGlobalVariableExpression(var: !979, expr: !DIExpression())
!979 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !965, file: !915, line: 507, type: !970, isLocal: true, isDefinition: true, align: 32)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !965, file: !915, line: 512, type: !970, isLocal: true, isDefinition: true, align: 32)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !965, file: !915, line: 516, type: !970, isLocal: true, isDefinition: true, align: 32)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !965, file: !915, line: 523, type: !970, isLocal: true, isDefinition: true, align: 32)
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !965, file: !915, line: 527, type: !970, isLocal: true, isDefinition: true, align: 32)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !989, size: 512, elements: !347)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !427, line: 127, baseType: !846)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !993, file: !998, line: 21, type: !1018, isLocal: false, isDefinition: true, align: 16)
!993 = distinct !DICompileUnit(language: DW_LANG_C99, file: !994, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !995, splitDebugInlining: false, nameTableKind: None)
!994 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/zbus/hello_world/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/zbus/hello_world")
!995 = !{!996, !991, !1002, !1004, !1006, !1008, !1010, !1012, !1014, !1016}
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !993, file: !998, line: 16, type: !999, isLocal: false, isDefinition: true, align: 16)
!998 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/zbus/hello_world")
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 176, elements: !1000)
!1000 = !{!1001}
!1001 = !DISubrange(count: 11)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_17", scope: !993, file: !998, line: 28, type: !916, isLocal: false, isDefinition: true, align: 16)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !993, file: !998, line: 35, type: !916, isLocal: false, isDefinition: true, align: 16)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_53", scope: !993, file: !998, line: 42, type: !916, isLocal: false, isDefinition: true, align: 16)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_59", scope: !993, file: !998, line: 49, type: !916, isLocal: false, isDefinition: true, align: 16)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_15", scope: !993, file: !998, line: 56, type: !916, isLocal: false, isDefinition: true, align: 16)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !993, file: !998, line: 63, type: !916, isLocal: false, isDefinition: true, align: 16)
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !993, file: !998, line: 70, type: !916, isLocal: false, isDefinition: true, align: 16)
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !993, file: !998, line: 77, type: !916, isLocal: false, isDefinition: true, align: 16)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 48, elements: !380)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !1021, file: !1065, line: 398, type: !1098, isLocal: true, isDefinition: true)
