; ModuleID = 'build/adafruit_feather_m0_basic_proto/application_development/out_of_tree_driver/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.sam0_eic_data = type { [2 x %struct.sam0_eic_port_data], [16 x %struct.anon.10] }
%struct.sam0_eic_port_data = type { void (i32, i8*)*, i8* }
%struct.anon.10 = type { i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.uart_sam0_dev_cfg = type { %struct.SercomUsart*, i32, i32, i8, i32, i16, void (%struct.device*)*, %struct.pinctrl_dev_config* }
%struct.SercomUsart = type { %union.PORT_DIR_Type, %union.PORT_DIR_Type, [4 x i8], %union.SERCOM_USART_BAUD_Type, %union.PORT_PMUX_Type, [5 x i8], %union.PORT_PMUX_Type, [1 x i8], %union.PORT_PMUX_Type, [1 x i8], %union.PORT_PMUX_Type, [1 x i8], %union.SERCOM_USART_BAUD_Type, %union.PORT_DIR_Type, [8 x i8], %union.SERCOM_USART_BAUD_Type, [6 x i8], %union.PORT_PMUX_Type }
%union.PORT_DIR_Type = type { %union.anon.14 }
%union.anon.14 = type { i32 }
%union.SERCOM_USART_BAUD_Type = type { %union.anon.2 }
%union.anon.2 = type { i16 }
%union.PORT_PMUX_Type = type { %struct.anon.10 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/application_development/out_of_tree_driver/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/application_development/out_of_tree_driver")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/application_development/out_of_tree_driver")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "dev", scope: !27, file: !106, line: 11, type: !107, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !102, globals: !105, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/application_development/out_of_tree_driver/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/application_development/out_of_tree_driver")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_HELLO_WORLD", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_LAST", value: 67)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !{!25}
!106 = !DIFile(filename: "zephyr/samples/application_development/out_of_tree_driver/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !111)
!110 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !{!112, !116, !117, !118, !127, !128}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !109, file: !110, line: 380, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !109, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !109, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !109, file: !110, line: 386, baseType: !119, size: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !121)
!121 = !{!122, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !120, file: !110, line: 359, baseType: !123, size: 8)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !124)
!124 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !120, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!126 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !109, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !110, line: 43, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !133)
!133 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "_char_out", scope: !136, file: !139, line: 54, type: !140, isLocal: false, isDefinition: true)
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !102, globals: !138, splitDebugInlining: false, nameTableKind: None)
!137 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/application_development/out_of_tree_driver")
!138 = !{!134}
!139 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DISubroutineType(types: !142)
!142 = !{!104, !104}
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !145, file: !884, line: 202, type: !885, isLocal: true, isDefinition: true, align: 32)
!145 = distinct !DICompileUnit(language: DW_LANG_C99, file: !146, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !147, globals: !883, splitDebugInlining: false, nameTableKind: None)
!146 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/application_development/out_of_tree_driver")
!147 = !{!103, !104, !148, !275, !614, !615, !682}
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !150, line: 335, baseType: !151)
!150 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !150, line: 320, size: 288, elements: !152)
!152 = !{!153, !166, !174, !189, !200, !211, !215, !226, !227, !238, !239, !254, !255, !265}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !151, file: !150, line: 321, baseType: !154, size: 16)
!154 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !155)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !150, line: 50, baseType: !156)
!156 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !150, line: 43, size: 16, elements: !157)
!157 = !{!158, !165}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !156, file: !150, line: 48, baseType: !159, size: 16)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !156, file: !150, line: 44, size: 16, elements: !160)
!160 = !{!161, !164}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !159, file: !150, line: 45, baseType: !162, size: 7, flags: DIFlagBitField, extraData: i64 0)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !163)
!163 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !159, file: !150, line: 47, baseType: !162, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !156, file: !150, line: 49, baseType: !162, size: 16)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !151, file: !150, line: 322, baseType: !167, size: 16, offset: 16)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 16, elements: !172)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !169, line: 52, baseType: !170)
!169 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !123)
!172 = !{!173}
!173 = !DISubrange(count: 2)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !151, file: !150, line: 323, baseType: !175, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !150, line: 107, baseType: !177)
!177 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !150, line: 94, size: 32, elements: !178)
!178 = !{!179, !188}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !177, file: !150, line: 105, baseType: !180, size: 32)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !177, file: !150, line: 95, size: 32, elements: !181)
!181 = !{!182, !184, !185, !186, !187}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !180, file: !150, line: 97, baseType: !183, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !180, file: !150, line: 99, baseType: !183, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !180, file: !150, line: 100, baseType: !183, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !180, file: !150, line: 102, baseType: !183, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !180, file: !150, line: 103, baseType: !183, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !177, file: !150, line: 106, baseType: !183, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !151, file: !150, line: 324, baseType: !190, size: 32, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !150, line: 155, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !150, line: 148, size: 32, elements: !193)
!193 = !{!194, !199}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !192, file: !150, line: 153, baseType: !195, size: 32)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !192, file: !150, line: 149, size: 32, elements: !196)
!196 = !{!197, !198}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !195, file: !150, line: 150, baseType: !183, size: 16, flags: DIFlagBitField, extraData: i64 0)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !195, file: !150, line: 151, baseType: !183, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !192, file: !150, line: 154, baseType: !183, size: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !151, file: !150, line: 325, baseType: !201, size: 8, offset: 96)
!201 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !150, line: 194, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !150, line: 187, size: 8, elements: !204)
!204 = !{!205, !210}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !203, file: !150, line: 192, baseType: !206, size: 8)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !203, file: !150, line: 188, size: 8, elements: !207)
!207 = !{!208, !209}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !206, file: !150, line: 189, baseType: !123, size: 1, flags: DIFlagBitField, extraData: i64 0)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !206, file: !150, line: 190, baseType: !123, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !203, file: !150, line: 193, baseType: !123, size: 8)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !151, file: !150, line: 326, baseType: !212, size: 24, offset: 104)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 24, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 3)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !151, file: !150, line: 327, baseType: !216, size: 8, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !150, line: 215, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !150, line: 208, size: 8, elements: !219)
!219 = !{!220, !225}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !218, file: !150, line: 213, baseType: !221, size: 8)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !218, file: !150, line: 209, size: 8, elements: !222)
!222 = !{!223, !224}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !221, file: !150, line: 210, baseType: !123, size: 1, flags: DIFlagBitField, extraData: i64 0)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !221, file: !150, line: 211, baseType: !123, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !218, file: !150, line: 214, baseType: !123, size: 8)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !151, file: !150, line: 328, baseType: !212, size: 24, offset: 136)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !151, file: !150, line: 329, baseType: !228, size: 8, offset: 160)
!228 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !150, line: 236, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !150, line: 229, size: 8, elements: !231)
!231 = !{!232, !237}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !230, file: !150, line: 234, baseType: !233, size: 8)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !230, file: !150, line: 230, size: 8, elements: !234)
!234 = !{!235, !236}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !233, file: !150, line: 231, baseType: !170, size: 1, flags: DIFlagBitField, extraData: i64 0)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !233, file: !150, line: 232, baseType: !170, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !230, file: !150, line: 235, baseType: !123, size: 8)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !151, file: !150, line: 330, baseType: !212, size: 24, offset: 168)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !151, file: !150, line: 331, baseType: !240, size: 16, offset: 192)
!240 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !150, line: 262, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !150, line: 250, size: 16, elements: !243)
!243 = !{!244, !253}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !242, file: !150, line: 260, baseType: !245, size: 16)
!245 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !242, file: !150, line: 251, size: 16, elements: !246)
!246 = !{!247, !248, !249, !250, !251, !252}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !245, file: !150, line: 252, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !245, file: !150, line: 253, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !245, file: !150, line: 254, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !245, file: !150, line: 255, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !245, file: !150, line: 256, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !245, file: !150, line: 258, baseType: !162, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !242, file: !150, line: 261, baseType: !162, size: 16)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !151, file: !150, line: 332, baseType: !167, size: 16, offset: 208)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !151, file: !150, line: 333, baseType: !256, size: 32, offset: 224)
!256 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !257)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !150, line: 290, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !150, line: 284, size: 32, elements: !259)
!259 = !{!260, !264}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !258, file: !150, line: 288, baseType: !261, size: 32)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !258, file: !150, line: 285, size: 32, elements: !262)
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !261, file: !150, line: 286, baseType: !183, size: 22, flags: DIFlagBitField, extraData: i64 0)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !258, file: !150, line: 289, baseType: !183, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !151, file: !150, line: 334, baseType: !266, size: 16, offset: 256)
!266 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !267)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !150, line: 308, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !150, line: 303, size: 16, elements: !269)
!269 = !{!270, !274}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !268, file: !150, line: 306, baseType: !271, size: 16)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !268, file: !150, line: 304, size: 16, elements: !272)
!272 = !{!273}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !271, file: !150, line: 305, baseType: !162, size: 16, flags: DIFlagBitField, extraData: i64 0)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !268, file: !150, line: 307, baseType: !162, size: 16)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !277, line: 928, baseType: !278)
!277 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !277, line: 899, size: 672, elements: !279)
!279 = !{!280, !304, !328, !354, !379, !395, !396, !414, !415, !432, !443, !444, !459, !479, !480, !492, !504, !514, !515, !532, !536, !547, !548, !560, !572, !573, !584, !600}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !278, file: !277, line: 900, baseType: !281, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !282)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !277, line: 64, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 43, size: 32, elements: !284)
!284 = !{!285, !303}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !283, file: !277, line: 62, baseType: !286, size: 32)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !283, file: !277, line: 44, size: 32, elements: !287)
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !286, file: !277, line: 45, baseType: !183, size: 1, flags: DIFlagBitField, extraData: i64 0)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !286, file: !277, line: 46, baseType: !183, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !286, file: !277, line: 47, baseType: !183, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !286, file: !277, line: 48, baseType: !183, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !286, file: !277, line: 49, baseType: !183, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !286, file: !277, line: 50, baseType: !183, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !286, file: !277, line: 51, baseType: !183, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !286, file: !277, line: 52, baseType: !183, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !286, file: !277, line: 53, baseType: !183, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !286, file: !277, line: 54, baseType: !183, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !286, file: !277, line: 55, baseType: !183, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !286, file: !277, line: 56, baseType: !183, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !286, file: !277, line: 58, baseType: !183, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !286, file: !277, line: 59, baseType: !183, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !286, file: !277, line: 60, baseType: !183, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !283, file: !277, line: 63, baseType: !183, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !278, file: !277, line: 901, baseType: !305, size: 32, offset: 32)
!305 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !277, line: 125, baseType: !307)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 104, size: 32, elements: !308)
!308 = !{!309, !327}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !307, file: !277, line: 123, baseType: !310, size: 32)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !307, file: !277, line: 105, size: 32, elements: !311)
!311 = !{!312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !310, file: !277, line: 106, baseType: !183, size: 1, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !310, file: !277, line: 107, baseType: !183, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !310, file: !277, line: 108, baseType: !183, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !310, file: !277, line: 109, baseType: !183, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !310, file: !277, line: 110, baseType: !183, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !310, file: !277, line: 111, baseType: !183, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !310, file: !277, line: 112, baseType: !183, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !310, file: !277, line: 113, baseType: !183, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !310, file: !277, line: 114, baseType: !183, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !310, file: !277, line: 115, baseType: !183, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !310, file: !277, line: 116, baseType: !183, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !310, file: !277, line: 117, baseType: !183, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !310, file: !277, line: 119, baseType: !183, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !310, file: !277, line: 120, baseType: !183, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !310, file: !277, line: 121, baseType: !183, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !307, file: !277, line: 124, baseType: !183, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !278, file: !277, line: 902, baseType: !329, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !277, line: 186, baseType: !331)
!331 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 165, size: 32, elements: !332)
!332 = !{!333, !353}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !331, file: !277, line: 184, baseType: !334, size: 32)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !331, file: !277, line: 166, size: 32, elements: !335)
!335 = !{!336, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !334, file: !277, line: 167, baseType: !337, size: 1, flags: DIFlagBitField, extraData: i64 0)
!337 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !183)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !334, file: !277, line: 168, baseType: !337, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !334, file: !277, line: 169, baseType: !337, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !334, file: !277, line: 170, baseType: !337, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !334, file: !277, line: 171, baseType: !337, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !334, file: !277, line: 172, baseType: !337, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !334, file: !277, line: 173, baseType: !337, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !334, file: !277, line: 174, baseType: !337, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !334, file: !277, line: 175, baseType: !337, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !334, file: !277, line: 176, baseType: !337, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !334, file: !277, line: 177, baseType: !337, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !334, file: !277, line: 178, baseType: !337, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !334, file: !277, line: 180, baseType: !337, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !334, file: !277, line: 181, baseType: !337, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !334, file: !277, line: 182, baseType: !337, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !331, file: !277, line: 185, baseType: !183, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !278, file: !277, line: 903, baseType: !355, size: 32, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !356)
!356 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !357)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !277, line: 247, baseType: !358)
!358 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 226, size: 32, elements: !359)
!359 = !{!360, !378}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !358, file: !277, line: 245, baseType: !361, size: 32)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !358, file: !277, line: 227, size: 32, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !361, file: !277, line: 228, baseType: !183, size: 1, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !361, file: !277, line: 229, baseType: !183, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !361, file: !277, line: 230, baseType: !183, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !361, file: !277, line: 231, baseType: !183, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !361, file: !277, line: 232, baseType: !183, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !361, file: !277, line: 233, baseType: !183, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !361, file: !277, line: 234, baseType: !183, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !361, file: !277, line: 235, baseType: !183, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !361, file: !277, line: 236, baseType: !183, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !361, file: !277, line: 237, baseType: !183, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !361, file: !277, line: 238, baseType: !183, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !361, file: !277, line: 239, baseType: !183, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !361, file: !277, line: 241, baseType: !183, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !361, file: !277, line: 242, baseType: !183, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !361, file: !277, line: 243, baseType: !183, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !358, file: !277, line: 246, baseType: !183, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !278, file: !277, line: 904, baseType: !380, size: 16, offset: 128)
!380 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !277, line: 300, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 287, size: 16, elements: !383)
!383 = !{!384, !394}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !382, file: !277, line: 298, baseType: !385, size: 16)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !382, file: !277, line: 288, size: 16, elements: !386)
!386 = !{!387, !388, !389, !390, !391, !392, !393}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !385, file: !277, line: 290, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !385, file: !277, line: 291, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !385, file: !277, line: 293, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !385, file: !277, line: 294, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !385, file: !277, line: 295, baseType: !162, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !385, file: !277, line: 296, baseType: !162, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !385, file: !277, line: 297, baseType: !162, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !382, file: !277, line: 299, baseType: !162, size: 16)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !278, file: !277, line: 905, baseType: !167, size: 16, offset: 144)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !278, file: !277, line: 906, baseType: !397, size: 16, offset: 160)
!397 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !398)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !277, line: 352, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 336, size: 16, elements: !400)
!400 = !{!401, !413}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !399, file: !277, line: 350, baseType: !402, size: 16)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !399, file: !277, line: 337, size: 16, elements: !403)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !402, file: !277, line: 339, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !402, file: !277, line: 340, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !402, file: !277, line: 341, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !402, file: !277, line: 342, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !402, file: !277, line: 343, baseType: !162, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !402, file: !277, line: 344, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !402, file: !277, line: 345, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !402, file: !277, line: 346, baseType: !162, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !402, file: !277, line: 348, baseType: !162, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !399, file: !277, line: 351, baseType: !162, size: 16)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !278, file: !277, line: 907, baseType: !167, size: 16, offset: 176)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !278, file: !277, line: 908, baseType: !416, size: 32, offset: 192)
!416 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !417)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !277, line: 398, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 381, size: 32, elements: !419)
!419 = !{!420, !431}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !418, file: !277, line: 396, baseType: !421, size: 32)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !418, file: !277, line: 382, size: 32, elements: !422)
!422 = !{!423, !424, !425, !426, !427, !428, !429, !430}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !421, file: !277, line: 384, baseType: !183, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !421, file: !277, line: 385, baseType: !183, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !421, file: !277, line: 386, baseType: !183, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !421, file: !277, line: 388, baseType: !183, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !421, file: !277, line: 389, baseType: !183, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !421, file: !277, line: 390, baseType: !183, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !421, file: !277, line: 392, baseType: !183, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !421, file: !277, line: 394, baseType: !183, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !418, file: !277, line: 397, baseType: !183, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !278, file: !277, line: 909, baseType: !433, size: 8, offset: 224)
!433 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !277, line: 433, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 426, size: 8, elements: !436)
!436 = !{!437, !442}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !435, file: !277, line: 431, baseType: !438, size: 8)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !435, file: !277, line: 427, size: 8, elements: !439)
!439 = !{!440, !441}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !438, file: !277, line: 428, baseType: !123, size: 5, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !438, file: !277, line: 430, baseType: !123, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !435, file: !277, line: 432, baseType: !123, size: 8)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !278, file: !277, line: 910, baseType: !212, size: 24, offset: 232)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !278, file: !277, line: 911, baseType: !445, size: 32, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !277, line: 462, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 448, size: 32, elements: !448)
!448 = !{!449, !458}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !447, file: !277, line: 460, baseType: !450, size: 32)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !447, file: !277, line: 449, size: 32, elements: !451)
!451 = !{!452, !453, !454, !455, !456, !457}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !450, file: !277, line: 451, baseType: !183, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !450, file: !277, line: 453, baseType: !183, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !450, file: !277, line: 454, baseType: !183, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !450, file: !277, line: 455, baseType: !183, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !450, file: !277, line: 457, baseType: !183, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !450, file: !277, line: 459, baseType: !183, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !447, file: !277, line: 461, baseType: !183, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !278, file: !277, line: 912, baseType: !460, size: 16, offset: 288)
!460 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !461)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !277, line: 520, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 503, size: 16, elements: !463)
!463 = !{!464, !478}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !462, file: !277, line: 518, baseType: !465, size: 16)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !462, file: !277, line: 504, size: 16, elements: !466)
!466 = !{!467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !465, file: !277, line: 506, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !465, file: !277, line: 507, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !465, file: !277, line: 508, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !465, file: !277, line: 509, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !465, file: !277, line: 510, baseType: !162, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !465, file: !277, line: 511, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !465, file: !277, line: 512, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !465, file: !277, line: 513, baseType: !162, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !465, file: !277, line: 514, baseType: !162, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !465, file: !277, line: 515, baseType: !162, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !465, file: !277, line: 516, baseType: !162, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !462, file: !277, line: 519, baseType: !162, size: 16)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !278, file: !277, line: 913, baseType: !167, size: 16, offset: 304)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !278, file: !277, line: 914, baseType: !481, size: 32, offset: 320)
!481 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !277, line: 559, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 552, size: 32, elements: !484)
!484 = !{!485, !491}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !483, file: !277, line: 557, baseType: !486, size: 32)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !483, file: !277, line: 553, size: 32, elements: !487)
!487 = !{!488, !489, !490}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !486, file: !277, line: 554, baseType: !183, size: 10, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !486, file: !277, line: 555, baseType: !183, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !486, file: !277, line: 556, baseType: !183, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !483, file: !277, line: 558, baseType: !183, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !278, file: !277, line: 915, baseType: !493, size: 32, offset: 352)
!493 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !494)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !277, line: 585, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 578, size: 32, elements: !496)
!496 = !{!497, !503}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !495, file: !277, line: 583, baseType: !498, size: 32)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !495, file: !277, line: 579, size: 32, elements: !499)
!499 = !{!500, !501, !502}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !498, file: !277, line: 580, baseType: !183, size: 16, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !498, file: !277, line: 581, baseType: !183, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !498, file: !277, line: 582, baseType: !183, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !495, file: !277, line: 584, baseType: !183, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !278, file: !277, line: 916, baseType: !505, size: 8, offset: 384)
!505 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !506)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !277, line: 610, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 604, size: 8, elements: !508)
!508 = !{!509, !513}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !507, file: !277, line: 608, baseType: !510, size: 8)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !507, file: !277, line: 605, size: 8, elements: !511)
!511 = !{!512}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !510, file: !277, line: 607, baseType: !123, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !507, file: !277, line: 609, baseType: !123, size: 8)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !278, file: !277, line: 917, baseType: !212, size: 24, offset: 392)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !278, file: !277, line: 918, baseType: !516, size: 32, offset: 416)
!516 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !517)
!517 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !277, line: 639, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 622, size: 32, elements: !519)
!519 = !{!520, !531}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !518, file: !277, line: 637, baseType: !521, size: 32)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !518, file: !277, line: 623, size: 32, elements: !522)
!522 = !{!523, !524, !525, !526, !527, !528, !529, !530}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !521, file: !277, line: 625, baseType: !183, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !521, file: !277, line: 626, baseType: !183, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !521, file: !277, line: 627, baseType: !183, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !521, file: !277, line: 629, baseType: !183, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !521, file: !277, line: 631, baseType: !183, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !521, file: !277, line: 632, baseType: !183, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !521, file: !277, line: 634, baseType: !183, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !521, file: !277, line: 635, baseType: !183, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !518, file: !277, line: 638, baseType: !183, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !278, file: !277, line: 919, baseType: !533, size: 32, offset: 448)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 32, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 4)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !278, file: !277, line: 920, baseType: !537, size: 16, offset: 480)
!537 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !538)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !277, line: 715, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 706, size: 16, elements: !540)
!540 = !{!541, !546}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !539, file: !277, line: 713, baseType: !542, size: 16)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !539, file: !277, line: 707, size: 16, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !542, file: !277, line: 709, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !542, file: !277, line: 711, baseType: !162, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !539, file: !277, line: 714, baseType: !162, size: 16)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !278, file: !277, line: 921, baseType: !167, size: 16, offset: 496)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !278, file: !277, line: 922, baseType: !549, size: 32, offset: 512)
!549 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !277, line: 739, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 729, size: 32, elements: !552)
!552 = !{!553, !559}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !551, file: !277, line: 737, baseType: !554, size: 32)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !551, file: !277, line: 730, size: 32, elements: !555)
!555 = !{!556, !557, !558}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !554, file: !277, line: 732, baseType: !183, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !554, file: !277, line: 733, baseType: !183, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !554, file: !277, line: 735, baseType: !183, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !551, file: !277, line: 738, baseType: !183, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !278, file: !277, line: 923, baseType: !561, size: 8, offset: 544)
!561 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !277, line: 765, baseType: !563)
!563 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 756, size: 8, elements: !564)
!564 = !{!565, !571}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !563, file: !277, line: 763, baseType: !566, size: 8)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !563, file: !277, line: 757, size: 8, elements: !567)
!567 = !{!568, !569, !570}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !566, file: !277, line: 759, baseType: !123, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !566, file: !277, line: 761, baseType: !123, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !566, file: !277, line: 762, baseType: !123, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !563, file: !277, line: 764, baseType: !123, size: 8)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !278, file: !277, line: 924, baseType: !212, size: 24, offset: 552)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !278, file: !277, line: 925, baseType: !574, size: 32, offset: 576)
!574 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !277, line: 789, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 781, size: 32, elements: !577)
!577 = !{!578, !583}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !576, file: !277, line: 787, baseType: !579, size: 32)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !576, file: !277, line: 782, size: 32, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !579, file: !277, line: 783, baseType: !183, size: 12, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !579, file: !277, line: 785, baseType: !183, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !576, file: !277, line: 788, baseType: !183, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !278, file: !277, line: 926, baseType: !585, size: 32, offset: 608)
!585 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !277, line: 820, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 805, size: 32, elements: !588)
!588 = !{!589, !599}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !587, file: !277, line: 818, baseType: !590, size: 32)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !587, file: !277, line: 806, size: 32, elements: !591)
!591 = !{!592, !593, !594, !595, !596, !597, !598}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !590, file: !277, line: 807, baseType: !183, size: 2, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !590, file: !277, line: 808, baseType: !183, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !590, file: !277, line: 809, baseType: !183, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !590, file: !277, line: 810, baseType: !183, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !590, file: !277, line: 812, baseType: !183, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !590, file: !277, line: 814, baseType: !183, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !590, file: !277, line: 816, baseType: !183, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !587, file: !277, line: 819, baseType: !183, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !278, file: !277, line: 927, baseType: !601, size: 8, offset: 640)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !277, line: 881, baseType: !604)
!604 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !277, line: 872, size: 8, elements: !605)
!605 = !{!606, !613}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !604, file: !277, line: 879, baseType: !607, size: 8)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !604, file: !277, line: 873, size: 8, elements: !608)
!608 = !{!609, !610, !611, !612}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !607, file: !277, line: 874, baseType: !123, size: 1, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !607, file: !277, line: 875, baseType: !123, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !607, file: !277, line: 876, baseType: !123, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !607, file: !277, line: 877, baseType: !123, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !604, file: !277, line: 880, baseType: !123, size: 8)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !617, line: 290, baseType: !618)
!617 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !617, line: 284, size: 96, elements: !619)
!619 = !{!620, !630, !641, !654, !671}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !618, file: !617, line: 285, baseType: !621, size: 8)
!621 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !617, line: 49, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !617, line: 43, size: 8, elements: !624)
!624 = !{!625, !629}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !623, file: !617, line: 47, baseType: !626, size: 8)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !623, file: !617, line: 44, size: 8, elements: !627)
!627 = !{!628}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !626, file: !617, line: 45, baseType: !123, size: 1, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !623, file: !617, line: 48, baseType: !123, size: 8)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !618, file: !617, line: 286, baseType: !631, size: 8, offset: 8)
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !632)
!632 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !617, line: 67, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !617, line: 61, size: 8, elements: !635)
!635 = !{!636, !640}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !634, file: !617, line: 65, baseType: !637, size: 8)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !634, file: !617, line: 62, size: 8, elements: !638)
!638 = !{!639}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !637, file: !617, line: 64, baseType: !123, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !634, file: !617, line: 66, baseType: !123, size: 8)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !618, file: !617, line: 287, baseType: !642, size: 16, offset: 16)
!642 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !617, line: 89, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !617, line: 79, size: 16, elements: !645)
!645 = !{!646, !653}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !644, file: !617, line: 87, baseType: !647, size: 16)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !644, file: !617, line: 80, size: 16, elements: !648)
!648 = !{!649, !650, !651, !652}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !647, file: !617, line: 81, baseType: !162, size: 6, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !647, file: !617, line: 83, baseType: !162, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !647, file: !617, line: 85, baseType: !162, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !647, file: !617, line: 86, baseType: !162, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !644, file: !617, line: 88, baseType: !162, size: 16)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !618, file: !617, line: 288, baseType: !655, size: 32, offset: 32)
!655 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !617, line: 214, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !617, line: 199, size: 32, elements: !658)
!658 = !{!659, !670}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !657, file: !617, line: 212, baseType: !660, size: 32)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !657, file: !617, line: 200, size: 32, elements: !661)
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !660, file: !617, line: 201, baseType: !183, size: 4, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !660, file: !617, line: 203, baseType: !183, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !660, file: !617, line: 205, baseType: !183, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !660, file: !617, line: 206, baseType: !183, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !660, file: !617, line: 207, baseType: !183, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !660, file: !617, line: 208, baseType: !183, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !660, file: !617, line: 209, baseType: !183, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !660, file: !617, line: 210, baseType: !183, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !657, file: !617, line: 213, baseType: !183, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !618, file: !617, line: 289, baseType: !672, size: 32, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !617, line: 268, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !617, line: 260, size: 32, elements: !675)
!675 = !{!676, !681}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !674, file: !617, line: 266, baseType: !677, size: 32)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !674, file: !617, line: 261, size: 32, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !677, file: !617, line: 262, baseType: !183, size: 4, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !677, file: !617, line: 264, baseType: !183, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !674, file: !617, line: 267, baseType: !183, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !684, line: 513, baseType: !685)
!684 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 494, size: 480, elements: !686)
!686 = !{!687, !693, !703, !707, !717, !727, !737, !747, !751, !767, !783, !799, !829, !833, !843, !853, !863, !867}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !685, file: !684, line: 495, baseType: !688, size: 8)
!688 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !684, line: 45, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !684, line: 43, size: 8, elements: !691)
!691 = !{!692}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !690, file: !684, line: 44, baseType: !123, size: 8)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !685, file: !684, line: 496, baseType: !694, size: 8, offset: 8)
!694 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !684, line: 61, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !684, line: 55, size: 8, elements: !697)
!697 = !{!698, !702}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !696, file: !684, line: 59, baseType: !699, size: 8)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !696, file: !684, line: 56, size: 8, elements: !700)
!700 = !{!701}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "IDLE", scope: !699, file: !684, line: 57, baseType: !123, size: 2, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !696, file: !684, line: 60, baseType: !123, size: 8)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !685, file: !684, line: 497, baseType: !704, size: 48, offset: 16)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 48, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 6)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "CPUSEL", scope: !685, file: !684, line: 498, baseType: !708, size: 8, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CPUSEL_Type", file: !684, line: 86, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !684, line: 80, size: 8, elements: !711)
!711 = !{!712, !716}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !710, file: !684, line: 84, baseType: !713, size: 8)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !710, file: !684, line: 81, size: 8, elements: !714)
!714 = !{!715}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "CPUDIV", scope: !713, file: !684, line: 82, baseType: !123, size: 3, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !710, file: !684, line: 85, baseType: !123, size: 8)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "APBASEL", scope: !685, file: !684, line: 499, baseType: !718, size: 8, offset: 72)
!718 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBASEL_Type", file: !684, line: 121, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !684, line: 115, size: 8, elements: !721)
!721 = !{!722, !726}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !720, file: !684, line: 119, baseType: !723, size: 8)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !720, file: !684, line: 116, size: 8, elements: !724)
!724 = !{!725}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "APBADIV", scope: !723, file: !684, line: 117, baseType: !123, size: 3, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !720, file: !684, line: 120, baseType: !123, size: 8)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "APBBSEL", scope: !685, file: !684, line: 500, baseType: !728, size: 8, offset: 80)
!728 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !729)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBSEL_Type", file: !684, line: 156, baseType: !730)
!730 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !684, line: 150, size: 8, elements: !731)
!731 = !{!732, !736}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !730, file: !684, line: 154, baseType: !733, size: 8)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !730, file: !684, line: 151, size: 8, elements: !734)
!734 = !{!735}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "APBBDIV", scope: !733, file: !684, line: 152, baseType: !123, size: 3, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !730, file: !684, line: 155, baseType: !123, size: 8)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "APBCSEL", scope: !685, file: !684, line: 501, baseType: !738, size: 8, offset: 88)
!738 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !739)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCSEL_Type", file: !684, line: 191, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !684, line: 185, size: 8, elements: !741)
!741 = !{!742, !746}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !740, file: !684, line: 189, baseType: !743, size: 8)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !740, file: !684, line: 186, size: 8, elements: !744)
!744 = !{!745}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "APBCDIV", scope: !743, file: !684, line: 187, baseType: !123, size: 3, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !740, file: !684, line: 190, baseType: !123, size: 8)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !685, file: !684, line: 502, baseType: !748, size: 64, offset: 96)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 64, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 8)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "AHBMASK", scope: !685, file: !684, line: 503, baseType: !752, size: 32, offset: 160)
!752 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_AHBMASK_Type", file: !684, line: 232, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !684, line: 220, size: 32, elements: !755)
!755 = !{!756, !766}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !754, file: !684, line: 230, baseType: !757, size: 32)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !754, file: !684, line: 221, size: 32, elements: !758)
!758 = !{!759, !760, !761, !762, !763, !764, !765}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "HPB0_", scope: !757, file: !684, line: 222, baseType: !183, size: 1, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "HPB1_", scope: !757, file: !684, line: 223, baseType: !183, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "HPB2_", scope: !757, file: !684, line: 224, baseType: !183, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !757, file: !684, line: 225, baseType: !183, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !757, file: !684, line: 226, baseType: !183, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !757, file: !684, line: 227, baseType: !183, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !757, file: !684, line: 228, baseType: !183, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !754, file: !684, line: 231, baseType: !183, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "APBAMASK", scope: !685, file: !684, line: 504, baseType: !768, size: 32, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBAMASK_Type", file: !684, line: 268, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !684, line: 256, size: 32, elements: !771)
!771 = !{!772, !782}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !770, file: !684, line: 266, baseType: !773, size: 32)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !770, file: !684, line: 257, size: 32, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780, !781}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "PAC0_", scope: !773, file: !684, line: 258, baseType: !183, size: 1, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "PM_", scope: !773, file: !684, line: 259, baseType: !183, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "SYSCTRL_", scope: !773, file: !684, line: 260, baseType: !183, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK_", scope: !773, file: !684, line: 261, baseType: !183, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_", scope: !773, file: !684, line: 262, baseType: !183, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "RTC_", scope: !773, file: !684, line: 263, baseType: !183, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "EIC_", scope: !773, file: !684, line: 264, baseType: !183, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !770, file: !684, line: 267, baseType: !183, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "APBBMASK", scope: !685, file: !684, line: 505, baseType: !784, size: 32, offset: 224)
!784 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBBMASK_Type", file: !684, line: 304, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !684, line: 292, size: 32, elements: !787)
!787 = !{!788, !798}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !786, file: !684, line: 302, baseType: !789, size: 32)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !786, file: !684, line: 293, size: 32, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "PAC1_", scope: !789, file: !684, line: 294, baseType: !183, size: 1, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "DSU_", scope: !789, file: !684, line: 295, baseType: !183, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "NVMCTRL_", scope: !789, file: !684, line: 296, baseType: !183, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "PORT_", scope: !789, file: !684, line: 297, baseType: !183, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "DMAC_", scope: !789, file: !684, line: 298, baseType: !183, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "USB_", scope: !789, file: !684, line: 299, baseType: !183, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "HMATRIX_", scope: !789, file: !684, line: 300, baseType: !183, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !786, file: !684, line: 303, baseType: !183, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "APBCMASK", scope: !685, file: !684, line: 506, baseType: !800, size: 32, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_APBCMASK_Type", file: !684, line: 354, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !684, line: 328, size: 32, elements: !803)
!803 = !{!804, !828}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !802, file: !684, line: 352, baseType: !805, size: 32)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !802, file: !684, line: 329, size: 32, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "PAC2_", scope: !805, file: !684, line: 330, baseType: !183, size: 1, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "EVSYS_", scope: !805, file: !684, line: 331, baseType: !183, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM0_", scope: !805, file: !684, line: 332, baseType: !183, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM1_", scope: !805, file: !684, line: 333, baseType: !183, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM2_", scope: !805, file: !684, line: 334, baseType: !183, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM3_", scope: !805, file: !684, line: 335, baseType: !183, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM4_", scope: !805, file: !684, line: 336, baseType: !183, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "SERCOM5_", scope: !805, file: !684, line: 337, baseType: !183, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "TCC0_", scope: !805, file: !684, line: 338, baseType: !183, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "TCC1_", scope: !805, file: !684, line: 339, baseType: !183, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "TCC2_", scope: !805, file: !684, line: 340, baseType: !183, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "TC3_", scope: !805, file: !684, line: 341, baseType: !183, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "TC4_", scope: !805, file: !684, line: 342, baseType: !183, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "TC5_", scope: !805, file: !684, line: 343, baseType: !183, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "TC6_", scope: !805, file: !684, line: 344, baseType: !183, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "TC7_", scope: !805, file: !684, line: 345, baseType: !183, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ADC_", scope: !805, file: !684, line: 346, baseType: !183, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "AC_", scope: !805, file: !684, line: 347, baseType: !183, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "DAC_", scope: !805, file: !684, line: 348, baseType: !183, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "PTC_", scope: !805, file: !684, line: 349, baseType: !183, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "I2S_", scope: !805, file: !684, line: 350, baseType: !183, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !802, file: !684, line: 353, baseType: !183, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !685, file: !684, line: 507, baseType: !830, size: 128, offset: 288)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 128, elements: !831)
!831 = !{!832}
!832 = !DISubrange(count: 16)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !685, file: !684, line: 508, baseType: !834, size: 8, offset: 416)
!834 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENCLR_Type", file: !684, line: 412, baseType: !836)
!836 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !684, line: 406, size: 8, elements: !837)
!837 = !{!838, !842}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !836, file: !684, line: 410, baseType: !839, size: 8)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !836, file: !684, line: 407, size: 8, elements: !840)
!840 = !{!841}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !839, file: !684, line: 408, baseType: !123, size: 1, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !836, file: !684, line: 411, baseType: !123, size: 8)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !685, file: !684, line: 509, baseType: !844, size: 8, offset: 424)
!844 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTENSET_Type", file: !684, line: 430, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !684, line: 424, size: 8, elements: !847)
!847 = !{!848, !852}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !846, file: !684, line: 428, baseType: !849, size: 8)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !846, file: !684, line: 425, size: 8, elements: !850)
!850 = !{!851}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !849, file: !684, line: 426, baseType: !123, size: 1, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !846, file: !684, line: 429, baseType: !123, size: 8)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !685, file: !684, line: 510, baseType: !854, size: 8, offset: 432)
!854 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_INTFLAG_Type", file: !684, line: 448, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !684, line: 442, size: 8, elements: !857)
!857 = !{!858, !862}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !856, file: !684, line: 446, baseType: !859, size: 8)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !856, file: !684, line: 443, size: 8, elements: !860)
!860 = !{!861}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "CKRDY", scope: !859, file: !684, line: 444, baseType: !170, size: 1, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !856, file: !684, line: 447, baseType: !123, size: 8)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !685, file: !684, line: 511, baseType: !864, size: 8, offset: 440)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !168, size: 8, elements: !865)
!865 = !{!866}
!866 = !DISubrange(count: 1)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "RCAUSE", scope: !685, file: !684, line: 512, baseType: !868, size: 8, offset: 448)
!868 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !870)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_RCAUSE_Type", file: !684, line: 472, baseType: !871)
!871 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !684, line: 460, size: 8, elements: !872)
!872 = !{!873, !882}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !871, file: !684, line: 470, baseType: !874, size: 8)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !871, file: !684, line: 461, size: 8, elements: !875)
!875 = !{!876, !877, !878, !879, !880, !881}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "POR", scope: !874, file: !684, line: 462, baseType: !123, size: 1, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "BOD12", scope: !874, file: !684, line: 463, baseType: !123, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !874, file: !684, line: 464, baseType: !123, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "EXT", scope: !874, file: !684, line: 466, baseType: !123, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "WDT", scope: !874, file: !684, line: 467, baseType: !123, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "SYST", scope: !874, file: !684, line: 468, baseType: !123, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !871, file: !684, line: 471, baseType: !123, size: 8)
!883 = !{!143}
!884 = !DIFile(filename: "zephyr/soc/arm/atmel_sam0/common/soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!885 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !887, line: 51, size: 64, elements: !888)
!887 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
