; ModuleID = 'build/96b_wistrio/drivers/ipm/ipm_mcux/remote/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.stm32_exti_data = type { [16 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %union.anon.1, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/drivers/ipm/ipm_mcux/remote/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/drivers/ipm/ipm_mcux/remote")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/drivers/ipm/ipm_mcux/remote")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/drivers/ipm/ipm_mcux/remote")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_stm32l1_init", scope: !111, file: !142, line: 60, type: !143, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !141, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/drivers/ipm/ipm_mcux/remote")
!113 = !{!114, !135}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 386, baseType: !117)
!116 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l151xba.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 370, size: 448, elements: !118)
!118 = !{!119, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !117, file: !116, line: 372, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !117, file: !116, line: 373, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !117, file: !116, line: 374, baseType: !120, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !117, file: !116, line: 375, baseType: !120, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !117, file: !116, line: 376, baseType: !120, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !117, file: !116, line: 377, baseType: !120, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !117, file: !116, line: 378, baseType: !120, size: 32, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !117, file: !116, line: 379, baseType: !120, size: 32, offset: 224)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !117, file: !116, line: 380, baseType: !120, size: 32, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !117, file: !116, line: 381, baseType: !120, size: 32, offset: 288)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !117, file: !116, line: 382, baseType: !120, size: 32, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !117, file: !116, line: 383, baseType: !120, size: 32, offset: 352)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !117, file: !116, line: 384, baseType: !120, size: 32, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !117, file: !116, line: 385, baseType: !120, size: 32, offset: 416)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !116, line: 364, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 360, size: 64, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !137, file: !116, line: 362, baseType: !120, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !137, file: !116, line: 363, baseType: !120, size: 32, offset: 32)
!141 = !{!109}
!142 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = !{!147, !178}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !144, file: !145, line: 60, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DISubroutineType(types: !150)
!150 = !{!103, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !155)
!154 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!155 = !{!156, !160, !161, !162, !171, !172}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !154, line: 380, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !153, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !153, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !153, file: !154, line: 386, baseType: !163, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !165)
!165 = !{!166, !169}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !164, file: !154, line: 359, baseType: !167, size: 8)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !168)
!168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !164, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!170 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !153, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !153, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !154, line: 43, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !177)
!177 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !144, file: !145, line: 65, baseType: !151, size: 32, offset: 32)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !181, file: !184, line: 71, type: !185, isLocal: true, isDefinition: true, align: 32)
!181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !182, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !183, splitDebugInlining: false, nameTableKind: None)
!182 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/drivers/ipm/ipm_mcux/remote")
!183 = !{!179}
!184 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !187)
!187 = !{!188, !207}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !186, file: !145, line: 60, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = !DISubroutineType(types: !191)
!191 = !{!103, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !195)
!195 = !{!196, !197, !198, !199, !205, !206}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !154, line: 380, baseType: !157, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !194, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !194, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !194, file: !154, line: 386, baseType: !200, size: 32, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !201, file: !154, line: 359, baseType: !167, size: 8)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !201, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !194, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !194, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !186, file: !145, line: 65, baseType: !192, size: 32, offset: 32)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "static_regions", scope: !210, file: !219, line: 62, type: !360, isLocal: true, isDefinition: true)
!210 = distinct !DICompileUnit(language: DW_LANG_C99, file: !211, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !212, globals: !215, splitDebugInlining: false, nameTableKind: None)
!211 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/drivers/ipm/ipm_mcux/remote")
!212 = !{!213, !103, !121, !102}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !214, line: 214, baseType: !32)
!214 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = !{!216, !208}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !218, file: !219, line: 198, type: !346, isLocal: true, isDefinition: true)
!218 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !219, file: !219, line: 175, type: !220, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !210, retainedNodes: !341)
!219 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!220 = !DISubroutineType(types: !221)
!221 = !{null, !222}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !224, line: 245, size: 1024, elements: !225)
!224 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!225 = !{!226, !295, !308, !309, !310, !311, !317, !336}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !223, file: !224, line: 247, baseType: !227, size: 384)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !224, line: 57, size: 384, elements: !228)
!228 = !{!229, !257, !265, !266, !267, !280, !281, !282}
!229 = !DIDerivedType(tag: DW_TAG_member, scope: !227, file: !224, line: 60, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !227, file: !224, line: 60, size: 64, elements: !231)
!231 = !{!232, !248}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !230, file: !224, line: 61, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !234, line: 49, baseType: !235)
!234 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !234, line: 37, size: 64, elements: !236)
!236 = !{!237, !243}
!237 = !DIDerivedType(tag: DW_TAG_member, scope: !235, file: !234, line: 38, baseType: !238, size: 32)
!238 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !235, file: !234, line: 38, size: 32, elements: !239)
!239 = !{!240, !242}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !238, file: !234, line: 39, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !234, line: 40, baseType: !241, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, scope: !235, file: !234, line: 42, baseType: !244, size: 32, offset: 32)
!244 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !235, file: !234, line: 42, size: 32, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !244, file: !234, line: 43, baseType: !241, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !244, file: !234, line: 44, baseType: !241, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !230, file: !224, line: 62, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !250, line: 49, size: 64, elements: !251)
!250 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !249, file: !250, line: 50, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 64, elements: !255)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!255 = !{!256}
!256 = !DISubrange(count: 2)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !227, file: !224, line: 68, baseType: !258, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !260, line: 233, baseType: !261)
!260 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !260, line: 231, size: 64, elements: !262)
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !261, file: !260, line: 232, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !234, line: 48, baseType: !235)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !227, file: !224, line: 71, baseType: !167, size: 8, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !227, file: !224, line: 74, baseType: !167, size: 8, offset: 104)
!267 = !DIDerivedType(tag: DW_TAG_member, scope: !227, file: !224, line: 90, baseType: !268, size: 16, offset: 112)
!268 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !227, file: !224, line: 90, size: 16, elements: !269)
!269 = !{!270, !277}
!270 = !DIDerivedType(tag: DW_TAG_member, scope: !268, file: !224, line: 91, baseType: !271, size: 16)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !268, file: !224, line: 91, size: 16, elements: !272)
!272 = !{!273, !276}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !271, file: !224, line: 96, baseType: !274, size: 8)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !275)
!275 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !271, file: !224, line: 97, baseType: !167, size: 8, offset: 8)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !268, file: !224, line: 100, baseType: !278, size: 16)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !279)
!279 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !227, file: !224, line: 107, baseType: !121, size: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !227, file: !224, line: 127, baseType: !102, size: 32, offset: 160)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !227, file: !224, line: 131, baseType: !283, size: 192, offset: 192)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !260, line: 244, size: 192, elements: !284)
!284 = !{!285, !286, !292}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !283, file: !260, line: 245, baseType: !233, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !283, file: !260, line: 246, baseType: !287, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !260, line: 242, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !291}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !283, file: !260, line: 249, baseType: !293, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !294)
!294 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !223, file: !224, line: 250, baseType: !296, size: 288, offset: 384)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !297, line: 25, size: 288, elements: !298)
!297 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !296, file: !297, line: 26, baseType: !121, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !296, file: !297, line: 27, baseType: !121, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !296, file: !297, line: 28, baseType: !121, size: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !296, file: !297, line: 29, baseType: !121, size: 32, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !296, file: !297, line: 30, baseType: !121, size: 32, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !296, file: !297, line: 31, baseType: !121, size: 32, offset: 160)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !296, file: !297, line: 32, baseType: !121, size: 32, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !296, file: !297, line: 33, baseType: !121, size: 32, offset: 224)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !296, file: !297, line: 34, baseType: !121, size: 32, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !223, file: !224, line: 253, baseType: !102, size: 32, offset: 672)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !223, file: !224, line: 256, baseType: !259, size: 64, offset: 704)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !223, file: !224, line: 294, baseType: !103, size: 32, offset: 768)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !223, file: !224, line: 300, baseType: !312, size: 96, offset: 800)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !224, line: 149, size: 96, elements: !313)
!313 = !{!314, !315, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !312, file: !224, line: 153, baseType: !22, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !312, file: !224, line: 162, baseType: !213, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !312, file: !224, line: 168, baseType: !213, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !223, file: !224, line: 325, baseType: !318, size: 32, offset: 896)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !320, line: 5073, size: 160, elements: !321)
!320 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!321 = !{!322, !331, !332}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !319, file: !320, line: 5074, baseType: !323, size: 96)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !324, line: 56, size: 96, elements: !325)
!324 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!325 = !{!326, !329, !330}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !323, file: !324, line: 57, baseType: !327, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !324, line: 57, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !323, file: !324, line: 58, baseType: !102, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !323, file: !324, line: 59, baseType: !213, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !319, file: !320, line: 5075, baseType: !259, size: 64, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !319, file: !320, line: 5076, baseType: !333, offset: 160)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !334, line: 43, elements: !335)
!334 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = !{}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !223, file: !224, line: 343, baseType: !337, size: 64, offset: 928)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !297, line: 60, size: 64, elements: !338)
!338 = !{!339, !340}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !337, file: !297, line: 63, baseType: !121, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !337, file: !297, line: 66, baseType: !121, size: 32, offset: 32)
!341 = !{!342, !343, !344, !345}
!342 = !DILocalVariable(name: "thread", arg: 1, scope: !218, file: !219, line: 175, type: !222)
!343 = !DILocalVariable(name: "region_num", scope: !218, file: !219, line: 200, type: !167)
!344 = !DILocalVariable(name: "guard_start", scope: !218, file: !219, line: 265, type: !22)
!345 = !DILocalVariable(name: "guard_size", scope: !218, file: !219, line: 266, type: !213)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !347, size: 96, elements: !358)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !348, line: 52, size: 96, elements: !349)
!348 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!349 = !{!350, !351, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !347, file: !348, line: 53, baseType: !22, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !347, file: !348, line: 54, baseType: !213, size: 32, offset: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !347, file: !348, line: 55, baseType: !353, size: 32, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !354, line: 151, baseType: !355)
!354 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !354, line: 149, size: 32, elements: !356)
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !355, file: !354, line: 150, baseType: !121, size: 32)
!358 = !{!359}
!359 = !DISubrange(count: 1)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 96, elements: !358)
!361 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !364, file: !397, line: 39, type: !167, isLocal: true, isDefinition: true)
!364 = distinct !DICompileUnit(language: DW_LANG_C99, file: !365, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !366, globals: !396, splitDebugInlining: false, nameTableKind: None)
!365 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/drivers/ipm/ipm_mcux/remote")
!366 = !{!367, !102, !103, !384, !167}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !369, line: 1168, baseType: !370)
!369 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !369, line: 1155, size: 352, elements: !371)
!371 = !{!372, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !370, file: !369, line: 1157, baseType: !373, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !370, file: !369, line: 1158, baseType: !120, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !370, file: !369, line: 1159, baseType: !120, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !370, file: !369, line: 1160, baseType: !120, size: 32, offset: 96)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !370, file: !369, line: 1161, baseType: !120, size: 32, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !370, file: !369, line: 1162, baseType: !120, size: 32, offset: 160)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !370, file: !369, line: 1163, baseType: !120, size: 32, offset: 192)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !370, file: !369, line: 1164, baseType: !120, size: 32, offset: 224)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !370, file: !369, line: 1165, baseType: !120, size: 32, offset: 256)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !370, file: !369, line: 1166, baseType: !120, size: 32, offset: 288)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !370, file: !369, line: 1167, baseType: !120, size: 32, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !386)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !387, line: 27, size: 96, elements: !388)
!387 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!388 = !{!389, !390, !391}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !386, file: !387, line: 29, baseType: !121, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !386, file: !387, line: 31, baseType: !157, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !386, file: !387, line: 37, baseType: !392, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !354, line: 146, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !354, line: 141, size: 32, elements: !394)
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !393, file: !354, line: 143, baseType: !121, size: 32)
!396 = !{!362}
!397 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !400, file: !405, line: 13, type: !422, isLocal: true, isDefinition: true)
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !402, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/drivers/ipm/ipm_mcux/remote")
!402 = !{!403, !398}
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "mpu_config", scope: !400, file: !405, line: 37, type: !406, isLocal: false, isDefinition: true)
!405 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !387, line: 41, size: 64, elements: !408)
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !407, file: !387, line: 43, baseType: !121, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !407, file: !387, line: 45, baseType: !411, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !387, line: 27, size: 96, elements: !414)
!414 = !{!415, !416, !417}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !413, file: !387, line: 29, baseType: !121, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !413, file: !387, line: 31, baseType: !157, size: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !413, file: !387, line: 37, baseType: !418, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !354, line: 146, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !354, line: 141, size: 32, elements: !420)
!420 = !{!421}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !419, file: !354, line: 143, baseType: !121, size: 32)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 192, elements: !255)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "__init_rf_init", scope: !425, file: !522, line: 36, type: !523, isLocal: true, isDefinition: true, align: 32)
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !427, retainedTypes: !439, globals: !521, splitDebugInlining: false, nameTableKind: None)
!426 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/drivers/ipm/ipm_mcux/remote")
!427 = !{!428, !434}
!428 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !429, line: 506, baseType: !32, size: 32, elements: !430)
!429 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!430 = !{!431, !432, !433}
!431 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!432 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!433 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!434 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !429, line: 512, baseType: !32, size: 32, elements: !435)
!435 = !{!436, !437, !438}
!436 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!437 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!438 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!439 = !{!440, !510, !515, !475, !434, !428, !520, !102}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !429, line: 523, size: 288, elements: !443)
!443 = !{!444, !465, !471, !476, !480, !481, !482, !486, !506}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !442, file: !429, line: 524, baseType: !445, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!446 = !DISubroutineType(types: !447)
!447 = !{!103, !448, !463, !464}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !450)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !451)
!451 = !{!452, !453, !454, !455, !461, !462}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !450, file: !154, line: 380, baseType: !157, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !450, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !450, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !450, file: !154, line: 386, baseType: !456, size: 32, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 32)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !457, file: !154, line: 359, baseType: !167, size: 8)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !457, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !450, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !450, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !429, line: 237, baseType: !167)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !429, line: 257, baseType: !121)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !442, file: !429, line: 530, baseType: !466, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DISubroutineType(types: !468)
!468 = !{!103, !448, !469}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !429, line: 229, baseType: !121)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !442, file: !429, line: 532, baseType: !472, size: 32, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!473 = !DISubroutineType(types: !474)
!474 = !{!103, !448, !475, !470}
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !429, line: 216, baseType: !121)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !442, file: !429, line: 535, baseType: !477, size: 32, offset: 96)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 32)
!478 = !DISubroutineType(types: !479)
!479 = !{!103, !448, !475}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !442, file: !429, line: 537, baseType: !477, size: 32, offset: 128)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !442, file: !429, line: 539, baseType: !477, size: 32, offset: 160)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !442, file: !429, line: 541, baseType: !483, size: 32, offset: 192)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = !DISubroutineType(types: !485)
!485 = !{!103, !448, !463, !428, !434}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !442, file: !429, line: 544, baseType: !487, size: 32, offset: 224)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!488 = !DISubroutineType(types: !489)
!489 = !{!103, !448, !490, !170}
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 32)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !429, line: 478, size: 96, elements: !492)
!492 = !{!493, !500, !505}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !491, file: !429, line: 482, baseType: !494, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !495, line: 33, baseType: !496)
!495 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !495, line: 29, size: 32, elements: !497)
!497 = !{!498}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !496, file: !495, line: 30, baseType: !499, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !491, file: !429, line: 485, baseType: !501, size: 32, offset: 32)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !429, line: 464, baseType: !502)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 32)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !448, !490, !475}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !491, file: !429, line: 493, baseType: !475, size: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !442, file: !429, line: 547, baseType: !507, size: 32, offset: 256)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 32)
!508 = !DISubroutineType(types: !509)
!509 = !{!121, !448}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !512)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !429, line: 428, size: 32, elements: !513)
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !512, file: !429, line: 434, baseType: !475, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !429, line: 441, size: 32, elements: !518)
!518 = !{!519}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !517, file: !429, line: 447, baseType: !475, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!521 = !{!423}
!522 = !DIFile(filename: "zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !524)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !525)
!525 = !{!526, !530}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !524, file: !145, line: 60, baseType: !527, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!528 = !DISubroutineType(types: !529)
!529 = !{!103, !448}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !524, file: !145, line: 65, baseType: !448, size: 32, offset: 32)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !533, file: !605, line: 48, type: !681, isLocal: true, isDefinition: true)
!533 = distinct !DICompileUnit(language: DW_LANG_C99, file: !534, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !535, retainedTypes: !591, globals: !602, splitDebugInlining: false, nameTableKind: None)
!534 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/drivers/ipm/ipm_mcux/remote")
!535 = !{!30, !536}
!536 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 69, baseType: !103, size: 32, elements: !537)
!537 = !{!538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590}
!538 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!539 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!540 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!541 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!542 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!543 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!544 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!545 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!546 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!547 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!548 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!549 = !DIEnumerator(name: "TAMPER_STAMP_IRQn", value: 2)
!550 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!551 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!552 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!553 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!554 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!555 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!556 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!557 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!558 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!559 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!560 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!561 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!562 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!563 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!564 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!565 = !DIEnumerator(name: "ADC1_IRQn", value: 18)
!566 = !DIEnumerator(name: "USB_HP_IRQn", value: 19)
!567 = !DIEnumerator(name: "USB_LP_IRQn", value: 20)
!568 = !DIEnumerator(name: "DAC_IRQn", value: 21)
!569 = !DIEnumerator(name: "COMP_IRQn", value: 22)
!570 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!571 = !DIEnumerator(name: "TIM9_IRQn", value: 25)
!572 = !DIEnumerator(name: "TIM10_IRQn", value: 26)
!573 = !DIEnumerator(name: "TIM11_IRQn", value: 27)
!574 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!575 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!576 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!577 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!578 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!579 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!580 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!581 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!582 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!583 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!584 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!585 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!586 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!587 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!588 = !DIEnumerator(name: "USB_FS_WKUP_IRQn", value: 42)
!589 = !DIEnumerator(name: "TIM6_IRQn", value: 43)
!590 = !DIEnumerator(name: "TIM7_IRQn", value: 44)
!591 = !{!213, !103, !102, !592}
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !116, line: 270, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 262, size: 192, elements: !595)
!595 = !{!596, !597, !598, !599, !600, !601}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !594, file: !116, line: 264, baseType: !120, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !594, file: !116, line: 265, baseType: !120, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !594, file: !116, line: 266, baseType: !120, size: 32, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !594, file: !116, line: 267, baseType: !120, size: 32, offset: 96)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !594, file: !116, line: 268, baseType: !120, size: 32, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !594, file: !116, line: 269, baseType: !120, size: 32, offset: 160)
!602 = !{!603, !609, !625, !636, !653, !531, !655, !669, !671, !673, !675, !677, !679}
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !533, file: !605, line: 424, type: !606, isLocal: false, isDefinition: true, align: 16)
!605 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 64, elements: !607)
!607 = !{!608}
!608 = !DISubrange(count: 4)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "__device_dts_ord_32", scope: !533, file: !605, line: 424, type: !611, isLocal: false, isDefinition: true, align: 32)
!611 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !612)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !613)
!613 = !{!614, !615, !616, !617, !623, !624}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !612, file: !154, line: 380, baseType: !157, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !612, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !612, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !612, file: !154, line: 386, baseType: !618, size: 32, offset: 96)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 32)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !620)
!620 = !{!621, !622}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !619, file: !154, line: 359, baseType: !167, size: 8)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !619, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !612, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !612, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_32", scope: !533, file: !605, line: 424, type: !627, isLocal: true, isDefinition: true, align: 32)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !629)
!629 = !{!630, !635}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !628, file: !145, line: 60, baseType: !631, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 32)
!632 = !DISubroutineType(types: !633)
!633 = !{!103, !634}
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !628, file: !145, line: 65, baseType: !634, size: 32, offset: 32)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "exti_data", scope: !533, file: !605, line: 423, type: !638, isLocal: true, isDefinition: true)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !605, line: 107, size: 1024, elements: !639)
!639 = !{!640}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !638, file: !605, line: 109, baseType: !641, size: 1024)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !642, size: 1024, elements: !651)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !605, line: 101, size: 64, elements: !643)
!643 = !{!644, !650}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !642, file: !605, line: 102, baseType: !645, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !646, line: 63, baseType: !647)
!646 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 32)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !103, !102}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !642, file: !605, line: 103, baseType: !102, size: 32, offset: 32)
!651 = !{!652}
!652 = !DISubrange(count: 16)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_32", scope: !533, file: !605, line: 424, type: !619, isLocal: true, isDefinition: true, align: 8)
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !657, file: !605, line: 493, type: !662, isLocal: true, isDefinition: true, align: 32)
!657 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !605, file: !605, line: 460, type: !658, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !533, retainedNodes: !660)
!658 = !DISubroutineType(types: !659)
!659 = !{null, !634}
!660 = !{!661}
!661 = !DILocalVariable(name: "dev", arg: 1, scope: !657, file: !605, line: 460, type: !634)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !663)
!663 = !{!664, !666, !667, !668}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !662, file: !10, line: 55, baseType: !665, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !662, file: !10, line: 57, baseType: !665, size: 32, offset: 32)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !662, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !662, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !657, file: !605, line: 497, type: !662, isLocal: true, isDefinition: true, align: 32)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !657, file: !605, line: 507, type: !662, isLocal: true, isDefinition: true, align: 32)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !657, file: !605, line: 512, type: !662, isLocal: true, isDefinition: true, align: 32)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !657, file: !605, line: 516, type: !662, isLocal: true, isDefinition: true, align: 32)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !657, file: !605, line: 523, type: !662, isLocal: true, isDefinition: true, align: 32)
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !657, file: !605, line: 527, type: !662, isLocal: true, isDefinition: true, align: 32)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 512, elements: !651)
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !116, line: 127, baseType: !536)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !686, file: !691, line: 21, type: !711, isLocal: false, isDefinition: true, align: 16)
!686 = distinct !DICompileUnit(language: DW_LANG_C99, file: !687, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !688, splitDebugInlining: false, nameTableKind: None)
!687 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/drivers/ipm/ipm_mcux/remote/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/drivers/ipm/ipm_mcux/remote")
!688 = !{!689, !684, !695, !697, !699, !701, !703, !705, !707, !709}
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !686, file: !691, line: 16, type: !692, isLocal: false, isDefinition: true, align: 16)
!691 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/drivers/ipm/ipm_mcux/remote")
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 176, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 11)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_17", scope: !686, file: !691, line: 28, type: !606, isLocal: false, isDefinition: true, align: 16)
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !686, file: !691, line: 35, type: !606, isLocal: false, isDefinition: true, align: 16)
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_53", scope: !686, file: !691, line: 42, type: !606, isLocal: false, isDefinition: true, align: 16)
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_59", scope: !686, file: !691, line: 49, type: !606, isLocal: false, isDefinition: true, align: 16)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_15", scope: !686, file: !691, line: 56, type: !606, isLocal: false, isDefinition: true, align: 16)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !686, file: !691, line: 63, type: !606, isLocal: false, isDefinition: true, align: 16)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !686, file: !691, line: 70, type: !606, isLocal: false, isDefinition: true, align: 16)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !686, file: !691, line: 77, type: !606, isLocal: false, isDefinition: true, align: 16)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 48, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 3)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !716, file: !760, line: 398, type: !793, isLocal: true, isDefinition: true)
!716 = distinct !DICompileUnit(language: DW_LANG_C99, file: !717, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !718, retainedTypes: !731, globals: !757, splitDebugInlining: false, nameTableKind: None)
!717 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/drivers/ipm/ipm_mcux/remote")
!718 = !{!719, !30, !724}
!719 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !720, line: 190, baseType: !32, size: 32, elements: !721)
!720 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l1xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!721 = !{!722, !723}
!722 = !DIEnumerator(name: "SUCCESS", value: 0)
!723 = !DIEnumerator(name: "ERROR", value: 1)
!724 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !725, line: 44, baseType: !32, size: 32, elements: !726)
!725 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!726 = !{!727, !728, !729, !730}
!727 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!728 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!729 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!730 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!731 = !{!102, !103, !121, !732, !750, !756}
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 386, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 370, size: 448, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !734, file: !116, line: 372, baseType: !120, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !734, file: !116, line: 373, baseType: !120, size: 32, offset: 32)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !734, file: !116, line: 374, baseType: !120, size: 32, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !734, file: !116, line: 375, baseType: !120, size: 32, offset: 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !734, file: !116, line: 376, baseType: !120, size: 32, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !734, file: !116, line: 377, baseType: !120, size: 32, offset: 160)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !734, file: !116, line: 378, baseType: !120, size: 32, offset: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !734, file: !116, line: 379, baseType: !120, size: 32, offset: 224)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !734, file: !116, line: 380, baseType: !120, size: 32, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !734, file: !116, line: 381, baseType: !120, size: 32, offset: 288)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !734, file: !116, line: 382, baseType: !120, size: 32, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !734, file: !116, line: 383, baseType: !120, size: 32, offset: 352)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !734, file: !116, line: 384, baseType: !120, size: 32, offset: 384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !734, file: !116, line: 385, baseType: !120, size: 32, offset: 416)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !752, line: 343, size: 64, elements: !753)
!752 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !751, file: !752, line: 344, baseType: !121, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !751, file: !752, line: 345, baseType: !121, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!757 = !{!758, !764, !780, !791, !714}
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!759 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !716, file: !760, line: 752, type: !761, isLocal: false, isDefinition: true, align: 16)
!760 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 512, elements: !762)
!762 = !{!763}
!763 = !DISubrange(count: 32)
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !716, file: !760, line: 752, type: !766, isLocal: false, isDefinition: true, align: 32)
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !768)
!768 = !{!769, !770, !771, !772, !778, !779}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !767, file: !154, line: 380, baseType: !157, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !767, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !767, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !767, file: !154, line: 386, baseType: !773, size: 32, offset: 96)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !774, file: !154, line: 359, baseType: !167, size: 8)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !774, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !767, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !767, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !716, file: !760, line: 752, type: !782, isLocal: true, isDefinition: true, align: 32)
!782 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !784)
!784 = !{!785, !790}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !783, file: !145, line: 60, baseType: !786, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 32)
!787 = !DISubroutineType(types: !788)
!788 = !{!103, !789}
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !783, file: !145, line: 65, baseType: !789, size: 32, offset: 32)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !716, file: !760, line: 752, type: !774, isLocal: true, isDefinition: true, align: 8)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !725, line: 100, size: 224, elements: !794)
!794 = !{!795, !801, !802, !811, !816, !821, !827}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !793, file: !725, line: 101, baseType: !796, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !725, line: 76, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = !DISubroutineType(types: !799)
!799 = !{!103, !789, !800}
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !725, line: 56, baseType: !102)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !793, file: !725, line: 102, baseType: !796, size: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !793, file: !725, line: 103, baseType: !803, size: 32, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !725, line: 83, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 32)
!805 = !DISubroutineType(types: !806)
!806 = !{!103, !789, !800, !807, !102}
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !725, line: 72, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DISubroutineType(types: !810)
!810 = !{null, !789, !800, !102}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !793, file: !725, line: 104, baseType: !812, size: 32, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !725, line: 79, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!814 = !DISubroutineType(types: !815)
!815 = !{!103, !789, !800, !756}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !793, file: !725, line: 105, baseType: !817, size: 32, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !725, line: 88, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DISubroutineType(types: !820)
!820 = !{!724, !789, !800}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !793, file: !725, line: 106, baseType: !822, size: 32, offset: 160)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !725, line: 92, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DISubroutineType(types: !825)
!825 = !{!103, !789, !800, !826}
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !725, line: 64, baseType: !102)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !793, file: !725, line: 107, baseType: !828, size: 32, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !725, line: 96, baseType: !829)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32)
!830 = !DISubroutineType(types: !831)
!831 = !{!103, !789, !800, !102}
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !834, file: !891, line: 603, type: !893, isLocal: true, isDefinition: true, align: 32)
!834 = distinct !DICompileUnit(language: DW_LANG_C99, file: !835, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !836, globals: !888, splitDebugInlining: false, nameTableKind: None)
!835 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/drivers/ipm/ipm_mcux/remote")
!836 = !{!102, !103, !837}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !840, line: 336, size: 160, elements: !841)
!840 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!841 = !{!842, !862, !866, !870, !883}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !839, file: !840, line: 365, baseType: !843, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DISubroutineType(types: !845)
!845 = !{!103, !846, !861}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !849)
!849 = !{!850, !851, !852, !853, !859, !860}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !848, file: !154, line: 380, baseType: !157, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !848, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !848, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !848, file: !154, line: 386, baseType: !854, size: 32, offset: 96)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !855, file: !154, line: 359, baseType: !167, size: 8)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !855, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !848, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !848, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !839, file: !840, line: 366, baseType: !863, size: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 32)
!864 = !DISubroutineType(types: !865)
!865 = !{null, !846, !168}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !839, file: !840, line: 374, baseType: !867, size: 32, offset: 64)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!868 = !DISubroutineType(types: !869)
!869 = !{!103, !846}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !839, file: !840, line: 377, baseType: !871, size: 32, offset: 96)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!872 = !DISubroutineType(types: !873)
!873 = !{!103, !846, !874}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !840, line: 122, size: 64, elements: !877)
!877 = !{!878, !879, !880, !881, !882}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !876, file: !840, line: 123, baseType: !121, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !876, file: !840, line: 124, baseType: !167, size: 8, offset: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !876, file: !840, line: 125, baseType: !167, size: 8, offset: 40)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !876, file: !840, line: 126, baseType: !167, size: 8, offset: 48)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !876, file: !840, line: 127, baseType: !167, size: 8, offset: 56)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !839, file: !840, line: 379, baseType: !884, size: 32, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!885 = !DISubroutineType(types: !886)
!886 = !{!103, !846, !887}
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!888 = !{!832, !889}
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !834, file: !891, line: 38, type: !892, isLocal: true, isDefinition: true)
!891 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!892 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !846)
!893 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !894, file: !145, line: 60, baseType: !867, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !894, file: !145, line: 65, baseType: !846, size: 32, offset: 32)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !900, file: !1051, line: 762, type: !1149, isLocal: true, isDefinition: true)
!900 = distinct !DICompileUnit(language: DW_LANG_C99, file: !901, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !902, retainedTypes: !909, globals: !1048, splitDebugInlining: false, nameTableKind: None)
!901 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/drivers/ipm/ipm_mcux/remote")
!902 = !{!30, !428, !434, !903, !724}
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !646, line: 43, baseType: !32, size: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!906 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!907 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!908 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!909 = !{!102, !103, !910, !974, !979, !475, !434, !428, !984, !985, !121, !999, !955, !1007, !1008, !1009}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !429, line: 523, size: 288, elements: !913)
!913 = !{!914, !933, !937, !941, !945, !946, !947, !951, !970}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !912, file: !429, line: 524, baseType: !915, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 32)
!916 = !DISubroutineType(types: !917)
!917 = !{!103, !918, !463, !464}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !921)
!921 = !{!922, !923, !924, !925, !931, !932}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !920, file: !154, line: 380, baseType: !157, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !920, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !920, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !920, file: !154, line: 386, baseType: !926, size: 32, offset: 96)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !927, file: !154, line: 359, baseType: !167, size: 8)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !927, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !920, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !920, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !912, file: !429, line: 530, baseType: !934, size: 32, offset: 32)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DISubroutineType(types: !936)
!936 = !{!103, !918, !469}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !912, file: !429, line: 532, baseType: !938, size: 32, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 32)
!939 = !DISubroutineType(types: !940)
!940 = !{!103, !918, !475, !470}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !912, file: !429, line: 535, baseType: !942, size: 32, offset: 96)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 32)
!943 = !DISubroutineType(types: !944)
!944 = !{!103, !918, !475}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !912, file: !429, line: 537, baseType: !942, size: 32, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !912, file: !429, line: 539, baseType: !942, size: 32, offset: 160)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !912, file: !429, line: 541, baseType: !948, size: 32, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 32)
!949 = !DISubroutineType(types: !950)
!950 = !{!103, !918, !463, !428, !434}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !912, file: !429, line: 544, baseType: !952, size: 32, offset: 224)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 32)
!953 = !DISubroutineType(types: !954)
!954 = !{!103, !918, !955, !170}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !429, line: 478, size: 96, elements: !957)
!957 = !{!958, !964, !969}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !956, file: !429, line: 482, baseType: !959, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !495, line: 33, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !495, line: 29, size: 32, elements: !961)
!961 = !{!962}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !960, file: !495, line: 30, baseType: !963, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !956, file: !429, line: 485, baseType: !965, size: 32, offset: 32)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !429, line: 464, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 32)
!967 = !DISubroutineType(types: !968)
!968 = !{null, !918, !955, !475}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !956, file: !429, line: 493, baseType: !475, size: 32, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !912, file: !429, line: 547, baseType: !971, size: 32, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 32)
!972 = !DISubroutineType(types: !973)
!973 = !{!121, !918}
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !429, line: 428, size: 32, elements: !977)
!977 = !{!978}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !976, file: !429, line: 434, baseType: !475, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !429, line: 441, size: 32, elements: !982)
!982 = !{!983}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !981, file: !429, line: 447, baseType: !475, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 32)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !116, line: 314, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 303, size: 320, elements: !988)
!988 = !{!989, !990, !991, !992, !993, !994, !995, !996, !997}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !987, file: !116, line: 305, baseType: !120, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !987, file: !116, line: 306, baseType: !120, size: 32, offset: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !987, file: !116, line: 307, baseType: !120, size: 32, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !987, file: !116, line: 308, baseType: !120, size: 32, offset: 96)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !987, file: !116, line: 309, baseType: !120, size: 32, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !987, file: !116, line: 310, baseType: !120, size: 32, offset: 160)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !987, file: !116, line: 311, baseType: !120, size: 32, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !987, file: !116, line: 312, baseType: !120, size: 32, offset: 224)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !987, file: !116, line: 313, baseType: !998, size: 64, offset: 256)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !255)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !116, line: 325, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 320, size: 192, elements: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !1001, file: !116, line: 322, baseType: !120, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !1001, file: !116, line: 323, baseType: !120, size: 32, offset: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !1001, file: !116, line: 324, baseType: !1006, size: 128, offset: 64)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !607)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !725, line: 100, size: 224, elements: !1012)
!1012 = !{!1013, !1018, !1019, !1028, !1033, !1038, !1043}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !1011, file: !725, line: 101, baseType: !1014, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !725, line: 76, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!103, !918, !800}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !1011, file: !725, line: 102, baseType: !1014, size: 32, offset: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !1011, file: !725, line: 103, baseType: !1020, size: 32, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !725, line: 83, baseType: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 32)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!103, !918, !800, !1024, !102}
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !725, line: 72, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 32)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{null, !918, !800, !102}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !1011, file: !725, line: 104, baseType: !1029, size: 32, offset: 96)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !725, line: 79, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 32)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{!103, !918, !800, !756}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !1011, file: !725, line: 105, baseType: !1034, size: 32, offset: 128)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !725, line: 88, baseType: !1035)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 32)
!1036 = !DISubroutineType(types: !1037)
!1037 = !{!724, !918, !800}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !1011, file: !725, line: 106, baseType: !1039, size: 32, offset: 160)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !725, line: 92, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 32)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!103, !918, !800, !826}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !1011, file: !725, line: 107, baseType: !1044, size: 32, offset: 192)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !725, line: 96, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 32)
!1046 = !DISubroutineType(types: !1047)
!1047 = !{!103, !918, !800, !102}
!1048 = !{!1049, !1055, !1057, !1067, !1072, !1074, !1076, !1081, !1083, !1085, !1090, !1092, !1094, !1096, !1098, !1100, !1105, !1107, !1109, !1123, !1125, !1127, !1129, !1131, !1133, !1135, !1137, !1139, !1141, !1143, !898, !1145, !1147, !1160, !1162, !1164, !1166}
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !900, file: !1051, line: 762, type: !1052, isLocal: false, isDefinition: true, align: 16)
!1051 = !DIFile(filename: "zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 128, elements: !1053)
!1053 = !{!1054}
!1054 = !DISubrange(count: 8)
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(name: "__device_dts_ord_14", scope: !900, file: !1051, line: 762, type: !919, isLocal: false, isDefinition: true, align: 32)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_14", scope: !900, file: !1051, line: 762, type: !1059, isLocal: true, isDefinition: true, align: 32)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
