; ModuleID = './main.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct.avm_module_s = type { i16, i32*, i8 (i8*)*, i8 ()*, i8 ()* }
%struct.SixAxis = type { float, float, float, float, float, float }
%struct.pid_st = type { float, float, float*, float*, float, float, float, float, i16, i16*, i16* }

@_estack = external dso_local global i32, align 4

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "g_pfnVectors", scope: !2, file: !3, line: 91, type: !58, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !57, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "startup.c", directory: "/home/mjshen/RTOSExploration/Avem/src", checksumkind: CSK_MD5, checksum: "cbd9238780a989b8c894aa43530e4d57")
!4 = !{!5, !12}
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !6, line: 513, baseType: !7)
!6 = !DIFile(filename: "libs/STM32_USB-FS-Device_Lib_V4.0.0/Libraries/CMSIS/Device/ST/STM32F10x/Include/stm32f10x.h", directory: "/home/mjshen/RTOSExploration/Avem", checksumkind: CSK_MD5, checksum: "1c2128df8a82e2d2915878006b067356")
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !8, line: 48, baseType: !9)
!8 = !DIFile(filename: "gcc-arm-none-eabi-8-2018-q4-major/bin/../lib/gcc/arm-none-eabi/8.2.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "ab914e287601b2385e57880e6599aa6b")
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !10, line: 79, baseType: !11)
!10 = !DIFile(filename: "gcc-arm-none-eabi-8-2018-q4-major/bin/../lib/gcc/arm-none-eabi/8.2.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration", checksumkind: CSK_MD5, checksum: "f7024d0682a918b41f94e8be9cd90461")
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !14, line: 336, baseType: !15)
!14 = !DIFile(filename: "libs/STM32_USB-FS-Device_Lib_V4.0.0/Libraries/CMSIS/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/Avem", checksumkind: CSK_MD5, checksum: "f6a877e01832adc7c6f3e6a91cff33f2")
!15 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !14, line: 313, size: 1120, elements: !16)
!16 = !{!17, !20, !21, !22, !23, !24, !25, !33, !34, !35, !36, !37, !38, !39, !40, !44, !45, !46, !50, !54, !56}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !15, file: !14, line: 315, baseType: !18, size: 32)
!18 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !15, file: !14, line: 316, baseType: !19, size: 32, offset: 32)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !15, file: !14, line: 317, baseType: !19, size: 32, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !15, file: !14, line: 318, baseType: !19, size: 32, offset: 96)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !15, file: !14, line: 319, baseType: !19, size: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !15, file: !14, line: 320, baseType: !19, size: 32, offset: 160)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !15, file: !14, line: 321, baseType: !26, size: 96, offset: 192)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 96, elements: !31)
!27 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !8, line: 24, baseType: !29)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !10, line: 43, baseType: !30)
!30 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!31 = !{!32}
!32 = !DISubrange(count: 12)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !15, file: !14, line: 322, baseType: !19, size: 32, offset: 288)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !15, file: !14, line: 323, baseType: !19, size: 32, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !15, file: !14, line: 324, baseType: !19, size: 32, offset: 352)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !15, file: !14, line: 325, baseType: !19, size: 32, offset: 384)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !15, file: !14, line: 326, baseType: !19, size: 32, offset: 416)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !15, file: !14, line: 327, baseType: !19, size: 32, offset: 448)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !15, file: !14, line: 328, baseType: !19, size: 32, offset: 480)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !15, file: !14, line: 329, baseType: !41, size: 64, offset: 512)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 64, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 2)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !15, file: !14, line: 330, baseType: !18, size: 32, offset: 576)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !15, file: !14, line: 331, baseType: !18, size: 32, offset: 608)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !15, file: !14, line: 332, baseType: !47, size: 128, offset: 640)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 128, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 4)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !15, file: !14, line: 333, baseType: !51, size: 160, offset: 768)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 160, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 5)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !15, file: !14, line: 334, baseType: !55, size: 160, offset: 928)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !52)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !15, file: !14, line: 335, baseType: !19, size: 32, offset: 1088)
!57 = !{!0}
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 3840, elements: !63)
!59 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 32)
!61 = !DISubroutineType(types: !62)
!62 = !{null}
!63 = !{!64}
!64 = !DISubrange(count: 120)
!65 = !DIGlobalVariableExpression(var: !66, expr: !DIExpression())
!66 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !67, file: !135, line: 168, type: !7, isLocal: false, isDefinition: true)
!67 = distinct !DICompileUnit(language: DW_LANG_C99, file: !68, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !69, retainedTypes: !75, globals: !132, splitDebugInlining: false, nameTableKind: None)
!68 = !DIFile(filename: "/home/mjshen/RTOSExploration/Avem/libs/STM32_USB-FS-Device_Lib_V4.0.0/Libraries/CMSIS/Device/ST/STM32F10x/Source/Templates/system_stm32f10x.c", directory: "/home/mjshen/RTOSExploration/Avem/libs/STM32_USB-FS-Device_Lib_V4.0.0/Libraries/CMSIS/Device/ST/STM32F10x/Source/Templates", checksumkind: CSK_MD5, checksum: "06a753527f3679037b7585ec5825a1b5")
!69 = !{!70}
!70 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !71, line: 529, baseType: !11, size: 32, elements: !72)
!71 = !DIFile(filename: "Include/stm32f10x.h", directory: "/home/mjshen/RTOSExploration/Avem/libs/STM32_USB-FS-Device_Lib_V4.0.0/Libraries/CMSIS/Device/ST/STM32F10x", checksumkind: CSK_MD5, checksum: "1c2128df8a82e2d2915878006b067356")
!72 = !{!73, !74}
!73 = !DIEnumerator(name: "RESET", value: 0)
!74 = !DIEnumerator(name: "SET", value: 1)
!75 = !{!7, !76, !90, !116, !28, !119}
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !71, line: 1108, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 1086, size: 320, elements: !79)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !78, file: !71, line: 1088, baseType: !19, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !78, file: !71, line: 1089, baseType: !19, size: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !78, file: !71, line: 1090, baseType: !19, size: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !78, file: !71, line: 1091, baseType: !19, size: 32, offset: 96)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !78, file: !71, line: 1092, baseType: !19, size: 32, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !78, file: !71, line: 1093, baseType: !19, size: 32, offset: 160)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !78, file: !71, line: 1094, baseType: !19, size: 32, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !78, file: !71, line: 1095, baseType: !19, size: 32, offset: 224)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !78, file: !71, line: 1096, baseType: !19, size: 32, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !78, file: !71, line: 1097, baseType: !19, size: 32, offset: 288)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !92, line: 336, baseType: !93)
!92 = !DIFile(filename: "Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/Avem/libs/STM32_USB-FS-Device_Lib_V4.0.0/Libraries/CMSIS", checksumkind: CSK_MD5, checksum: "f6a877e01832adc7c6f3e6a91cff33f2")
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !92, line: 313, size: 1120, elements: !94)
!94 = !{!95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !93, file: !92, line: 315, baseType: !18, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !93, file: !92, line: 316, baseType: !19, size: 32, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !93, file: !92, line: 317, baseType: !19, size: 32, offset: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !93, file: !92, line: 318, baseType: !19, size: 32, offset: 96)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !93, file: !92, line: 319, baseType: !19, size: 32, offset: 128)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !93, file: !92, line: 320, baseType: !19, size: 32, offset: 160)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !93, file: !92, line: 321, baseType: !26, size: 96, offset: 192)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !93, file: !92, line: 322, baseType: !19, size: 32, offset: 288)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !93, file: !92, line: 323, baseType: !19, size: 32, offset: 320)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !93, file: !92, line: 324, baseType: !19, size: 32, offset: 352)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !93, file: !92, line: 325, baseType: !19, size: 32, offset: 384)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !93, file: !92, line: 326, baseType: !19, size: 32, offset: 416)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !93, file: !92, line: 327, baseType: !19, size: 32, offset: 448)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !93, file: !92, line: 328, baseType: !19, size: 32, offset: 480)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !93, file: !92, line: 329, baseType: !41, size: 64, offset: 512)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !93, file: !92, line: 330, baseType: !18, size: 32, offset: 576)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !93, file: !92, line: 331, baseType: !18, size: 32, offset: 608)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !93, file: !92, line: 332, baseType: !47, size: 128, offset: 640)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !93, file: !92, line: 333, baseType: !51, size: 160, offset: 768)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !93, file: !92, line: 334, baseType: !55, size: 160, offset: 928)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !93, file: !92, line: 335, baseType: !19, size: 32, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !8, line: 36, baseType: !117)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !10, line: 57, baseType: !118)
!118 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !71, line: 930, baseType: !121)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 911, size: 288, elements: !122)
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !121, file: !71, line: 913, baseType: !19, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !121, file: !71, line: 914, baseType: !19, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !121, file: !71, line: 915, baseType: !19, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !121, file: !71, line: 916, baseType: !19, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !121, file: !71, line: 917, baseType: !19, size: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "AR", scope: !121, file: !71, line: 918, baseType: !19, size: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !121, file: !71, line: 919, baseType: !19, size: 32, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "OBR", scope: !121, file: !71, line: 920, baseType: !19, size: 32, offset: 224)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "WRPR", scope: !121, file: !71, line: 921, baseType: !19, size: 32, offset: 256)
!132 = !{!65, !133}
!133 = !DIGlobalVariableExpression(var: !134, expr: !DIExpression())
!134 = distinct !DIGlobalVariable(name: "AHBPrescTable", scope: !67, file: !135, line: 173, type: !136, isLocal: false, isDefinition: true)
!135 = !DIFile(filename: "system_stm32f10x.c", directory: "/home/mjshen/RTOSExploration/Avem/libs/STM32_USB-FS-Device_Lib_V4.0.0/Libraries/CMSIS/Device/ST/STM32F10x/Source/Templates", checksumkind: CSK_MD5, checksum: "06a753527f3679037b7585ec5825a1b5")
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !137, size: 128, elements: !138)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!138 = !{!139}
!139 = !DISubrange(count: 16)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "avm_core_module_st", scope: !142, file: !184, line: 5, type: !187, isLocal: false, isDefinition: true)
!142 = distinct !DICompileUnit(language: DW_LANG_C99, file: !143, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !144, globals: !181, splitDebugInlining: false, nameTableKind: None)
!143 = !DIFile(filename: "/home/mjshen/RTOSExploration/Avem/libs/module/avm_core.c", directory: "/home/mjshen/RTOSExploration/Avem/libs/module", checksumkind: CSK_MD5, checksum: "fc24f6cd1bef1f76759dc0e57a10b1de")
!144 = !{!145, !154, !60, !7, !155, !156}
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !147, line: 581, baseType: !148)
!147 = !DIFile(filename: "STM32_USB-FS-Device_Lib_V4.0.0/Libraries/CMSIS/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/Avem/libs", checksumkind: CSK_MD5, checksum: "f6a877e01832adc7c6f3e6a91cff33f2")
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !147, line: 575, size: 128, elements: !149)
!149 = !{!150, !151, !152, !153}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !148, file: !147, line: 577, baseType: !19, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !148, file: !147, line: 578, baseType: !19, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !148, file: !147, line: 579, baseType: !19, size: 32, offset: 64)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !148, file: !147, line: 580, baseType: !18, size: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !147, line: 336, baseType: !158)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !147, line: 313, size: 1120, elements: !159)
!159 = !{!160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !158, file: !147, line: 315, baseType: !18, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !158, file: !147, line: 316, baseType: !19, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !158, file: !147, line: 317, baseType: !19, size: 32, offset: 64)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !158, file: !147, line: 318, baseType: !19, size: 32, offset: 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !158, file: !147, line: 319, baseType: !19, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !158, file: !147, line: 320, baseType: !19, size: 32, offset: 160)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !158, file: !147, line: 321, baseType: !26, size: 96, offset: 192)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !158, file: !147, line: 322, baseType: !19, size: 32, offset: 288)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !158, file: !147, line: 323, baseType: !19, size: 32, offset: 320)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !158, file: !147, line: 324, baseType: !19, size: 32, offset: 352)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !158, file: !147, line: 325, baseType: !19, size: 32, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !158, file: !147, line: 326, baseType: !19, size: 32, offset: 416)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !158, file: !147, line: 327, baseType: !19, size: 32, offset: 448)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !158, file: !147, line: 328, baseType: !19, size: 32, offset: 480)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !158, file: !147, line: 329, baseType: !41, size: 64, offset: 512)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !158, file: !147, line: 330, baseType: !18, size: 32, offset: 576)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !158, file: !147, line: 331, baseType: !18, size: 32, offset: 608)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !158, file: !147, line: 332, baseType: !47, size: 128, offset: 640)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !158, file: !147, line: 333, baseType: !51, size: 160, offset: 768)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !158, file: !147, line: 334, baseType: !55, size: 160, offset: 928)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !158, file: !147, line: 335, baseType: !19, size: 32, offset: 1088)
!181 = !{!140, !182, !204}
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "avm_modules_pool", scope: !142, file: !184, line: 39, type: !185, isLocal: false, isDefinition: true)
!184 = !DIFile(filename: "avm_core.c", directory: "/home/mjshen/RTOSExploration/Avem/libs/module", checksumkind: CSK_MD5, checksum: "fc24f6cd1bef1f76759dc0e57a10b1de")
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 192, elements: !202)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "avm_module_t", file: !188, line: 4, baseType: !189)
!188 = !DIFile(filename: "avm_core.h", directory: "/home/mjshen/RTOSExploration/Avem/libs/module", checksumkind: CSK_MD5, checksum: "81ff38b28cf7846d1b43b3611bdfab46")
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "avm_module_s", file: !188, line: 19, size: 160, elements: !190)
!190 = !{!191, !192, !193, !197, !201}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !189, file: !188, line: 20, baseType: !118, size: 16)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "confs", scope: !189, file: !188, line: 21, baseType: !154, size: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !189, file: !188, line: 22, baseType: !194, size: 32, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DISubroutineType(types: !196)
!196 = !{!30, !155}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "enable_module", scope: !189, file: !188, line: 23, baseType: !198, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{!30}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "disable_module", scope: !189, file: !188, line: 24, baseType: !198, size: 32, offset: 128)
!202 = !{!203}
!203 = !DISubrange(count: 6)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "avm_modules_num", scope: !206, file: !184, line: 53, type: !30, isLocal: true, isDefinition: true)
!206 = distinct !DISubprogram(name: "avm_core_init", scope: !184, file: !184, line: 48, type: !195, scopeLine: 48, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !142, retainedNodes: !207)
!207 = !{!208, !209, !210}
!208 = !DILocalVariable(name: "arg", arg: 1, scope: !206, file: !184, line: 48, type: !155)
!209 = !DILocalVariable(name: "p_core", scope: !206, file: !184, line: 51, type: !186)
!210 = !DILocalVariable(name: "this", scope: !206, file: !184, line: 60, type: !211)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "avm_i2c_module_st", scope: !214, file: !247, line: 5, type: !248, isLocal: false, isDefinition: true)
!214 = distinct !DICompileUnit(language: DW_LANG_C99, file: !215, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !216, globals: !246, splitDebugInlining: false, nameTableKind: None)
!215 = !DIFile(filename: "/home/mjshen/RTOSExploration/Avem/libs/module/avm_i2c.c", directory: "/home/mjshen/RTOSExploration/Avem/libs/module", checksumkind: CSK_MD5, checksum: "0e7cc63d5a0f1b4dca6beac304455642")
!216 = !{!7, !217, !232, !243, !11}
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !219, line: 1108, baseType: !220)
!219 = !DIFile(filename: "STM32_USB-FS-Device_Lib_V4.0.0/Libraries/CMSIS/Device/ST/STM32F10x/Include/stm32f10x.h", directory: "/home/mjshen/RTOSExploration/Avem/libs", checksumkind: CSK_MD5, checksum: "1c2128df8a82e2d2915878006b067356")
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !219, line: 1086, size: 320, elements: !221)
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !231}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !220, file: !219, line: 1088, baseType: !19, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !220, file: !219, line: 1089, baseType: !19, size: 32, offset: 32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !220, file: !219, line: 1090, baseType: !19, size: 32, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !220, file: !219, line: 1091, baseType: !19, size: 32, offset: 96)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !220, file: !219, line: 1092, baseType: !19, size: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !220, file: !219, line: 1093, baseType: !19, size: 32, offset: 160)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !220, file: !219, line: 1094, baseType: !19, size: 32, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !220, file: !219, line: 1095, baseType: !19, size: 32, offset: 224)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !220, file: !219, line: 1096, baseType: !19, size: 32, offset: 256)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !220, file: !219, line: 1097, baseType: !19, size: 32, offset: 288)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !219, line: 1020, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !219, line: 1011, size: 224, elements: !235)
!235 = !{!236, !237, !238, !239, !240, !241, !242}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "CRL", scope: !234, file: !219, line: 1013, baseType: !19, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "CRH", scope: !234, file: !219, line: 1014, baseType: !19, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !234, file: !219, line: 1015, baseType: !19, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !234, file: !219, line: 1016, baseType: !19, size: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !234, file: !219, line: 1017, baseType: !19, size: 32, offset: 128)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !234, file: !219, line: 1018, baseType: !19, size: 32, offset: 160)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !234, file: !219, line: 1019, baseType: !19, size: 32, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !245)
!245 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!246 = !{!212}
!247 = !DIFile(filename: "avm_i2c.c", directory: "/home/mjshen/RTOSExploration/Avem/libs/module", checksumkind: CSK_MD5, checksum: "0e7cc63d5a0f1b4dca6beac304455642")
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "avm_module_t", file: !188, line: 4, baseType: !249)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "avm_module_s", file: !188, line: 19, size: 160, elements: !250)
!250 = !{!251, !252, !253, !254, !255}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !249, file: !188, line: 20, baseType: !118, size: 16)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "confs", scope: !249, file: !188, line: 21, baseType: !154, size: 32, offset: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !249, file: !188, line: 22, baseType: !194, size: 32, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "enable_module", scope: !249, file: !188, line: 23, baseType: !198, size: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "disable_module", scope: !249, file: !188, line: 24, baseType: !198, size: 32, offset: 128)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "avm_motor_module_st", scope: !258, file: !332, line: 5, type: !333, isLocal: false, isDefinition: true)
!258 = distinct !DICompileUnit(language: DW_LANG_C99, file: !259, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !260, globals: !331, splitDebugInlining: false, nameTableKind: None)
!259 = !DIFile(filename: "/home/mjshen/RTOSExploration/Avem/libs/module/avm_motor.c", directory: "/home/mjshen/RTOSExploration/Avem/libs/module", checksumkind: CSK_MD5, checksum: "ffcf33f092fdb4a913792a749f470553")
!260 = !{!7, !261, !275, !286, !118}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !219, line: 1108, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !219, line: 1086, size: 320, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273, !274}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !263, file: !219, line: 1088, baseType: !19, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !263, file: !219, line: 1089, baseType: !19, size: 32, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !263, file: !219, line: 1090, baseType: !19, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !263, file: !219, line: 1091, baseType: !19, size: 32, offset: 96)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !263, file: !219, line: 1092, baseType: !19, size: 32, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !263, file: !219, line: 1093, baseType: !19, size: 32, offset: 160)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !263, file: !219, line: 1094, baseType: !19, size: 32, offset: 192)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !263, file: !219, line: 1095, baseType: !19, size: 32, offset: 224)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !263, file: !219, line: 1096, baseType: !19, size: 32, offset: 256)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !263, file: !219, line: 1097, baseType: !19, size: 32, offset: 288)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !219, line: 1020, baseType: !277)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !219, line: 1011, size: 224, elements: !278)
!278 = !{!279, !280, !281, !282, !283, !284, !285}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "CRL", scope: !277, file: !219, line: 1013, baseType: !19, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "CRH", scope: !277, file: !219, line: 1014, baseType: !19, size: 32, offset: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !277, file: !219, line: 1015, baseType: !19, size: 32, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !277, file: !219, line: 1016, baseType: !19, size: 32, offset: 96)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !277, file: !219, line: 1017, baseType: !19, size: 32, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !277, file: !219, line: 1018, baseType: !19, size: 32, offset: 160)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !277, file: !219, line: 1019, baseType: !19, size: 32, offset: 192)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "TIM_TypeDef", file: !219, line: 1238, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !219, line: 1196, size: 640, elements: !289)
!289 = !{!290, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "CR1", scope: !288, file: !219, line: 1198, baseType: !291, size: 16)
!291 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !116)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !288, file: !219, line: 1199, baseType: !116, size: 16, offset: 16)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !288, file: !219, line: 1200, baseType: !291, size: 16, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !288, file: !219, line: 1201, baseType: !116, size: 16, offset: 48)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "SMCR", scope: !288, file: !219, line: 1202, baseType: !291, size: 16, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !288, file: !219, line: 1203, baseType: !116, size: 16, offset: 80)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "DIER", scope: !288, file: !219, line: 1204, baseType: !291, size: 16, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !288, file: !219, line: 1205, baseType: !116, size: 16, offset: 112)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !288, file: !219, line: 1206, baseType: !291, size: 16, offset: 128)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !288, file: !219, line: 1207, baseType: !116, size: 16, offset: 144)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "EGR", scope: !288, file: !219, line: 1208, baseType: !291, size: 16, offset: 160)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !288, file: !219, line: 1209, baseType: !116, size: 16, offset: 176)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "CCMR1", scope: !288, file: !219, line: 1210, baseType: !291, size: 16, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !288, file: !219, line: 1211, baseType: !116, size: 16, offset: 208)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "CCMR2", scope: !288, file: !219, line: 1212, baseType: !291, size: 16, offset: 224)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !288, file: !219, line: 1213, baseType: !116, size: 16, offset: 240)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "CCER", scope: !288, file: !219, line: 1214, baseType: !291, size: 16, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !288, file: !219, line: 1215, baseType: !116, size: 16, offset: 272)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "CNT", scope: !288, file: !219, line: 1216, baseType: !291, size: 16, offset: 288)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !288, file: !219, line: 1217, baseType: !116, size: 16, offset: 304)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "PSC", scope: !288, file: !219, line: 1218, baseType: !291, size: 16, offset: 320)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !288, file: !219, line: 1219, baseType: !116, size: 16, offset: 336)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ARR", scope: !288, file: !219, line: 1220, baseType: !291, size: 16, offset: 352)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !288, file: !219, line: 1221, baseType: !116, size: 16, offset: 368)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "RCR", scope: !288, file: !219, line: 1222, baseType: !291, size: 16, offset: 384)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !288, file: !219, line: 1223, baseType: !116, size: 16, offset: 400)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "CCR1", scope: !288, file: !219, line: 1224, baseType: !291, size: 16, offset: 416)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !288, file: !219, line: 1225, baseType: !116, size: 16, offset: 432)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "CCR2", scope: !288, file: !219, line: 1226, baseType: !291, size: 16, offset: 448)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED14", scope: !288, file: !219, line: 1227, baseType: !116, size: 16, offset: 464)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "CCR3", scope: !288, file: !219, line: 1228, baseType: !291, size: 16, offset: 480)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED15", scope: !288, file: !219, line: 1229, baseType: !116, size: 16, offset: 496)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "CCR4", scope: !288, file: !219, line: 1230, baseType: !291, size: 16, offset: 512)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED16", scope: !288, file: !219, line: 1231, baseType: !116, size: 16, offset: 528)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "BDTR", scope: !288, file: !219, line: 1232, baseType: !291, size: 16, offset: 544)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED17", scope: !288, file: !219, line: 1233, baseType: !116, size: 16, offset: 560)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "DCR", scope: !288, file: !219, line: 1234, baseType: !291, size: 16, offset: 576)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED18", scope: !288, file: !219, line: 1235, baseType: !116, size: 16, offset: 592)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "DMAR", scope: !288, file: !219, line: 1236, baseType: !291, size: 16, offset: 608)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED19", scope: !288, file: !219, line: 1237, baseType: !116, size: 16, offset: 624)
!331 = !{!256}
!332 = !DIFile(filename: "avm_motor.c", directory: "/home/mjshen/RTOSExploration/Avem/libs/module", checksumkind: CSK_MD5, checksum: "ffcf33f092fdb4a913792a749f470553")
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "avm_module_t", file: !188, line: 4, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "avm_module_s", file: !188, line: 19, size: 160, elements: !335)
!335 = !{!336, !337, !338, !339, !340}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !334, file: !188, line: 20, baseType: !118, size: 16)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "confs", scope: !334, file: !188, line: 21, baseType: !154, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !334, file: !188, line: 22, baseType: !194, size: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "enable_module", scope: !334, file: !188, line: 23, baseType: !198, size: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "disable_module", scope: !334, file: !188, line: 24, baseType: !198, size: 32, offset: 128)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "avm_mpu_module_st", scope: !343, file: !352, line: 5, type: !394, isLocal: false, isDefinition: true)
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !344, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !345, globals: !348, splitDebugInlining: false, nameTableKind: None)
!344 = !DIFile(filename: "/home/mjshen/RTOSExploration/Avem/libs/module/avm_mpu6050.c", directory: "/home/mjshen/RTOSExploration/Avem/libs/module", checksumkind: CSK_MD5, checksum: "0a6d3f72b58f848b690f49c93e410d1b")
!345 = !{!243, !11, !7, !346, !347}
!346 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!347 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!348 = !{!341, !349, !374, !376, !378, !380, !382, !384, !386, !388, !390, !392}
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "g_q0", scope: !351, file: !352, line: 114, type: !347, isLocal: true, isDefinition: true)
!351 = distinct !DISubprogram(name: "IMU_Comput", scope: !352, file: !352, line: 113, type: !353, scopeLine: 113, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !343, retainedNodes: !365)
!352 = !DIFile(filename: "avm_mpu6050.c", directory: "/home/mjshen/RTOSExploration/Avem/libs/module", checksumkind: CSK_MD5, checksum: "0a6d3f72b58f848b690f49c93e410d1b")
!353 = !DISubroutineType(types: !354)
!354 = !{null, !355}
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "SixAxis", file: !356, line: 62, baseType: !357)
!356 = !DIFile(filename: "avm_mpu6050.h", directory: "/home/mjshen/RTOSExploration/Avem/libs/module", checksumkind: CSK_MD5, checksum: "7ca90c792aa70499945426f5120627de")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !356, line: 55, size: 192, elements: !358)
!358 = !{!359, !360, !361, !362, !363, !364}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "gX", scope: !357, file: !356, line: 56, baseType: !347, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "gY", scope: !357, file: !356, line: 57, baseType: !347, size: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "gZ", scope: !357, file: !356, line: 58, baseType: !347, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "aX", scope: !357, file: !356, line: 59, baseType: !347, size: 32, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "aY", scope: !357, file: !356, line: 60, baseType: !347, size: 32, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "aZ", scope: !357, file: !356, line: 61, baseType: !347, size: 32, offset: 160)
!365 = !{!366, !367, !368, !369, !370, !371, !372, !373}
!366 = !DILocalVariable(name: "cache", arg: 1, scope: !351, file: !352, line: 113, type: !355)
!367 = !DILocalVariable(name: "norm", scope: !351, file: !352, line: 118, type: !347)
!368 = !DILocalVariable(name: "vx", scope: !351, file: !352, line: 119, type: !347)
!369 = !DILocalVariable(name: "vy", scope: !351, file: !352, line: 119, type: !347)
!370 = !DILocalVariable(name: "vz", scope: !351, file: !352, line: 119, type: !347)
!371 = !DILocalVariable(name: "ex", scope: !351, file: !352, line: 120, type: !347)
!372 = !DILocalVariable(name: "ey", scope: !351, file: !352, line: 120, type: !347)
!373 = !DILocalVariable(name: "ez", scope: !351, file: !352, line: 120, type: !347)
!374 = !DIGlobalVariableExpression(var: !375, expr: !DIExpression())
!375 = distinct !DIGlobalVariable(name: "g_q1", scope: !351, file: !352, line: 114, type: !347, isLocal: true, isDefinition: true)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "g_q2", scope: !351, file: !352, line: 114, type: !347, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "g_q3", scope: !351, file: !352, line: 114, type: !347, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "g_exInt", scope: !351, file: !352, line: 115, type: !347, isLocal: true, isDefinition: true)
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "g_eyInt", scope: !351, file: !352, line: 115, type: !347, isLocal: true, isDefinition: true)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "g_ezInt", scope: !351, file: !352, line: 115, type: !347, isLocal: true, isDefinition: true)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "g_Yaw", scope: !343, file: !352, line: 110, type: !347, isLocal: false, isDefinition: true)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "g_Pitch", scope: !343, file: !352, line: 110, type: !347, isLocal: false, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "g_Roll", scope: !343, file: !352, line: 110, type: !347, isLocal: false, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "avm_euler", scope: !343, file: !352, line: 111, type: !355, isLocal: false, isDefinition: true)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "avm_module_t", file: !188, line: 4, baseType: !395)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "avm_module_s", file: !188, line: 19, size: 160, elements: !396)
!396 = !{!397, !398, !399, !400, !401}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !395, file: !188, line: 20, baseType: !118, size: 16)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "confs", scope: !395, file: !188, line: 21, baseType: !154, size: 32, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !395, file: !188, line: 22, baseType: !194, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "enable_module", scope: !395, file: !188, line: 23, baseType: !198, size: 32, offset: 96)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "disable_module", scope: !395, file: !188, line: 24, baseType: !198, size: 32, offset: 128)
!402 = !DIGlobalVariableExpression(var: !403, expr: !DIExpression())
!403 = distinct !DIGlobalVariable(name: "avm_uart_conf", scope: !404, file: !583, line: 4, type: !592, isLocal: true, isDefinition: true)
!404 = distinct !DICompileUnit(language: DW_LANG_C99, file: !405, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !406, retainedTypes: !478, globals: !580, splitDebugInlining: false, nameTableKind: None)
!405 = !DIFile(filename: "/home/mjshen/RTOSExploration/Avem/libs/module/avm_uart.c", directory: "/home/mjshen/RTOSExploration/Avem/libs/module", checksumkind: CSK_MD5, checksum: "c79a9a9311bd76fbd7a1ba3c951eeb70")
!406 = !{!407}
!407 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !219, line: 177, baseType: !408, size: 32, elements: !409)
!408 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477}
!410 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!411 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!412 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!413 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!414 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!415 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!416 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!417 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!418 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!419 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!420 = !DIEnumerator(name: "TAMPER_IRQn", value: 2)
!421 = !DIEnumerator(name: "RTC_IRQn", value: 3)
!422 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!423 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!424 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!425 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!426 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!427 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!428 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!429 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!430 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!431 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!432 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!433 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!434 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!435 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!436 = !DIEnumerator(name: "ADC1_2_IRQn", value: 18)
!437 = !DIEnumerator(name: "USB_HP_CAN1_TX_IRQn", value: 19)
!438 = !DIEnumerator(name: "USB_LP_CAN1_RX0_IRQn", value: 20)
!439 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!440 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!441 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!442 = !DIEnumerator(name: "TIM1_BRK_IRQn", value: 24)
!443 = !DIEnumerator(name: "TIM1_UP_IRQn", value: 25)
!444 = !DIEnumerator(name: "TIM1_TRG_COM_IRQn", value: 26)
!445 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!446 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!447 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!448 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!449 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!450 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!451 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!452 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!453 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!454 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!455 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!456 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!457 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!458 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!459 = !DIEnumerator(name: "RTCAlarm_IRQn", value: 41)
!460 = !DIEnumerator(name: "USBWakeUp_IRQn", value: 42)
!461 = !DIEnumerator(name: "TIM8_BRK_IRQn", value: 43)
!462 = !DIEnumerator(name: "TIM8_UP_IRQn", value: 44)
!463 = !DIEnumerator(name: "TIM8_TRG_COM_IRQn", value: 45)
!464 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!465 = !DIEnumerator(name: "ADC3_IRQn", value: 47)
!466 = !DIEnumerator(name: "FSMC_IRQn", value: 48)
!467 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!468 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!469 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!470 = !DIEnumerator(name: "UART4_IRQn", value: 52)
!471 = !DIEnumerator(name: "UART5_IRQn", value: 53)
!472 = !DIEnumerator(name: "TIM6_IRQn", value: 54)
!473 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!474 = !DIEnumerator(name: "DMA2_Channel1_IRQn", value: 56)
!475 = !DIEnumerator(name: "DMA2_Channel2_IRQn", value: 57)
!476 = !DIEnumerator(name: "DMA2_Channel3_IRQn", value: 58)
!477 = !DIEnumerator(name: "DMA2_Channel4_5_IRQn", value: 59)
!478 = !{!347, !7, !479, !493, !504, !116, !522, !30, !11, !154, !523, !555}
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !219, line: 1108, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !219, line: 1086, size: 320, elements: !482)
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !492}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !481, file: !219, line: 1088, baseType: !19, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !481, file: !219, line: 1089, baseType: !19, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !481, file: !219, line: 1090, baseType: !19, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !481, file: !219, line: 1091, baseType: !19, size: 32, offset: 96)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !481, file: !219, line: 1092, baseType: !19, size: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !481, file: !219, line: 1093, baseType: !19, size: 32, offset: 160)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !481, file: !219, line: 1094, baseType: !19, size: 32, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !481, file: !219, line: 1095, baseType: !19, size: 32, offset: 224)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !481, file: !219, line: 1096, baseType: !19, size: 32, offset: 256)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !481, file: !219, line: 1097, baseType: !19, size: 32, offset: 288)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !219, line: 1020, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !219, line: 1011, size: 224, elements: !496)
!496 = !{!497, !498, !499, !500, !501, !502, !503}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "CRL", scope: !495, file: !219, line: 1013, baseType: !19, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "CRH", scope: !495, file: !219, line: 1014, baseType: !19, size: 32, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !495, file: !219, line: 1015, baseType: !19, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !495, file: !219, line: 1016, baseType: !19, size: 32, offset: 96)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !495, file: !219, line: 1017, baseType: !19, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !495, file: !219, line: 1018, baseType: !19, size: 32, offset: 160)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !495, file: !219, line: 1019, baseType: !19, size: 32, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "USART_TypeDef", file: !219, line: 1260, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !219, line: 1244, size: 224, elements: !507)
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !506, file: !219, line: 1246, baseType: !291, size: 16)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !506, file: !219, line: 1247, baseType: !116, size: 16, offset: 16)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !506, file: !219, line: 1248, baseType: !291, size: 16, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !506, file: !219, line: 1249, baseType: !116, size: 16, offset: 48)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "BRR", scope: !506, file: !219, line: 1250, baseType: !291, size: 16, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !506, file: !219, line: 1251, baseType: !116, size: 16, offset: 80)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "CR1", scope: !506, file: !219, line: 1252, baseType: !291, size: 16, offset: 96)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !506, file: !219, line: 1253, baseType: !116, size: 16, offset: 112)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "CR2", scope: !506, file: !219, line: 1254, baseType: !291, size: 16, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !506, file: !219, line: 1255, baseType: !116, size: 16, offset: 144)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "CR3", scope: !506, file: !219, line: 1256, baseType: !291, size: 16, offset: 160)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !506, file: !219, line: 1257, baseType: !116, size: 16, offset: 176)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "GTPR", scope: !506, file: !219, line: 1258, baseType: !291, size: 16, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !506, file: !219, line: 1259, baseType: !116, size: 16, offset: 208)
!522 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !147, line: 296, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !147, line: 281, size: 28704, elements: !526)
!526 = !{!527, !531, !535, !536, !537, !538, !539, !540, !541, !542, !546, !550, !554}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !525, file: !147, line: 283, baseType: !528, size: 256)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 256, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 8)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !525, file: !147, line: 284, baseType: !532, size: 768, offset: 256)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 768, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 24)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !525, file: !147, line: 285, baseType: !528, size: 256, offset: 1024)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !525, file: !147, line: 286, baseType: !532, size: 768, offset: 1280)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !525, file: !147, line: 287, baseType: !528, size: 256, offset: 2048)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !525, file: !147, line: 288, baseType: !532, size: 768, offset: 2304)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !525, file: !147, line: 289, baseType: !528, size: 256, offset: 3072)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !525, file: !147, line: 290, baseType: !532, size: 768, offset: 3328)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !525, file: !147, line: 291, baseType: !528, size: 256, offset: 4096)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !525, file: !147, line: 292, baseType: !543, size: 1792, offset: 4352)
!543 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1792, elements: !544)
!544 = !{!545}
!545 = !DISubrange(count: 56)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !525, file: !147, line: 293, baseType: !547, size: 1920, offset: 6144)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 1920, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 240)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !525, file: !147, line: 294, baseType: !551, size: 20608, offset: 8064)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 20608, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 644)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !525, file: !147, line: 295, baseType: !19, size: 32, offset: 28672)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !147, line: 336, baseType: !557)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !147, line: 313, size: 1120, elements: !558)
!558 = !{!559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !557, file: !147, line: 315, baseType: !18, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !557, file: !147, line: 316, baseType: !19, size: 32, offset: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !557, file: !147, line: 317, baseType: !19, size: 32, offset: 64)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !557, file: !147, line: 318, baseType: !19, size: 32, offset: 96)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !557, file: !147, line: 319, baseType: !19, size: 32, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !557, file: !147, line: 320, baseType: !19, size: 32, offset: 160)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !557, file: !147, line: 321, baseType: !26, size: 96, offset: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !557, file: !147, line: 322, baseType: !19, size: 32, offset: 288)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !557, file: !147, line: 323, baseType: !19, size: 32, offset: 320)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !557, file: !147, line: 324, baseType: !19, size: 32, offset: 352)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !557, file: !147, line: 325, baseType: !19, size: 32, offset: 384)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !557, file: !147, line: 326, baseType: !19, size: 32, offset: 416)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !557, file: !147, line: 327, baseType: !19, size: 32, offset: 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !557, file: !147, line: 328, baseType: !19, size: 32, offset: 480)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !557, file: !147, line: 329, baseType: !41, size: 64, offset: 512)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !557, file: !147, line: 330, baseType: !18, size: 32, offset: 576)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !557, file: !147, line: 331, baseType: !18, size: 32, offset: 608)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !557, file: !147, line: 332, baseType: !47, size: 128, offset: 640)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !557, file: !147, line: 333, baseType: !51, size: 160, offset: 768)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !557, file: !147, line: 334, baseType: !55, size: 160, offset: 928)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !557, file: !147, line: 335, baseType: !19, size: 32, offset: 1088)
!580 = !{!581, !402}
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "avm_uart_module_st", scope: !404, file: !583, line: 6, type: !584, isLocal: false, isDefinition: true)
!583 = !DIFile(filename: "avm_uart.c", directory: "/home/mjshen/RTOSExploration/Avem/libs/module", checksumkind: CSK_MD5, checksum: "c79a9a9311bd76fbd7a1ba3c951eeb70")
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "avm_module_t", file: !188, line: 4, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "avm_module_s", file: !188, line: 19, size: 160, elements: !586)
!586 = !{!587, !588, !589, !590, !591}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !585, file: !188, line: 20, baseType: !118, size: 16)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "confs", scope: !585, file: !188, line: 21, baseType: !154, size: 32, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "init_module", scope: !585, file: !188, line: 22, baseType: !194, size: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "enable_module", scope: !585, file: !188, line: 23, baseType: !198, size: 32, offset: 96)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "disable_module", scope: !585, file: !188, line: 24, baseType: !198, size: 32, offset: 128)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 64, elements: !42)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "avm_pid", scope: !595, file: !599, line: 15, type: !600, isLocal: false, isDefinition: true)
!595 = distinct !DICompileUnit(language: DW_LANG_C99, file: !596, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !597, globals: !598, splitDebugInlining: false, nameTableKind: None)
!596 = !DIFile(filename: "/home/mjshen/RTOSExploration/Avem/libs/module/avm_pid.c", directory: "/home/mjshen/RTOSExploration/Avem/libs/module", checksumkind: CSK_MD5, checksum: "83391c05fe41722cde1f18573cbb36a9")
!597 = !{!346, !118}
!598 = !{!593}
!599 = !DIFile(filename: "avm_pid.c", directory: "/home/mjshen/RTOSExploration/Avem/libs/module", checksumkind: CSK_MD5, checksum: "83391c05fe41722cde1f18573cbb36a9")
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_st", file: !601, line: 30, baseType: !602)
!601 = !DIFile(filename: "avm_pid.h", directory: "/home/mjshen/RTOSExploration/Avem/libs/module", checksumkind: CSK_MD5, checksum: "06f5805b7c1f68d8b5a50a4823cf3e76")
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !601, line: 18, size: 352, elements: !603)
!603 = !{!604, !605, !606, !608, !609, !610, !611, !612, !613, !614, !616}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "InnerLast", scope: !602, file: !601, line: 19, baseType: !347, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "OutterLast", scope: !602, file: !601, line: 20, baseType: !347, size: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Feedback", scope: !602, file: !601, line: 21, baseType: !607, size: 32, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "Gyro", scope: !602, file: !601, line: 22, baseType: !607, size: 32, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "Error", scope: !602, file: !601, line: 23, baseType: !347, size: 32, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !602, file: !601, line: 24, baseType: !347, size: 32, offset: 160)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !602, file: !601, line: 25, baseType: !347, size: 32, offset: 192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !602, file: !601, line: 26, baseType: !347, size: 32, offset: 224)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !602, file: !601, line: 27, baseType: !346, size: 16, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Channel1", scope: !602, file: !601, line: 28, baseType: !615, size: 32, offset: 288)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "Channel2", scope: !602, file: !601, line: 29, baseType: !615, size: 32, offset: 320)
!617 = distinct !DICompileUnit(language: DW_LANG_C99, file: !618, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !619, splitDebugInlining: false, nameTableKind: None)
!618 = !DIFile(filename: "main.c", directory: "/home/mjshen/RTOSExploration/Avem/src", checksumkind: CSK_MD5, checksum: "5039076196fb027f1101e9bfbb081b90")
!619 = !{!155}
!620 = !{!"Ubuntu clang version 14.0.6"}
!621 = !{i32 7, !"Dwarf Version", i32 5}
!622 = !{i32 2, !"Debug Info Version", i32 3}
!623 = !{i32 1, !"wchar_size", i32 4}
!624 = !{i32 1, !"min_enum_size", i32 4}
!625 = !{i32 1, !"branch-target-enforcement", i32 0}
!626 = !{i32 1, !"sign-return-address", i32 0}
!627 = !{i32 1, !"sign-return-address-all", i32 0}
!628 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!629 = !{i32 7, !"frame-pointer", i32 2}
!630 = distinct !DISubprogram(name: "Reset_Handler", scope: !3, file: !3, line: 242, type: !61, scopeLine: 242, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !631)
!631 = !{}
!632 = !DILocation(line: 243, column: 2, scope: !630)
!633 = !DILocation(line: 245, column: 12, scope: !630)
!634 = !{!635, !636, i64 8}
!635 = !{!"", !636, i64 0, !636, i64 4, !636, i64 8, !636, i64 12, !636, i64 16, !636, i64 20, !637, i64 24, !636, i64 36, !636, i64 40, !636, i64 44, !636, i64 48, !636, i64 52, !636, i64 56, !636, i64 60, !637, i64 64, !636, i64 72, !636, i64 76, !637, i64 80, !637, i64 96, !637, i64 116, !636, i64 136}
!636 = !{!"int", !637, i64 0}
!637 = !{!"omnipotent char", !638, i64 0}
!638 = !{!"Simple C/C++ TBAA"}
!639 = !DILocation(line: 246, column: 2, scope: !630)
!640 = !DILocation(line: 247, column: 2, scope: !630)
!641 = !DILocation(line: 248, column: 2, scope: !630)
!642 = distinct !{!642, !641, !643}
!643 = !DILocation(line: 248, column: 12, scope: !630)
!644 = distinct !DISubprogram(name: "Default_Handler", scope: !3, file: !3, line: 320, type: !61, scopeLine: 321, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !631)
!645 = !DILocation(line: 322, column: 1, scope: !644)
!646 = distinct !{!646, !645, !647}
!647 = !DILocation(line: 322, column: 12, scope: !644)
!648 = distinct !DISubprogram(name: "__Init_Data", scope: !3, file: !3, line: 229, type: !61, scopeLine: 229, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !649)
!649 = !{!650, !652}
!650 = !DILocalVariable(name: "src", scope: !648, file: !3, line: 230, type: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!652 = !DILocalVariable(name: "dst", scope: !648, file: !3, line: 230, type: !651)
!653 = !DILocation(line: 0, scope: !648)
!654 = !DILocation(line: 234, column: 6, scope: !648)
!655 = !DILocation(line: 235, column: 3, scope: !656)
!656 = distinct !DILexicalBlock(scope: !648, file: !3, line: 234, column: 6)
!657 = !DILocation(line: 236, column: 13, scope: !656)
!658 = !{!659, !659, i64 0}
!659 = !{!"long", !637, i64 0}
!660 = !DILocation(line: 239, column: 2, scope: !648)
!661 = !DILocation(line: 240, column: 12, scope: !648)
!662 = !DILocation(line: 241, column: 1, scope: !648)
!663 = distinct !DISubprogram(name: "main", scope: !618, file: !618, line: 3, type: !664, scopeLine: 3, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !617, retainedNodes: !631)
!664 = !DISubroutineType(types: !665)
!665 = !{!408}
!666 = !DILocation(line: 14, column: 21, scope: !663)
!667 = !{!668, !670, i64 8}
!668 = !{!"avm_module_s", !669, i64 0, !670, i64 4, !670, i64 8, !670, i64 12, !670, i64 16}
!669 = !{!"short", !637, i64 0}
!670 = !{!"any pointer", !637, i64 0}
!671 = !DILocation(line: 14, column: 2, scope: !663)
