; ModuleID = 'build/actinius_icarus_bee_ns/device_pm/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16*, %struct.pm_device* }
%struct.device_state = type { i8, i8 }
%struct.pm_device = type { %struct.device*, %struct.k_mutex, i32, %struct.k_work_delayable, %struct.k_condvar, %struct.device*, i32, i32, i32 (%struct.device*, i32)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/device_pm/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/device_pm")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/device_pm")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "parent", scope: !27, file: !344, line: 13, type: !126, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !114, globals: !341, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/pm/device_pm/src/dummy_driver.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/device_pm")
!29 = !{!30, !38, !44}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_state", file: !31, line: 53, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/pm/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37}
!34 = !DIEnumerator(name: "PM_DEVICE_STATE_ACTIVE", value: 0)
!35 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDED", value: 1)
!36 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDING", value: 2)
!37 = !DIEnumerator(name: "PM_DEVICE_STATE_OFF", value: 3)
!38 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_action", file: !31, line: 75, baseType: !32, size: 32, elements: !39)
!39 = !{!40, !41, !42, !43}
!40 = !DIEnumerator(name: "PM_DEVICE_ACTION_SUSPEND", value: 0)
!41 = !DIEnumerator(name: "PM_DEVICE_ACTION_RESUME", value: 1)
!42 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_OFF", value: 2)
!43 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_ON", value: 3)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !45, line: 27, baseType: !32, size: 32, elements: !46)
!45 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113}
!47 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!48 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!49 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!50 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!51 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!52 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!53 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!54 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!55 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!56 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!57 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!58 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!59 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!60 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!61 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!62 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!63 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!113 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!114 = !{!115, !116, !117}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!116 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dummy_parent_api", file: !119, line: 17, size: 32, elements: !120)
!119 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_parent.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!120 = !{!121}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "transfer", scope: !118, file: !119, line: 18, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_transfer_t", file: !119, line: 14, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DISubroutineType(types: !125)
!125 = !{!116, !126, !223, !340}
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !129, line: 378, size: 224, elements: !130)
!129 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !{!131, !135, !136, !137, !146, !147, !153}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !129, line: 380, baseType: !132, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !128, file: !129, line: 382, baseType: !13, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !128, file: !129, line: 384, baseType: !13, size: 32, offset: 64)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !128, file: !129, line: 386, baseType: !138, size: 32, offset: 96)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !129, line: 351, size: 16, elements: !140)
!140 = !{!141, !144}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !139, file: !129, line: 359, baseType: !142, size: 8)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !143)
!143 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !139, file: !129, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!145 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !128, file: !129, line: 388, baseType: !115, size: 32, offset: 128)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !128, file: !129, line: 396, baseType: !148, size: 32, offset: 160)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !129, line: 43, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !152)
!152 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !128, file: !129, line: 403, baseType: !154, size: 32, offset: 192)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_device", file: !31, line: 121, size: 832, elements: !156)
!156 = !{!157, !158, !287, !288, !325, !329, !330, !334, !335}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !155, file: !31, line: 124, baseType: !126, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !155, file: !31, line: 126, baseType: !159, size: 160, offset: 32)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !160, line: 2720, size: 160, elements: !161)
!160 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!161 = !{!162, !183, !285, !286}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !159, file: !160, line: 2722, baseType: !163, size: 64)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !164, line: 233, baseType: !165)
!164 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 231, size: 64, elements: !166)
!166 = !{!167}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !165, file: !164, line: 232, baseType: !168, size: 64)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !169, line: 48, baseType: !170)
!169 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !169, line: 37, size: 64, elements: !171)
!171 = !{!172, !178}
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !170, file: !169, line: 38, baseType: !173, size: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !170, file: !169, line: 38, size: 32, elements: !174)
!174 = !{!175, !177}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !173, file: !169, line: 39, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !169, line: 40, baseType: !176, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, scope: !170, file: !169, line: 42, baseType: !179, size: 32, offset: 32)
!179 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !170, file: !169, line: 42, size: 32, elements: !180)
!180 = !{!181, !182}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !179, file: !169, line: 43, baseType: !176, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !179, file: !169, line: 44, baseType: !176, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !159, file: !160, line: 2724, baseType: !184, size: 32, offset: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !186, line: 245, size: 1024, elements: !187)
!186 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!187 = !{!188, !238, !251, !252, !253, !254, !262, !280}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !185, file: !186, line: 247, baseType: !189, size: 384)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !186, line: 57, size: 384, elements: !190)
!190 = !{!191, !205, !207, !208, !209, !222, !224, !225}
!191 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !186, line: 60, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !186, line: 60, size: 64, elements: !193)
!193 = !{!194, !196}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !192, file: !186, line: 61, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !169, line: 49, baseType: !170)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !192, file: !186, line: 62, baseType: !197, size: 64)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !198, line: 49, size: 64, elements: !199)
!198 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !197, file: !198, line: 50, baseType: !201, size: 64)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 64, elements: !203)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!203 = !{!204}
!204 = !DISubrange(count: 2)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !189, file: !186, line: 68, baseType: !206, size: 32, offset: 64)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !189, file: !186, line: 71, baseType: !142, size: 8, offset: 96)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !189, file: !186, line: 74, baseType: !142, size: 8, offset: 104)
!209 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !186, line: 90, baseType: !210, size: 16, offset: 112)
!210 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !186, line: 90, size: 16, elements: !211)
!211 = !{!212, !219}
!212 = !DIDerivedType(tag: DW_TAG_member, scope: !210, file: !186, line: 91, baseType: !213, size: 16)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !210, file: !186, line: 91, size: 16, elements: !214)
!214 = !{!215, !218}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !213, file: !186, line: 96, baseType: !216, size: 8)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !217)
!217 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !213, file: !186, line: 97, baseType: !142, size: 8, offset: 8)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !210, file: !186, line: 100, baseType: !220, size: 16)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !221)
!221 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !189, file: !186, line: 107, baseType: !223, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !189, file: !186, line: 127, baseType: !115, size: 32, offset: 160)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !189, file: !186, line: 131, baseType: !226, size: 192, offset: 192)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !164, line: 244, size: 192, elements: !227)
!227 = !{!228, !229, !235}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !226, file: !164, line: 245, baseType: !195, size: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !226, file: !164, line: 246, baseType: !230, size: 32, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !164, line: 242, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DISubroutineType(types: !233)
!233 = !{null, !234}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !226, file: !164, line: 249, baseType: !236, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !237)
!237 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !185, file: !186, line: 250, baseType: !239, size: 288, offset: 384)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !240, line: 25, size: 288, elements: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !{!242, !243, !244, !245, !246, !247, !248, !249, !250}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !239, file: !240, line: 26, baseType: !223, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !239, file: !240, line: 27, baseType: !223, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !239, file: !240, line: 28, baseType: !223, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !239, file: !240, line: 29, baseType: !223, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !239, file: !240, line: 30, baseType: !223, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !239, file: !240, line: 31, baseType: !223, size: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !239, file: !240, line: 32, baseType: !223, size: 32, offset: 192)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !239, file: !240, line: 33, baseType: !223, size: 32, offset: 224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !239, file: !240, line: 34, baseType: !223, size: 32, offset: 256)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !185, file: !186, line: 253, baseType: !115, size: 32, offset: 672)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !185, file: !186, line: 256, baseType: !163, size: 64, offset: 704)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !185, file: !186, line: 294, baseType: !116, size: 32, offset: 768)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !185, file: !186, line: 300, baseType: !255, size: 96, offset: 800)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !186, line: 149, size: 96, elements: !256)
!256 = !{!257, !258, !261}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !255, file: !186, line: 153, baseType: !22, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !255, file: !186, line: 162, baseType: !259, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !260, line: 214, baseType: !32)
!260 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!261 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !255, file: !186, line: 168, baseType: !259, size: 32, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !185, file: !186, line: 325, baseType: !263, size: 32, offset: 896)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 32)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !160, line: 5073, size: 160, elements: !265)
!265 = !{!266, !275, !276}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !264, file: !160, line: 5074, baseType: !267, size: 96)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !268, line: 56, size: 96, elements: !269)
!268 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !{!270, !273, !274}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !267, file: !268, line: 57, baseType: !271, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !268, line: 57, flags: DIFlagFwdDecl)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !267, file: !268, line: 58, baseType: !115, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !267, file: !268, line: 59, baseType: !259, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !264, file: !160, line: 5075, baseType: !163, size: 64, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !264, file: !160, line: 5076, baseType: !277, offset: 160)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !279)
!278 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!279 = !{}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !185, file: !186, line: 343, baseType: !281, size: 64, offset: 928)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !240, line: 60, size: 64, elements: !282)
!282 = !{!283, !284}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !281, file: !240, line: 63, baseType: !223, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !281, file: !240, line: 66, baseType: !223, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !159, file: !160, line: 2727, baseType: !223, size: 32, offset: 96)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !159, file: !160, line: 2730, baseType: !116, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !155, file: !31, line: 128, baseType: !223, size: 32, offset: 192)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !155, file: !31, line: 130, baseType: !289, size: 384, offset: 256)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_delayable", file: !160, line: 3691, size: 384, elements: !290)
!290 = !{!291, !323, !324}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !289, file: !160, line: 3693, baseType: !292, size: 128)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work", file: !160, line: 3663, size: 128, elements: !293)
!293 = !{!294, !301, !307, !322}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !292, file: !160, line: 3669, baseType: !295, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !296, line: 33, baseType: !297)
!296 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !296, line: 29, size: 32, elements: !298)
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !296, line: 30, baseType: !300, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !292, file: !160, line: 3672, baseType: !302, size: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_work_handler_t", file: !160, line: 3071, baseType: !303)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !306}
!306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !292, file: !160, line: 3675, baseType: !308, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_q", file: !160, line: 3810, size: 1280, elements: !310)
!310 = !{!311, !312, !319, !320, !321}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !309, file: !160, line: 3812, baseType: !185, size: 1024)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !309, file: !160, line: 3819, baseType: !313, size: 64, offset: 1024)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !296, line: 40, baseType: !314)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !296, line: 35, size: 64, elements: !315)
!315 = !{!316, !318}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !314, file: !296, line: 36, baseType: !317, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !314, file: !296, line: 37, baseType: !317, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "notifyq", scope: !309, file: !160, line: 3822, baseType: !163, size: 64, offset: 1088)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "drainq", scope: !309, file: !160, line: 3825, baseType: !163, size: 64, offset: 1152)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !309, file: !160, line: 3828, baseType: !223, size: 32, offset: 1216)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !292, file: !160, line: 3683, baseType: !223, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !289, file: !160, line: 3696, baseType: !226, size: 192, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !289, file: !160, line: 3699, baseType: !308, size: 32, offset: 320)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "condvar", scope: !155, file: !31, line: 132, baseType: !326, size: 64, offset: 640)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !160, line: 2828, size: 64, elements: !327)
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !326, file: !160, line: 2829, baseType: !163, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !155, file: !31, line: 136, baseType: !126, size: 32, offset: 704)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !155, file: !31, line: 139, baseType: !331, size: 32, offset: 736)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !332, line: 22, baseType: !333)
!332 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!333 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !155, file: !31, line: 141, baseType: !30, size: 32, offset: 768)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "action_cb", scope: !155, file: !31, line: 143, baseType: !336, size: 32, offset: 800)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_device_action_cb_t", file: !31, line: 104, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DISubroutineType(types: !339)
!339 = !{!116, !126, !38}
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!341 = !{!342, !348, !350, !25, !361, !363, !365, !385}
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_driver", scope: !27, file: !344, line: 117, type: !345, isLocal: false, isDefinition: true, align: 16)
!344 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_driver.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !149, size: 48, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 3)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "__device_dummy_driver", scope: !27, file: !344, line: 117, type: !127, isLocal: true, isDefinition: true, align: 32)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "__init___device_dummy_driver", scope: !27, file: !344, line: 117, type: !352, isLocal: true, isDefinition: true, align: 32)
!352 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !354, line: 51, size: 64, elements: !355)
!354 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!355 = !{!356, !360}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !353, file: !354, line: 60, baseType: !357, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !358, size: 32)
!358 = !DISubroutineType(types: !359)
!359 = !{!116, !126}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !353, file: !354, line: 65, baseType: !126, size: 32, offset: 32)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "__pm_slot_dummy_driver", scope: !27, file: !344, line: 115, type: !126, isLocal: true, isDefinition: true, align: 32)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "__devstate_dummy_driver", scope: !27, file: !344, line: 117, type: !139, isLocal: true, isDefinition: true, align: 8)
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "funcs", scope: !27, file: !344, line: 98, type: !367, isLocal: true, isDefinition: true)
!367 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dummy_driver_api", file: !369, line: 19, size: 128, elements: !370)
!369 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_driver.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!370 = !{!371, !373, !378, !383}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !368, file: !369, line: 20, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_open_t", file: !369, line: 11, baseType: !357)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "read", scope: !368, file: !369, line: 21, baseType: !374, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_read_t", file: !369, line: 13, baseType: !375)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 32)
!376 = !DISubroutineType(types: !377)
!377 = !{!116, !126, !340}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "write", scope: !368, file: !369, line: 22, baseType: !379, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_write_t", file: !369, line: 15, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DISubroutineType(types: !382)
!382 = !{!116, !126, !223}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !368, file: !369, line: 23, baseType: !384, size: 32, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_close_t", file: !369, line: 17, baseType: !357)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "__pm_device_dummy_driver", scope: !27, file: !344, line: 115, type: !155, isLocal: true, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_driver", scope: !389, file: !394, line: 27, type: !345, isLocal: false, isDefinition: true, align: 16)
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !391, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/device_pm/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/device_pm")
!391 = !{!392, !395, !397, !399, !387}
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_48", scope: !389, file: !394, line: 7, type: !345, isLocal: false, isDefinition: true, align: 16)
!394 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/device_pm")
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_6", scope: !389, file: !394, line: 12, type: !345, isLocal: false, isDefinition: true, align: 16)
!397 = !DIGlobalVariableExpression(var: !398, expr: !DIExpression())
!398 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_76", scope: !389, file: !394, line: 17, type: !345, isLocal: false, isDefinition: true, align: 16)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_parent", scope: !389, file: !394, line: 22, type: !345, isLocal: false, isDefinition: true, align: 16)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "funcs", scope: !403, file: !409, line: 43, type: !606, isLocal: true, isDefinition: true)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !405, globals: !406, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/pm/device_pm/src/dummy_parent.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/device_pm")
!405 = !{!115, !116}
!406 = !{!407, !410, !588, !598, !600, !401, !602, !604}
!407 = !DIGlobalVariableExpression(var: !408, expr: !DIExpression())
!408 = distinct !DIGlobalVariable(name: "__devicehdl_dummy_parent", scope: !403, file: !409, line: 54, type: !345, isLocal: false, isDefinition: true, align: 16)
!409 = !DIFile(filename: "zephyr/samples/subsys/pm/device_pm/src/dummy_parent.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "__device_dummy_parent", scope: !403, file: !409, line: 54, type: !412, isLocal: true, isDefinition: true, align: 32)
!412 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !129, line: 378, size: 224, elements: !414)
!414 = !{!415, !416, !417, !418, !424, !425, !426}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !413, file: !129, line: 380, baseType: !132, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !413, file: !129, line: 382, baseType: !13, size: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !413, file: !129, line: 384, baseType: !13, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !413, file: !129, line: 386, baseType: !419, size: 32, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 32)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !129, line: 351, size: 16, elements: !421)
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !420, file: !129, line: 359, baseType: !142, size: 8)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !420, file: !129, line: 364, baseType: !145, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !413, file: !129, line: 388, baseType: !115, size: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !413, file: !129, line: 396, baseType: !148, size: 32, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !413, file: !129, line: 403, baseType: !427, size: 32, offset: 192)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_device", file: !31, line: 121, size: 832, elements: !429)
!429 = !{!430, !432, !539, !540, !576, !580, !581, !582, !583}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !428, file: !31, line: 124, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !428, file: !31, line: 126, baseType: !433, size: 160, offset: 32)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !160, line: 2720, size: 160, elements: !434)
!434 = !{!435, !454, !537, !538}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !433, file: !160, line: 2722, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !164, line: 233, baseType: !437)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 231, size: 64, elements: !438)
!438 = !{!439}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !437, file: !164, line: 232, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !169, line: 48, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !169, line: 37, size: 64, elements: !442)
!442 = !{!443, !449}
!443 = !DIDerivedType(tag: DW_TAG_member, scope: !441, file: !169, line: 38, baseType: !444, size: 32)
!444 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !441, file: !169, line: 38, size: 32, elements: !445)
!445 = !{!446, !448}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !444, file: !169, line: 39, baseType: !447, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !444, file: !169, line: 40, baseType: !447, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, scope: !441, file: !169, line: 42, baseType: !450, size: 32, offset: 32)
!450 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !441, file: !169, line: 42, size: 32, elements: !451)
!451 = !{!452, !453}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !450, file: !169, line: 43, baseType: !447, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !450, file: !169, line: 44, baseType: !447, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !433, file: !160, line: 2724, baseType: !455, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 32)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !186, line: 245, size: 1024, elements: !457)
!457 = !{!458, !498, !510, !511, !512, !513, !519, !532}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !456, file: !186, line: 247, baseType: !459, size: 384)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !186, line: 57, size: 384, elements: !460)
!460 = !{!461, !472, !474, !475, !476, !485, !486, !487}
!461 = !DIDerivedType(tag: DW_TAG_member, scope: !459, file: !186, line: 60, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !459, file: !186, line: 60, size: 64, elements: !463)
!463 = !{!464, !466}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !462, file: !186, line: 61, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !169, line: 49, baseType: !441)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !462, file: !186, line: 62, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !198, line: 49, size: 64, elements: !468)
!468 = !{!469}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !467, file: !198, line: 50, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 64, elements: !203)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !459, file: !186, line: 68, baseType: !473, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !459, file: !186, line: 71, baseType: !142, size: 8, offset: 96)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !459, file: !186, line: 74, baseType: !142, size: 8, offset: 104)
!476 = !DIDerivedType(tag: DW_TAG_member, scope: !459, file: !186, line: 90, baseType: !477, size: 16, offset: 112)
!477 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !459, file: !186, line: 90, size: 16, elements: !478)
!478 = !{!479, !484}
!479 = !DIDerivedType(tag: DW_TAG_member, scope: !477, file: !186, line: 91, baseType: !480, size: 16)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !477, file: !186, line: 91, size: 16, elements: !481)
!481 = !{!482, !483}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !480, file: !186, line: 96, baseType: !216, size: 8)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !480, file: !186, line: 97, baseType: !142, size: 8, offset: 8)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !477, file: !186, line: 100, baseType: !220, size: 16)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !459, file: !186, line: 107, baseType: !223, size: 32, offset: 128)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !459, file: !186, line: 127, baseType: !115, size: 32, offset: 160)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !459, file: !186, line: 131, baseType: !488, size: 192, offset: 192)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !164, line: 244, size: 192, elements: !489)
!489 = !{!490, !491, !497}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !488, file: !164, line: 245, baseType: !465, size: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !488, file: !164, line: 246, baseType: !492, size: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !164, line: 242, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !496}
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !488, file: !164, line: 249, baseType: !236, size: 64, offset: 128)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !456, file: !186, line: 250, baseType: !499, size: 288, offset: 384)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !240, line: 25, size: 288, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506, !507, !508, !509}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !499, file: !240, line: 26, baseType: !223, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !499, file: !240, line: 27, baseType: !223, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !499, file: !240, line: 28, baseType: !223, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !499, file: !240, line: 29, baseType: !223, size: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !499, file: !240, line: 30, baseType: !223, size: 32, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !499, file: !240, line: 31, baseType: !223, size: 32, offset: 160)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !499, file: !240, line: 32, baseType: !223, size: 32, offset: 192)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !499, file: !240, line: 33, baseType: !223, size: 32, offset: 224)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !499, file: !240, line: 34, baseType: !223, size: 32, offset: 256)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !456, file: !186, line: 253, baseType: !115, size: 32, offset: 672)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !456, file: !186, line: 256, baseType: !436, size: 64, offset: 704)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !456, file: !186, line: 294, baseType: !116, size: 32, offset: 768)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !456, file: !186, line: 300, baseType: !514, size: 96, offset: 800)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !186, line: 149, size: 96, elements: !515)
!515 = !{!516, !517, !518}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !514, file: !186, line: 153, baseType: !22, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !514, file: !186, line: 162, baseType: !259, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !514, file: !186, line: 168, baseType: !259, size: 32, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !456, file: !186, line: 325, baseType: !520, size: 32, offset: 896)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 32)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !160, line: 5073, size: 160, elements: !522)
!522 = !{!523, !529, !530}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !521, file: !160, line: 5074, baseType: !524, size: 96)
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !268, line: 56, size: 96, elements: !525)
!525 = !{!526, !527, !528}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !524, file: !268, line: 57, baseType: !271, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !524, file: !268, line: 58, baseType: !115, size: 32, offset: 32)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !524, file: !268, line: 59, baseType: !259, size: 32, offset: 64)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !521, file: !160, line: 5075, baseType: !436, size: 64, offset: 96)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !521, file: !160, line: 5076, baseType: !531, offset: 160)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !279)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !456, file: !186, line: 343, baseType: !533, size: 64, offset: 928)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !240, line: 60, size: 64, elements: !534)
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !533, file: !240, line: 63, baseType: !223, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !533, file: !240, line: 66, baseType: !223, size: 32, offset: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !433, file: !160, line: 2727, baseType: !223, size: 32, offset: 96)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !433, file: !160, line: 2730, baseType: !116, size: 32, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "usage", scope: !428, file: !31, line: 128, baseType: !223, size: 32, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !428, file: !31, line: 130, baseType: !541, size: 384, offset: 256)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_delayable", file: !160, line: 3691, size: 384, elements: !542)
!542 = !{!543, !574, !575}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "work", scope: !541, file: !160, line: 3693, baseType: !544, size: 128)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work", file: !160, line: 3663, size: 128, elements: !545)
!545 = !{!546, !552, !558, !573}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !544, file: !160, line: 3669, baseType: !547, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !296, line: 33, baseType: !548)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !296, line: 29, size: 32, elements: !549)
!549 = !{!550}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !548, file: !296, line: 30, baseType: !551, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !544, file: !160, line: 3672, baseType: !553, size: 32, offset: 32)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_work_handler_t", file: !160, line: 3071, baseType: !554)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 32)
!555 = !DISubroutineType(types: !556)
!556 = !{null, !557}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !544, file: !160, line: 3675, baseType: !559, size: 32, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_work_q", file: !160, line: 3810, size: 1280, elements: !561)
!561 = !{!562, !563, !570, !571, !572}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !560, file: !160, line: 3812, baseType: !456, size: 1024)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "pending", scope: !560, file: !160, line: 3819, baseType: !564, size: 64, offset: 1024)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !296, line: 40, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !296, line: 35, size: 64, elements: !566)
!566 = !{!567, !569}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !565, file: !296, line: 36, baseType: !568, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !565, file: !296, line: 37, baseType: !568, size: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "notifyq", scope: !560, file: !160, line: 3822, baseType: !436, size: 64, offset: 1088)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "drainq", scope: !560, file: !160, line: 3825, baseType: !436, size: 64, offset: 1152)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !560, file: !160, line: 3828, baseType: !223, size: 32, offset: 1216)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !544, file: !160, line: 3683, baseType: !223, size: 32, offset: 96)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !541, file: !160, line: 3696, baseType: !488, size: 192, offset: 128)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !541, file: !160, line: 3699, baseType: !559, size: 32, offset: 320)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "condvar", scope: !428, file: !31, line: 132, baseType: !577, size: 64, offset: 640)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !160, line: 2828, size: 64, elements: !578)
!578 = !{!579}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !577, file: !160, line: 2829, baseType: !436, size: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !428, file: !31, line: 136, baseType: !431, size: 32, offset: 704)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !428, file: !31, line: 139, baseType: !331, size: 32, offset: 736)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !428, file: !31, line: 141, baseType: !30, size: 32, offset: 768)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "action_cb", scope: !428, file: !31, line: 143, baseType: !584, size: 32, offset: 800)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_device_action_cb_t", file: !31, line: 104, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DISubroutineType(types: !587)
!587 = !{!116, !431, !38}
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "__init___device_dummy_parent", scope: !403, file: !409, line: 54, type: !590, isLocal: true, isDefinition: true, align: 32)
!590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !354, line: 51, size: 64, elements: !592)
!592 = !{!593, !597}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !591, file: !354, line: 60, baseType: !594, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DISubroutineType(types: !596)
!596 = !{!116, !431}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !591, file: !354, line: 65, baseType: !431, size: 32, offset: 32)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "__pm_slot_dummy_parent", scope: !403, file: !409, line: 52, type: !431, isLocal: true, isDefinition: true, align: 32)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "__devstate_dummy_parent", scope: !403, file: !409, line: 54, type: !420, isLocal: true, isDefinition: true, align: 8)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "store_value", scope: !403, file: !409, line: 12, type: !223, isLocal: true, isDefinition: true)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "__pm_device_dummy_parent", scope: !403, file: !409, line: 52, type: !428, isLocal: true, isDefinition: true)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dummy_parent_api", file: !119, line: 17, size: 32, elements: !608)
!608 = !{!609}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "transfer", scope: !607, file: !119, line: 18, baseType: !610, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummy_api_transfer_t", file: !119, line: 14, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!612 = !DISubroutineType(types: !613)
!613 = !{!116, !431, !223, !340}
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "_char_out", scope: !616, file: !620, line: 54, type: !621, isLocal: false, isDefinition: true)
!616 = distinct !DICompileUnit(language: DW_LANG_C99, file: !617, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !618, retainedTypes: !405, globals: !619, splitDebugInlining: false, nameTableKind: None)
!617 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/device_pm")
!618 = !{!44}
!619 = !{!614}
!620 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!622 = !DISubroutineType(types: !623)
!623 = !{!116, !116}
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !626, file: !683, line: 65, type: !684, isLocal: true, isDefinition: true, align: 32)
!626 = distinct !DICompileUnit(language: DW_LANG_C99, file: !627, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !618, retainedTypes: !628, globals: !678, splitDebugInlining: false, nameTableKind: None)
!627 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/device_pm")
!628 = !{!115, !116, !629, !223, !640}
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !631, file: !630, line: 167, baseType: !639)
!630 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!631 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !630, file: !630, line: 134, type: !632, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !626, retainedNodes: !634)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !223}
!634 = !{!635, !636, !638}
!635 = !DILocalVariable(name: "time_us", arg: 1, scope: !631, file: !630, line: 134, type: !223)
!636 = !DILocalVariable(name: "delay_cycles", scope: !631, file: !630, line: 168, type: !637)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !629)
!638 = !DILocalVariable(name: "cycles", scope: !631, file: !630, line: 171, type: !223)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !642, line: 1928, baseType: !643)
!642 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !642, line: 1909, size: 11360, elements: !644)
!644 = !{!645, !651, !652, !653, !654, !658, !659, !660, !661, !663, !664, !668, !669, !670, !671, !672, !676, !677}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !643, file: !642, line: 1910, baseType: !646, size: 8192)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 8192, elements: !649)
!647 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !223)
!649 = !{!650}
!650 = !DISubrange(count: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !643, file: !642, line: 1911, baseType: !647, size: 32, offset: 8192)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !643, file: !642, line: 1912, baseType: !647, size: 32, offset: 8224)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !643, file: !642, line: 1913, baseType: !647, size: 32, offset: 8256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !643, file: !642, line: 1914, baseType: !655, size: 1984, offset: 8288)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 1984, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 62)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !643, file: !642, line: 1915, baseType: !648, size: 32, offset: 10272)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !643, file: !642, line: 1916, baseType: !647, size: 32, offset: 10304)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !643, file: !642, line: 1917, baseType: !648, size: 32, offset: 10336)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !643, file: !642, line: 1918, baseType: !662, size: 96, offset: 10368)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 96, elements: !346)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !643, file: !642, line: 1919, baseType: !648, size: 32, offset: 10464)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !643, file: !642, line: 1920, baseType: !665, size: 256, offset: 10496)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 256, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 8)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !643, file: !642, line: 1921, baseType: !648, size: 32, offset: 10752)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !643, file: !642, line: 1922, baseType: !647, size: 32, offset: 10784)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !643, file: !642, line: 1923, baseType: !648, size: 32, offset: 10816)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !643, file: !642, line: 1924, baseType: !648, size: 32, offset: 10848)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !643, file: !642, line: 1925, baseType: !673, size: 416, offset: 10880)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 416, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 13)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !643, file: !642, line: 1926, baseType: !648, size: 32, offset: 11296)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !643, file: !642, line: 1927, baseType: !648, size: 32, offset: 11328)
!678 = !{!624, !679}
!679 = !DIGlobalVariableExpression(var: !680, expr: !DIExpression())
!680 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !631, file: !630, line: 161, type: !681, isLocal: true, isDefinition: true, align: 128)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 48, elements: !346)
!682 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!683 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !354, line: 51, size: 64, elements: !686)
!686 = !{!687, !694}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !685, file: !354, line: 60, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 32)
!689 = !DISubroutineType(types: !690)
!690 = !{!116, !691}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !693)
!693 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !354, line: 48, flags: DIFlagFwdDecl)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !685, file: !354, line: 65, baseType: !691, size: 32, offset: 32)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !697, file: !735, line: 27, type: !760, isLocal: true, isDefinition: true)
!697 = distinct !DICompileUnit(language: DW_LANG_C99, file: !698, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !699, retainedTypes: !711, globals: !732, splitDebugInlining: false, nameTableKind: None)
!698 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/device_pm")
!699 = !{!700, !30, !38, !44}
!700 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !701, line: 27, baseType: !32, size: 32, elements: !702)
!701 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710}
!703 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!704 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!705 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!706 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!707 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!708 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!709 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!710 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!711 = !{!115, !712, !116, !24, !714, !729, !223, !730}
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !713, line: 46, baseType: !236)
!713 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !716, line: 54, size: 96, elements: !717)
!716 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!717 = !{!718, !724, !728}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !715, file: !716, line: 55, baseType: !719, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !296, line: 33, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !296, line: 29, size: 32, elements: !721)
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !720, file: !296, line: 30, baseType: !723, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !715, file: !716, line: 60, baseType: !725, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 32)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !700}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !715, file: !716, line: 65, baseType: !725, size: 32, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !731)
!731 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!732 = !{!695, !733, !737, !739, !750, !752}
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !697, file: !735, line: 44, type: !736, isLocal: true, isDefinition: true)
!735 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !279)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !697, file: !735, line: 49, type: !736, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !697, file: !735, line: 36, type: !741, isLocal: true, isDefinition: true)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 128, elements: !748)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !701, line: 114, size: 128, elements: !743)
!743 = !{!744, !745, !746, !747}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !742, file: !701, line: 115, baseType: !700, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !742, file: !701, line: 141, baseType: !142, size: 8, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !742, file: !701, line: 149, baseType: !223, size: 32, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !742, file: !701, line: 156, baseType: !223, size: 32, offset: 96)
!748 = !{!749}
!749 = !DISubrange(count: 1)
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !697, file: !735, line: 40, type: !741, isLocal: true, isDefinition: true)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !697, file: !735, line: 28, type: !754, isLocal: true, isDefinition: true)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !296, line: 40, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !296, line: 35, size: 64, elements: !756)
!756 = !{!757, !759}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !755, file: !296, line: 36, baseType: !758, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !755, file: !296, line: 37, baseType: !758, size: 32, offset: 32)
!760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 32, elements: !748)
!761 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!762 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !765, file: !793, line: 50, type: !780, isLocal: true, isDefinition: true)
!765 = distinct !DICompileUnit(language: DW_LANG_C99, file: !766, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !767, retainedTypes: !768, globals: !790, splitDebugInlining: false, nameTableKind: None)
!766 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/device_pm")
!767 = !{!700, !44}
!768 = !{!151, !712, !259, !116, !115, !223, !730, !769, !729, !780, !781}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 32)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !771, line: 45, size: 64, elements: !772)
!771 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!772 = !{!773, !779}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !770, file: !771, line: 46, baseType: !774, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !296, line: 33, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !296, line: 29, size: 32, elements: !776)
!776 = !{!777}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !775, file: !296, line: 30, baseType: !778, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !770, file: !771, line: 48, baseType: !223, size: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !116)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !771, line: 38, size: 64, elements: !783)
!783 = !{!784, !785}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !782, file: !771, line: 39, baseType: !774, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !782, file: !771, line: 41, baseType: !786, size: 32, offset: 32)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !771, line: 35, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DISubroutineType(types: !789)
!789 = !{null, !780}
!790 = !{!791, !795, !803, !763, !805, !815}
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "latency_lock", scope: !765, file: !793, line: 44, type: !794, isLocal: true, isDefinition: true)
!793 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !278, line: 43, elements: !279)
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !765, file: !793, line: 46, type: !797, isLocal: true, isDefinition: true)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !296, line: 40, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !296, line: 35, size: 64, elements: !799)
!799 = !{!800, !802}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !798, file: !296, line: 36, baseType: !801, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !798, file: !296, line: 37, baseType: !801, size: 32, offset: 32)
!803 = !DIGlobalVariableExpression(var: !804, expr: !DIExpression())
!804 = distinct !DIGlobalVariable(name: "latency_subs", scope: !765, file: !793, line: 52, type: !797, isLocal: true, isDefinition: true)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !765, file: !793, line: 39, type: !807, isLocal: true, isDefinition: true)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !808, elements: !813)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !793, line: 35, size: 96, elements: !809)
!809 = !{!810, !811, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !808, file: !793, line: 36, baseType: !700, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !808, file: !793, line: 37, baseType: !142, size: 8, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !808, file: !793, line: 38, baseType: !331, size: 32, offset: 64)
!813 = !{!814}
!814 = !DISubrange(count: 0)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !765, file: !793, line: 48, type: !780, isLocal: true, isDefinition: true)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !819, file: !826, line: 47, type: !840, isLocal: true, isDefinition: true)
!819 = distinct !DICompileUnit(language: DW_LANG_C99, file: !820, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !821, retainedTypes: !822, globals: !823, splitDebugInlining: false, nameTableKind: None)
!820 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/device_pm")
!821 = !{!700}
!822 = !{!259, !116}
!823 = !{!824, !817, !836}
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "cpus_states", scope: !819, file: !826, line: 50, type: !827, isLocal: true, isDefinition: true)
!826 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !828, size: 32, elements: !748)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !701, line: 114, size: 128, elements: !831)
!831 = !{!832, !833, !834, !835}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !830, file: !701, line: 115, baseType: !700, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !830, file: !701, line: 141, baseType: !142, size: 8, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !830, file: !701, line: 149, baseType: !223, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !830, file: !701, line: 156, baseType: !223, size: 32, offset: 96)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !819, file: !826, line: 55, type: !838, isLocal: true, isDefinition: true)
!838 = !DICompositeType(tag: DW_TAG_array_type, baseType: !839, size: 8, elements: !748)
!839 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, elements: !813)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "__init_pm_stats_init", scope: !843, file: !848, line: 53, type: !877, isLocal: true, isDefinition: true, align: 32)
!843 = distinct !DICompileUnit(language: DW_LANG_C99, file: !844, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !767, retainedTypes: !405, globals: !845, splitDebugInlining: false, nameTableKind: None)
!844 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm_stats.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/device_pm")
!845 = !{!841, !846, !867, !870, !872}
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "stats", scope: !843, file: !848, line: 27, type: !849, isLocal: true, isDefinition: true)
!848 = !DIFile(filename: "zephyr/subsys/pm/pm_stats.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 1568, elements: !865)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stats_pm_stats", file: !848, line: 15, size: 224, elements: !851)
!851 = !{!852, !862, !863, !864}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "s_hdr", scope: !850, file: !848, line: 15, baseType: !853, size: 128)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stats_hdr", file: !854, line: 66, size: 128, elements: !855)
!854 = !DIFile(filename: "zephyr/include/zephyr/stats/stats.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!855 = !{!856, !857, !858, !859, !860}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "s_name", scope: !853, file: !854, line: 67, baseType: !132, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "s_size", scope: !853, file: !854, line: 68, baseType: !142, size: 8, offset: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "s_cnt", scope: !853, file: !854, line: 69, baseType: !220, size: 16, offset: 48)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "s_pad1", scope: !853, file: !854, line: 70, baseType: !142, size: 8, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !853, file: !854, line: 75, baseType: !861, size: 32, offset: 96)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "state_count", scope: !850, file: !848, line: 16, baseType: !223, size: 32, offset: 128)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "state_last_cycles", scope: !850, file: !848, line: 17, baseType: !223, size: 32, offset: 160)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "state_total_cycles", scope: !850, file: !848, line: 18, baseType: !223, size: 32, offset: 192)
!865 = !{!749, !866}
!866 = !DISubrange(count: 7)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "time_start", scope: !843, file: !848, line: 31, type: !869, isLocal: true, isDefinition: true)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !223, size: 32, elements: !748)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "time_stop", scope: !843, file: !848, line: 32, type: !869, isLocal: true, isDefinition: true)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "names", scope: !843, file: !848, line: 30, type: !874, isLocal: true, isDefinition: true)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 1400, elements: !875)
!875 = !{!749, !866, !876}
!876 = !DISubrange(count: 25)
!877 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !354, line: 51, size: 64, elements: !879)
!879 = !{!880, !881}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !878, file: !354, line: 60, baseType: !688, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !878, file: !354, line: 65, baseType: !691, size: 32, offset: 32)
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "action_target_state", scope: !884, file: !900, line: 14, type: !901, isLocal: true, isDefinition: true)
!884 = distinct !DICompileUnit(language: DW_LANG_C99, file: !885, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !886, retainedTypes: !896, globals: !897, splitDebugInlining: false, nameTableKind: None)
!885 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/device.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/device_pm")
!886 = !{!30, !38, !887, !44}
!887 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_flag", file: !31, line: 30, baseType: !32, size: 32, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895}
!889 = !DIEnumerator(name: "PM_DEVICE_FLAG_BUSY", value: 0)
!890 = !DIEnumerator(name: "PM_DEVICE_FLAG_TURN_ON_FAILED", value: 1)
!891 = !DIEnumerator(name: "PM_DEVICE_FLAG_WS_CAPABLE", value: 2)
!892 = !DIEnumerator(name: "PM_DEVICE_FLAG_WS_ENABLED", value: 3)
!893 = !DIEnumerator(name: "PM_DEVICE_FLAG_RUNTIME_ENABLED", value: 4)
!894 = !DIEnumerator(name: "PM_DEVICE_FLAG_STATE_LOCKED", value: 5)
!895 = !DIEnumerator(name: "PM_DEVICE_FLAG_PD", value: 6)
!896 = !{!115, !116, !24, !259}
!897 = !{!882, !898}
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "action_expected_state", scope: !884, file: !900, line: 20, type: !901, isLocal: true, isDefinition: true)
!900 = !DIFile(filename: "zephyr/subsys/pm/device.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 128, elements: !903)
!902 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!903 = !{!904}
!904 = !DISubrange(count: 4)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "stats_list", scope: !907, file: !912, line: 16, type: !913, isLocal: true, isDefinition: true)
!907 = distinct !DICompileUnit(language: DW_LANG_C99, file: !908, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !909, globals: !911, splitDebugInlining: false, nameTableKind: None)
!908 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/stats/stats.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/device_pm")
!909 = !{!115, !910, !220, !116}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!911 = !{!905}
!912 = !DIFile(filename: "zephyr/subsys/stats/stats.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stats_hdr", file: !854, line: 66, size: 128, elements: !915)
!915 = !{!916, !917, !918, !919, !920}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "s_name", scope: !914, file: !854, line: 67, baseType: !132, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "s_size", scope: !914, file: !854, line: 68, baseType: !142, size: 8, offset: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "s_cnt", scope: !914, file: !854, line: 69, baseType: !220, size: 16, offset: 48)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "s_pad1", scope: !914, file: !854, line: 70, baseType: !142, size: 8, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "s_next", scope: !914, file: !854, line: 75, baseType: !913, size: 32, offset: 96)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(name: "static_regions", scope: !923, file: !930, line: 62, type: !1049, isLocal: true, isDefinition: true)
!923 = distinct !DICompileUnit(language: DW_LANG_C99, file: !924, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !618, retainedTypes: !925, globals: !926, splitDebugInlining: false, nameTableKind: None)
!924 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/device_pm")
!925 = !{!259, !116, !223, !115}
!926 = !{!927, !921}
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !929, file: !930, line: 198, type: !1036, isLocal: true, isDefinition: true)
!929 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !930, file: !930, line: 175, type: !931, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !923, retainedNodes: !1033)
!930 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!931 = !DISubroutineType(types: !932)
!932 = !{null, !933}
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 32)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !186, line: 245, size: 1024, elements: !935)
!935 = !{!936, !994, !1006, !1007, !1008, !1009, !1015, !1028}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !934, file: !186, line: 247, baseType: !937, size: 384)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !186, line: 57, size: 384, elements: !938)
!938 = !{!939, !963, !970, !971, !972, !981, !982, !983}
!939 = !DIDerivedType(tag: DW_TAG_member, scope: !937, file: !186, line: 60, baseType: !940, size: 64)
!940 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !937, file: !186, line: 60, size: 64, elements: !941)
!941 = !{!942, !957}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !940, file: !186, line: 61, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !169, line: 49, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !169, line: 37, size: 64, elements: !945)
!945 = !{!946, !952}
!946 = !DIDerivedType(tag: DW_TAG_member, scope: !944, file: !169, line: 38, baseType: !947, size: 32)
!947 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !944, file: !169, line: 38, size: 32, elements: !948)
!948 = !{!949, !951}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !947, file: !169, line: 39, baseType: !950, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !947, file: !169, line: 40, baseType: !950, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, scope: !944, file: !169, line: 42, baseType: !953, size: 32, offset: 32)
!953 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !944, file: !169, line: 42, size: 32, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !953, file: !169, line: 43, baseType: !950, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !953, file: !169, line: 44, baseType: !950, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !940, file: !186, line: 62, baseType: !958, size: 64)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !198, line: 49, size: 64, elements: !959)
!959 = !{!960}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !958, file: !198, line: 50, baseType: !961, size: 64)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 64, elements: !203)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !937, file: !186, line: 68, baseType: !964, size: 32, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !164, line: 233, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !164, line: 231, size: 64, elements: !967)
!967 = !{!968}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !966, file: !164, line: 232, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !169, line: 48, baseType: !944)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !937, file: !186, line: 71, baseType: !142, size: 8, offset: 96)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !937, file: !186, line: 74, baseType: !142, size: 8, offset: 104)
!972 = !DIDerivedType(tag: DW_TAG_member, scope: !937, file: !186, line: 90, baseType: !973, size: 16, offset: 112)
!973 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !937, file: !186, line: 90, size: 16, elements: !974)
!974 = !{!975, !980}
!975 = !DIDerivedType(tag: DW_TAG_member, scope: !973, file: !186, line: 91, baseType: !976, size: 16)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !973, file: !186, line: 91, size: 16, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !976, file: !186, line: 96, baseType: !216, size: 8)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !976, file: !186, line: 97, baseType: !142, size: 8, offset: 8)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !973, file: !186, line: 100, baseType: !220, size: 16)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !937, file: !186, line: 107, baseType: !223, size: 32, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !937, file: !186, line: 127, baseType: !115, size: 32, offset: 160)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !937, file: !186, line: 131, baseType: !984, size: 192, offset: 192)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !164, line: 244, size: 192, elements: !985)
!985 = !{!986, !987, !993}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !984, file: !164, line: 245, baseType: !943, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !984, file: !164, line: 246, baseType: !988, size: 32, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !164, line: 242, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 32)
!990 = !DISubroutineType(types: !991)
!991 = !{null, !992}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !984, file: !164, line: 249, baseType: !236, size: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !934, file: !186, line: 250, baseType: !995, size: 288, offset: 384)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !240, line: 25, size: 288, elements: !996)
!996 = !{!997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !995, file: !240, line: 26, baseType: !223, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !995, file: !240, line: 27, baseType: !223, size: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !995, file: !240, line: 28, baseType: !223, size: 32, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !995, file: !240, line: 29, baseType: !223, size: 32, offset: 96)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !995, file: !240, line: 30, baseType: !223, size: 32, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !995, file: !240, line: 31, baseType: !223, size: 32, offset: 160)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !995, file: !240, line: 32, baseType: !223, size: 32, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !995, file: !240, line: 33, baseType: !223, size: 32, offset: 224)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !995, file: !240, line: 34, baseType: !223, size: 32, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !934, file: !186, line: 253, baseType: !115, size: 32, offset: 672)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !934, file: !186, line: 256, baseType: !965, size: 64, offset: 704)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !934, file: !186, line: 294, baseType: !116, size: 32, offset: 768)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !934, file: !186, line: 300, baseType: !1010, size: 96, offset: 800)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !186, line: 149, size: 96, elements: !1011)
!1011 = !{!1012, !1013, !1014}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1010, file: !186, line: 153, baseType: !22, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1010, file: !186, line: 162, baseType: !259, size: 32, offset: 32)
