; ModuleID = './build/no_rtos_initialize_system.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.flash_info_t = type { i8*, i8, i32, i32, i32, i8, i8, i8 }
%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.hal_gpt_context_t = type { i32, %struct.hal_gpt_callback_context, i8 }
%struct.hal_gpt_callback_context = type { void (i8*)*, i8* }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.__va_list = type { i8* }
%struct.hal_cache_region_config_t = type { i32, i32 }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }

!79 = distinct !DIGlobalVariable(name: "sf_Mutex", scope: !2, file: !3, line: 78, type: !7, isLocal: true, isDefinition: true)
!80 = !DIGlobalVariableExpression(var: !79, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "g_u4ClkCnt1ms", scope: !83, file: !84, line: 71, type: !158, isLocal: false, isDefinition: true)
!83 = distinct !DICompileUnit(language: DW_LANG_C99, file: !84, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !85, retainedTypes: !136, globals: !141, splitDebugInlining: false, nameTableKind: None)
!84 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!85 = !{!86, !91}
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !87, line: 121, baseType: !30, size: 32, elements: !88)
!87 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!88 = !{!89, !90}
!89 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!90 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !92, line: 47, baseType: !7, size: 32, elements: !93)
!92 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135}
!94 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!95 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!96 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!97 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!98 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!99 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!100 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!101 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!102 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!103 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!104 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!105 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!106 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!107 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!108 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!109 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!110 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!111 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!112 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!113 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!114 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!115 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!116 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!117 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!118 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!119 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!120 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!121 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!122 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!123 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!124 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!125 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!126 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!127 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!128 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!129 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!130 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!131 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!132 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!133 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!134 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!135 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!136 = !{!137, !140}
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !87, line: 116, baseType: !30)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !92, line: 95, baseType: !91)
!141 = !{!81, !142}
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "GPTTimer", scope: !83, file: !84, line: 67, type: !144, isLocal: true, isDefinition: true)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPTStruct", file: !145, line: 111, baseType: !146)
!145 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 109, size: 96, elements: !147)
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_FUNC", scope: !146, file: !145, line: 110, baseType: !149, size: 96)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_func", file: !145, line: 106, baseType: !150)
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !145, line: 102, size: 96, elements: !151)
!151 = !{!152, !156, !157}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "gpt0_func", scope: !150, file: !145, line: 103, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!154 = !DISubroutineType(types: !155)
!155 = !{null}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "gpt1_func", scope: !150, file: !145, line: 104, baseType: !153, size: 32, offset: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "gpt3_func", scope: !150, file: !145, line: 105, baseType: !153, size: 32, offset: 64)
!158 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !87, line: 62, baseType: !30)
!160 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!161 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "g_sfc_security_enable", scope: !164, file: !165, line: 58, type: !30, isLocal: false, isDefinition: true)
!164 = distinct !DICompileUnit(language: DW_LANG_C99, file: !165, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !166, retainedTypes: !173, globals: !180, splitDebugInlining: false, nameTableKind: None)
!165 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/sfc.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!166 = !{!167}
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 45, baseType: !30, size: 32, elements: !168)
!168 = !{!169, !170, !171, !172}
!169 = !DIEnumerator(name: "SF_UNDEF", value: 0)
!170 = !DIEnumerator(name: "SPI", value: 1)
!171 = !DIEnumerator(name: "SPIQ", value: 2)
!172 = !DIEnumerator(name: "QPI", value: 3)
!173 = !{!137, !174, !30, !175, !177, !178}
!174 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !30)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !58)
!180 = !{!162}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "gSFC_max_data_size", scope: !183, file: !184, line: 67, type: !30, isLocal: false, isDefinition: true)
!183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185, retainedTypes: !192, globals: !211, splitDebugInlining: false, nameTableKind: None)
!184 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/spi_flash.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!185 = !{!35, !5, !167, !186}
!186 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 66, baseType: !7, size: 32, elements: !187)
!187 = !{!188, !189, !190, !191}
!188 = !DIEnumerator(name: "FLASH_NOT_READY", value: -1)
!189 = !DIEnumerator(name: "FLASH_READY", value: 0)
!190 = !DIEnumerator(name: "FLASH_PROGRAMMING", value: 1)
!191 = !DIEnumerator(name: "FLASH_ERASING", value: 2)
!192 = !{!193, !195, !196, !30, !51, !210, !61, !139}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !58)
!195 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chip_info", file: !6, line: 137, size: 192, elements: !199)
!199 = !{!200, !203, !204, !205, !206, !207, !208, !209}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !198, file: !6, line: 138, baseType: !201, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !198, file: !6, line: 139, baseType: !58, size: 8, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "jedec_id", scope: !198, file: !6, line: 140, baseType: !195, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !198, file: !6, line: 141, baseType: !195, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "n_pages", scope: !198, file: !6, line: 142, baseType: !30, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "quad_program_cmd", scope: !198, file: !6, line: 144, baseType: !58, size: 8, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "quad_read_cmd", scope: !198, file: !6, line: 145, baseType: !58, size: 8, offset: 168)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "qpi_read_cmd", scope: !198, file: !6, line: 146, baseType: !58, size: 8, offset: 176)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 32)
!211 = !{!181, !212, !217, !222, !227, !230, !232, !237, !239, !241, !243, !245, !247, !249, !251, !253, !255, !257, !259, !264, !266, !268, !270, !273}
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_winbond", scope: !183, file: !184, line: 70, type: !214, isLocal: false, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 96, elements: !215)
!215 = !{!216}
!216 = !DISubrange(count: 12)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_winbond", scope: !183, file: !184, line: 73, type: !219, isLocal: false, isDefinition: true)
!219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 32, elements: !220)
!220 = !{!221}
!221 = !DISubrange(count: 4)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_winbond", scope: !183, file: !184, line: 76, type: !224, isLocal: false, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 72, elements: !225)
!225 = !{!226}
!226 = !DISubrange(count: 9)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "cmdlist_suspend_winbond", scope: !183, file: !184, line: 79, type: !229, isLocal: false, isDefinition: true)
!229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 32, elements: !220)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "cmdlist_resume_winbond", scope: !183, file: !184, line: 82, type: !229, isLocal: false, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_mxic", scope: !183, file: !184, line: 87, type: !234, isLocal: false, isDefinition: true)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 64, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 8)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_mxic", scope: !183, file: !184, line: 91, type: !234, isLocal: false, isDefinition: true)
!239 = !DIGlobalVariableExpression(var: !240, expr: !DIExpression())
!240 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_mxic", scope: !183, file: !184, line: 95, type: !234, isLocal: false, isDefinition: true)
!241 = !DIGlobalVariableExpression(var: !242, expr: !DIExpression())
!242 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_gd", scope: !183, file: !184, line: 100, type: !224, isLocal: false, isDefinition: true)
!243 = !DIGlobalVariableExpression(var: !244, expr: !DIExpression())
!244 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_gd", scope: !183, file: !184, line: 104, type: !224, isLocal: false, isDefinition: true)
!245 = !DIGlobalVariableExpression(var: !246, expr: !DIExpression())
!246 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_gd", scope: !183, file: !184, line: 108, type: !224, isLocal: false, isDefinition: true)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_gd25q32c", scope: !183, file: !184, line: 112, type: !234, isLocal: false, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_gd25q32c", scope: !183, file: !184, line: 115, type: !234, isLocal: false, isDefinition: true)
!251 = !DIGlobalVariableExpression(var: !252, expr: !DIExpression())
!252 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_gd25q32c", scope: !183, file: !184, line: 119, type: !234, isLocal: false, isDefinition: true)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_micron", scope: !183, file: !184, line: 123, type: !234, isLocal: false, isDefinition: true)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_micron", scope: !183, file: !184, line: 126, type: !234, isLocal: false, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_micron", scope: !183, file: !184, line: 130, type: !234, isLocal: false, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "cmdlist_flash_reset_spimode", scope: !183, file: !184, line: 135, type: !261, isLocal: false, isDefinition: true)
!261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 56, elements: !262)
!262 = !{!263}
!263 = !DISubrange(count: 7)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "cmdlist_flash_reset_qpimode", scope: !183, file: !184, line: 138, type: !261, isLocal: false, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "spi_chip_info", scope: !183, file: !184, line: 142, type: !196, isLocal: false, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "gd_write_sr2_1", scope: !183, file: !184, line: 161, type: !7, isLocal: false, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "support_flash_id", scope: !183, file: !184, line: 162, type: !272, isLocal: false, isDefinition: true)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "SF_TYPT", file: !6, line: 81, baseType: !35)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "chips_data", scope: !183, file: !184, line: 144, type: !275, isLocal: true, isDefinition: true)
!275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 2496, elements: !276)
!276 = !{!277}
!277 = !DISubrange(count: 13)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !280, file: !281, line: 43, type: !61, isLocal: true, isDefinition: true)
!280 = distinct !DICompileUnit(language: DW_LANG_C99, file: !281, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !282, globals: !287, splitDebugInlining: false, nameTableKind: None)
!281 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!282 = !{!175, !159, !59, !283, !284, !286}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32", file: !87, line: 133, baseType: !30)
!287 = !{!278, !288}
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !280, file: !281, line: 44, type: !61, isLocal: true, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !292, file: !293, line: 54, type: !61, isLocal: false, isDefinition: true)
!292 = distinct !DICompileUnit(language: DW_LANG_C99, file: !293, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !294, retainedTypes: !318, globals: !326, splitDebugInlining: false, nameTableKind: None)
!293 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!294 = !{!91, !295, !301}
!295 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !296, line: 71, baseType: !30, size: 32, elements: !297)
!296 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!297 = !{!298, !299, !300}
!298 = !DIEnumerator(name: "UART_PORT0", value: 0)
!299 = !DIEnumerator(name: "UART_PORT1", value: 1)
!300 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!301 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !302, line: 129, baseType: !30, size: 32, elements: !303)
!302 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/dma_sw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317}
!304 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!305 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!306 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!307 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!308 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!309 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!310 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!311 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!312 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!313 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!314 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!315 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!316 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!317 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!318 = !{!175, !61, !319, !321, !323, !324, !159}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !87, line: 113, baseType: !322)
!322 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !87, line: 59, baseType: !58)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !323)
!326 = !{!327, !335, !290}
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler_name", scope: !292, file: !293, line: 57, type: !329, isLocal: false, isDefinition: true)
!329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 64, elements: !333)
!330 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !331)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!333 = !{!334}
!334 = !DISubrange(count: 2)
!335 = !DIGlobalVariableExpression(var: !336, expr: !DIExpression())
!336 = distinct !DIGlobalVariable(name: "g_uart_port_to_irq_num", scope: !292, file: !293, line: 58, type: !337, isLocal: false, isDefinition: true)
!337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 64, elements: !333)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !339)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !92, line: 97, baseType: !140)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !342, file: !343, line: 51, type: !422, isLocal: false, isDefinition: true)
!342 = distinct !DICompileUnit(language: DW_LANG_C99, file: !343, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !344, retainedTypes: !391, globals: !421, splitDebugInlining: false, nameTableKind: None)
!343 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!344 = !{!345, !356, !375, !382}
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !346, line: 163, baseType: !7, size: 32, elements: !347)
!346 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!347 = !{!348, !349, !350, !351, !352, !353, !354, !355}
!348 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!349 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!350 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!351 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!352 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!353 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!354 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!355 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !346, line: 186, baseType: !30, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374}
!358 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!359 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!360 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!361 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!362 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!363 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!364 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!365 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!366 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!367 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!368 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!369 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!370 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!371 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!372 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!373 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!374 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!375 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !346, line: 176, baseType: !30, size: 32, elements: !376)
!376 = !{!377, !378, !379, !380, !381}
!377 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!378 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!379 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!380 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!381 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!382 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !383, line: 99, baseType: !30, size: 32, elements: !384)
!383 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!384 = !{!385, !386, !387, !388, !389, !390}
!385 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!386 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!387 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!388 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!389 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!390 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!391 = !{!392, !51}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !394, line: 72, baseType: !395)
!394 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 56, size: 525312, elements: !396)
!396 = !{!397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !411, !412, !416, !420}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !395, file: !394, line: 57, baseType: !60, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !395, file: !394, line: 58, baseType: !60, size: 32, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !395, file: !394, line: 59, baseType: !60, size: 32, offset: 64)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !395, file: !394, line: 60, baseType: !60, size: 32, offset: 96)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !395, file: !394, line: 61, baseType: !60, size: 32, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !395, file: !394, line: 62, baseType: !60, size: 32, offset: 160)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !395, file: !394, line: 63, baseType: !60, size: 32, offset: 192)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !395, file: !394, line: 64, baseType: !60, size: 32, offset: 224)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !395, file: !394, line: 65, baseType: !60, size: 32, offset: 256)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !395, file: !394, line: 66, baseType: !60, size: 32, offset: 288)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !395, file: !394, line: 67, baseType: !408, size: 32, offset: 320)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 32, elements: !409)
!409 = !{!410}
!410 = !DISubrange(count: 1)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !395, file: !394, line: 68, baseType: !60, size: 32, offset: 352)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !395, file: !394, line: 69, baseType: !413, size: 523904, offset: 384)
!413 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 523904, elements: !414)
!414 = !{!415}
!415 = !DISubrange(count: 16372)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !395, file: !394, line: 70, baseType: !417, size: 512, offset: 524288)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 16)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !395, file: !394, line: 71, baseType: !417, size: 512, offset: 524800)
!421 = !{!340}
!422 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !69)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "g_cache_con", scope: !425, file: !426, line: 48, type: !460, isLocal: false, isDefinition: true)
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !427, splitDebugInlining: false, nameTableKind: None)
!426 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!427 = !{!423, !428, !431}
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "g_cache_region_en", scope: !425, file: !426, line: 49, type: !430, isLocal: false, isDefinition: true)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGION_EN_Type", file: !383, line: 66, baseType: !61)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "g_cache_entry", scope: !425, file: !426, line: 50, type: !433, isLocal: false, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 1024, elements: !418)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_ENTRY_Type", file: !383, line: 90, baseType: !435)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !383, line: 87, size: 64, elements: !436)
!436 = !{!437, !450}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "cache_entry_n", scope: !435, file: !383, line: 88, baseType: !438, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_ENTRY_N_Type", file: !383, line: 77, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !383, line: 68, size: 32, elements: !440)
!440 = !{!441, !449}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !439, file: !383, line: 75, baseType: !442, size: 32)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !439, file: !383, line: 69, size: 32, elements: !443)
!443 = !{!444, !445, !446, !447, !448}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !442, file: !383, line: 70, baseType: !61, size: 5, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "ATTR", scope: !442, file: !383, line: 71, baseType: !61, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !442, file: !383, line: 72, baseType: !61, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved1", scope: !442, file: !383, line: 73, baseType: !61, size: 3, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "BASEADDR", scope: !442, file: !383, line: 74, baseType: !61, size: 20, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !439, file: !383, line: 76, baseType: !61, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "cache_end_entry_n", scope: !435, file: !383, line: 89, baseType: !451, size: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_END_ENTRY_N_Type", file: !383, line: 85, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !383, line: 79, size: 32, elements: !453)
!453 = !{!454, !459}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !452, file: !383, line: 83, baseType: !455, size: 32)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !452, file: !383, line: 80, size: 32, elements: !456)
!456 = !{!457, !458}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !455, file: !383, line: 81, baseType: !61, size: 12, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "BASEADDR", scope: !455, file: !383, line: 82, baseType: !61, size: 20, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !452, file: !383, line: 84, baseType: !61, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_CON_Type", file: !383, line: 64, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !383, line: 51, size: 32, elements: !462)
!462 = !{!463, !475}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !461, file: !383, line: 62, baseType: !464, size: 32)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !461, file: !383, line: 52, size: 32, elements: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !472, !473, !474}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "MCEN", scope: !464, file: !383, line: 53, baseType: !61, size: 1, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "MPEN", scope: !464, file: !383, line: 54, baseType: !61, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "CNTEN0", scope: !464, file: !383, line: 55, baseType: !61, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "CNTEN1", scope: !464, file: !383, line: 56, baseType: !61, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "MPDEFEN", scope: !464, file: !383, line: 57, baseType: !61, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !464, file: !383, line: 58, baseType: !61, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "MDRF", scope: !464, file: !383, line: 59, baseType: !61, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "CACHESIZE", scope: !464, file: !383, line: 60, baseType: !61, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved1", scope: !464, file: !383, line: 61, baseType: !61, size: 22, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !461, file: !383, line: 63, baseType: !61, size: 32)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !478, file: !479, line: 53, type: !557, isLocal: false, isDefinition: true)
!478 = distinct !DICompileUnit(language: DW_LANG_C99, file: !479, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !480, retainedTypes: !489, globals: !556, splitDebugInlining: false, nameTableKind: None)
!479 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!480 = !{!481, !91}
!481 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !482, line: 152, baseType: !7, size: 32, elements: !483)
!482 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!483 = !{!484, !485, !486, !487, !488}
!484 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!485 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!486 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!487 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!488 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!489 = !{!339, !51, !61, !490, !492, !523}
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !55, line: 44, baseType: !491)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !57, line: 77, baseType: !7)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !494, line: 378, baseType: !495)
!494 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !494, line: 363, size: 28704, elements: !496)
!496 = !{!497, !499, !503, !504, !505, !506, !507, !508, !509, !510, !514, !518, !522}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !495, file: !494, line: 365, baseType: !498, size: 256)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 256, elements: !235)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !495, file: !494, line: 366, baseType: !500, size: 768, offset: 256)
!500 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 768, elements: !501)
!501 = !{!502}
!502 = !DISubrange(count: 24)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !495, file: !494, line: 367, baseType: !498, size: 256, offset: 1024)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !495, file: !494, line: 368, baseType: !500, size: 768, offset: 1280)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !495, file: !494, line: 369, baseType: !498, size: 256, offset: 2048)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !495, file: !494, line: 370, baseType: !500, size: 768, offset: 2304)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !495, file: !494, line: 371, baseType: !498, size: 256, offset: 3072)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !495, file: !494, line: 372, baseType: !500, size: 768, offset: 3328)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !495, file: !494, line: 373, baseType: !498, size: 256, offset: 4096)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !495, file: !494, line: 374, baseType: !511, size: 1792, offset: 4352)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 1792, elements: !512)
!512 = !{!513}
!513 = !DISubrange(count: 56)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !495, file: !494, line: 375, baseType: !515, size: 1920, offset: 6144)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 1920, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 240)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !495, file: !494, line: 376, baseType: !519, size: 20608, offset: 8064)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 20608, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 644)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !495, file: !494, line: 377, baseType: !60, size: 32, offset: 28672)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !494, line: 418, baseType: !525)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !494, line: 395, size: 1120, elements: !526)
!526 = !{!527, !529, !530, !531, !532, !533, !534, !536, !537, !538, !539, !540, !541, !542, !543, !545, !546, !547, !549, !553, !555}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !525, file: !494, line: 397, baseType: !528, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !525, file: !494, line: 398, baseType: !60, size: 32, offset: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !525, file: !494, line: 399, baseType: !60, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !525, file: !494, line: 400, baseType: !60, size: 32, offset: 96)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !525, file: !494, line: 401, baseType: !60, size: 32, offset: 128)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !525, file: !494, line: 402, baseType: !60, size: 32, offset: 160)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !525, file: !494, line: 403, baseType: !535, size: 96, offset: 192)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 96, elements: !215)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !525, file: !494, line: 404, baseType: !60, size: 32, offset: 288)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !525, file: !494, line: 405, baseType: !60, size: 32, offset: 320)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !525, file: !494, line: 406, baseType: !60, size: 32, offset: 352)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !525, file: !494, line: 407, baseType: !60, size: 32, offset: 384)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !525, file: !494, line: 408, baseType: !60, size: 32, offset: 416)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !525, file: !494, line: 409, baseType: !60, size: 32, offset: 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !525, file: !494, line: 410, baseType: !60, size: 32, offset: 480)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !525, file: !494, line: 411, baseType: !544, size: 64, offset: 512)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 64, elements: !333)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !525, file: !494, line: 412, baseType: !528, size: 32, offset: 576)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !525, file: !494, line: 413, baseType: !528, size: 32, offset: 608)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !525, file: !494, line: 414, baseType: !548, size: 128, offset: 640)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 128, elements: !220)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !525, file: !494, line: 415, baseType: !550, size: 160, offset: 768)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 160, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 5)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !525, file: !494, line: 416, baseType: !554, size: 160, offset: 928)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !61, size: 160, elements: !551)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !525, file: !494, line: 417, baseType: !60, size: 32, offset: 1088)
!556 = !{!476}
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 6144, elements: !566)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !479, line: 50, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !479, line: 47, size: 64, elements: !560)
!560 = !{!561, !565}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !559, file: !479, line: 48, baseType: !562, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !339}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !559, file: !479, line: 49, baseType: !61, size: 32, offset: 32)
!566 = !{!567}
!567 = !DISubrange(count: 96)
!568 = !DIGlobalVariableExpression(var: !569, expr: !DIExpression())
!569 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !570, file: !571, line: 61, type: !590, isLocal: true, isDefinition: true)
!570 = distinct !DICompileUnit(language: DW_LANG_C99, file: !571, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !572, retainedTypes: !588, globals: !589, splitDebugInlining: false, nameTableKind: None)
!571 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!572 = !{!20, !573, !580, !28, !584}
!573 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 657, baseType: !30, size: 32, elements: !574)
!574 = !{!575, !576, !577, !578, !579}
!575 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!576 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!577 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!578 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!579 = !DIEnumerator(name: "HAL_GPT_MAX", value: 5)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 397, baseType: !30, size: 32, elements: !581)
!581 = !{!582, !583}
!582 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!583 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!584 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 380, baseType: !30, size: 32, elements: !585)
!585 = !{!586, !587}
!586 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!587 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!588 = !{!51, !61}
!589 = !{!568}
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 640, elements: !551)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_context_t", file: !571, line: 55, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 51, size: 128, elements: !593)
!593 = !{!594, !596, !606}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !592, file: !571, line: 52, baseType: !595, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !21, line: 400, baseType: !580)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !592, file: !571, line: 53, baseType: !597, size: 64, offset: 32)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_context", file: !571, line: 49, baseType: !598)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !571, line: 46, size: 64, elements: !599)
!599 = !{!600, !605}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !598, file: !571, line: 47, baseType: !601, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !21, line: 371, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !51}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !598, file: !571, line: 48, baseType: !51, size: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "has_initlized", scope: !592, file: !571, line: 54, baseType: !69, size: 8, offset: 96)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "g_uart_frist_send_complete_interrupt", scope: !609, file: !610, line: 80, type: !711, isLocal: true, isDefinition: true)
!609 = distinct !DICompileUnit(language: DW_LANG_C99, file: !610, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !611, retainedTypes: !661, globals: !662, splitDebugInlining: false, nameTableKind: None)
!610 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!611 = !{!295, !612, !620, !625, !641, !647, !651, !301, !656}
!612 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !613, line: 345, baseType: !7, size: 32, elements: !614)
!613 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!614 = !{!615, !616, !617, !618, !619}
!615 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!616 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!617 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!618 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!619 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!620 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !29, line: 109, baseType: !30, size: 32, elements: !621)
!621 = !{!622, !623, !624}
!622 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!623 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!624 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!625 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !613, line: 302, baseType: !30, size: 32, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640}
!627 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!628 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!629 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!630 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!631 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!632 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!633 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!634 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!635 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!636 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!637 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!638 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!639 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!640 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!641 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !613, line: 321, baseType: !30, size: 32, elements: !642)
!642 = !{!643, !644, !645, !646}
!643 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!644 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!645 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!646 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!647 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !613, line: 330, baseType: !30, size: 32, elements: !648)
!648 = !{!649, !650}
!649 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!650 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !613, line: 337, baseType: !30, size: 32, elements: !652)
!652 = !{!653, !654, !655}
!653 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!654 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!655 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!656 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !613, line: 355, baseType: !7, size: 32, elements: !657)
!657 = !{!658, !659, !660}
!658 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!659 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!660 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!661 = !{!201, !30, !51, !58, !202, !54}
!662 = !{!663, !706, !607, !709, !712}
!663 = !DIGlobalVariableExpression(var: !664, expr: !DIExpression())
!664 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !609, file: !610, line: 77, type: !665, isLocal: true, isDefinition: true)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !666, size: 1024, elements: !333)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !610, line: 75, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !610, line: 68, size: 512, elements: !668)
!668 = !{!669, !670, !682, !683, !694, !695}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !667, file: !610, line: 69, baseType: !69, size: 8)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !667, file: !610, line: 70, baseType: !671, size: 128, offset: 32)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !613, line: 378, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !613, line: 373, size: 128, elements: !673)
!673 = !{!674, !676, !678, !680}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !672, file: !613, line: 374, baseType: !675, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !613, line: 317, baseType: !625)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !672, file: !613, line: 375, baseType: !677, size: 32, offset: 32)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !613, line: 326, baseType: !641)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !672, file: !613, line: 376, baseType: !679, size: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !613, line: 333, baseType: !647)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !672, file: !613, line: 377, baseType: !681, size: 32, offset: 96)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !613, line: 341, baseType: !651)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !667, file: !610, line: 71, baseType: !69, size: 8, offset: 160)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !667, file: !610, line: 72, baseType: !684, size: 64, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !610, line: 66, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !610, line: 63, size: 64, elements: !686)
!686 = !{!687, !693}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !685, file: !610, line: 64, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !613, line: 410, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 32)
!690 = !DISubroutineType(types: !691)
!691 = !{null, !692, !51}
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !613, line: 359, baseType: !656)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !685, file: !610, line: 65, baseType: !51, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !667, file: !610, line: 73, baseType: !69, size: 8, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !667, file: !610, line: 74, baseType: !696, size: 224, offset: 288)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !613, line: 390, baseType: !697)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !613, line: 382, size: 224, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !697, file: !613, line: 383, baseType: !210, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !697, file: !613, line: 384, baseType: !61, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !697, file: !613, line: 385, baseType: !61, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !697, file: !613, line: 386, baseType: !210, size: 32, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !697, file: !613, line: 387, baseType: !61, size: 32, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !697, file: !613, line: 388, baseType: !61, size: 32, offset: 160)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !697, file: !613, line: 389, baseType: !61, size: 32, offset: 192)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler", scope: !609, file: !610, line: 82, type: !708, isLocal: true, isDefinition: true)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !54, size: 16, elements: !333)
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "g_uart_send_lock_status", scope: !609, file: !610, line: 81, type: !711, isLocal: true, isDefinition: true)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 16, elements: !333)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "func_tbl", scope: !714, file: !610, line: 536, type: !721, isLocal: true, isDefinition: true)
!714 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !610, file: !610, line: 534, type: !715, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !609, retainedNodes: !719)
!715 = !DISubroutineType(types: !716)
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !302, line: 197, baseType: !153)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !29, line: 113, baseType: !620)
!719 = !{!720}
!720 = !DILocalVariable(name: "uart_port", arg: 1, scope: !714, file: !610, line: 534, type: !718)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !722, size: 64, elements: !333)
!722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !717)
!723 = !DIGlobalVariableExpression(var: !724, expr: !DIExpression())
!724 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_default", scope: !725, file: !726, line: 164, type: !214, isLocal: false, isDefinition: true)
!725 = distinct !DICompileUnit(language: DW_LANG_C99, file: !726, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !727, globals: !742, splitDebugInlining: false, nameTableKind: None)
!726 = !DIFile(filename: "../../../../../driver/board/mt76x7_hdk/external_flash/src/bsp_flash_config.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!727 = !{!728, !51}
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_info_t", file: !731, line: 48, baseType: !732)
!731 = !DIFile(filename: "../../../../../driver/board/mt76x7_hdk/external_flash/inc/bsp_flash_config.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !731, line: 38, size: 192, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !732, file: !731, line: 39, baseType: !201, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !732, file: !731, line: 40, baseType: !58, size: 8, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "jedec_id", scope: !732, file: !731, line: 41, baseType: !195, size: 32, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !732, file: !731, line: 42, baseType: !195, size: 32, offset: 96)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "n_pages", scope: !732, file: !731, line: 43, baseType: !30, size: 32, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "quad_program_cmd", scope: !732, file: !731, line: 45, baseType: !58, size: 8, offset: 160)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "quad_read_cmd", scope: !732, file: !731, line: 46, baseType: !58, size: 8, offset: 168)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "qpi_read_cmd", scope: !732, file: !731, line: 47, baseType: !58, size: 8, offset: 176)
!742 = !{!723, !743, !745, !747}
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_default", scope: !725, file: !726, line: 167, type: !219, isLocal: false, isDefinition: true)
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_default", scope: !725, file: !726, line: 170, type: !224, isLocal: false, isDefinition: true)
!747 = !DIGlobalVariableExpression(var: !748, expr: !DIExpression())
!748 = distinct !DIGlobalVariable(name: "customer_flash_info", scope: !725, file: !726, line: 174, type: !729, isLocal: false, isDefinition: true)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !751, file: !752, line: 59, type: !61, isLocal: false, isDefinition: true)
!751 = distinct !DICompileUnit(language: DW_LANG_C99, file: !752, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !753, globals: !806, splitDebugInlining: false, nameTableKind: None)
!752 = !DIFile(filename: "../../../../../project/mt7687_hdk/templates/no_rtos_initialize_system/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!753 = !{!754, !762, !787}
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !494, line: 656, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !494, line: 650, size: 128, elements: !757)
!757 = !{!758, !759, !760, !761}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !756, file: !494, line: 652, baseType: !60, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !756, file: !494, line: 653, baseType: !60, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !756, file: !494, line: 654, baseType: !60, size: 32, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !756, file: !494, line: 655, baseType: !528, size: 32, offset: 96)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !494, line: 418, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !494, line: 395, size: 1120, elements: !765)
!765 = !{!766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !764, file: !494, line: 397, baseType: !528, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !764, file: !494, line: 398, baseType: !60, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !764, file: !494, line: 399, baseType: !60, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !764, file: !494, line: 400, baseType: !60, size: 32, offset: 96)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !764, file: !494, line: 401, baseType: !60, size: 32, offset: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !764, file: !494, line: 402, baseType: !60, size: 32, offset: 160)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !764, file: !494, line: 403, baseType: !535, size: 96, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !764, file: !494, line: 404, baseType: !60, size: 32, offset: 288)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !764, file: !494, line: 405, baseType: !60, size: 32, offset: 320)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !764, file: !494, line: 406, baseType: !60, size: 32, offset: 352)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !764, file: !494, line: 407, baseType: !60, size: 32, offset: 384)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !764, file: !494, line: 408, baseType: !60, size: 32, offset: 416)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !764, file: !494, line: 409, baseType: !60, size: 32, offset: 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !764, file: !494, line: 410, baseType: !60, size: 32, offset: 480)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !764, file: !494, line: 411, baseType: !544, size: 64, offset: 512)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !764, file: !494, line: 412, baseType: !528, size: 32, offset: 576)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !764, file: !494, line: 413, baseType: !528, size: 32, offset: 608)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !764, file: !494, line: 414, baseType: !548, size: 128, offset: 640)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !764, file: !494, line: 415, baseType: !550, size: 160, offset: 768)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !764, file: !494, line: 416, baseType: !554, size: 160, offset: 928)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !764, file: !494, line: 417, baseType: !60, size: 32, offset: 1088)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !394, line: 72, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 56, size: 525312, elements: !790)
!790 = !{!791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !789, file: !394, line: 57, baseType: !60, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !789, file: !394, line: 58, baseType: !60, size: 32, offset: 32)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !789, file: !394, line: 59, baseType: !60, size: 32, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !789, file: !394, line: 60, baseType: !60, size: 32, offset: 96)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !789, file: !394, line: 61, baseType: !60, size: 32, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !789, file: !394, line: 62, baseType: !60, size: 32, offset: 160)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !789, file: !394, line: 63, baseType: !60, size: 32, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !789, file: !394, line: 64, baseType: !60, size: 32, offset: 224)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !789, file: !394, line: 65, baseType: !60, size: 32, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !789, file: !394, line: 66, baseType: !60, size: 32, offset: 288)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !789, file: !394, line: 67, baseType: !408, size: 32, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !789, file: !394, line: 68, baseType: !60, size: 32, offset: 352)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !789, file: !394, line: 69, baseType: !413, size: 523904, offset: 384)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !789, file: !394, line: 70, baseType: !417, size: 512, offset: 524288)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !789, file: !394, line: 71, baseType: !417, size: 512, offset: 524800)
!806 = !{!749, !807}
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !751, file: !752, line: 61, type: !60, isLocal: true, isDefinition: true)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "heap_end", scope: !811, file: !812, line: 101, type: !201, isLocal: true, isDefinition: true)
!811 = distinct !DISubprogram(name: "_sbrk_r", scope: !812, file: !812, line: 98, type: !813, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !1002, retainedNodes: !1006)
!812 = !DIFile(filename: "../../../../../project/mt7687_hdk/templates/no_rtos_initialize_system/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!813 = !DISubroutineType(types: !814)
!814 = !{!815, !817, !1001}
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !816, line: 123, baseType: !201)
!816 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !819, line: 377, size: 1920, elements: !820)
!819 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!820 = !{!821, !822, !891, !892, !893, !894, !895, !896, !897, !900, !920, !924, !925, !926, !927, !937, !950, !951, !956, !975, !976, !983, !984, !1000}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !818, file: !819, line: 381, baseType: !7, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !818, file: !819, line: 386, baseType: !823, size: 32, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !819, line: 292, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !819, line: 186, size: 832, elements: !826)
!826 = !{!827, !828, !829, !830, !832, !833, !838, !839, !840, !841, !845, !849, !855, !859, !860, !861, !862, !866, !868, !869, !870, !872, !878, !890}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !825, file: !819, line: 187, baseType: !177, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !825, file: !819, line: 188, baseType: !7, size: 32, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !825, file: !819, line: 189, baseType: !7, size: 32, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !825, file: !819, line: 190, baseType: !831, size: 16, offset: 96)
!831 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !825, file: !819, line: 191, baseType: !831, size: 16, offset: 112)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !825, file: !819, line: 192, baseType: !834, size: 64, offset: 128)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !819, line: 122, size: 64, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !834, file: !819, line: 123, baseType: !177, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !834, file: !819, line: 124, baseType: !7, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !825, file: !819, line: 193, baseType: !7, size: 32, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !825, file: !819, line: 196, baseType: !817, size: 32, offset: 224)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !825, file: !819, line: 200, baseType: !51, size: 32, offset: 256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !825, file: !819, line: 202, baseType: !842, size: 32, offset: 288)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 32)
!843 = !DISubroutineType(types: !844)
!844 = !{!7, !817, !51, !201, !7}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !825, file: !819, line: 204, baseType: !846, size: 32, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = !DISubroutineType(types: !848)
!848 = !{!7, !817, !51, !331, !7}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !825, file: !819, line: 207, baseType: !850, size: 32, offset: 352)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!851 = !DISubroutineType(types: !852)
!852 = !{!853, !817, !51, !853, !7}
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !854, line: 116, baseType: !174)
!854 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !825, file: !819, line: 208, baseType: !856, size: 32, offset: 384)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DISubroutineType(types: !858)
!858 = !{!7, !817, !51}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !825, file: !819, line: 211, baseType: !834, size: 64, offset: 416)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !825, file: !819, line: 212, baseType: !177, size: 32, offset: 480)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !825, file: !819, line: 213, baseType: !7, size: 32, offset: 512)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !825, file: !819, line: 216, baseType: !863, size: 24, offset: 544)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 24, elements: !864)
!864 = !{!865}
!865 = !DISubrange(count: 3)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !825, file: !819, line: 217, baseType: !867, size: 8, offset: 568)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 8, elements: !409)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !825, file: !819, line: 220, baseType: !834, size: 64, offset: 576)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !825, file: !819, line: 223, baseType: !7, size: 32, offset: 640)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !825, file: !819, line: 224, baseType: !871, size: 32, offset: 672)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !854, line: 46, baseType: !174)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !825, file: !819, line: 231, baseType: !873, size: 32, offset: 704)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !819, line: 35, baseType: !874)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !875, line: 34, baseType: !876)
!875 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 32)
!877 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !875, line: 33, flags: DIFlagFwdDecl)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !825, file: !819, line: 233, baseType: !879, size: 64, offset: 736)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !854, line: 170, baseType: !880)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !854, line: 162, size: 64, elements: !881)
!881 = !{!882, !883}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !880, file: !854, line: 164, baseType: !7, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !880, file: !854, line: 169, baseType: !884, size: 32, offset: 32)
!884 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !880, file: !854, line: 165, size: 32, elements: !885)
!885 = !{!886, !889}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !884, file: !854, line: 167, baseType: !887, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !888, line: 116, baseType: !7)
!888 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!889 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !884, file: !854, line: 168, baseType: !229, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !825, file: !819, line: 234, baseType: !7, size: 32, offset: 800)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !818, file: !819, line: 386, baseType: !823, size: 32, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !818, file: !819, line: 386, baseType: !823, size: 32, offset: 96)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !818, file: !819, line: 388, baseType: !7, size: 32, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !818, file: !819, line: 390, baseType: !201, size: 32, offset: 160)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !818, file: !819, line: 392, baseType: !7, size: 32, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !818, file: !819, line: 394, baseType: !7, size: 32, offset: 224)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !818, file: !819, line: 395, baseType: !898, size: 32, offset: 256)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 32)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !819, line: 45, flags: DIFlagFwdDecl)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !818, file: !819, line: 397, baseType: !901, size: 32, offset: 288)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !819, line: 349, size: 128, elements: !903)
!903 = !{!904, !916, !917, !918}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !902, file: !819, line: 352, baseType: !905, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !819, line: 52, size: 192, elements: !907)
!907 = !{!908, !909, !910, !911, !912, !913}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !906, file: !819, line: 54, baseType: !905, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !906, file: !819, line: 55, baseType: !7, size: 32, offset: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !906, file: !819, line: 55, baseType: !7, size: 32, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !906, file: !819, line: 55, baseType: !7, size: 32, offset: 96)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !906, file: !819, line: 55, baseType: !7, size: 32, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !906, file: !819, line: 56, baseType: !914, size: 32, offset: 160)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 32, elements: !409)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !819, line: 22, baseType: !195)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !902, file: !819, line: 353, baseType: !7, size: 32, offset: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !902, file: !819, line: 354, baseType: !905, size: 32, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !902, file: !819, line: 355, baseType: !919, size: 32, offset: 96)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !818, file: !819, line: 399, baseType: !921, size: 32, offset: 320)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 32)
!922 = !DISubroutineType(types: !923)
!923 = !{null, !817}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !818, file: !819, line: 401, baseType: !7, size: 32, offset: 352)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !818, file: !819, line: 404, baseType: !7, size: 32, offset: 384)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !818, file: !819, line: 405, baseType: !201, size: 32, offset: 416)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !818, file: !819, line: 407, baseType: !928, size: 32, offset: 448)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 32)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !819, line: 324, size: 192, elements: !930)
!930 = !{!931, !933, !934, !935}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !929, file: !819, line: 325, baseType: !932, size: 48)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !322, size: 48, elements: !864)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !929, file: !819, line: 326, baseType: !932, size: 48, offset: 48)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !929, file: !819, line: 327, baseType: !322, size: 16, offset: 96)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !929, file: !819, line: 330, baseType: !936, size: 64, offset: 128)
!936 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !818, file: !819, line: 408, baseType: !938, size: 32, offset: 480)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 32)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !819, line: 60, size: 288, elements: !940)
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !939, file: !819, line: 62, baseType: !7, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !939, file: !819, line: 63, baseType: !7, size: 32, offset: 32)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !939, file: !819, line: 64, baseType: !7, size: 32, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !939, file: !819, line: 65, baseType: !7, size: 32, offset: 96)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !939, file: !819, line: 66, baseType: !7, size: 32, offset: 128)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !939, file: !819, line: 67, baseType: !7, size: 32, offset: 160)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !939, file: !819, line: 68, baseType: !7, size: 32, offset: 192)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !939, file: !819, line: 69, baseType: !7, size: 32, offset: 224)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !939, file: !819, line: 70, baseType: !7, size: 32, offset: 256)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !818, file: !819, line: 409, baseType: !201, size: 32, offset: 512)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !818, file: !819, line: 412, baseType: !952, size: 32, offset: 544)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 32)
!954 = !DISubroutineType(types: !955)
!955 = !{null, !7}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !818, file: !819, line: 416, baseType: !957, size: 32, offset: 576)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !819, line: 90, size: 1120, elements: !959)
!959 = !{!960, !961, !962, !966}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !958, file: !819, line: 91, baseType: !957, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !958, file: !819, line: 92, baseType: !7, size: 32, offset: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !958, file: !819, line: 93, baseType: !963, size: 1024, offset: 64)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 1024, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !958, file: !819, line: 94, baseType: !967, size: 32, offset: 1088)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !819, line: 79, size: 2112, elements: !969)
!969 = !{!970, !972, !973, !974}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !968, file: !819, line: 80, baseType: !971, size: 1024)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 1024, elements: !964)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !968, file: !819, line: 81, baseType: !971, size: 1024, offset: 1024)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !968, file: !819, line: 83, baseType: !915, size: 32, offset: 2048)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !968, file: !819, line: 86, baseType: !915, size: 32, offset: 2080)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !818, file: !819, line: 417, baseType: !958, size: 1120, offset: 608)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !818, file: !819, line: 420, baseType: !977, size: 96, offset: 1728)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !819, line: 296, size: 96, elements: !978)
!978 = !{!979, !981, !982}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !977, file: !819, line: 298, baseType: !980, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !977, file: !819, line: 299, baseType: !7, size: 32, offset: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !977, file: !819, line: 300, baseType: !823, size: 32, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !818, file: !819, line: 421, baseType: !823, size: 32, offset: 1824)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !818, file: !819, line: 422, baseType: !985, size: 32, offset: 1856)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 32)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !819, line: 359, size: 640, elements: !987)
!987 = !{!988, !989, !990, !991, !992, !994, !995, !996, !997, !998, !999}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !986, file: !819, line: 362, baseType: !201, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !986, file: !819, line: 363, baseType: !879, size: 64, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !986, file: !819, line: 364, baseType: !879, size: 64, offset: 96)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !986, file: !819, line: 365, baseType: !879, size: 64, offset: 160)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !986, file: !819, line: 366, baseType: !993, size: 64, offset: 224)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 64, elements: !235)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !986, file: !819, line: 367, baseType: !7, size: 32, offset: 288)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !986, file: !819, line: 368, baseType: !879, size: 64, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !986, file: !819, line: 369, baseType: !879, size: 64, offset: 384)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !986, file: !819, line: 370, baseType: !879, size: 64, offset: 448)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !986, file: !819, line: 371, baseType: !879, size: 64, offset: 512)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !986, file: !819, line: 372, baseType: !879, size: 64, offset: 576)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !818, file: !819, line: 423, baseType: !201, size: 32, offset: 1888)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !888, line: 46, baseType: !30)
!1002 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1003, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1004, globals: !1005, splitDebugInlining: false, nameTableKind: None)
!1003 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!1004 = !{!201, !815}
!1005 = !{!809}
!1006 = !{!1007, !1008, !1009, !1010}
!1007 = !DILocalVariable(name: "r", arg: 1, scope: !811, file: !812, line: 98, type: !817)
!1008 = !DILocalVariable(name: "nbytes", arg: 2, scope: !811, file: !812, line: 98, type: !1001)
!1009 = !DILocalVariable(name: "prev_heap_end", scope: !811, file: !812, line: 102, type: !201)
!1010 = !DILocalVariable(name: "stack", scope: !811, file: !812, line: 103, type: !201)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !1013, file: !1018, line: 4, type: !1024, isLocal: false, isDefinition: true)
!1013 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1014, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1015, splitDebugInlining: false, nameTableKind: None)
!1014 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!1015 = !{!1011, !1016, !1022}
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !1013, file: !1018, line: 5, type: !1019, isLocal: false, isDefinition: true)
!1018 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 88, elements: !1020)
!1020 = !{!1021}
!1021 = !DISubrange(count: 11)
!1022 = !DIGlobalVariableExpression(var: !1023, expr: !DIExpression())
!1023 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !1013, file: !1018, line: 6, type: !1019, isLocal: false, isDefinition: true)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !202, size: 248, elements: !1025)
!1025 = !{!1026}
!1026 = !DISubrange(count: 31)
!1027 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1028, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1029, splitDebugInlining: false, nameTableKind: None)
!1028 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/templates/no_rtos_initialize_system/GCC")
!1029 = !{!1030, !1055}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !494, line: 418, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !494, line: 395, size: 1120, elements: !1033)
!1033 = !{!1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !1032, file: !494, line: 397, baseType: !528, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !1032, file: !494, line: 398, baseType: !60, size: 32, offset: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !1032, file: !494, line: 399, baseType: !60, size: 32, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !1032, file: !494, line: 400, baseType: !60, size: 32, offset: 96)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !1032, file: !494, line: 401, baseType: !60, size: 32, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !1032, file: !494, line: 402, baseType: !60, size: 32, offset: 160)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !1032, file: !494, line: 403, baseType: !535, size: 96, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !1032, file: !494, line: 404, baseType: !60, size: 32, offset: 288)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !1032, file: !494, line: 405, baseType: !60, size: 32, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !1032, file: !494, line: 406, baseType: !60, size: 32, offset: 352)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !1032, file: !494, line: 407, baseType: !60, size: 32, offset: 384)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !1032, file: !494, line: 408, baseType: !60, size: 32, offset: 416)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !1032, file: !494, line: 409, baseType: !60, size: 32, offset: 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !1032, file: !494, line: 410, baseType: !60, size: 32, offset: 480)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !1032, file: !494, line: 411, baseType: !544, size: 64, offset: 512)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !1032, file: !494, line: 412, baseType: !528, size: 32, offset: 576)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !1032, file: !494, line: 413, baseType: !528, size: 32, offset: 608)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !1032, file: !494, line: 414, baseType: !548, size: 128, offset: 640)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !1032, file: !494, line: 415, baseType: !550, size: 160, offset: 768)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1032, file: !494, line: 416, baseType: !554, size: 160, offset: 928)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !1032, file: !494, line: 417, baseType: !60, size: 32, offset: 1088)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 32)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !494, line: 378, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !494, line: 363, size: 28704, elements: !1058)
!1058 = !{!1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !1057, file: !494, line: 365, baseType: !498, size: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1057, file: !494, line: 366, baseType: !500, size: 768, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !1057, file: !494, line: 367, baseType: !498, size: 256, offset: 1024)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !1057, file: !494, line: 368, baseType: !500, size: 768, offset: 1280)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !1057, file: !494, line: 369, baseType: !498, size: 256, offset: 2048)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1057, file: !494, line: 370, baseType: !500, size: 768, offset: 2304)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !1057, file: !494, line: 371, baseType: !498, size: 256, offset: 3072)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1057, file: !494, line: 372, baseType: !500, size: 768, offset: 3328)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !1057, file: !494, line: 373, baseType: !498, size: 256, offset: 4096)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1057, file: !494, line: 374, baseType: !511, size: 1792, offset: 4352)
