; ModuleID = '/src/_build/ia32-generic-qemu/prog/dummyfs.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-p270:32:32-p271:32:32-p272:64:64-f64:32:64-f80:32-n8:16:32-S128"
target triple = "i386-pc-none-gnu"

%struct.anon.41 = type { %struct._rbtree_t, i32 }
%struct._rbtree_t = type { %struct._rbnode_t*, i32 (%struct._rbnode_t*, %struct._rbnode_t*)*, void (%struct._rbnode_t*)* }
%struct._rbnode_t = type { %struct._rbnode_t*, %struct._rbnode_t*, %struct._rbnode_t*, i32 }
%struct.anon.45 = type { [32 x void (i32)*], [32 x i32], i32 }
%struct._FILE = type { i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.anon.50 = type { i32, i32, [32 x %struct._chunk_t*], [32 x %struct._rbtree_t], i32, i32, i32 }
%struct._chunk_t = type { i32, %struct.heap_t*, %struct._chunk_t*, %struct._chunk_t*, %struct._rbnode_t }
%struct.heap_t = type { i32, i32, [0 x i8] }
%struct.anon.52 = type { i8* }
%struct.errinfo_t = type { i16, i16 }
%struct.tm = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.pthread_attr_t = type { i8*, i32, i32, i32, i32 }
%struct.anon.88 = type { i32, i32, i32, i32, %struct.pthread_mutex_t, %struct.pthread_mutex_t, %struct.pthread_ctx*, %struct.pthread_fork_handlers_t* }
%struct.pthread_mutex_t = type { i32, i32 }
%struct.pthread_ctx = type { i32, i8* (i8*)*, i8*, i8*, i8*, i32, %struct.pthread_ctx*, %struct.pthread_ctx*, i32, i32, %struct.__errno_t, i32, %struct.pthread_key_data_t* }
%struct.__errno_t = type { %struct._rbnode_t, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "mtstack", scope: !2, file: !104, line: 106, type: !105, isLocal: true, isDefinition: true, align: 64)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !54, globals: !103, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/src/phoenix-rtos-filesystems/dummyfs/srv.c", directory: "/src/phoenix-rtos-filesystems", checksumkind: CSK_MD5, checksum: "2e29de47f885fd5566ad32d002b5fae9")
!4 = !{!5, !11, !19, !37}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rbcolor_t", file: !6, line: 29, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/../../../../i386-pc-phoenix/include/sys/rb.h", directory: "", checksumkind: CSK_MD5, checksum: "b64924d3aac346a3c0d2613130ee2f50")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "RB_RED", value: 0)
!10 = !DIEnumerator(name: "RB_BLACK", value: 1)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 22, baseType: !7, size: 32, elements: !13)
!12 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/../../../../i386-pc-phoenix/include/sys/file.h", directory: "", checksumkind: CSK_MD5, checksum: "e0641f226a7270f4565e3ce942c8b258")
!13 = !{!14, !15, !16, !17, !18}
!14 = !DIEnumerator(name: "otDir", value: 0)
!15 = !DIEnumerator(name: "otFile", value: 1)
!16 = !DIEnumerator(name: "otDev", value: 2)
!17 = !DIEnumerator(name: "otSymlink", value: 3)
!18 = !DIEnumerator(name: "otUnknown", value: 4)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !20, line: 24, baseType: !7, size: 32, elements: !21)
!20 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/../../../../i386-pc-phoenix/include/phoenix/msg.h", directory: "", checksumkind: CSK_MD5, checksum: "542795edacfe9ec3ffece94e87c863a1")
!21 = !{!22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36}
!22 = !DIEnumerator(name: "mtOpen", value: 0)
!23 = !DIEnumerator(name: "mtClose", value: 1)
!24 = !DIEnumerator(name: "mtRead", value: 2)
!25 = !DIEnumerator(name: "mtWrite", value: 3)
!26 = !DIEnumerator(name: "mtTruncate", value: 4)
!27 = !DIEnumerator(name: "mtDevCtl", value: 5)
!28 = !DIEnumerator(name: "mtCreate", value: 6)
!29 = !DIEnumerator(name: "mtDestroy", value: 7)
!30 = !DIEnumerator(name: "mtSetAttr", value: 8)
!31 = !DIEnumerator(name: "mtGetAttr", value: 9)
!32 = !DIEnumerator(name: "mtLookup", value: 10)
!33 = !DIEnumerator(name: "mtLink", value: 11)
!34 = !DIEnumerator(name: "mtUnlink", value: 12)
!35 = !DIEnumerator(name: "mtReaddir", value: 13)
!36 = !DIEnumerator(name: "mtCount", value: 14)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !12, line: 25, baseType: !7, size: 32, elements: !38)
!38 = !{!39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53}
!39 = !DIEnumerator(name: "atMode", value: 0)
!40 = !DIEnumerator(name: "atUid", value: 1)
!41 = !DIEnumerator(name: "atGid", value: 2)
!42 = !DIEnumerator(name: "atSize", value: 3)
!43 = !DIEnumerator(name: "atBlocks", value: 4)
!44 = !DIEnumerator(name: "atIOBlock", value: 5)
!45 = !DIEnumerator(name: "atType", value: 6)
!46 = !DIEnumerator(name: "atPort", value: 7)
!47 = !DIEnumerator(name: "atPollStatus", value: 8)
!48 = !DIEnumerator(name: "atEventMask", value: 9)
!49 = !DIEnumerator(name: "atCTime", value: 10)
!50 = !DIEnumerator(name: "atMTime", value: 11)
!51 = !DIEnumerator(name: "atATime", value: 12)
!52 = !DIEnumerator(name: "atLinks", value: 13)
!53 = !DIEnumerator(name: "atDev", value: 14)
!54 = !{!55, !56, !102}
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummyfs_t", file: !58, line: 90, baseType: !59)
!58 = !DIFile(filename: "dummyfs/dummyfs_internal.h", directory: "/src/phoenix-rtos-filesystems", checksumkind: CSK_MD5, checksum: "1b61bcaef959f5d2eb731a248857115e")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 81, size: 384, elements: !60)
!60 = !{!61, !64, !67, !69, !96, !97, !98, !99}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !59, file: !58, line: 82, baseType: !62, size: 32)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !63, line: 30, baseType: !7)
!63 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/../../../../i386-pc-phoenix/include/arch/ia32/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "07ebff5242b2f7809433124b796203ee")
!64 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !59, file: !58, line: 83, baseType: !65, size: 32, offset: 32)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "handle_t", file: !66, line: 33, baseType: !7)
!66 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/../../../../i386-pc-phoenix/include/arch/ia32/types.h", directory: "", checksumkind: CSK_MD5, checksum: "dccb145a9c3fe34a34ce266e2880bf02")
!67 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !59, file: !58, line: 84, baseType: !68, size: 32, offset: 64)
!68 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "dummytree", scope: !59, file: !58, line: 85, baseType: !70, size: 96, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "idtree_t", file: !71, line: 22, baseType: !72)
!71 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/../../../../i386-pc-phoenix/include/posix/idtree.h", directory: "", checksumkind: CSK_MD5, checksum: "3e5125688f7a9b23c38b21ad150ad234")
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbtree_t", file: !6, line: 55, baseType: !73)
!73 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rbtree_t", file: !6, line: 51, size: 96, elements: !74)
!74 = !{!75, !86, !91}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !73, file: !6, line: 52, baseType: !76, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 32)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbnode_t", file: !6, line: 39, baseType: !78)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rbnode_t", file: !6, line: 34, size: 128, elements: !79)
!79 = !{!80, !82, !83, !84}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !78, file: !6, line: 35, baseType: !81, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !78, file: !6, line: 36, baseType: !81, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !78, file: !6, line: 37, baseType: !81, size: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !78, file: !6, line: 38, baseType: !85, size: 32, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbcolor_t", file: !6, line: 31, baseType: !5)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !73, file: !6, line: 53, baseType: !87, size: 32, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbcomp_t", file: !6, line: 42, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 32)
!89 = !DISubroutineType(types: !90)
!90 = !{!68, !76, !76}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "augment", scope: !73, file: !6, line: 54, baseType: !92, size: 32, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbaugment_t", file: !6, line: 45, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!94 = !DISubroutineType(types: !95)
!95 = !{null, !76}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "olock", scope: !59, file: !58, line: 86, baseType: !65, size: 32, offset: 192)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "devtree", scope: !59, file: !58, line: 87, baseType: !72, size: 96, offset: 224)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "devlock", scope: !59, file: !58, line: 88, baseType: !65, size: 32, offset: 320)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "mountpt", scope: !59, file: !58, line: 89, baseType: !100, size: 32, offset: 352)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!103 = !{!0}
!104 = !DIFile(filename: "dummyfs/srv.c", directory: "/src/phoenix-rtos-filesystems", checksumkind: CSK_MD5, checksum: "2e29de47f885fd5566ad32d002b5fae9")
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 32768, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 4096)
!108 = !DIGlobalVariableExpression(var: !109, expr: !DIExpression())
!109 = distinct !DIGlobalVariable(name: "errno_common", scope: !110, file: !136, line: 25, type: !137, isLocal: false, isDefinition: true)
!110 = distinct !DICompileUnit(language: DW_LANG_C99, file: !111, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !112, retainedTypes: !115, globals: !133, splitDebugInlining: false, nameTableKind: None)
!111 = !DIFile(filename: "/src/libphoenix/errno/errno.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "994b4c625b3851d775f2f3f0e785704c")
!112 = !{!113}
!113 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rbcolor_t", file: !114, line: 29, baseType: !7, size: 32, elements: !8)
!114 = !DIFile(filename: "include/sys/rb.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "b64924d3aac346a3c0d2613130ee2f50")
!115 = !{!116, !117, !55}
!116 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__errno_t", file: !119, line: 32, size: 192, elements: !120)
!119 = !DIFile(filename: "include/sys/threads.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "0221ca48ed158d0d0b44da6dd42655a1")
!120 = !{!121, !131, !132}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "linkage", scope: !118, file: !119, line: 33, baseType: !122, size: 128)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbnode_t", file: !114, line: 39, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rbnode_t", file: !114, line: 34, size: 128, elements: !124)
!124 = !{!125, !127, !128, !129}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !123, file: !114, line: 35, baseType: !126, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !123, file: !114, line: 36, baseType: !126, size: 32, offset: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !123, file: !114, line: 37, baseType: !126, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !123, file: !114, line: 38, baseType: !130, size: 32, offset: 96)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbcolor_t", file: !114, line: 31, baseType: !113)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !118, file: !119, line: 34, baseType: !68, size: 32, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !118, file: !119, line: 35, baseType: !68, size: 32, offset: 160)
!133 = !{!134, !108}
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "errno_global", scope: !110, file: !136, line: 20, type: !68, isLocal: true, isDefinition: true)
!136 = !DIFile(filename: "errno/errno.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "994b4c625b3851d775f2f3f0e785704c")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !136, line: 22, size: 128, elements: !138)
!138 = !{!139, !155}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !137, file: !136, line: 23, baseType: !140, size: 96)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbtree_t", file: !114, line: 55, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rbtree_t", file: !114, line: 51, size: 96, elements: !142)
!142 = !{!143, !145, !150}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !141, file: !114, line: 52, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !141, file: !114, line: 53, baseType: !146, size: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbcomp_t", file: !114, line: 42, baseType: !147)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!148 = !DISubroutineType(types: !149)
!149 = !{!68, !144, !144}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "augment", scope: !141, file: !114, line: 54, baseType: !151, size: 32, offset: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbaugment_t", file: !114, line: 45, baseType: !152)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DISubroutineType(types: !154)
!154 = !{null, !144}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !137, file: !136, line: 24, baseType: !156, size: 32, offset: 96)
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "handle_t", file: !157, line: 33, baseType: !7)
!157 = !DIFile(filename: "include/arch/ia32/types.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "dccb145a9c3fe34a34ce266e2880bf02")
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "_signals_phx2posix", scope: !160, file: !177, line: 36, type: !190, isLocal: false, isDefinition: true)
!160 = distinct !DICompileUnit(language: DW_LANG_C99, file: !161, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, retainedTypes: !169, globals: !174, splitDebugInlining: false, nameTableKind: None)
!161 = !DIFile(filename: "/src/libphoenix/signal/signal.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "0016819dc034123b9e32494e5904cc14")
!162 = !{!163}
!163 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !164, line: 65, baseType: !7, size: 32, elements: !165)
!164 = !DIFile(filename: "include/signal.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "c25249b0aa213a140dfa2e75433fd639")
!165 = !{!166, !167, !168}
!166 = !DIEnumerator(name: "SIG_BLOCK", value: 0)
!167 = !DIEnumerator(name: "SIG_SETMASK", value: 1)
!168 = !DIEnumerator(name: "SIG_UNBLOCK", value: 2)
!169 = !{!170, !55}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "sighandler_t", file: !164, line: 23, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 32)
!172 = !DISubroutineType(types: !173)
!173 = !{null, !68}
!174 = !{!158, !175, !188}
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "signal_common", scope: !160, file: !177, line: 33, type: !178, isLocal: false, isDefinition: true)
!177 = !DIFile(filename: "signal/signal.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "0016819dc034123b9e32494e5904cc14")
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !177, line: 29, size: 2080, elements: !179)
!179 = !{!180, !184, !187}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sightab", scope: !178, file: !177, line: 30, baseType: !181, size: 1024)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 1024, elements: !182)
!182 = !{!183}
!183 = !DISubrange(count: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "sigset", scope: !178, file: !177, line: 31, baseType: !185, size: 1024, offset: 1024)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 1024, elements: !182)
!186 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !164, line: 78, baseType: !68)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !178, file: !177, line: 32, baseType: !156, size: 32, offset: 2048)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "_signals_posix2phx", scope: !160, file: !177, line: 41, type: !190, isLocal: true, isDefinition: true)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 1024, elements: !182)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "stdout", scope: !194, file: !237, line: 47, type: !260, isLocal: false, isDefinition: true)
!194 = distinct !DICompileUnit(language: DW_LANG_C99, file: !195, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !196, retainedTypes: !230, globals: !257, splitDebugInlining: false, nameTableKind: None)
!195 = !DIFile(filename: "/src/libphoenix/stdio/file.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "47d8b7a3d3e87b2afc6844d93138785e")
!196 = !{!197, !211, !219}
!197 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !198, line: 43, baseType: !7, size: 32, elements: !199)
!198 = !DIFile(filename: "include/fcntl.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "1fb1413f7e76ff024fa62e7e49fd904f")
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210}
!200 = !DIEnumerator(name: "F_DUPFD", value: 0)
!201 = !DIEnumerator(name: "F_DUPFD_CLOEXEC", value: 1)
!202 = !DIEnumerator(name: "F_GETFD", value: 2)
!203 = !DIEnumerator(name: "F_SETFD", value: 3)
!204 = !DIEnumerator(name: "F_GETFL", value: 4)
!205 = !DIEnumerator(name: "F_SETFL", value: 5)
!206 = !DIEnumerator(name: "F_GETOWN", value: 6)
!207 = !DIEnumerator(name: "F_SETOWN", value: 7)
!208 = !DIEnumerator(name: "F_GETLK", value: 8)
!209 = !DIEnumerator(name: "F_SETLK", value: 9)
!210 = !DIEnumerator(name: "F_SETLKW", value: 10)
!211 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !212, line: 24, baseType: !7, size: 32, elements: !213)
!212 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/../../../../i386-pc-phoenix/include/phoenix/mman.h", directory: "", checksumkind: CSK_MD5, checksum: "b24dcbd5287fd86aa93587d1f4749735")
!213 = !{!214, !215, !216, !217, !218}
!214 = !DIEnumerator(name: "PROT_NONE", value: 0)
!215 = !DIEnumerator(name: "PROT_READ", value: 1)
!216 = !DIEnumerator(name: "PROT_WRITE", value: 2)
!217 = !DIEnumerator(name: "PROT_EXEC", value: 4)
!218 = !DIEnumerator(name: "PROT_USER", value: 8)
!219 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !212, line: 20, baseType: !7, size: 32, elements: !220)
!220 = !{!221, !222, !223, !224, !225, !226, !227, !228, !229}
!221 = !DIEnumerator(name: "MAP_NONE", value: 0)
!222 = !DIEnumerator(name: "MAP_NEEDSCOPY", value: 1)
!223 = !DIEnumerator(name: "MAP_UNCACHED", value: 2)
!224 = !DIEnumerator(name: "MAP_DEVICE", value: 4)
!225 = !DIEnumerator(name: "MAP_NOINHERIT", value: 8)
!226 = !DIEnumerator(name: "MAP_SHARED", value: 0)
!227 = !DIEnumerator(name: "MAP_PRIVATE", value: 0)
!228 = !DIEnumerator(name: "MAP_FIXED", value: 0)
!229 = !DIEnumerator(name: "MAP_ANONYMOUS", value: 0)
!230 = !{!55, !231, !116, !235}
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !232, line: 42, baseType: !233)
!232 = !DIFile(filename: "include/sys/types.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "53fc299ca750308d7127f33067080633")
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !232, line: 41, baseType: !234)
!234 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "popen_FILE", file: !237, line: 44, baseType: !238)
!237 = !DIFile(filename: "stdio/file.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "47d8b7a3d3e87b2afc6844d93138785e")
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !237, line: 41, size: 288, elements: !239)
!239 = !{!240, !255}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !238, file: !237, line: 42, baseType: !241, size: 256)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !242, line: 67, baseType: !243)
!242 = !DIFile(filename: "include/stdio.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "1c8ea53ca5b48b8b669b534900b6bf8a")
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE", file: !242, line: 57, size: 256, elements: !244)
!244 = !{!245, !246, !247, !248, !251, !252, !253, !254}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !243, file: !242, line: 58, baseType: !68, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !243, file: !242, line: 59, baseType: !7, size: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !243, file: !242, line: 61, baseType: !68, size: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "bufeof", scope: !243, file: !242, line: 62, baseType: !249, size: 32, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !250, line: 209, baseType: !7)
!250 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "6c2f8c538b0427e4a1e2dd9a64369f49")
!251 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !243, file: !242, line: 63, baseType: !249, size: 32, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "bufsz", scope: !243, file: !242, line: 64, baseType: !249, size: 32, offset: 160)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !243, file: !242, line: 65, baseType: !100, size: 32, offset: 192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !243, file: !242, line: 66, baseType: !156, size: 32, offset: 224)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !238, file: !237, line: 43, baseType: !256, size: 32, offset: 256)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !232, line: 29, baseType: !68)
!257 = !{!258, !192, !261}
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "stdin", scope: !194, file: !237, line: 47, type: !260, isLocal: false, isDefinition: true)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "stderr", scope: !194, file: !237, line: 47, type: !260, isLocal: false, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "atexit_funcs", scope: !265, file: !269, line: 19, type: !270, isLocal: false, isDefinition: true)
!265 = distinct !DICompileUnit(language: DW_LANG_C99, file: !266, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !267, globals: !268, splitDebugInlining: false, nameTableKind: None)
!266 = !DIFile(filename: "/src/libphoenix/stdlib/atexit.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "0c5bd3b700dd461995df990484695e52")
!267 = !{!55}
!268 = !{!263}
!269 = !DIFile(filename: "stdlib/atexit.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "0c5bd3b700dd461995df990484695e52")
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 1024, elements: !182)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DISubroutineType(types: !273)
!273 = !{null}
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "malloc_common", scope: !276, file: !303, line: 73, type: !361, isLocal: false, isDefinition: true)
!276 = distinct !DICompileUnit(language: DW_LANG_C99, file: !277, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !278, retainedTypes: !297, globals: !336, splitDebugInlining: false, nameTableKind: None)
!277 = !DIFile(filename: "/src/libphoenix/stdlib/malloc_dl.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "62af652782abbd6840f007efb06e5269")
!278 = !{!113, !279, !211, !219}
!279 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !280, line: 7, baseType: !7, size: 32, elements: !281)
!280 = !DIFile(filename: "include/sysexits.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "7393c8deb081ddea4b4b13881afa2c33")
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296}
!282 = !DIEnumerator(name: "EX_USAGE", value: 64)
!283 = !DIEnumerator(name: "EX_DATAERR", value: 65)
!284 = !DIEnumerator(name: "EX_NOINPUT", value: 66)
!285 = !DIEnumerator(name: "EX_NOUSER", value: 67)
!286 = !DIEnumerator(name: "EX_NOHOST", value: 68)
!287 = !DIEnumerator(name: "EX_UNAVAILABLE", value: 69)
!288 = !DIEnumerator(name: "EX_SOFTWARE", value: 70)
!289 = !DIEnumerator(name: "EX_OSERR", value: 71)
!290 = !DIEnumerator(name: "EX_OSFILE", value: 72)
!291 = !DIEnumerator(name: "EX_CANTCREAT", value: 73)
!292 = !DIEnumerator(name: "EX_IOERR", value: 74)
!293 = !DIEnumerator(name: "EX_TEMPFAIL", value: 75)
!294 = !DIEnumerator(name: "EX_PROTOCOL", value: 76)
!295 = !DIEnumerator(name: "EX_NOPERM", value: 77)
!296 = !DIEnumerator(name: "EX_CONFIG", value: 78)
!297 = !{!55, !298, !249, !301, !332, !116, !334, !102, !335}
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !299, line: 31, baseType: !300)
!299 = !DIFile(filename: "include/arch/ia32/stdint.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "07ebff5242b2f7809433124b796203ee")
!300 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk_t", file: !303, line: 60, baseType: !304)
!303 = !DIFile(filename: "stdlib/malloc_dl.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "62af652782abbd6840f007efb06e5269")
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_chunk_t", file: !303, line: 51, size: 256, elements: !305)
!305 = !{!306, !307, !320, !322, !323}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !304, file: !303, line: 53, baseType: !249, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !304, file: !303, line: 54, baseType: !308, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "heap_t", file: !303, line: 48, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 44, size: 64, elements: !311)
!311 = !{!312, !313, !314}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !310, file: !303, line: 45, baseType: !249, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "freesz", scope: !310, file: !303, line: 46, baseType: !249, size: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !310, file: !303, line: 47, baseType: !315, offset: 64)
!315 = !DICompositeType(tag: DW_TAG_array_type, baseType: !316, elements: !318)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !299, line: 28, baseType: !317)
!317 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!318 = !{!319}
!319 = !DISubrange(count: -1)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !304, file: !303, line: 57, baseType: !321, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !304, file: !303, line: 58, baseType: !321, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !304, file: !303, line: 59, baseType: !324, size: 128, offset: 128)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbnode_t", file: !114, line: 39, baseType: !325)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rbnode_t", file: !114, line: 34, size: 128, elements: !326)
!326 = !{!327, !329, !330, !331}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !325, file: !114, line: 35, baseType: !328, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !325, file: !114, line: 36, baseType: !328, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !325, file: !114, line: 37, baseType: !328, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !325, file: !114, line: 38, baseType: !130, size: 32, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !299, line: 65, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !299, line: 30, baseType: !7)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 32)
!336 = !{!274, !337}
!337 = !DIGlobalVariableExpression(var: !338, expr: !DIExpression())
!338 = distinct !DIGlobalVariable(name: "lookup", scope: !339, file: !303, line: 352, type: !360, isLocal: true, isDefinition: true)
!339 = distinct !DISubprogram(name: "_malloc_allocLarge", scope: !303, file: !303, line: 349, type: !340, scopeLine: 350, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !276, retainedNodes: !342)
!340 = !DISubroutineType(types: !341)
!341 = !{!55, !249}
!342 = !{!343, !344, !345, !346, !347, !348, !349, !352, !353, !359}
!343 = !DILocalVariable(name: "size", arg: 1, scope: !339, file: !303, line: 349, type: !249)
!344 = !DILocalVariable(name: "idx", scope: !339, file: !303, line: 359, type: !7)
!345 = !DILocalVariable(name: "binmap", scope: !339, file: !303, line: 360, type: !7)
!346 = !DILocalVariable(name: "heap", scope: !339, file: !303, line: 361, type: !308)
!347 = !DILocalVariable(name: "chunk", scope: !339, file: !303, line: 362, type: !301)
!348 = !DILocalVariable(name: "t", scope: !339, file: !303, line: 363, type: !302)
!349 = !DILocalVariable(name: "_off", scope: !350, file: !303, line: 367, type: !116)
!350 = distinct !DILexicalBlock(scope: !351, file: !303, line: 367, column: 11)
!351 = distinct !DILexicalBlock(scope: !339, file: !303, line: 366, column: 29)
!352 = !DILocalVariable(name: "tmpnode", scope: !350, file: !303, line: 367, type: !55)
!353 = !DILocalVariable(name: "_a", scope: !354, file: !303, line: 376, type: !358)
!354 = distinct !DILexicalBlock(scope: !355, file: !303, line: 376, column: 33)
!355 = distinct !DILexicalBlock(scope: !356, file: !303, line: 376, column: 7)
!356 = distinct !DILexicalBlock(scope: !357, file: !303, line: 374, column: 21)
!357 = distinct !DILexicalBlock(scope: !339, file: !303, line: 374, column: 6)
!358 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !249)
!359 = !DILocalVariable(name: "_b", scope: !354, file: !303, line: 376, type: !249)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !358, size: 1024, elements: !182)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !303, line: 63, size: 4256, elements: !362)
!362 = !{!363, !364, !365, !367, !384, !385, !386}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "sbinmap", scope: !361, file: !303, line: 64, baseType: !333, size: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "lbinmap", scope: !361, file: !303, line: 65, baseType: !333, size: 32, offset: 32)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sbins", scope: !361, file: !303, line: 66, baseType: !366, size: 1024, offset: 64)
!366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 1024, elements: !182)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "lbins", scope: !361, file: !303, line: 67, baseType: !368, size: 3072, offset: 1088)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !369, size: 3072, elements: !182)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbtree_t", file: !114, line: 55, baseType: !370)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rbtree_t", file: !114, line: 51, size: 96, elements: !371)
!371 = !{!372, !374, !379}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !370, file: !114, line: 52, baseType: !373, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !370, file: !114, line: 53, baseType: !375, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbcomp_t", file: !114, line: 42, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = !DISubroutineType(types: !378)
!378 = !{!68, !373, !373}
!379 = !DIDerivedType(tag: DW_TAG_member, name: "augment", scope: !370, file: !114, line: 54, baseType: !380, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbaugment_t", file: !114, line: 45, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !373}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "allocsz", scope: !361, file: !303, line: 69, baseType: !249, size: 32, offset: 4160)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "freesz", scope: !361, file: !303, line: 70, baseType: !249, size: 32, offset: 4192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !361, file: !303, line: 72, baseType: !156, size: 32, offset: 4224)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "string_common", scope: !389, file: !396, line: 25, type: !397, isLocal: false, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !391, globals: !395, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "/src/libphoenix/string/string.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "f7857eaa7dce8fd44f8623b07e418515")
!391 = !{!100, !55, !392, !394, !317}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !101)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!395 = !{!387}
!396 = !DIFile(filename: "string/string.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "f7857eaa7dce8fd44f8623b07e418515")
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !396, line: 23, size: 32, elements: !398)
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "next_token", scope: !397, file: !396, line: 24, baseType: !100, size: 32)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "errtab", scope: !402, file: !408, line: 30, type: !428, isLocal: true, isDefinition: true)
!402 = distinct !DICompileUnit(language: DW_LANG_C99, file: !403, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !404, globals: !405, splitDebugInlining: false, nameTableKind: None)
!403 = !DIFile(filename: "/src/libphoenix/string/strerror.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "654a18a700e30c4e66d7af615befe91d")
!404 = !{!100, !55, !116}
!405 = !{!400, !406, !412, !425}
!406 = !DIGlobalVariableExpression(var: !407, expr: !DIExpression())
!407 = distinct !DIGlobalVariable(name: "errnames", scope: !402, file: !408, line: 26, type: !409, isLocal: true, isDefinition: true)
!408 = !DIFile(filename: "string/strerror.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "654a18a700e30c4e66d7af615befe91d")
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 4904, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 613)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "gaitab", scope: !402, file: !408, line: 38, type: !414, isLocal: true, isDefinition: true)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, elements: !423)
!415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "errinfo_t", file: !408, line: 23, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 20, size: 32, elements: !418)
!418 = !{!419, !422}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "errno", scope: !417, file: !408, line: 21, baseType: !420, size: 16)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !299, line: 29, baseType: !421)
!421 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !417, file: !408, line: 22, baseType: !420, size: 16, offset: 16)
!423 = !{!424}
!424 = !DISubrange(count: 0)
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "gainames", scope: !402, file: !408, line: 34, type: !427, isLocal: true, isDefinition: true)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, elements: !423)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 2336, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 73)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "tznamestore", scope: !433, file: !434, line: 71, type: !518, isLocal: true, isDefinition: true)
!433 = distinct !DISubprogram(name: "tzset", scope: !434, file: !434, line: 69, type: !272, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !435, retainedNodes: !517)
!434 = !DIFile(filename: "time/time.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "8e7d168ab45c01bc54a88b843660c300")
!435 = distinct !DICompileUnit(language: DW_LANG_C99, file: !436, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !437, globals: !440, splitDebugInlining: false, nameTableKind: None)
!436 = !DIFile(filename: "/src/libphoenix/time/time.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "8e7d168ab45c01bc54a88b843660c300")
!437 = !{!55, !438, !439}
!438 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_t", file: !232, line: 44, baseType: !68)
!440 = !{!431, !441, !463, !474, !479, !486, !491, !493, !495, !501, !506}
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "buff", scope: !443, file: !434, line: 146, type: !462, isLocal: true, isDefinition: true)
!443 = distinct !DISubprogram(name: "asctime", scope: !434, file: !434, line: 144, type: !444, scopeLine: 145, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !435, retainedNodes: !460)
!444 = !DISubroutineType(types: !445)
!445 = !{!100, !446}
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !449, line: 33, size: 288, elements: !450)
!449 = !DIFile(filename: "include/time.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "a2e8ad5ad4a4f79bbd3d7bfb5e5a3791")
!450 = !{!451, !452, !453, !454, !455, !456, !457, !458, !459}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !448, file: !449, line: 34, baseType: !68, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !448, file: !449, line: 35, baseType: !68, size: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !448, file: !449, line: 36, baseType: !68, size: 32, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !448, file: !449, line: 37, baseType: !68, size: 32, offset: 96)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !448, file: !449, line: 38, baseType: !68, size: 32, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !448, file: !449, line: 39, baseType: !68, size: 32, offset: 160)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !448, file: !449, line: 40, baseType: !68, size: 32, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !448, file: !449, line: 41, baseType: !68, size: 32, offset: 224)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !448, file: !449, line: 42, baseType: !68, size: 32, offset: 256)
!460 = !{!461}
!461 = !DILocalVariable(name: "tp", arg: 1, scope: !443, file: !434, line: 144, type: !446)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 256, elements: !182)
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "tmp", scope: !465, file: !434, line: 219, type: !448, isLocal: true, isDefinition: true)
!465 = distinct !DISubprogram(name: "gmtime", scope: !434, file: !434, line: 217, type: !466, scopeLine: 218, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !435, retainedNodes: !472)
!466 = !DISubroutineType(types: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !157, line: 23, baseType: !300)
!472 = !{!473}
!473 = !DILocalVariable(name: "timep", arg: 1, scope: !465, file: !434, line: 217, type: !469)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "tmp", scope: !476, file: !434, line: 234, type: !448, isLocal: true, isDefinition: true)
!476 = distinct !DISubprogram(name: "localtime", scope: !434, file: !434, line: 232, type: !466, scopeLine: 233, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !435, retainedNodes: !477)
!477 = !{!478}
!478 = !DILocalVariable(name: "timep", arg: 1, scope: !476, file: !434, line: 232, type: !469)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "buff", scope: !481, file: !434, line: 252, type: !462, isLocal: true, isDefinition: true)
!481 = distinct !DISubprogram(name: "ctime", scope: !434, file: !434, line: 250, type: !482, scopeLine: 251, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !435, retainedNodes: !484)
!482 = !DISubroutineType(types: !483)
!483 = !{!100, !469}
!484 = !{!485}
!485 = !DILocalVariable(name: "timep", arg: 1, scope: !481, file: !434, line: 250, type: !469)
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "tzname", scope: !435, file: !434, line: 25, type: !488, isLocal: false, isDefinition: true)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 64, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 2)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "timezone", scope: !435, file: !434, line: 28, type: !116, isLocal: false, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "daylight", scope: !435, file: !434, line: 31, type: !68, isLocal: false, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "wdayasc", scope: !435, file: !434, line: 34, type: !497, isLocal: true, isDefinition: true)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 640, elements: !498)
!498 = !{!499, !500}
!499 = !DISubrange(count: 8)
!500 = !DISubrange(count: 10)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "monasc", scope: !435, file: !434, line: 37, type: !503, isLocal: true, isDefinition: true)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 1040, elements: !504)
!504 = !{!505, !500}
!505 = !DISubrange(count: 13)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "lut", scope: !508, file: !434, line: 43, type: !514, isLocal: true, isDefinition: true)
!508 = distinct !DISubprogram(name: "daysofmonth", scope: !434, file: !434, line: 41, type: !509, scopeLine: 42, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !435, retainedNodes: !511)
!509 = !DISubroutineType(types: !510)
!510 = !{!68, !68, !68}
!511 = !{!512, !513}
!512 = !DILocalVariable(name: "month", arg: 1, scope: !508, file: !434, line: 41, type: !68)
!513 = !DILocalVariable(name: "leap", arg: 2, scope: !508, file: !434, line: 41, type: !68)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !191, size: 384, elements: !515)
!515 = !{!516}
!516 = !DISubrange(count: 12)
!517 = !{}
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !101, size: 64, elements: !519)
!519 = !{!490, !520}
!520 = !DISubrange(count: 4)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "dir_common", scope: !523, file: !530, line: 33, type: !531, isLocal: true, isDefinition: true)
!523 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !525, retainedTypes: !267, globals: !529, splitDebugInlining: false, nameTableKind: None)
!524 = !DIFile(filename: "/src/libphoenix/unistd/dir.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "501f34c59e3495fae10ed79e649ad745")
!525 = !{!19, !526, !528}
!526 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !527, line: 25, baseType: !7, size: 32, elements: !38)
!527 = !DIFile(filename: "include/sys/file.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "e0641f226a7270f4565e3ce942c8b258")
!528 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !527, line: 22, baseType: !7, size: 32, elements: !13)
!529 = !{!521}
!530 = !DIFile(filename: "unistd/dir.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "501f34c59e3495fae10ed79e649ad745")
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !530, line: 31, size: 32, elements: !532)
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "cwd", scope: !531, file: !530, line: 32, baseType: !100, size: 32)
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!535 = distinct !DIGlobalVariable(name: "nodevfs", scope: !536, file: !537, line: 280, type: !68, isLocal: true, isDefinition: true)
!536 = distinct !DISubprogram(name: "create_dev", scope: !537, file: !537, line: 273, type: !538, scopeLine: 274, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !547, retainedNodes: !561)
!537 = !DIFile(filename: "unistd/file.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "efdf8317541df00b1996e0af929dedc4")
!538 = !DISubroutineType(types: !539)
!539 = !{!68, !540, !392}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "oid_t", file: !157, line: 31, baseType: !542)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oid_t", file: !157, line: 28, size: 96, elements: !543)
!543 = !{!544, !545}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !542, file: !157, line: 29, baseType: !7, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !542, file: !157, line: 30, baseType: !546, size: 64, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "id_t", file: !157, line: 27, baseType: !300)
!547 = distinct !DICompileUnit(language: DW_LANG_C99, file: !548, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !549, retainedTypes: !557, globals: !559, splitDebugInlining: false, nameTableKind: None)
!548 = !DIFile(filename: "/src/libphoenix/unistd/file.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "efdf8317541df00b1996e0af929dedc4")
!549 = !{!19, !528, !550}
!550 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !551, line: 35, baseType: !7, size: 32, elements: !552)
!551 = !DIFile(filename: "include/unistd.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "633c02209749713cfa40a8a7a874f447")
!552 = !{!553, !554, !555, !556}
!553 = !DIEnumerator(name: "F_OK", value: 0)
!554 = !DIEnumerator(name: "R_OK", value: 4)
!555 = !DIEnumerator(name: "W_OK", value: 2)
!556 = !DIEnumerator(name: "X_OK", value: 1)
!557 = !{!55, !558}
!558 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!559 = !{!560}
!560 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!561 = !{!562, !563, !564, !565, !566, !658, !659, !660, !661, !662, !663, !664, !665}
!562 = !DILocalVariable(name: "oid", arg: 1, scope: !536, file: !537, line: 273, type: !540)
!563 = !DILocalVariable(name: "path", arg: 2, scope: !536, file: !537, line: 273, type: !392)
!564 = !DILocalVariable(name: "odev", scope: !536, file: !537, line: 275, type: !541)
!565 = !DILocalVariable(name: "odir", scope: !536, file: !537, line: 275, type: !541)
!566 = !DILocalVariable(name: "msg", scope: !536, file: !537, line: 276, type: !567)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "msg_t", file: !20, line: 138, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_msg_t", file: !20, line: 41, size: 1248, elements: !569)
!569 = !{!570, !571, !572, !573, !629}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !568, file: !20, line: 42, baseType: !68, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !568, file: !20, line: 43, baseType: !7, size: 32, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !568, file: !20, line: 44, baseType: !7, size: 32, offset: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !568, file: !20, line: 104, baseType: !574, size: 576, offset: 96)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !568, file: !20, line: 46, size: 576, elements: !575)
!575 = !{!576, !627, !628}
!576 = !DIDerivedType(tag: DW_TAG_member, scope: !574, file: !20, line: 47, baseType: !577, size: 512)
!577 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !574, file: !20, line: 47, size: 512, elements: !578)
!578 = !{!579, !584, !592, !599, !603, !609, !613, !618, !623}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "openclose", scope: !577, file: !20, line: 52, baseType: !580, size: 128)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !577, file: !20, line: 49, size: 128, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !580, file: !20, line: 50, baseType: !541, size: 96)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !580, file: !20, line: 51, baseType: !68, size: 32, offset: 96)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !577, file: !20, line: 60, baseType: !585, size: 224)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !577, file: !20, line: 55, size: 224, elements: !586)
!586 = !{!587, !588, !590, !591}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !585, file: !20, line: 56, baseType: !541, size: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "offs", scope: !585, file: !20, line: 57, baseType: !589, size: 64, offset: 96)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "offs_t", file: !157, line: 20, baseType: !234)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !585, file: !20, line: 58, baseType: !249, size: 32, offset: 160)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !585, file: !20, line: 59, baseType: !7, size: 32, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !577, file: !20, line: 68, baseType: !593, size: 256)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !577, file: !20, line: 63, size: 256, elements: !594)
!594 = !{!595, !596, !597, !598}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !593, file: !20, line: 64, baseType: !541, size: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !593, file: !20, line: 65, baseType: !68, size: 32, offset: 96)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !593, file: !20, line: 66, baseType: !7, size: 32, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !593, file: !20, line: 67, baseType: !541, size: 96, offset: 160)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !577, file: !20, line: 73, baseType: !600, size: 96)
!600 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !577, file: !20, line: 71, size: 96, elements: !601)
!601 = !{!602}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !600, file: !20, line: 72, baseType: !541, size: 96)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !577, file: !20, line: 80, baseType: !604, size: 192)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !577, file: !20, line: 76, size: 192, elements: !605)
!605 = !{!606, !607, !608}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !604, file: !20, line: 77, baseType: !541, size: 96)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !604, file: !20, line: 78, baseType: !234, size: 64, offset: 96)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !604, file: !20, line: 79, baseType: !68, size: 32, offset: 160)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !577, file: !20, line: 85, baseType: !610, size: 96)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !577, file: !20, line: 83, size: 96, elements: !611)
!611 = !{!612}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !610, file: !20, line: 84, baseType: !541, size: 96)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "ln", scope: !577, file: !20, line: 91, baseType: !614, size: 192)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !577, file: !20, line: 88, size: 192, elements: !615)
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !614, file: !20, line: 89, baseType: !541, size: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !614, file: !20, line: 90, baseType: !541, size: 96, offset: 96)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "readdir", scope: !577, file: !20, line: 97, baseType: !619, size: 160)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !577, file: !20, line: 94, size: 160, elements: !620)
!620 = !{!621, !622}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !619, file: !20, line: 95, baseType: !541, size: 96)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "offs", scope: !619, file: !20, line: 96, baseType: !589, size: 64, offset: 96)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !577, file: !20, line: 99, baseType: !624, size: 512)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 512, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !574, file: !20, line: 102, baseType: !249, size: 32, offset: 512)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !574, file: !20, line: 103, baseType: !55, size: 32, offset: 544)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !568, file: !20, line: 136, baseType: !630, size: 576, offset: 672)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !568, file: !20, line: 106, size: 576, elements: !631)
!631 = !{!632, !656, !657}
!632 = !DIDerivedType(tag: DW_TAG_member, scope: !630, file: !20, line: 107, baseType: !633, size: 512)
!633 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !630, file: !20, line: 107, size: 512, elements: !634)
!634 = !{!635, !639, !644, !649, !655}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !633, file: !20, line: 110, baseType: !636, size: 32)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !633, file: !20, line: 108, size: 32, elements: !637)
!637 = !{!638}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !636, file: !20, line: 109, baseType: !68, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !633, file: !20, line: 116, baseType: !640, size: 96)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !633, file: !20, line: 113, size: 96, elements: !641)
!641 = !{!642, !643}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !640, file: !20, line: 114, baseType: !234, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !640, file: !20, line: 115, baseType: !68, size: 32, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !633, file: !20, line: 122, baseType: !645, size: 128)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !633, file: !20, line: 119, size: 128, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !645, file: !20, line: 120, baseType: !541, size: 96)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !645, file: !20, line: 121, baseType: !68, size: 32, offset: 96)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !633, file: !20, line: 129, baseType: !650, size: 224)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !633, file: !20, line: 125, size: 224, elements: !651)
!651 = !{!652, !653, !654}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !650, file: !20, line: 126, baseType: !541, size: 96)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !650, file: !20, line: 127, baseType: !541, size: 96, offset: 96)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !650, file: !20, line: 128, baseType: !68, size: 32, offset: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !633, file: !20, line: 131, baseType: !624, size: 512)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !630, file: !20, line: 134, baseType: !249, size: 32, offset: 512)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !630, file: !20, line: 135, baseType: !55, size: 32, offset: 544)
!658 = !DILocalVariable(name: "retry", scope: !536, file: !537, line: 277, type: !68)
!659 = !DILocalVariable(name: "err", scope: !536, file: !537, line: 277, type: !68)
!660 = !DILocalVariable(name: "canonical_path", scope: !536, file: !537, line: 278, type: !100)
!661 = !DILocalVariable(name: "dir", scope: !536, file: !537, line: 278, type: !100)
!662 = !DILocalVariable(name: "sep", scope: !536, file: !537, line: 278, type: !100)
!663 = !DILocalVariable(name: "name", scope: !536, file: !537, line: 278, type: !100)
!664 = !DILocalVariable(name: "tpathalloc", scope: !536, file: !537, line: 278, type: !100)
!665 = !DILocalVariable(name: "tpath", scope: !536, file: !537, line: 279, type: !392)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "optind", scope: !668, file: !682, line: 25, type: !68, isLocal: false, isDefinition: true)
!668 = distinct !DICompileUnit(language: DW_LANG_C99, file: !669, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !670, retainedTypes: !677, globals: !679, splitDebugInlining: false, nameTableKind: None)
!669 = !DIFile(filename: "/src/libphoenix/unistd/getopt.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "f57c583b069a5ebe3d9619bec64726ec")
!670 = !{!671}
!671 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !672, line: 30, baseType: !7, size: 32, elements: !673)
!672 = !DIFile(filename: "include/getopt.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "3af22cb57d4bf7c2a16e03b241d0e623")
!673 = !{!674, !675, !676}
!674 = !DIEnumerator(name: "no_argument", value: 0)
!675 = !DIEnumerator(name: "required_argument", value: 1)
!676 = !DIEnumerator(name: "optional_argument", value: 2)
!677 = !{!55, !100, !678}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 32)
!679 = !{!666, !680, !683, !685, !687}
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "opterr", scope: !668, file: !682, line: 25, type: !68, isLocal: false, isDefinition: true)
!682 = !DIFile(filename: "unistd/getopt.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "f57c583b069a5ebe3d9619bec64726ec")
!683 = !DIGlobalVariableExpression(var: !684, expr: !DIExpression())
!684 = distinct !DIGlobalVariable(name: "optarg", scope: !668, file: !682, line: 22, type: !100, isLocal: false, isDefinition: true)
!685 = !DIGlobalVariableExpression(var: !686, expr: !DIExpression())
!686 = distinct !DIGlobalVariable(name: "optopt", scope: !668, file: !682, line: 25, type: !68, isLocal: false, isDefinition: true)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "optwhere", scope: !668, file: !682, line: 28, type: !68, isLocal: true, isDefinition: true)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!690 = distinct !DIGlobalVariable(name: "sys_common", scope: !691, file: !696, line: 50, type: !697, isLocal: true, isDefinition: true)
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !692, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !693, globals: !694, splitDebugInlining: false, nameTableKind: None)
!692 = !DIFile(filename: "/src/libphoenix/unistd/sys.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "2d08f2d6e6df97f0542571edee78155e")
!693 = !{!55, !100, !7}
!694 = !{!695}
!695 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!696 = !DIFile(filename: "unistd/sys.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "2d08f2d6e6df97f0542571edee78155e")
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !696, line: 44, size: 128, elements: !698)
!698 = !{!699, !700, !701, !702}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "execBuff", scope: !697, file: !696, line: 46, baseType: !100, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "filePathBuff", scope: !697, file: !696, line: 47, baseType: !100, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "canonicalPath", scope: !697, file: !696, line: 48, baseType: !100, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "sbArgs", scope: !697, file: !696, line: 49, baseType: !678, size: 32, offset: 96)
!703 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!704 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression(DW_OP_LLVM_fragment, 64, 32))
!705 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression(DW_OP_LLVM_fragment, 96, 32))
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "argv_progname", scope: !708, file: !713, line: 31, type: !392, isLocal: false, isDefinition: true)
!708 = distinct !DICompileUnit(language: DW_LANG_C99, file: !709, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !710, splitDebugInlining: false, nameTableKind: None)
!709 = !DIFile(filename: "/src/libphoenix/_startc.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "6d3894dced37fb49d44ac2331e489157")
!710 = !{!711, !706}
!711 = !DIGlobalVariableExpression(var: !712, expr: !DIExpression())
!712 = distinct !DIGlobalVariable(name: "environ", scope: !708, file: !713, line: 30, type: !678, isLocal: false, isDefinition: true)
!713 = !DIFile(filename: "_startc.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "6d3894dced37fb49d44ac2331e489157")
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "pthread_attr_default", scope: !716, file: !729, line: 88, type: !813, isLocal: true, isDefinition: true)
!716 = distinct !DICompileUnit(language: DW_LANG_C99, file: !717, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !718, retainedTypes: !726, globals: !789, splitDebugInlining: false, nameTableKind: None)
!717 = !DIFile(filename: "/src/libphoenix/pthread/pthread.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "c8fa3860e0f6913eea69833891ee5715")
!718 = !{!211, !219, !113, !719}
!719 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !720, line: 20, baseType: !7, size: 32, elements: !721)
!720 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/../../../../i386-pc-phoenix/include/phoenix/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "dbac1c6ee0b71d1be98639a0333f9158")
!721 = !{!722, !723, !724, !725}
!722 = !DIEnumerator(name: "signal_kill", value: 1)
!723 = !DIEnumerator(name: "signal_segv", value: 2)
!724 = !DIEnumerator(name: "signal_illegal", value: 3)
!725 = !DIEnumerator(name: "signal_cancel", value: 32)
!726 = !{!55, !727, !776, !102, !332, !777, !779}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_ctx", file: !729, line: 45, baseType: !730)
!729 = !DIFile(filename: "pthread/pthread.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "c8fa3860e0f6913eea69833891ee5715")
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_ctx", file: !729, line: 31, size: 576, elements: !731)
!731 = !{!732, !733, !737, !738, !739, !740, !741, !743, !744, !745, !746, !760, !761}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !730, file: !729, line: 32, baseType: !156, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "start_routine", scope: !730, file: !729, line: 33, baseType: !734, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = !DISubroutineType(types: !736)
!736 = !{!55, !55}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !730, file: !729, line: 34, baseType: !55, size: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !730, file: !729, line: 35, baseType: !55, size: 32, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !730, file: !729, line: 36, baseType: !55, size: 32, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !730, file: !729, line: 37, baseType: !249, size: 32, offset: 160)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !730, file: !729, line: 38, baseType: !742, size: 32, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !730, file: !729, line: 39, baseType: !742, size: 32, offset: 224)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !730, file: !729, line: 40, baseType: !68, size: 32, offset: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "cancelstate", scope: !730, file: !729, line: 41, baseType: !68, size: 32, offset: 288)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !730, file: !729, line: 42, baseType: !747, size: 192, offset: 320)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__errno_t", file: !119, line: 32, size: 192, elements: !748)
!748 = !{!749, !758, !759}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "linkage", scope: !747, file: !119, line: 33, baseType: !750, size: 128)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbnode_t", file: !114, line: 39, baseType: !751)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rbnode_t", file: !114, line: 34, size: 128, elements: !752)
!752 = !{!753, !755, !756, !757}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !751, file: !114, line: 35, baseType: !754, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !751, file: !114, line: 36, baseType: !754, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !751, file: !114, line: 37, baseType: !754, size: 32, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !751, file: !114, line: 38, baseType: !130, size: 32, offset: 96)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !747, file: !119, line: 34, baseType: !68, size: 32, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !747, file: !119, line: 35, baseType: !68, size: 32, offset: 160)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !730, file: !729, line: 43, baseType: !68, size: 32, offset: 512)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "key_data_list", scope: !730, file: !729, line: 44, baseType: !762, size: 32, offset: 544)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_key_data_t", file: !729, line: 74, size: 96, elements: !764)
!764 = !{!765, !774, !775}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !763, file: !729, line: 75, baseType: !766, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_key_t", file: !729, line: 71, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_key_t", file: !729, line: 69, size: 32, elements: !769)
!769 = !{!770}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !768, file: !729, line: 70, baseType: !771, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 32)
!772 = !DISubroutineType(types: !773)
!773 = !{null, !55}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !763, file: !729, line: 76, baseType: !55, size: 32, offset: 32)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !763, file: !729, line: 77, baseType: !762, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !232, line: 62, baseType: !332)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_key_data_t", file: !729, line: 78, baseType: !763)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_fork_handlers_t", file: !729, line: 54, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_fork_handlers_t", file: !729, line: 48, size: 160, elements: !782)
!782 = !{!783, !784, !785, !786, !788}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !781, file: !729, line: 49, baseType: !271, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !781, file: !729, line: 50, baseType: !271, size: 32, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !781, file: !729, line: 51, baseType: !271, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !781, file: !729, line: 52, baseType: !787, size: 32, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !781, file: !729, line: 53, baseType: !787, size: 32, offset: 128)
!789 = !{!790, !714}
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(name: "pthread_common", scope: !716, file: !729, line: 66, type: !792, isLocal: true, isDefinition: true)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !729, line: 57, size: 320, elements: !793)
!793 = !{!794, !795, !796, !797, !798, !805, !811, !812}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "pthread_key_lock", scope: !792, file: !729, line: 58, baseType: !156, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "pthread_list_lock", scope: !792, file: !729, line: 59, baseType: !156, size: 32, offset: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "pthread_atfork_lock", scope: !792, file: !729, line: 60, baseType: !156, size: 32, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "mutex_cond_init_lock", scope: !792, file: !729, line: 61, baseType: !156, size: 32, offset: 96)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pthread_once_lock", scope: !792, file: !729, line: 62, baseType: !799, size: 64, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !232, line: 67, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !232, line: 64, size: 64, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "mutexh", scope: !800, file: !232, line: 65, baseType: !156, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !800, file: !232, line: 66, baseType: !804, size: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !68)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "pthread_once_cond", scope: !792, file: !729, line: 63, baseType: !806, size: 64, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !232, line: 78, baseType: !807)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !232, line: 75, size: 64, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "condh", scope: !807, file: !232, line: 76, baseType: !156, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !807, file: !232, line: 77, baseType: !804, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "pthread_list", scope: !792, file: !729, line: 64, baseType: !727, size: 32, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "pthread_fork_handlers", scope: !792, file: !729, line: 65, baseType: !779, size: 32, offset: 288)
!813 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_attr_t", file: !232, line: 60, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_attr_t", file: !232, line: 54, size: 160, elements: !816)
!816 = !{!817, !818, !819, !820, !821}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "stackaddr", scope: !815, file: !232, line: 55, baseType: !55, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !815, file: !232, line: 56, baseType: !68, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !815, file: !232, line: 57, baseType: !68, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !815, file: !232, line: 58, baseType: !68, size: 32, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !815, file: !232, line: 59, baseType: !249, size: 32, offset: 128)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "_cnt", scope: !824, file: !829, line: 27, type: !249, isLocal: true, isDefinition: true)
!824 = distinct !DICompileUnit(language: DW_LANG_C99, file: !825, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !162, retainedTypes: !341, globals: !826, splitDebugInlining: false, nameTableKind: None)
!825 = !DIFile(filename: "/src/libphoenix/stdlib/env.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "46370262a72d8e309870a1bc118b7a3c")
!826 = !{!822, !827, !830, !833}
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "_size", scope: !824, file: !829, line: 26, type: !249, isLocal: true, isDefinition: true)
!829 = !DIFile(filename: "stdlib/env.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "46370262a72d8e309870a1bc118b7a3c")
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "_string_allocated", scope: !824, file: !829, line: 33, type: !832, isLocal: true, isDefinition: true)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "_environ_allocated", scope: !824, file: !829, line: 30, type: !7, isLocal: true, isDefinition: true)
!835 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!836 = distinct !DICompileUnit(language: DW_LANG_C99, file: !837, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !838, retainedTypes: !839, splitDebugInlining: false, nameTableKind: None)
!837 = !DIFile(filename: "/src/phoenix-rtos-filesystems/dummyfs/dir.c", directory: "/src/phoenix-rtos-filesystems", checksumkind: CSK_MD5, checksum: "b90cce72288a22d0aa0b5ce6a0e3a7dc")
!838 = !{!5, !11}
!839 = !{!55, !100}
!840 = distinct !DICompileUnit(language: DW_LANG_C99, file: !841, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !842, retainedTypes: !267, splitDebugInlining: false, nameTableKind: None)
!841 = !DIFile(filename: "/src/phoenix-rtos-filesystems/dummyfs/file.c", directory: "/src/phoenix-rtos-filesystems", checksumkind: CSK_MD5, checksum: "a83202b674bf089163204da05750a154")
!842 = !{!5}
!843 = distinct !DICompileUnit(language: DW_LANG_C99, file: !844, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !845, retainedTypes: !846, splitDebugInlining: false, nameTableKind: None)
!844 = !DIFile(filename: "/src/phoenix-rtos-filesystems/dummyfs/dummyfs.c", directory: "/src/phoenix-rtos-filesystems", checksumkind: CSK_MD5, checksum: "874afbc697c6d802b841d14e83c4e535")
!845 = !{!5, !37, !11}
!846 = !{!847, !55, !883, !884, !558}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummyfs_t", file: !58, line: 90, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !58, line: 81, size: 384, elements: !850)
!850 = !{!851, !852, !853, !854, !879, !880, !881, !882}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !849, file: !58, line: 82, baseType: !62, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !849, file: !58, line: 83, baseType: !65, size: 32, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !849, file: !58, line: 84, baseType: !68, size: 32, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "dummytree", scope: !849, file: !58, line: 85, baseType: !855, size: 96, offset: 96)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "idtree_t", file: !71, line: 22, baseType: !856)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbtree_t", file: !6, line: 55, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rbtree_t", file: !6, line: 51, size: 96, elements: !858)
!858 = !{!859, !869, !874}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !857, file: !6, line: 52, baseType: !860, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbnode_t", file: !6, line: 39, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rbnode_t", file: !6, line: 34, size: 128, elements: !863)
!863 = !{!864, !866, !867, !868}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !862, file: !6, line: 35, baseType: !865, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !862, file: !6, line: 36, baseType: !865, size: 32, offset: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !862, file: !6, line: 37, baseType: !865, size: 32, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !862, file: !6, line: 38, baseType: !85, size: 32, offset: 96)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !857, file: !6, line: 53, baseType: !870, size: 32, offset: 32)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbcomp_t", file: !6, line: 42, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!872 = !DISubroutineType(types: !873)
!873 = !{!68, !860, !860}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "augment", scope: !857, file: !6, line: 54, baseType: !875, size: 32, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbaugment_t", file: !6, line: 45, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 32)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !860}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "olock", scope: !849, file: !58, line: 86, baseType: !65, size: 32, offset: 192)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "devtree", scope: !849, file: !58, line: 87, baseType: !856, size: 96, offset: 224)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "devlock", scope: !849, file: !58, line: 88, baseType: !65, size: 32, offset: 320)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "mountpt", scope: !849, file: !58, line: 89, baseType: !100, size: 32, offset: 352)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !63, line: 65, baseType: !62)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_t", file: !66, line: 19, baseType: !7)
!885 = distinct !DICompileUnit(language: DW_LANG_C99, file: !886, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !842, retainedTypes: !887, splitDebugInlining: false, nameTableKind: None)
!886 = !DIFile(filename: "/src/phoenix-rtos-filesystems/dummyfs/object.c", directory: "/src/phoenix-rtos-filesystems", checksumkind: CSK_MD5, checksum: "09eb00b5f4ca6af473985bca86f692ad")
!887 = !{!888, !55, !116}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummyfs_object_t", file: !58, line: 78, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dummyfs_object_t", file: !58, line: 54, size: 864, elements: !891)
!891 = !{!892, !899, !900, !901, !902, !903, !904, !905, !921, !922, !953, !955, !956, !957}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !890, file: !58, line: 55, baseType: !893, size: 96)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "oid_t", file: !66, line: 31, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oid_t", file: !66, line: 28, size: 96, elements: !895)
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !894, file: !66, line: 29, baseType: !7, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !894, file: !66, line: 30, baseType: !898, size: 64, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "id_t", file: !66, line: 27, baseType: !300)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !890, file: !58, line: 55, baseType: !893, size: 96, offset: 96)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !890, file: !58, line: 57, baseType: !7, size: 32, offset: 192)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !890, file: !58, line: 58, baseType: !7, size: 32, offset: 224)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !890, file: !58, line: 59, baseType: !62, size: 32, offset: 256)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !890, file: !58, line: 61, baseType: !68, size: 32, offset: 288)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "nlink", scope: !890, file: !58, line: 62, baseType: !68, size: 32, offset: 320)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !890, file: !58, line: 64, baseType: !906, size: 224, offset: 352)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "idnode_t", file: !71, line: 29, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !71, line: 25, size: 224, elements: !908)
!908 = !{!909, !918, !919, !920}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "linkage", scope: !907, file: !71, line: 26, baseType: !910, size: 128)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbnode_t", file: !6, line: 39, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rbnode_t", file: !6, line: 34, size: 128, elements: !912)
!912 = !{!913, !915, !916, !917}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !911, file: !6, line: 35, baseType: !914, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !911, file: !6, line: 36, baseType: !914, size: 32, offset: 32)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !911, file: !6, line: 37, baseType: !914, size: 32, offset: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !911, file: !6, line: 38, baseType: !85, size: 32, offset: 96)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "lmaxgap", scope: !907, file: !71, line: 27, baseType: !7, size: 32, offset: 128)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "rmaxgap", scope: !907, file: !71, line: 27, baseType: !7, size: 32, offset: 160)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !907, file: !71, line: 28, baseType: !7, size: 32, offset: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !890, file: !58, line: 65, baseType: !249, size: 32, offset: 576)
!922 = !DIDerivedType(tag: DW_TAG_member, scope: !890, file: !58, line: 67, baseType: !923, size: 32, offset: 608)
!923 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !890, file: !58, line: 67, size: 32, elements: !924)
!924 = !{!925, !939, !952}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !923, file: !58, line: 68, baseType: !926, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummyfs_dirent_t", file: !58, line: 39, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dummyfs_dirent_t", file: !58, line: 30, size: 288, elements: !929)
!929 = !{!930, !931, !932, !933, !934, !936, !938}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !928, file: !58, line: 31, baseType: !100, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !928, file: !58, line: 32, baseType: !7, size: 32, offset: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !928, file: !58, line: 33, baseType: !62, size: 32, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !928, file: !58, line: 34, baseType: !893, size: 96, offset: 96)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "deleted", scope: !928, file: !58, line: 35, baseType: !935, size: 8, offset: 192)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !63, line: 28, baseType: !317)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !928, file: !58, line: 37, baseType: !937, size: 32, offset: 224)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !928, file: !58, line: 38, baseType: !937, size: 32, offset: 256)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "chunks", scope: !923, file: !58, line: 69, baseType: !940, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummyfs_chunk_t", file: !58, line: 51, baseType: !942)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dummyfs_chunk_t", file: !58, line: 42, size: 224, elements: !943)
!943 = !{!944, !945, !947, !948, !949, !951}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !942, file: !58, line: 43, baseType: !100, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "offs", scope: !942, file: !58, line: 45, baseType: !946, size: 64, offset: 32)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "offs_t", file: !66, line: 20, baseType: !234)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !942, file: !58, line: 46, baseType: !249, size: 32, offset: 96)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !942, file: !58, line: 47, baseType: !249, size: 32, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !942, file: !58, line: 49, baseType: !950, size: 32, offset: 160)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !942, file: !58, line: 50, baseType: !950, size: 32, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !923, file: !58, line: 70, baseType: !62, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "atime", scope: !890, file: !58, line: 73, baseType: !954, size: 64, offset: 640)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !66, line: 23, baseType: !300)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !890, file: !58, line: 74, baseType: !954, size: 64, offset: 704)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ctime", scope: !890, file: !58, line: 75, baseType: !954, size: 64, offset: 768)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "dirty", scope: !890, file: !58, line: 77, baseType: !935, size: 8, offset: 832)
!958 = distinct !DICompileUnit(language: DW_LANG_C99, file: !959, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !842, retainedTypes: !960, splitDebugInlining: false, nameTableKind: None)
!959 = !DIFile(filename: "/src/phoenix-rtos-filesystems/dummyfs/dev.c", directory: "/src/phoenix-rtos-filesystems", checksumkind: CSK_MD5, checksum: "8fed11f507adbdd98d9e41907b570703")
!960 = !{!55, !116, !961}
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "dummyfs_dev_t", file: !963, line: 28, baseType: !964)
!963 = !DIFile(filename: "dummyfs/dev.c", directory: "/src/phoenix-rtos-filesystems", checksumkind: CSK_MD5, checksum: "8fed11f507adbdd98d9e41907b570703")
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !963, line: 24, size: 288, elements: !965)
!965 = !{!966, !975, !976}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "linkage", scope: !964, file: !963, line: 25, baseType: !967, size: 128)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbnode_t", file: !6, line: 39, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rbnode_t", file: !6, line: 34, size: 128, elements: !969)
!969 = !{!970, !972, !973, !974}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !968, file: !6, line: 35, baseType: !971, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !968, file: !6, line: 36, baseType: !971, size: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !968, file: !6, line: 37, baseType: !971, size: 32, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !968, file: !6, line: 38, baseType: !85, size: 32, offset: 96)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !964, file: !963, line: 26, baseType: !898, size: 64, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !964, file: !963, line: 27, baseType: !977, size: 96, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "oid_t", file: !66, line: 31, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oid_t", file: !66, line: 28, size: 96, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !978, file: !66, line: 29, baseType: !7, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !978, file: !66, line: 30, baseType: !898, size: 64, offset: 32)
!982 = distinct !DICompileUnit(language: DW_LANG_C99, file: !983, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !267, splitDebugInlining: false, nameTableKind: None)
!983 = !DIFile(filename: "/src/libphoenix/arch/ia32/string.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "007f6bf1f2023010eab3fd26b88318bc")
!984 = distinct !DICompileUnit(language: DW_LANG_C99, file: !985, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !112, retainedTypes: !986, splitDebugInlining: false, nameTableKind: None)
!985 = !DIFile(filename: "/src/libphoenix/posix/idtree.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "57c97be37a17082bda6d7790798856a7")
!986 = !{!116, !987, !55, !7}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "idnode_t", file: !989, line: 29, baseType: !990)
!989 = !DIFile(filename: "include/posix/idtree.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "3e5125688f7a9b23c38b21ad150ad234")
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !989, line: 25, size: 224, elements: !991)
!991 = !{!992, !1001, !1002, !1003}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "linkage", scope: !990, file: !989, line: 26, baseType: !993, size: 128)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbnode_t", file: !114, line: 39, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rbnode_t", file: !114, line: 34, size: 128, elements: !995)
!995 = !{!996, !998, !999, !1000}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !994, file: !114, line: 35, baseType: !997, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !994, file: !114, line: 36, baseType: !997, size: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !994, file: !114, line: 37, baseType: !997, size: 32, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !994, file: !114, line: 38, baseType: !130, size: 32, offset: 96)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "lmaxgap", scope: !990, file: !989, line: 27, baseType: !7, size: 32, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "rmaxgap", scope: !990, file: !989, line: 27, baseType: !7, size: 32, offset: 160)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !990, file: !989, line: 28, baseType: !7, size: 32, offset: 192)
!1004 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1005, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1005 = !DIFile(filename: "/src/libphoenix/stdio/printf.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "33ee4419490aefa2a1a519f495b41e78")
!1006 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1007, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1008, splitDebugInlining: false, nameTableKind: None)
!1007 = !DIFile(filename: "/src/libphoenix/stdio/format.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "4e5c8eb21739a9e5beb028819b24e817")
!1008 = !{!55, !101, !438, !1009, !68, !333, !298, !1010, !1011}
!1009 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !299, line: 25, baseType: !68)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !299, line: 26, baseType: !234)
!1012 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1013, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
