; ModuleID = '/src/_build/ia32-generic-qemu/prog/uart16550.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-p270:32:32-p271:32:32-p272:64:64-f64:32:64-f80:32-n8:16:32-S128"
target triple = "i386-pc-none-gnu"

%struct.anon = type { [4 x %struct.uart_t], [1024 x i8] }
%struct.uart_t = type { [64 x i8], i32, i32, i32, i32, i32, %struct._oid_t, %struct.libtty_common_s, [4 x i8], [1024 x i8] }
%struct._oid_t = type { i32, i64 }
%struct.libtty_common_s = type { %struct.libtty_callbacks_s, %struct.termios, %struct.winsize, i32, %struct.fifo_s*, %struct.fifo_s*, i32, i32, i32, i32, [4 x i8], i32, i32* }
%struct.libtty_callbacks_s = type { i8*, void (i8*, i32)*, void (i8*, i32*)*, void (i8*)* }
%struct.termios = type { i32, i32, i32, i32, [17 x i32], i32, i32 }
%struct.winsize = type { i16, i16, i16, i16 }
%struct.fifo_s = type { i32, i32, i32, [0 x i8] }
%struct.anon.1 = type { i8*, i32 }
%struct.anon.13 = type { [2048 x i8], void (i8*, i32)*, %struct.__errno_t, [4 x i8] }
%struct.__errno_t = type { %struct._rbnode_t, i32, i32 }
%struct._rbnode_t = type { %struct._rbnode_t*, %struct._rbnode_t*, %struct._rbnode_t*, i32 }
%struct.anon.16 = type { %struct._rbtree_t, i32 }
%struct._rbtree_t = type { %struct._rbnode_t*, i32 (%struct._rbnode_t*, %struct._rbnode_t*)*, void (%struct._rbnode_t*)* }
%struct.anon.18 = type { [32 x void (i32)*], [32 x i32], i32 }
%struct._FILE = type { i32, i32, i32, i32, i32, i32, i8*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "uart_common", scope: !2, file: !45, line: 56, type: !143, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !38, globals: !142, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/src/phoenix-rtos-devices/tty/uart16550/uart16550.c", directory: "/src/phoenix-rtos-devices", checksumkind: CSK_MD5, checksum: "9f50d3e506ebc94c59e723510d8d10be")
!4 = !{!5, !20}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 140, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/../../../../i386-pc-phoenix/include/termios.h", directory: "", checksumkind: CSK_MD5, checksum: "524b8992b8fd7f454ba0a3b1f842f1a6")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19}
!9 = !DIEnumerator(name: "CS5", value: 0)
!10 = !DIEnumerator(name: "CS6", value: 1)
!11 = !DIEnumerator(name: "CS7", value: 2)
!12 = !DIEnumerator(name: "CS8", value: 3)
!13 = !DIEnumerator(name: "CSIZE", value: 3)
!14 = !DIEnumerator(name: "CSTOPB", value: 8)
!15 = !DIEnumerator(name: "CREAD", value: 16)
!16 = !DIEnumerator(name: "PARENB", value: 32)
!17 = !DIEnumerator(name: "PARODD", value: 64)
!18 = !DIEnumerator(name: "HUPCL", value: 128)
!19 = !DIEnumerator(name: "CLOCAL", value: 256)
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 25, baseType: !7, size: 32, elements: !22)
!21 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/../../../../i386-pc-phoenix/include/sys/file.h", directory: "", checksumkind: CSK_MD5, checksum: "e0641f226a7270f4565e3ce942c8b258")
!22 = !{!23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37}
!23 = !DIEnumerator(name: "atMode", value: 0)
!24 = !DIEnumerator(name: "atUid", value: 1)
!25 = !DIEnumerator(name: "atGid", value: 2)
!26 = !DIEnumerator(name: "atSize", value: 3)
!27 = !DIEnumerator(name: "atBlocks", value: 4)
!28 = !DIEnumerator(name: "atIOBlock", value: 5)
!29 = !DIEnumerator(name: "atType", value: 6)
!30 = !DIEnumerator(name: "atPort", value: 7)
!31 = !DIEnumerator(name: "atPollStatus", value: 8)
!32 = !DIEnumerator(name: "atEventMask", value: 9)
!33 = !DIEnumerator(name: "atCTime", value: 10)
!34 = !DIEnumerator(name: "atMTime", value: 11)
!35 = !DIEnumerator(name: "atATime", value: 12)
!36 = !DIEnumerator(name: "atLinks", value: 13)
!37 = !DIEnumerator(name: "atDev", value: 14)
!38 = !{!39, !40, !43, !50, !7}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !41, line: 65, baseType: !42)
!41 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/../../../../i386-pc-phoenix/include/arch/ia32/stdint.h", directory: "", checksumkind: CSK_MD5, checksum: "07ebff5242b2f7809433124b796203ee")
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !41, line: 30, baseType: !7)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_t", file: !45, line: 50, baseType: !46)
!45 = !DIFile(filename: "tty/uart16550/uart16550.c", directory: "/src/phoenix-rtos-devices", checksumkind: CSK_MD5, checksum: "9f50d3e506ebc94c59e723510d8d10be")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 36, size: 10240, elements: !47)
!47 = !{!48, !54, !55, !56, !59, !60, !61, !69, !138}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "hwctx", scope: !46, file: !45, line: 37, baseType: !49, size: 512)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 512, elements: !52)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !41, line: 28, baseType: !51)
!51 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!52 = !{!53}
!53 = !DISubrange(count: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !46, file: !45, line: 39, baseType: !7, size: 32, offset: 512)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "clk", scope: !46, file: !45, line: 40, baseType: !7, size: 32, offset: 544)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !46, file: !45, line: 42, baseType: !57, size: 32, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "handle_t", file: !58, line: 33, baseType: !7)
!58 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/../../../../i386-pc-phoenix/include/arch/ia32/types.h", directory: "", checksumkind: CSK_MD5, checksum: "dccb145a9c3fe34a34ce266e2880bf02")
!59 = !DIDerivedType(tag: DW_TAG_member, name: "intcond", scope: !46, file: !45, line: 43, baseType: !57, size: 32, offset: 608)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "inth", scope: !46, file: !45, line: 44, baseType: !57, size: 32, offset: 640)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !46, file: !45, line: 46, baseType: !62, size: 96, offset: 672)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "oid_t", file: !58, line: 31, baseType: !63)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oid_t", file: !58, line: 28, size: 96, elements: !64)
!64 = !{!65, !66}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !63, file: !58, line: 29, baseType: !7, size: 32)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !63, file: !58, line: 30, baseType: !67, size: 64, offset: 32)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "id_t", file: !58, line: 27, baseType: !68)
!68 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "tty", scope: !46, file: !45, line: 47, baseType: !70, size: 1248, offset: 768)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "libtty_common_t", file: !71, line: 24, baseType: !72)
!71 = !DIFile(filename: "_build/ia32-generic-qemu/include/libtty.h", directory: "/src", checksumkind: CSK_MD5, checksum: "976d22f66dffe6fc457eed4c75f3961c")
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libtty_common_s", file: !71, line: 40, size: 1248, elements: !73)
!73 = !{!74, !95, !109, !117, !120, !124, !125, !126, !127, !128, !129, !134, !135}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !72, file: !71, line: 41, baseType: !75, size: 128)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "libtty_callbacks_t", file: !71, line: 25, baseType: !76)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libtty_callbacks_s", file: !71, line: 29, size: 128, elements: !77)
!77 = !{!78, !79, !85, !91}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !76, file: !71, line: 30, baseType: !39, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "set_baudrate", scope: !76, file: !71, line: 33, baseType: !80, size: 32, offset: 32)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 32)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !39, !83}
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "speed_t", file: !6, line: 23, baseType: !84)
!84 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "set_cflag", scope: !76, file: !71, line: 34, baseType: !86, size: 32, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 32)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !39, !89}
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "tcflag_t", file: !6, line: 24, baseType: !84)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "signal_txready", scope: !76, file: !71, line: 37, baseType: !92, size: 32, offset: 96)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 32)
!93 = !DISubroutineType(types: !94)
!94 = !{null, !39}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "term", scope: !72, file: !71, line: 42, baseType: !96, size: 736, offset: 128)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "termios", file: !6, line: 52, size: 736, elements: !97)
!97 = !{!98, !99, !100, !101, !102, !107, !108}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "c_iflag", scope: !96, file: !6, line: 53, baseType: !90, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "c_oflag", scope: !96, file: !6, line: 54, baseType: !90, size: 32, offset: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "c_cflag", scope: !96, file: !6, line: 55, baseType: !90, size: 32, offset: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "c_lflag", scope: !96, file: !6, line: 56, baseType: !90, size: 32, offset: 96)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "c_cc", scope: !96, file: !6, line: 57, baseType: !103, size: 544, offset: 128)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !104, size: 544, elements: !105)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "cc_t", file: !6, line: 22, baseType: !7)
!105 = !{!106}
!106 = !DISubrange(count: 17)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "c_ispeed", scope: !96, file: !6, line: 58, baseType: !83, size: 32, offset: 672)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "c_ospeed", scope: !96, file: !6, line: 59, baseType: !83, size: 32, offset: 704)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ws", scope: !72, file: !71, line: 43, baseType: !110, size: 64, offset: 864)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "winsize", file: !6, line: 169, size: 64, elements: !111)
!111 = !{!112, !114, !115, !116}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ws_row", scope: !110, file: !6, line: 171, baseType: !113, size: 16)
!113 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ws_col", scope: !110, file: !6, line: 172, baseType: !113, size: 16, offset: 16)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ws_xpixel", scope: !110, file: !6, line: 173, baseType: !113, size: 16, offset: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ws_ypixel", scope: !110, file: !6, line: 174, baseType: !113, size: 16, offset: 48)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "pgrp", scope: !72, file: !71, line: 44, baseType: !118, size: 32, offset: 928)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !119, line: 29, baseType: !84)
!119 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/../../../../i386-pc-phoenix/include/sys/types.h", directory: "", checksumkind: CSK_MD5, checksum: "53fc299ca750308d7127f33067080633")
!120 = !DIDerivedType(tag: DW_TAG_member, name: "tx_fifo", scope: !72, file: !71, line: 46, baseType: !121, size: 32, offset: 960)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "fifo_t", file: !71, line: 26, baseType: !123)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "fifo_s", file: !71, line: 26, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "rx_fifo", scope: !72, file: !71, line: 47, baseType: !121, size: 32, offset: 992)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "tx_waitq", scope: !72, file: !71, line: 49, baseType: !57, size: 32, offset: 1024)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "rx_waitq", scope: !72, file: !71, line: 50, baseType: !57, size: 32, offset: 1056)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tx_mutex", scope: !72, file: !71, line: 52, baseType: !57, size: 32, offset: 1088)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "rx_mutex", scope: !72, file: !71, line: 53, baseType: !57, size: 32, offset: 1120)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "breakchars", scope: !72, file: !71, line: 56, baseType: !130, size: 32, offset: 1152)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 32, elements: !132)
!131 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!132 = !{!133}
!133 = !DISubrange(count: 4)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "t_flags", scope: !72, file: !71, line: 57, baseType: !7, size: 32, offset: 1184)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "debug", scope: !72, file: !71, line: 60, baseType: !136, size: 32, offset: 1216)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !42)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !46, file: !45, line: 49, baseType: !139, size: 8192, align: 64, offset: 2048)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 8192, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 1024)
!142 = !{!0}
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !45, line: 53, size: 49152, elements: !144)
!144 = !{!145, !147}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "uarts", scope: !143, file: !45, line: 54, baseType: !146, size: 40960)
!146 = !DICompositeType(tag: DW_TAG_array_type, baseType: !44, size: 40960, elements: !132)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !143, file: !45, line: 55, baseType: !139, size: 8192, align: 64, offset: 40960)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "uarts", scope: !150, file: !151, line: 59, type: !172, isLocal: true, isDefinition: true)
!150 = distinct !DISubprogram(name: "uarthw_init", scope: !151, file: !151, line: 54, type: !152, scopeLine: 55, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !157, retainedNodes: !167)
!151 = !DIFile(filename: "tty/uart16550/uarthw-pc.c", directory: "/src/phoenix-rtos-devices", checksumkind: CSK_MD5, checksum: "239e026141386cbf1585648fc298f843")
!152 = !DISubroutineType(types: !153)
!153 = !{!84, !7, !39, !154, !156}
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !155, line: 209, baseType: !7)
!155 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "6c2f8c538b0427e4a1e2dd9a64369f49")
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 32)
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !159, globals: !166, splitDebugInlining: false, nameTableKind: None)
!158 = !DIFile(filename: "/src/phoenix-rtos-devices/tty/uart16550/uarthw-pc.c", directory: "/src/phoenix-rtos-devices", checksumkind: CSK_MD5, checksum: "239e026141386cbf1585648fc298f843")
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "uarthw_ctx_t", file: !151, line: 26, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !151, line: 23, size: 64, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !162, file: !151, line: 24, baseType: !39, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !162, file: !151, line: 25, baseType: !7, size: 32, offset: 32)
!166 = !{!148}
!167 = !{!168, !169, !170, !171}
!168 = !DILocalVariable(name: "uartn", arg: 1, scope: !150, file: !151, line: 54, type: !7)
!169 = !DILocalVariable(name: "hwctx", arg: 2, scope: !150, file: !151, line: 54, type: !39)
!170 = !DILocalVariable(name: "hwctxsz", arg: 3, scope: !150, file: !151, line: 54, type: !154)
!171 = !DILocalVariable(name: "fclk", arg: 4, scope: !150, file: !151, line: 54, type: !156)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 256, elements: !132)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !150, file: !151, line: 56, size: 64, elements: !174)
!174 = !{!175, !176}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !173, file: !151, line: 57, baseType: !39, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !173, file: !151, line: 58, baseType: !7, size: 32, offset: 32)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "ttydefchars", scope: !179, file: !272, line: 101, type: !103, isLocal: false, isDefinition: true)
!179 = distinct !DICompileUnit(language: DW_LANG_C99, file: !180, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !181, retainedTypes: !249, globals: !271, splitDebugInlining: false, nameTableKind: None)
!180 = !DIFile(filename: "/src/phoenix-rtos-devices/tty/libtty/libtty.c", directory: "/src/phoenix-rtos-devices", checksumkind: CSK_MD5, checksum: "c1512d5b44c315d421191ddc87ca1d7b")
!181 = !{!182, !196, !228, !233, !5}
!182 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 154, baseType: !7, size: 32, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195}
!184 = !DIEnumerator(name: "ECHO", value: 1)
!185 = !DIEnumerator(name: "ECHOE", value: 2)
!186 = !DIEnumerator(name: "ECHOK", value: 4)
!187 = !DIEnumerator(name: "ECHONL", value: 8)
!188 = !DIEnumerator(name: "ICANON", value: 16)
!189 = !DIEnumerator(name: "IEXTEN", value: 32)
!190 = !DIEnumerator(name: "ISIG", value: 64)
!191 = !DIEnumerator(name: "NOFLSH", value: 128)
!192 = !DIEnumerator(name: "TOSTOP", value: 256)
!193 = !DIEnumerator(name: "XCASE", value: 512)
!194 = !DIEnumerator(name: "ECHOCTL", value: 1024)
!195 = !DIEnumerator(name: "ECHOKE", value: 2048)
!196 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 82, baseType: !7, size: 32, elements: !197)
!197 = !{!198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227}
!198 = !DIEnumerator(name: "OPOST", value: 1)
!199 = !DIEnumerator(name: "OLCUC", value: 2)
!200 = !DIEnumerator(name: "ONLCR", value: 4)
!201 = !DIEnumerator(name: "OCRNL", value: 8)
!202 = !DIEnumerator(name: "ONOCR", value: 16)
!203 = !DIEnumerator(name: "ONLRET", value: 32)
!204 = !DIEnumerator(name: "OFILL", value: 64)
!205 = !DIEnumerator(name: "NLDLY", value: 128)
!206 = !DIEnumerator(name: "NL0", value: 256)
!207 = !DIEnumerator(name: "NL1", value: 512)
!208 = !DIEnumerator(name: "CRDLY", value: 1024)
!209 = !DIEnumerator(name: "CR0", value: 2048)
!210 = !DIEnumerator(name: "CR1", value: 4096)
!211 = !DIEnumerator(name: "CR2", value: 8192)
!212 = !DIEnumerator(name: "CR3", value: 16384)
!213 = !DIEnumerator(name: "TABDLY", value: 32768)
!214 = !DIEnumerator(name: "TAB0", value: 65536)
!215 = !DIEnumerator(name: "TAB1", value: 131072)
!216 = !DIEnumerator(name: "TAB2", value: 262144)
!217 = !DIEnumerator(name: "TAB3", value: 524288)
!218 = !DIEnumerator(name: "XTABS", value: 524288)
!219 = !DIEnumerator(name: "BSDLY", value: 1048576)
!220 = !DIEnumerator(name: "BS0", value: 2097152)
!221 = !DIEnumerator(name: "BS1", value: 4194304)
!222 = !DIEnumerator(name: "VTDLY", value: 8388608)
!223 = !DIEnumerator(name: "VT0", value: 16777216)
!224 = !DIEnumerator(name: "VT1", value: 33554432)
!225 = !DIEnumerator(name: "FFDLY", value: 67108864)
!226 = !DIEnumerator(name: "FF0", value: 134217728)
!227 = !DIEnumerator(name: "FF1", value: 268435456)
!228 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 194, baseType: !7, size: 32, elements: !229)
!229 = !{!230, !231, !232}
!230 = !DIEnumerator(name: "TCIFLUSH", value: 0)
!231 = !DIEnumerator(name: "TCOFLUSH", value: 1)
!232 = !DIEnumerator(name: "TCIOFLUSH", value: 2)
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 64, baseType: !7, size: 32, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248}
!235 = !DIEnumerator(name: "BRKINT", value: 1)
!236 = !DIEnumerator(name: "ICRNL", value: 2)
!237 = !DIEnumerator(name: "IGNBRK", value: 4)
!238 = !DIEnumerator(name: "IGNCR", value: 8)
!239 = !DIEnumerator(name: "IGNPAR", value: 16)
!240 = !DIEnumerator(name: "INLCR", value: 32)
!241 = !DIEnumerator(name: "INPCK", value: 64)
!242 = !DIEnumerator(name: "ISTRIP", value: 128)
!243 = !DIEnumerator(name: "IUCLC", value: 256)
!244 = !DIEnumerator(name: "IXANY", value: 512)
!245 = !DIEnumerator(name: "IXOFF", value: 1024)
!246 = !DIEnumerator(name: "IXON", value: 2048)
!247 = !DIEnumerator(name: "IMAXBEL", value: 4096)
!248 = !DIEnumerator(name: "PARMRK", value: 8192)
!249 = !{!39, !51, !250, !260, !267, !268, !270, !50}
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "termios", file: !6, line: 52, size: 736, elements: !252)
!252 = !{!253, !254, !255, !256, !257, !258, !259}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "c_iflag", scope: !251, file: !6, line: 53, baseType: !90, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "c_oflag", scope: !251, file: !6, line: 54, baseType: !90, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "c_cflag", scope: !251, file: !6, line: 55, baseType: !90, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "c_lflag", scope: !251, file: !6, line: 56, baseType: !90, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "c_cc", scope: !251, file: !6, line: 57, baseType: !103, size: 544, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "c_ispeed", scope: !251, file: !6, line: 58, baseType: !83, size: 32, offset: 672)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "c_ospeed", scope: !251, file: !6, line: 59, baseType: !83, size: 32, offset: 704)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "winsize", file: !6, line: 169, size: 64, elements: !262)
!262 = !{!263, !264, !265, !266}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "ws_row", scope: !261, file: !6, line: 171, baseType: !113, size: 16)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ws_col", scope: !261, file: !6, line: 172, baseType: !113, size: 16, offset: 16)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ws_xpixel", scope: !261, file: !6, line: 173, baseType: !113, size: 16, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "ws_ypixel", scope: !261, file: !6, line: 174, baseType: !113, size: 16, offset: 48)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!270 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!271 = !{!177}
!272 = !DIFile(filename: "tty/libtty/ttydefaults.h", directory: "/src/phoenix-rtos-devices", checksumkind: CSK_MD5, checksum: "893d39df6d2f169751a6adf8d8fcdcaf")
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "libklog_common", scope: !275, file: !285, line: 31, type: !286, isLocal: true, isDefinition: true)
!275 = distinct !DICompileUnit(language: DW_LANG_C99, file: !276, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !277, retainedTypes: !283, globals: !284, splitDebugInlining: false, nameTableKind: None)
!276 = !DIFile(filename: "/src/phoenix-rtos-devices/libklog/libklog.c", directory: "/src/phoenix-rtos-devices", checksumkind: CSK_MD5, checksum: "1bfc91ad9ebc8cb9975edd2a54e2562c")
!277 = !{!278}
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rbcolor_t", file: !279, line: 29, baseType: !7, size: 32, elements: !280)
!279 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/../../../../i386-pc-phoenix/include/sys/rb.h", directory: "", checksumkind: CSK_MD5, checksum: "b64924d3aac346a3c0d2613130ee2f50")
!280 = !{!281, !282}
!281 = !DIEnumerator(name: "RB_RED", value: 0)
!282 = !DIEnumerator(name: "RB_BLACK", value: 1)
!283 = !{!39}
!284 = !{!273}
!285 = !DIFile(filename: "libklog/libklog.c", directory: "/src/phoenix-rtos-devices", checksumkind: CSK_MD5, checksum: "1bfc91ad9ebc8cb9975edd2a54e2562c")
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !285, line: 27, size: 16640, elements: !287)
!287 = !{!288, !292, !300}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !286, file: !285, line: 28, baseType: !289, size: 16384, align: 64)
!289 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 16384, elements: !290)
!290 = !{!291}
!291 = !DISubrange(count: 2048)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ttywrite", scope: !286, file: !285, line: 29, baseType: !293, size: 32, offset: 16384)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "libklog_write_t", file: !294, line: 20, baseType: !295)
!294 = !DIFile(filename: "libklog/libklog.h", directory: "/src/phoenix-rtos-devices", checksumkind: CSK_MD5, checksum: "d3c11984f6fa032db7521ff8795de2ee")
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !298, !154}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !286, file: !285, line: 30, baseType: !301, size: 192, offset: 16416)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__errno_t", file: !302, line: 32, size: 192, elements: !303)
!302 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/../../../../i386-pc-phoenix/include/sys/threads.h", directory: "", checksumkind: CSK_MD5, checksum: "0221ca48ed158d0d0b44da6dd42655a1")
!303 = !{!304, !314, !315}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "linkage", scope: !301, file: !302, line: 33, baseType: !305, size: 128)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbnode_t", file: !279, line: 39, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rbnode_t", file: !279, line: 34, size: 128, elements: !307)
!307 = !{!308, !310, !311, !312}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !306, file: !279, line: 35, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !306, file: !279, line: 36, baseType: !309, size: 32, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !306, file: !279, line: 37, baseType: !309, size: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !306, file: !279, line: 38, baseType: !313, size: 32, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbcolor_t", file: !279, line: 31, baseType: !278)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !301, file: !302, line: 34, baseType: !84, size: 32, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !301, file: !302, line: 35, baseType: !84, size: 32, offset: 160)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "errno_common", scope: !318, file: !343, line: 25, type: !344, isLocal: false, isDefinition: true)
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !320, retainedTypes: !323, globals: !340, splitDebugInlining: false, nameTableKind: None)
!319 = !DIFile(filename: "/src/libphoenix/errno/errno.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "994b4c625b3851d775f2f3f0e785704c")
!320 = !{!321}
!321 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rbcolor_t", file: !322, line: 29, baseType: !7, size: 32, elements: !280)
!322 = !DIFile(filename: "include/sys/rb.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "b64924d3aac346a3c0d2613130ee2f50")
!323 = !{!270, !324, !39}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__errno_t", file: !326, line: 32, size: 192, elements: !327)
!326 = !DIFile(filename: "include/sys/threads.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "0221ca48ed158d0d0b44da6dd42655a1")
!327 = !{!328, !338, !339}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "linkage", scope: !325, file: !326, line: 33, baseType: !329, size: 128)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbnode_t", file: !322, line: 39, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rbnode_t", file: !322, line: 34, size: 128, elements: !331)
!331 = !{!332, !334, !335, !336}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !330, file: !322, line: 35, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !330, file: !322, line: 36, baseType: !333, size: 32, offset: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !330, file: !322, line: 37, baseType: !333, size: 32, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !330, file: !322, line: 38, baseType: !337, size: 32, offset: 96)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbcolor_t", file: !322, line: 31, baseType: !321)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !325, file: !326, line: 34, baseType: !84, size: 32, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !325, file: !326, line: 35, baseType: !84, size: 32, offset: 160)
!340 = !{!341, !316}
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "errno_global", scope: !318, file: !343, line: 20, type: !84, isLocal: true, isDefinition: true)
!343 = !DIFile(filename: "errno/errno.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "994b4c625b3851d775f2f3f0e785704c")
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !343, line: 22, size: 128, elements: !345)
!345 = !{!346, !362}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tree", scope: !344, file: !343, line: 23, baseType: !347, size: 96)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbtree_t", file: !322, line: 55, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rbtree_t", file: !322, line: 51, size: 96, elements: !349)
!349 = !{!350, !352, !357}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !348, file: !322, line: 52, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !348, file: !322, line: 53, baseType: !353, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbcomp_t", file: !322, line: 42, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DISubroutineType(types: !356)
!356 = !{!84, !351, !351}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "augment", scope: !348, file: !322, line: 54, baseType: !358, size: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbaugment_t", file: !322, line: 45, baseType: !359)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 32)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !351}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !344, file: !343, line: 24, baseType: !363, size: 32, offset: 96)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "handle_t", file: !364, line: 33, baseType: !7)
!364 = !DIFile(filename: "include/arch/ia32/types.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "dccb145a9c3fe34a34ce266e2880bf02")
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "_signals_phx2posix", scope: !367, file: !384, line: 36, type: !397, isLocal: false, isDefinition: true)
!367 = distinct !DICompileUnit(language: DW_LANG_C99, file: !368, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !369, retainedTypes: !376, globals: !381, splitDebugInlining: false, nameTableKind: None)
!368 = !DIFile(filename: "/src/libphoenix/signal/signal.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "0016819dc034123b9e32494e5904cc14")
!369 = !{!370}
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !371, line: 65, baseType: !7, size: 32, elements: !372)
!371 = !DIFile(filename: "include/signal.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "c25249b0aa213a140dfa2e75433fd639")
!372 = !{!373, !374, !375}
!373 = !DIEnumerator(name: "SIG_BLOCK", value: 0)
!374 = !DIEnumerator(name: "SIG_SETMASK", value: 1)
!375 = !DIEnumerator(name: "SIG_UNBLOCK", value: 2)
!376 = !{!377, !39}
!377 = !DIDerivedType(tag: DW_TAG_typedef, name: "sighandler_t", file: !371, line: 23, baseType: !378)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 32)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !84}
!381 = !{!365, !382, !395}
!382 = !DIGlobalVariableExpression(var: !383, expr: !DIExpression())
!383 = distinct !DIGlobalVariable(name: "signal_common", scope: !367, file: !384, line: 33, type: !385, isLocal: false, isDefinition: true)
!384 = !DIFile(filename: "signal/signal.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "0016819dc034123b9e32494e5904cc14")
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !384, line: 29, size: 2080, elements: !386)
!386 = !{!387, !391, !394}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "sightab", scope: !385, file: !384, line: 30, baseType: !388, size: 1024)
!388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !377, size: 1024, elements: !389)
!389 = !{!390}
!390 = !DISubrange(count: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "sigset", scope: !385, file: !384, line: 31, baseType: !392, size: 1024, offset: 1024)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 1024, elements: !389)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !371, line: 78, baseType: !84)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !385, file: !384, line: 32, baseType: !363, size: 32, offset: 2048)
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "_signals_posix2phx", scope: !367, file: !384, line: 41, type: !397, isLocal: true, isDefinition: true)
!397 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 1024, elements: !389)
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !84)
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "stdout", scope: !401, file: !444, line: 47, type: !466, isLocal: false, isDefinition: true)
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !403, retainedTypes: !437, globals: !463, splitDebugInlining: false, nameTableKind: None)
!402 = !DIFile(filename: "/src/libphoenix/stdio/file.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "47d8b7a3d3e87b2afc6844d93138785e")
!403 = !{!404, !418, !426}
!404 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !405, line: 43, baseType: !7, size: 32, elements: !406)
!405 = !DIFile(filename: "include/fcntl.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "1fb1413f7e76ff024fa62e7e49fd904f")
!406 = !{!407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417}
!407 = !DIEnumerator(name: "F_DUPFD", value: 0)
!408 = !DIEnumerator(name: "F_DUPFD_CLOEXEC", value: 1)
!409 = !DIEnumerator(name: "F_GETFD", value: 2)
!410 = !DIEnumerator(name: "F_SETFD", value: 3)
!411 = !DIEnumerator(name: "F_GETFL", value: 4)
!412 = !DIEnumerator(name: "F_SETFL", value: 5)
!413 = !DIEnumerator(name: "F_GETOWN", value: 6)
!414 = !DIEnumerator(name: "F_SETOWN", value: 7)
!415 = !DIEnumerator(name: "F_GETLK", value: 8)
!416 = !DIEnumerator(name: "F_SETLK", value: 9)
!417 = !DIEnumerator(name: "F_SETLKW", value: 10)
!418 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !419, line: 24, baseType: !7, size: 32, elements: !420)
!419 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/../../../../i386-pc-phoenix/include/phoenix/mman.h", directory: "", checksumkind: CSK_MD5, checksum: "b24dcbd5287fd86aa93587d1f4749735")
!420 = !{!421, !422, !423, !424, !425}
!421 = !DIEnumerator(name: "PROT_NONE", value: 0)
!422 = !DIEnumerator(name: "PROT_READ", value: 1)
!423 = !DIEnumerator(name: "PROT_WRITE", value: 2)
!424 = !DIEnumerator(name: "PROT_EXEC", value: 4)
!425 = !DIEnumerator(name: "PROT_USER", value: 8)
!426 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !419, line: 20, baseType: !7, size: 32, elements: !427)
!427 = !{!428, !429, !430, !431, !432, !433, !434, !435, !436}
!428 = !DIEnumerator(name: "MAP_NONE", value: 0)
!429 = !DIEnumerator(name: "MAP_NEEDSCOPY", value: 1)
!430 = !DIEnumerator(name: "MAP_UNCACHED", value: 2)
!431 = !DIEnumerator(name: "MAP_DEVICE", value: 4)
!432 = !DIEnumerator(name: "MAP_NOINHERIT", value: 8)
!433 = !DIEnumerator(name: "MAP_SHARED", value: 0)
!434 = !DIEnumerator(name: "MAP_PRIVATE", value: 0)
!435 = !DIEnumerator(name: "MAP_FIXED", value: 0)
!436 = !DIEnumerator(name: "MAP_ANONYMOUS", value: 0)
!437 = !{!39, !438, !270, !442}
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !439, line: 42, baseType: !440)
!439 = !DIFile(filename: "include/sys/types.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "53fc299ca750308d7127f33067080633")
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !439, line: 41, baseType: !441)
!441 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "popen_FILE", file: !444, line: 44, baseType: !445)
!444 = !DIFile(filename: "stdio/file.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "47d8b7a3d3e87b2afc6844d93138785e")
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !444, line: 41, size: 288, elements: !446)
!446 = !{!447, !461}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !445, file: !444, line: 42, baseType: !448, size: 256)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !449, line: 67, baseType: !450)
!449 = !DIFile(filename: "include/stdio.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "1c8ea53ca5b48b8b669b534900b6bf8a")
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE", file: !449, line: 57, size: 256, elements: !451)
!451 = !{!452, !453, !454, !455, !456, !457, !458, !460}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !450, file: !449, line: 58, baseType: !84, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !450, file: !449, line: 59, baseType: !7, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !450, file: !449, line: 61, baseType: !84, size: 32, offset: 64)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "bufeof", scope: !450, file: !449, line: 62, baseType: !154, size: 32, offset: 96)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !450, file: !449, line: 63, baseType: !154, size: 32, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "bufsz", scope: !450, file: !449, line: 64, baseType: !154, size: 32, offset: 160)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !450, file: !449, line: 65, baseType: !459, size: 32, offset: 192)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !450, file: !449, line: 66, baseType: !363, size: 32, offset: 224)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !445, file: !444, line: 43, baseType: !462, size: 32, offset: 256)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !439, line: 29, baseType: !84)
!463 = !{!464, !399, !467}
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "stdin", scope: !401, file: !444, line: 47, type: !466, isLocal: false, isDefinition: true)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "stderr", scope: !401, file: !444, line: 47, type: !466, isLocal: false, isDefinition: true)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "atexit_funcs", scope: !471, file: !474, line: 19, type: !475, isLocal: false, isDefinition: true)
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !472, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !283, globals: !473, splitDebugInlining: false, nameTableKind: None)
!472 = !DIFile(filename: "/src/libphoenix/stdlib/atexit.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "0c5bd3b700dd461995df990484695e52")
!473 = !{!469}
!474 = !DIFile(filename: "stdlib/atexit.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "0c5bd3b700dd461995df990484695e52")
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 1024, elements: !389)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 32)
!477 = !DISubroutineType(types: !478)
!478 = !{null}
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "malloc_common", scope: !481, file: !507, line: 73, type: !565, isLocal: false, isDefinition: true)
!481 = distinct !DICompileUnit(language: DW_LANG_C99, file: !482, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !483, retainedTypes: !502, globals: !540, splitDebugInlining: false, nameTableKind: None)
!482 = !DIFile(filename: "/src/libphoenix/stdlib/malloc_dl.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "62af652782abbd6840f007efb06e5269")
!483 = !{!321, !484, !418, !426}
!484 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !485, line: 7, baseType: !7, size: 32, elements: !486)
!485 = !DIFile(filename: "include/sysexits.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "7393c8deb081ddea4b4b13881afa2c33")
!486 = !{!487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501}
!487 = !DIEnumerator(name: "EX_USAGE", value: 64)
!488 = !DIEnumerator(name: "EX_DATAERR", value: 65)
!489 = !DIEnumerator(name: "EX_NOINPUT", value: 66)
!490 = !DIEnumerator(name: "EX_NOUSER", value: 67)
!491 = !DIEnumerator(name: "EX_NOHOST", value: 68)
!492 = !DIEnumerator(name: "EX_UNAVAILABLE", value: 69)
!493 = !DIEnumerator(name: "EX_SOFTWARE", value: 70)
!494 = !DIEnumerator(name: "EX_OSERR", value: 71)
!495 = !DIEnumerator(name: "EX_OSFILE", value: 72)
!496 = !DIEnumerator(name: "EX_CANTCREAT", value: 73)
!497 = !DIEnumerator(name: "EX_IOERR", value: 74)
!498 = !DIEnumerator(name: "EX_TEMPFAIL", value: 75)
!499 = !DIEnumerator(name: "EX_PROTOCOL", value: 76)
!500 = !DIEnumerator(name: "EX_NOPERM", value: 77)
!501 = !DIEnumerator(name: "EX_CONFIG", value: 78)
!502 = !{!39, !503, !154, !505, !535, !270, !537, !538, !539}
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !504, line: 31, baseType: !68)
!504 = !DIFile(filename: "include/arch/ia32/stdint.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "07ebff5242b2f7809433124b796203ee")
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 32)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "chunk_t", file: !507, line: 60, baseType: !508)
!507 = !DIFile(filename: "stdlib/malloc_dl.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "62af652782abbd6840f007efb06e5269")
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_chunk_t", file: !507, line: 51, size: 256, elements: !509)
!509 = !{!510, !511, !523, !525, !526}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !508, file: !507, line: 53, baseType: !154, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !508, file: !507, line: 54, baseType: !512, size: 32, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "heap_t", file: !507, line: 48, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !507, line: 44, size: 64, elements: !515)
!515 = !{!516, !517, !518}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !514, file: !507, line: 45, baseType: !154, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "freesz", scope: !514, file: !507, line: 46, baseType: !154, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "space", scope: !514, file: !507, line: 47, baseType: !519, offset: 64)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, elements: !521)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !504, line: 28, baseType: !51)
!521 = !{!522}
!522 = !DISubrange(count: -1)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !508, file: !507, line: 57, baseType: !524, size: 32, offset: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !508, file: !507, line: 58, baseType: !524, size: 32, offset: 96)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !508, file: !507, line: 59, baseType: !527, size: 128, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbnode_t", file: !322, line: 39, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rbnode_t", file: !322, line: 34, size: 128, elements: !529)
!529 = !{!530, !532, !533, !534}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !528, file: !322, line: 35, baseType: !531, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !528, file: !322, line: 36, baseType: !531, size: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !528, file: !322, line: 37, baseType: !531, size: 32, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !528, file: !322, line: 38, baseType: !337, size: 32, offset: 96)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !504, line: 65, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !504, line: 30, baseType: !7)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 32)
!540 = !{!479, !541}
!541 = !DIGlobalVariableExpression(var: !542, expr: !DIExpression())
!542 = distinct !DIGlobalVariable(name: "lookup", scope: !543, file: !507, line: 352, type: !564, isLocal: true, isDefinition: true)
!543 = distinct !DISubprogram(name: "_malloc_allocLarge", scope: !507, file: !507, line: 349, type: !544, scopeLine: 350, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !481, retainedNodes: !546)
!544 = !DISubroutineType(types: !545)
!545 = !{!39, !154}
!546 = !{!547, !548, !549, !550, !551, !552, !553, !556, !557, !563}
!547 = !DILocalVariable(name: "size", arg: 1, scope: !543, file: !507, line: 349, type: !154)
!548 = !DILocalVariable(name: "idx", scope: !543, file: !507, line: 359, type: !7)
!549 = !DILocalVariable(name: "binmap", scope: !543, file: !507, line: 360, type: !7)
!550 = !DILocalVariable(name: "heap", scope: !543, file: !507, line: 361, type: !512)
!551 = !DILocalVariable(name: "chunk", scope: !543, file: !507, line: 362, type: !505)
!552 = !DILocalVariable(name: "t", scope: !543, file: !507, line: 363, type: !506)
!553 = !DILocalVariable(name: "_off", scope: !554, file: !507, line: 367, type: !270)
!554 = distinct !DILexicalBlock(scope: !555, file: !507, line: 367, column: 11)
!555 = distinct !DILexicalBlock(scope: !543, file: !507, line: 366, column: 29)
!556 = !DILocalVariable(name: "tmpnode", scope: !554, file: !507, line: 367, type: !39)
!557 = !DILocalVariable(name: "_a", scope: !558, file: !507, line: 376, type: !562)
!558 = distinct !DILexicalBlock(scope: !559, file: !507, line: 376, column: 33)
!559 = distinct !DILexicalBlock(scope: !560, file: !507, line: 376, column: 7)
!560 = distinct !DILexicalBlock(scope: !561, file: !507, line: 374, column: 21)
!561 = distinct !DILexicalBlock(scope: !543, file: !507, line: 374, column: 6)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!563 = !DILocalVariable(name: "_b", scope: !558, file: !507, line: 376, type: !154)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 1024, elements: !389)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !507, line: 63, size: 4256, elements: !566)
!566 = !{!567, !568, !569, !571, !588, !589, !590}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "sbinmap", scope: !565, file: !507, line: 64, baseType: !536, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "lbinmap", scope: !565, file: !507, line: 65, baseType: !536, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "sbins", scope: !565, file: !507, line: 66, baseType: !570, size: 1024, offset: 64)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 1024, elements: !389)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "lbins", scope: !565, file: !507, line: 67, baseType: !572, size: 3072, offset: 1088)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 3072, elements: !389)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbtree_t", file: !322, line: 55, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rbtree_t", file: !322, line: 51, size: 96, elements: !575)
!575 = !{!576, !578, !583}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !574, file: !322, line: 52, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "compare", scope: !574, file: !322, line: 53, baseType: !579, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbcomp_t", file: !322, line: 42, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DISubroutineType(types: !582)
!582 = !{!84, !577, !577}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "augment", scope: !574, file: !322, line: 54, baseType: !584, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbaugment_t", file: !322, line: 45, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !577}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "allocsz", scope: !565, file: !507, line: 69, baseType: !154, size: 32, offset: 4160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "freesz", scope: !565, file: !507, line: 70, baseType: !154, size: 32, offset: 4192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !565, file: !507, line: 72, baseType: !363, size: 32, offset: 4224)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "string_common", scope: !593, file: !598, line: 25, type: !599, isLocal: false, isDefinition: true)
!593 = distinct !DICompileUnit(language: DW_LANG_C99, file: !594, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !595, globals: !597, splitDebugInlining: false, nameTableKind: None)
!594 = !DIFile(filename: "/src/libphoenix/string/string.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "f7857eaa7dce8fd44f8623b07e418515")
!595 = !{!459, !39, !298, !596, !51}
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 32)
!597 = !{!591}
!598 = !DIFile(filename: "string/string.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "f7857eaa7dce8fd44f8623b07e418515")
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !598, line: 23, size: 32, elements: !600)
!600 = !{!601}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "next_token", scope: !599, file: !598, line: 24, baseType: !459, size: 32)
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!603 = distinct !DIGlobalVariable(name: "nodevfs", scope: !604, file: !605, line: 280, type: !84, isLocal: true, isDefinition: true)
!604 = distinct !DISubprogram(name: "create_dev", scope: !605, file: !605, line: 273, type: !606, scopeLine: 274, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !615, retainedNodes: !655)
!605 = !DIFile(filename: "unistd/file.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "efdf8317541df00b1996e0af929dedc4")
!606 = !DISubroutineType(types: !607)
!607 = !{!84, !608, !298}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "oid_t", file: !364, line: 31, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_oid_t", file: !364, line: 28, size: 96, elements: !611)
!611 = !{!612, !613}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !610, file: !364, line: 29, baseType: !7, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !610, file: !364, line: 30, baseType: !614, size: 64, offset: 32)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "id_t", file: !364, line: 27, baseType: !68)
!615 = distinct !DICompileUnit(language: DW_LANG_C99, file: !616, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !617, retainedTypes: !651, globals: !653, splitDebugInlining: false, nameTableKind: None)
!616 = !DIFile(filename: "/src/libphoenix/unistd/file.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "efdf8317541df00b1996e0af929dedc4")
!617 = !{!618, !636, !644}
!618 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !619, line: 24, baseType: !7, size: 32, elements: !620)
!619 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/../../../../i386-pc-phoenix/include/phoenix/msg.h", directory: "", checksumkind: CSK_MD5, checksum: "542795edacfe9ec3ffece94e87c863a1")
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635}
!621 = !DIEnumerator(name: "mtOpen", value: 0)
!622 = !DIEnumerator(name: "mtClose", value: 1)
!623 = !DIEnumerator(name: "mtRead", value: 2)
!624 = !DIEnumerator(name: "mtWrite", value: 3)
!625 = !DIEnumerator(name: "mtTruncate", value: 4)
!626 = !DIEnumerator(name: "mtDevCtl", value: 5)
!627 = !DIEnumerator(name: "mtCreate", value: 6)
!628 = !DIEnumerator(name: "mtDestroy", value: 7)
!629 = !DIEnumerator(name: "mtSetAttr", value: 8)
!630 = !DIEnumerator(name: "mtGetAttr", value: 9)
!631 = !DIEnumerator(name: "mtLookup", value: 10)
!632 = !DIEnumerator(name: "mtLink", value: 11)
!633 = !DIEnumerator(name: "mtUnlink", value: 12)
!634 = !DIEnumerator(name: "mtReaddir", value: 13)
!635 = !DIEnumerator(name: "mtCount", value: 14)
!636 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !637, line: 22, baseType: !7, size: 32, elements: !638)
!637 = !DIFile(filename: "include/sys/file.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "e0641f226a7270f4565e3ce942c8b258")
!638 = !{!639, !640, !641, !642, !643}
!639 = !DIEnumerator(name: "otDir", value: 0)
!640 = !DIEnumerator(name: "otFile", value: 1)
!641 = !DIEnumerator(name: "otDev", value: 2)
!642 = !DIEnumerator(name: "otSymlink", value: 3)
!643 = !DIEnumerator(name: "otUnknown", value: 4)
!644 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !645, line: 35, baseType: !7, size: 32, elements: !646)
!645 = !DIFile(filename: "include/unistd.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "633c02209749713cfa40a8a7a874f447")
!646 = !{!647, !648, !649, !650}
!647 = !DIEnumerator(name: "F_OK", value: 0)
!648 = !DIEnumerator(name: "R_OK", value: 4)
!649 = !DIEnumerator(name: "W_OK", value: 2)
!650 = !DIEnumerator(name: "X_OK", value: 1)
!651 = !{!39, !652}
!652 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!653 = !{!654}
!654 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!655 = !{!656, !657, !658, !659, !660, !750, !751, !752, !753, !754, !755, !756, !757}
!656 = !DILocalVariable(name: "oid", arg: 1, scope: !604, file: !605, line: 273, type: !608)
!657 = !DILocalVariable(name: "path", arg: 2, scope: !604, file: !605, line: 273, type: !298)
!658 = !DILocalVariable(name: "odev", scope: !604, file: !605, line: 275, type: !609)
!659 = !DILocalVariable(name: "odir", scope: !604, file: !605, line: 275, type: !609)
!660 = !DILocalVariable(name: "msg", scope: !604, file: !605, line: 276, type: !661)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "msg_t", file: !619, line: 138, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_msg_t", file: !619, line: 41, size: 1248, elements: !663)
!663 = !{!664, !665, !666, !667, !721}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !662, file: !619, line: 42, baseType: !84, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pid", scope: !662, file: !619, line: 43, baseType: !7, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !662, file: !619, line: 44, baseType: !7, size: 32, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "i", scope: !662, file: !619, line: 104, baseType: !668, size: 576, offset: 96)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !662, file: !619, line: 46, size: 576, elements: !669)
!669 = !{!670, !719, !720}
!670 = !DIDerivedType(tag: DW_TAG_member, scope: !668, file: !619, line: 47, baseType: !671, size: 512)
!671 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !668, file: !619, line: 47, size: 512, elements: !672)
!672 = !{!673, !678, !686, !693, !697, !703, !707, !712, !717}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "openclose", scope: !671, file: !619, line: 52, baseType: !674, size: 128)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !619, line: 49, size: 128, elements: !675)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !674, file: !619, line: 50, baseType: !609, size: 96)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !674, file: !619, line: 51, baseType: !84, size: 32, offset: 96)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !671, file: !619, line: 60, baseType: !679, size: 224)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !619, line: 55, size: 224, elements: !680)
!680 = !{!681, !682, !684, !685}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !679, file: !619, line: 56, baseType: !609, size: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "offs", scope: !679, file: !619, line: 57, baseType: !683, size: 64, offset: 96)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "offs_t", file: !364, line: 20, baseType: !441)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !679, file: !619, line: 58, baseType: !154, size: 32, offset: 160)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !679, file: !619, line: 59, baseType: !7, size: 32, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !671, file: !619, line: 68, baseType: !687, size: 256)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !619, line: 63, size: 256, elements: !688)
!688 = !{!689, !690, !691, !692}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !687, file: !619, line: 64, baseType: !609, size: 96)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !687, file: !619, line: 65, baseType: !84, size: 32, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !687, file: !619, line: 66, baseType: !7, size: 32, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !687, file: !619, line: 67, baseType: !609, size: 96, offset: 160)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "destroy", scope: !671, file: !619, line: 73, baseType: !694, size: 96)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !619, line: 71, size: 96, elements: !695)
!695 = !{!696}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !694, file: !619, line: 72, baseType: !609, size: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !671, file: !619, line: 80, baseType: !698, size: 192)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !619, line: 76, size: 192, elements: !699)
!699 = !{!700, !701, !702}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !698, file: !619, line: 77, baseType: !609, size: 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !698, file: !619, line: 78, baseType: !441, size: 64, offset: 96)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !698, file: !619, line: 79, baseType: !84, size: 32, offset: 160)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !671, file: !619, line: 85, baseType: !704, size: 96)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !619, line: 83, size: 96, elements: !705)
!705 = !{!706}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !704, file: !619, line: 84, baseType: !609, size: 96)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "ln", scope: !671, file: !619, line: 91, baseType: !708, size: 192)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !619, line: 88, size: 192, elements: !709)
!709 = !{!710, !711}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !708, file: !619, line: 89, baseType: !609, size: 96)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !708, file: !619, line: 90, baseType: !609, size: 96, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "readdir", scope: !671, file: !619, line: 97, baseType: !713, size: 160)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !671, file: !619, line: 94, size: 160, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !713, file: !619, line: 95, baseType: !609, size: 96)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "offs", scope: !713, file: !619, line: 96, baseType: !683, size: 64, offset: 96)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !671, file: !619, line: 99, baseType: !718, size: 512)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 512, elements: !52)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !668, file: !619, line: 102, baseType: !154, size: 32, offset: 512)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !668, file: !619, line: 103, baseType: !39, size: 32, offset: 544)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "o", scope: !662, file: !619, line: 136, baseType: !722, size: 576, offset: 672)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !662, file: !619, line: 106, size: 576, elements: !723)
!723 = !{!724, !748, !749}
!724 = !DIDerivedType(tag: DW_TAG_member, scope: !722, file: !619, line: 107, baseType: !725, size: 512)
!725 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !722, file: !619, line: 107, size: 512, elements: !726)
!726 = !{!727, !731, !736, !741, !747}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "io", scope: !725, file: !619, line: 110, baseType: !728, size: 32)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !725, file: !619, line: 108, size: 32, elements: !729)
!729 = !{!730}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !728, file: !619, line: 109, baseType: !84, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !725, file: !619, line: 116, baseType: !732, size: 96)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !725, file: !619, line: 113, size: 96, elements: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !732, file: !619, line: 114, baseType: !441, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !732, file: !619, line: 115, baseType: !84, size: 32, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "create", scope: !725, file: !619, line: 122, baseType: !737, size: 128)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !725, file: !619, line: 119, size: 128, elements: !738)
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "oid", scope: !737, file: !619, line: 120, baseType: !609, size: 96)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !737, file: !619, line: 121, baseType: !84, size: 32, offset: 96)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lookup", scope: !725, file: !619, line: 129, baseType: !742, size: 224)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !725, file: !619, line: 125, size: 224, elements: !743)
!743 = !{!744, !745, !746}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "fil", scope: !742, file: !619, line: 126, baseType: !609, size: 96)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !742, file: !619, line: 127, baseType: !609, size: 96, offset: 96)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !742, file: !619, line: 128, baseType: !84, size: 32, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !725, file: !619, line: 131, baseType: !718, size: 512)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !722, file: !619, line: 134, baseType: !154, size: 32, offset: 512)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !722, file: !619, line: 135, baseType: !39, size: 32, offset: 544)
!750 = !DILocalVariable(name: "retry", scope: !604, file: !605, line: 277, type: !84)
!751 = !DILocalVariable(name: "err", scope: !604, file: !605, line: 277, type: !84)
!752 = !DILocalVariable(name: "canonical_path", scope: !604, file: !605, line: 278, type: !459)
!753 = !DILocalVariable(name: "dir", scope: !604, file: !605, line: 278, type: !459)
!754 = !DILocalVariable(name: "sep", scope: !604, file: !605, line: 278, type: !459)
!755 = !DILocalVariable(name: "name", scope: !604, file: !605, line: 278, type: !459)
!756 = !DILocalVariable(name: "tpathalloc", scope: !604, file: !605, line: 278, type: !459)
!757 = !DILocalVariable(name: "tpath", scope: !604, file: !605, line: 279, type: !298)
!758 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!759 = distinct !DIGlobalVariable(name: "sys_common", scope: !760, file: !765, line: 50, type: !766, isLocal: true, isDefinition: true)
!760 = distinct !DICompileUnit(language: DW_LANG_C99, file: !761, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !762, globals: !763, splitDebugInlining: false, nameTableKind: None)
!761 = !DIFile(filename: "/src/libphoenix/unistd/sys.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "2d08f2d6e6df97f0542571edee78155e")
!762 = !{!39, !459, !7}
!763 = !{!764}
!764 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression())
!765 = !DIFile(filename: "unistd/sys.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "2d08f2d6e6df97f0542571edee78155e")
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !765, line: 44, size: 128, elements: !767)
!767 = !{!768, !769, !770, !771}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "execBuff", scope: !766, file: !765, line: 46, baseType: !459, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "filePathBuff", scope: !766, file: !765, line: 47, baseType: !459, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "canonicalPath", scope: !766, file: !765, line: 48, baseType: !459, size: 32, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "sbArgs", scope: !766, file: !765, line: 49, baseType: !772, size: 32, offset: 96)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!773 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!774 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression(DW_OP_LLVM_fragment, 64, 32))
!775 = !DIGlobalVariableExpression(var: !759, expr: !DIExpression(DW_OP_LLVM_fragment, 96, 32))
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "argv_progname", scope: !778, file: !783, line: 31, type: !298, isLocal: false, isDefinition: true)
!778 = distinct !DICompileUnit(language: DW_LANG_C99, file: !779, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !780, splitDebugInlining: false, nameTableKind: None)
!779 = !DIFile(filename: "/src/libphoenix/_startc.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "6d3894dced37fb49d44ac2331e489157")
!780 = !{!781, !776}
!781 = !DIGlobalVariableExpression(var: !782, expr: !DIExpression())
!782 = distinct !DIGlobalVariable(name: "environ", scope: !778, file: !783, line: 30, type: !772, isLocal: false, isDefinition: true)
!783 = !DIFile(filename: "_startc.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "6d3894dced37fb49d44ac2331e489157")
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "pthread_attr_default", scope: !786, file: !799, line: 88, type: !880, isLocal: true, isDefinition: true)
!786 = distinct !DICompileUnit(language: DW_LANG_C99, file: !787, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !788, retainedTypes: !796, globals: !856, splitDebugInlining: false, nameTableKind: None)
!787 = !DIFile(filename: "/src/libphoenix/pthread/pthread.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "c8fa3860e0f6913eea69833891ee5715")
!788 = !{!418, !426, !321, !789}
!789 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !790, line: 20, baseType: !7, size: 32, elements: !791)
!790 = !DIFile(filename: "/opt/phoenix/i386-pc-phoenix/bin/../lib/gcc/i386-pc-phoenix/9.3.0/../../../../i386-pc-phoenix/include/phoenix/signal.h", directory: "", checksumkind: CSK_MD5, checksum: "dbac1c6ee0b71d1be98639a0333f9158")
!791 = !{!792, !793, !794, !795}
!792 = !DIEnumerator(name: "signal_kill", value: 1)
!793 = !DIEnumerator(name: "signal_segv", value: 2)
!794 = !DIEnumerator(name: "signal_illegal", value: 3)
!795 = !DIEnumerator(name: "signal_cancel", value: 32)
!796 = !{!39, !797, !843, !538, !535, !844, !846}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_ctx", file: !799, line: 45, baseType: !800)
!799 = !DIFile(filename: "pthread/pthread.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "c8fa3860e0f6913eea69833891ee5715")
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_ctx", file: !799, line: 31, size: 576, elements: !801)
!801 = !{!802, !803, !807, !808, !809, !810, !811, !813, !814, !815, !816, !830, !831}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !800, file: !799, line: 32, baseType: !363, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "start_routine", scope: !800, file: !799, line: 33, baseType: !804, size: 32, offset: 32)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 32)
!805 = !DISubroutineType(types: !806)
!806 = !{!39, !39}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !800, file: !799, line: 34, baseType: !39, size: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "retval", scope: !800, file: !799, line: 35, baseType: !39, size: 32, offset: 96)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !800, file: !799, line: 36, baseType: !39, size: 32, offset: 128)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !800, file: !799, line: 37, baseType: !154, size: 32, offset: 160)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !800, file: !799, line: 38, baseType: !812, size: 32, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !800, file: !799, line: 39, baseType: !812, size: 32, offset: 224)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !800, file: !799, line: 40, baseType: !84, size: 32, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "cancelstate", scope: !800, file: !799, line: 41, baseType: !84, size: 32, offset: 288)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !800, file: !799, line: 42, baseType: !817, size: 192, offset: 320)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__errno_t", file: !326, line: 32, size: 192, elements: !818)
!818 = !{!819, !828, !829}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "linkage", scope: !817, file: !326, line: 33, baseType: !820, size: 128)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "rbnode_t", file: !322, line: 39, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rbnode_t", file: !322, line: 34, size: 128, elements: !822)
!822 = !{!823, !825, !826, !827}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !821, file: !322, line: 35, baseType: !824, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !821, file: !322, line: 36, baseType: !824, size: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !821, file: !322, line: 37, baseType: !824, size: 32, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !821, file: !322, line: 38, baseType: !337, size: 32, offset: 96)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !817, file: !326, line: 34, baseType: !84, size: 32, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !817, file: !326, line: 35, baseType: !84, size: 32, offset: 160)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !800, file: !799, line: 43, baseType: !84, size: 32, offset: 512)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "key_data_list", scope: !800, file: !799, line: 44, baseType: !832, size: 32, offset: 544)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_key_data_t", file: !799, line: 74, size: 96, elements: !834)
!834 = !{!835, !841, !842}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !833, file: !799, line: 75, baseType: !836, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pthread_key_t", file: !799, line: 71, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_key_t", file: !799, line: 69, size: 32, elements: !839)
!839 = !{!840}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "destructor", scope: !838, file: !799, line: 70, baseType: !92, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !833, file: !799, line: 76, baseType: !39, size: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !833, file: !799, line: 77, baseType: !832, size: 32, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_t", file: !439, line: 62, baseType: !535)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_key_data_t", file: !799, line: 78, baseType: !833)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_fork_handlers_t", file: !799, line: 54, baseType: !848)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_fork_handlers_t", file: !799, line: 48, size: 160, elements: !849)
!849 = !{!850, !851, !852, !853, !855}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "prepare", scope: !848, file: !799, line: 49, baseType: !476, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !848, file: !799, line: 50, baseType: !476, size: 32, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !848, file: !799, line: 51, baseType: !476, size: 32, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !848, file: !799, line: 52, baseType: !854, size: 32, offset: 96)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !848, file: !799, line: 53, baseType: !854, size: 32, offset: 128)
!856 = !{!857, !784}
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(name: "pthread_common", scope: !786, file: !799, line: 66, type: !859, isLocal: true, isDefinition: true)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !799, line: 57, size: 320, elements: !860)
!860 = !{!861, !862, !863, !864, !865, !872, !878, !879}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "pthread_key_lock", scope: !859, file: !799, line: 58, baseType: !363, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "pthread_list_lock", scope: !859, file: !799, line: 59, baseType: !363, size: 32, offset: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "pthread_atfork_lock", scope: !859, file: !799, line: 60, baseType: !363, size: 32, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "mutex_cond_init_lock", scope: !859, file: !799, line: 61, baseType: !363, size: 32, offset: 96)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "pthread_once_lock", scope: !859, file: !799, line: 62, baseType: !866, size: 64, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_mutex_t", file: !439, line: 67, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 64, size: 64, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "mutexh", scope: !867, file: !439, line: 65, baseType: !363, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !867, file: !439, line: 66, baseType: !871, size: 32, offset: 32)
!871 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !84)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "pthread_once_cond", scope: !859, file: !799, line: 63, baseType: !873, size: 64, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_cond_t", file: !439, line: 78, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !439, line: 75, size: 64, elements: !875)
!875 = !{!876, !877}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "condh", scope: !874, file: !439, line: 76, baseType: !363, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !874, file: !439, line: 77, baseType: !871, size: 32, offset: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "pthread_list", scope: !859, file: !799, line: 64, baseType: !797, size: 32, offset: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "pthread_fork_handlers", scope: !859, file: !799, line: 65, baseType: !846, size: 32, offset: 288)
!880 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !881)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_attr_t", file: !439, line: 60, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pthread_attr_t", file: !439, line: 54, size: 160, elements: !883)
!883 = !{!884, !885, !886, !887, !888}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "stackaddr", scope: !882, file: !439, line: 55, baseType: !39, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "policy", scope: !882, file: !439, line: 56, baseType: !84, size: 32, offset: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !882, file: !439, line: 57, baseType: !84, size: 32, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "detached", scope: !882, file: !439, line: 58, baseType: !84, size: 32, offset: 96)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !882, file: !439, line: 59, baseType: !154, size: 32, offset: 128)
!889 = !DIGlobalVariableExpression(var: !890, expr: !DIExpression())
!890 = distinct !DIGlobalVariable(name: "_cnt", scope: !891, file: !896, line: 27, type: !154, isLocal: true, isDefinition: true)
!891 = distinct !DICompileUnit(language: DW_LANG_C99, file: !892, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !369, retainedTypes: !545, globals: !893, splitDebugInlining: false, nameTableKind: None)
!892 = !DIFile(filename: "/src/libphoenix/stdlib/env.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "46370262a72d8e309870a1bc118b7a3c")
!893 = !{!889, !894, !897, !899}
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "_size", scope: !891, file: !896, line: 26, type: !154, isLocal: true, isDefinition: true)
!896 = !DIFile(filename: "stdlib/env.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "46370262a72d8e309870a1bc118b7a3c")
!897 = !DIGlobalVariableExpression(var: !898, expr: !DIExpression())
!898 = distinct !DIGlobalVariable(name: "_string_allocated", scope: !891, file: !896, line: 33, type: !156, isLocal: true, isDefinition: true)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(name: "_environ_allocated", scope: !891, file: !896, line: 30, type: !7, isLocal: true, isDefinition: true)
!901 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "tznamestore", scope: !904, file: !905, line: 71, type: !989, isLocal: true, isDefinition: true)
!904 = distinct !DISubprogram(name: "tzset", scope: !905, file: !905, line: 69, type: !477, scopeLine: 70, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !906, retainedNodes: !988)
!905 = !DIFile(filename: "time/time.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "8e7d168ab45c01bc54a88b843660c300")
!906 = distinct !DICompileUnit(language: DW_LANG_C99, file: !907, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !908, globals: !911, splitDebugInlining: false, nameTableKind: None)
!907 = !DIFile(filename: "/src/libphoenix/time/time.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "8e7d168ab45c01bc54a88b843660c300")
!908 = !{!39, !909, !910}
!909 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_t", file: !439, line: 44, baseType: !84)
!911 = !{!902, !912, !934, !945, !950, !957, !962, !964, !966, !972, !977}
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(name: "buff", scope: !914, file: !905, line: 146, type: !933, isLocal: true, isDefinition: true)
!914 = distinct !DISubprogram(name: "asctime", scope: !905, file: !905, line: 144, type: !915, scopeLine: 145, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !906, retainedNodes: !931)
!915 = !DISubroutineType(types: !916)
!916 = !{!459, !917}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !919)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !920, line: 33, size: 288, elements: !921)
!920 = !DIFile(filename: "include/time.h", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "a2e8ad5ad4a4f79bbd3d7bfb5e5a3791")
!921 = !{!922, !923, !924, !925, !926, !927, !928, !929, !930}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !919, file: !920, line: 34, baseType: !84, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !919, file: !920, line: 35, baseType: !84, size: 32, offset: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !919, file: !920, line: 36, baseType: !84, size: 32, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !919, file: !920, line: 37, baseType: !84, size: 32, offset: 96)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !919, file: !920, line: 38, baseType: !84, size: 32, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !919, file: !920, line: 39, baseType: !84, size: 32, offset: 160)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !919, file: !920, line: 40, baseType: !84, size: 32, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !919, file: !920, line: 41, baseType: !84, size: 32, offset: 224)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !919, file: !920, line: 42, baseType: !84, size: 32, offset: 256)
!931 = !{!932}
!932 = !DILocalVariable(name: "tp", arg: 1, scope: !914, file: !905, line: 144, type: !917)
!933 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 256, elements: !389)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(name: "tmp", scope: !936, file: !905, line: 219, type: !919, isLocal: true, isDefinition: true)
!936 = distinct !DISubprogram(name: "gmtime", scope: !905, file: !905, line: 217, type: !937, scopeLine: 218, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !906, retainedNodes: !943)
!937 = !DISubroutineType(types: !938)
!938 = !{!939, !940}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !942)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !364, line: 23, baseType: !68)
!943 = !{!944}
!944 = !DILocalVariable(name: "timep", arg: 1, scope: !936, file: !905, line: 217, type: !940)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(name: "tmp", scope: !947, file: !905, line: 234, type: !919, isLocal: true, isDefinition: true)
!947 = distinct !DISubprogram(name: "localtime", scope: !905, file: !905, line: 232, type: !937, scopeLine: 233, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !906, retainedNodes: !948)
!948 = !{!949}
!949 = !DILocalVariable(name: "timep", arg: 1, scope: !947, file: !905, line: 232, type: !940)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(name: "buff", scope: !952, file: !905, line: 252, type: !933, isLocal: true, isDefinition: true)
!952 = distinct !DISubprogram(name: "ctime", scope: !905, file: !905, line: 250, type: !953, scopeLine: 251, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !906, retainedNodes: !955)
!953 = !DISubroutineType(types: !954)
!954 = !{!459, !940}
!955 = !{!956}
!956 = !DILocalVariable(name: "timep", arg: 1, scope: !952, file: !905, line: 250, type: !940)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(name: "tzname", scope: !906, file: !905, line: 25, type: !959, isLocal: false, isDefinition: true)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 64, elements: !960)
!960 = !{!961}
!961 = !DISubrange(count: 2)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "timezone", scope: !906, file: !905, line: 28, type: !270, isLocal: false, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "daylight", scope: !906, file: !905, line: 31, type: !84, isLocal: false, isDefinition: true)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(name: "wdayasc", scope: !906, file: !905, line: 34, type: !968, isLocal: true, isDefinition: true)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 640, elements: !969)
!969 = !{!970, !971}
!970 = !DISubrange(count: 8)
!971 = !DISubrange(count: 10)
!972 = !DIGlobalVariableExpression(var: !973, expr: !DIExpression())
!973 = distinct !DIGlobalVariable(name: "monasc", scope: !906, file: !905, line: 37, type: !974, isLocal: true, isDefinition: true)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 1040, elements: !975)
!975 = !{!976, !971}
!976 = !DISubrange(count: 13)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(name: "lut", scope: !979, file: !905, line: 43, type: !985, isLocal: true, isDefinition: true)
!979 = distinct !DISubprogram(name: "daysofmonth", scope: !905, file: !905, line: 41, type: !980, scopeLine: 42, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !906, retainedNodes: !982)
!980 = !DISubroutineType(types: !981)
!981 = !{!84, !84, !84}
!982 = !{!983, !984}
!983 = !DILocalVariable(name: "month", arg: 1, scope: !979, file: !905, line: 41, type: !84)
!984 = !DILocalVariable(name: "leap", arg: 2, scope: !979, file: !905, line: 41, type: !84)
!985 = !DICompositeType(tag: DW_TAG_array_type, baseType: !398, size: 384, elements: !986)
!986 = !{!987}
!987 = !DISubrange(count: 12)
!988 = !{}
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 64, elements: !990)
!990 = !{!961, !133}
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(name: "dir_common", scope: !993, file: !998, line: 33, type: !999, isLocal: true, isDefinition: true)
!993 = distinct !DICompileUnit(language: DW_LANG_C99, file: !994, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !995, retainedTypes: !283, globals: !997, splitDebugInlining: false, nameTableKind: None)
!994 = !DIFile(filename: "/src/libphoenix/unistd/dir.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "501f34c59e3495fae10ed79e649ad745")
!995 = !{!618, !996, !636}
!996 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !637, line: 25, baseType: !7, size: 32, elements: !22)
!997 = !{!991}
!998 = !DIFile(filename: "unistd/dir.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "501f34c59e3495fae10ed79e649ad745")
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !998, line: 31, size: 32, elements: !1000)
!1000 = !{!1001}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "cwd", scope: !999, file: !998, line: 32, baseType: !459, size: 32)
!1002 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1003, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1004, retainedTypes: !1005, splitDebugInlining: false, nameTableKind: None)
!1003 = !DIFile(filename: "/src/phoenix-rtos-devices/tty/libtty/libtty_disc.c", directory: "/src/phoenix-rtos-devices", checksumkind: CSK_MD5, checksum: "cc35054f16a144b2bb1194a292efe7e2")
!1004 = !{!233, !182, !196}
!1005 = !{!131, !1006, !51, !50, !39}
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !58, line: 23, baseType: !68)
!1007 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1008, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!1008 = !DIFile(filename: "/src/libphoenix/stdio/printf.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "33ee4419490aefa2a1a519f495b41e78")
!1009 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1010, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1011, splitDebugInlining: false, nameTableKind: None)
!1010 = !DIFile(filename: "/src/libphoenix/stdio/sprintf.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "0004e03a00f21478c66bf775f5069d5e")
!1011 = !{!1012, !1019}
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "vsprintf_ctx_t", file: !1014, line: 24, baseType: !1015)
!1014 = !DIFile(filename: "stdio/sprintf.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "0004e03a00f21478c66bf775f5069d5e")
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vsprintf_ctx_t", file: !1014, line: 21, size: 64, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !1015, file: !1014, line: 22, baseType: !459, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1015, file: !1014, line: 23, baseType: !154, size: 32, offset: 32)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "vsnprintf_ctx_t", file: !1014, line: 31, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vsnprintf_ctx_t", file: !1014, line: 27, size: 96, elements: !1022)
!1022 = !{!1023, !1024, !1025}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "buff", scope: !1021, file: !1014, line: 28, baseType: !459, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !1021, file: !1014, line: 29, baseType: !154, size: 32, offset: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "max_len", scope: !1021, file: !1014, line: 30, baseType: !154, size: 32, offset: 64)
!1026 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1027, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1028, retainedTypes: !1061, splitDebugInlining: false, nameTableKind: None)
!1027 = !DIFile(filename: "/src/libphoenix/stdio/fprintf.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "057a55eeddf42c2d3e436f009ae775e8")
!1028 = !{!1029}
!1029 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !1031, file: !1030, line: 34, baseType: !7, size: 32, elements: !1058)
!1030 = !DIFile(filename: "stdio/fprintf.c", directory: "/src/libphoenix", checksumkind: CSK_MD5, checksum: "057a55eeddf42c2d3e436f009ae775e8")
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "feed_ctx_s", file: !1030, line: 25, size: 288, elements: !1032)
!1032 = !{!1033, !1050, !1051, !1052, !1053, !1054}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !1031, file: !1030, line: 30, baseType: !1034, size: 32)
!1034 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1031, file: !1030, line: 27, size: 32, elements: !1035)
!1035 = !{!1036, !1049}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !1034, file: !1030, line: 28, baseType: !1037, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 32)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !449, line: 67, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_FILE", file: !449, line: 57, size: 256, elements: !1040)
!1040 = !{!1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !1039, file: !449, line: 58, baseType: !84, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1039, file: !449, line: 59, baseType: !7, size: 32, offset: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1039, file: !449, line: 61, baseType: !84, size: 32, offset: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "bufeof", scope: !1039, file: !449, line: 62, baseType: !154, size: 32, offset: 96)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "bufpos", scope: !1039, file: !449, line: 63, baseType: !154, size: 32, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "bufsz", scope: !1039, file: !449, line: 64, baseType: !154, size: 32, offset: 160)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !1039, file: !449, line: 65, baseType: !459, size: 32, offset: 192)
