; ModuleID = 'build/96b_neonkey/timer_synchronization/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.osTimerAttr_t = type { i8*, i32, i8*, i32 }
%struct.osMessageQueueAttr_t = type { i8*, i32, i8*, i32, i8*, i32 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.z_poller*, i8*, i16* }
%struct.z_poller = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_spinlock }
%struct.k_spinlock = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.k_spinlock }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.k_mem_slab = type { %union.anon, %struct.k_spinlock, i32, i32, i8*, i8*, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/timer_synchronization/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/timer_synchronization")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 98, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/timer_synchronization")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5504, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 86)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2752, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "timer_attr", scope: !27, file: !122, line: 20, type: !147, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !117, globals: !119, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/portability/cmsis_rtos_v2/timer_synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/timer_synchronization")
!29 = !{!30, !42, !47}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 195, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/portability/cmsis_os2.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41}
!34 = !DIEnumerator(name: "osOK", value: 0)
!35 = !DIEnumerator(name: "osError", value: -1)
!36 = !DIEnumerator(name: "osErrorTimeout", value: -2)
!37 = !DIEnumerator(name: "osErrorResource", value: -3)
!38 = !DIEnumerator(name: "osErrorParameter", value: -4)
!39 = !DIEnumerator(name: "osErrorNoMemory", value: -5)
!40 = !DIEnumerator(name: "osErrorISR", value: -6)
!41 = !DIEnumerator(name: "osStatusReserved", value: 2147483647)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 164, baseType: !43, size: 32, elements: !44)
!43 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!44 = !{!45, !46}
!45 = !DIEnumerator(name: "osTimerOnce", value: 0)
!46 = !DIEnumerator(name: "osTimerPeriodic", value: 1)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !48, line: 27, baseType: !43, size: 32, elements: !49)
!48 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!49 = !{!50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116}
!50 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!51 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!52 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!53 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!54 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!55 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!56 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!57 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!58 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!59 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!60 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!61 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!62 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!63 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!64 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!65 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!66 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!115 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!116 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!117 = !{!118, !32}
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!119 = !{!25, !120, !124, !127, !142}
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "message_id", scope: !27, file: !122, line: 24, type: !123, isLocal: false, isDefinition: true)
!122 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v2/timer_synchronization/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "osMessageQueueId_t", file: !31, line: 226, baseType: !118)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "data", scope: !27, file: !122, line: 26, type: !126, isLocal: false, isDefinition: true)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !43)
!127 = !DIGlobalVariableExpression(var: !128, expr: !DIExpression())
!128 = distinct !DIGlobalVariable(name: "mem_attrs", scope: !27, file: !122, line: 30, type: !129, isLocal: true, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "osMessageQueueAttr_t", file: !31, line: 299, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 292, size: 192, elements: !132)
!132 = !{!133, !137, !138, !139, !140, !141}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !131, file: !31, line: 293, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !131, file: !31, line: 294, baseType: !126, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !131, file: !31, line: 295, baseType: !118, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !131, file: !31, line: 296, baseType: !126, size: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "mq_mem", scope: !131, file: !31, line: 297, baseType: !118, size: 32, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mq_size", scope: !131, file: !31, line: 298, baseType: !126, size: 32, offset: 160)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "sample_mem", scope: !27, file: !122, line: 28, type: !144, isLocal: true, isDefinition: true, align: 32)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 32, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 4)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "osTimerAttr_t", file: !31, line: 255, baseType: !149)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 250, size: 128, elements: !150)
!150 = !{!151, !152, !153, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !149, file: !31, line: 251, baseType: !134, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !149, file: !31, line: 252, baseType: !126, size: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !149, file: !31, line: 253, baseType: !118, size: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !149, file: !31, line: 254, baseType: !126, size: 32, offset: 96)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "_char_out", scope: !157, file: !161, line: 54, type: !162, isLocal: false, isDefinition: true)
!157 = distinct !DICompileUnit(language: DW_LANG_C99, file: !158, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !117, globals: !160, splitDebugInlining: false, nameTableKind: None)
!158 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/timer_synchronization")
!159 = !{!47}
!160 = !{!155}
!161 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DISubroutineType(types: !164)
!164 = !{!32, !32}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !167, file: !184, line: 56, type: !185, isLocal: true, isDefinition: true, align: 32)
!167 = distinct !DICompileUnit(language: DW_LANG_C99, file: !168, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !169, globals: !183, splitDebugInlining: false, nameTableKind: None)
!168 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/timer_synchronization")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !172, line: 259, baseType: !173)
!172 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f411xe.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 250, size: 224, elements: !174)
!174 = !{!175, !177, !178, !179, !180, !181, !182}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !173, file: !172, line: 252, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !126)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !173, file: !172, line: 253, baseType: !176, size: 32, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !173, file: !172, line: 254, baseType: !176, size: 32, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !173, file: !172, line: 255, baseType: !176, size: 32, offset: 96)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !173, file: !172, line: 256, baseType: !176, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !173, file: !172, line: 257, baseType: !176, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !173, file: !172, line: 258, baseType: !176, size: 32, offset: 192)
!183 = !{!165}
!184 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !188)
!187 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!188 = !{!189, !217}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !186, file: !187, line: 60, baseType: !190, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DISubroutineType(types: !192)
!192 = !{!32, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !197)
!196 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!197 = !{!198, !199, !200, !201, !210, !211}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !195, file: !196, line: 380, baseType: !134, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !195, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !195, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !195, file: !196, line: 386, baseType: !202, size: 32, offset: 96)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !204)
!204 = !{!205, !208}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !203, file: !196, line: 359, baseType: !206, size: 8)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !207)
!207 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !203, file: !196, line: 364, baseType: !209, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!209 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !195, file: !196, line: 388, baseType: !118, size: 32, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !195, file: !196, line: 396, baseType: !212, size: 32, offset: 160)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !196, line: 43, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !216)
!216 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !186, file: !187, line: 65, baseType: !193, size: 32, offset: 32)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !220, file: !223, line: 71, type: !224, isLocal: true, isDefinition: true, align: 32)
!220 = distinct !DICompileUnit(language: DW_LANG_C99, file: !221, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !222, splitDebugInlining: false, nameTableKind: None)
!221 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/timer_synchronization")
!222 = !{!218}
!223 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!224 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !226)
!226 = !{!227, !246}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !225, file: !187, line: 60, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DISubroutineType(types: !230)
!230 = !{!32, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !234)
!234 = !{!235, !236, !237, !238, !244, !245}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !196, line: 380, baseType: !134, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !233, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !233, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !233, file: !196, line: 386, baseType: !239, size: 32, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !240, file: !196, line: 359, baseType: !206, size: 8)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !240, file: !196, line: 364, baseType: !209, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !233, file: !196, line: 388, baseType: !118, size: 32, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !233, file: !196, line: 396, baseType: !212, size: 32, offset: 160)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !225, file: !187, line: 65, baseType: !231, size: 32, offset: 32)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "static_regions", scope: !249, file: !258, line: 62, type: !422, isLocal: true, isDefinition: true)
!249 = distinct !DICompileUnit(language: DW_LANG_C99, file: !250, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !251, globals: !254, splitDebugInlining: false, nameTableKind: None)
!250 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/timer_synchronization")
!251 = !{!252, !32, !126, !118}
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !253, line: 214, baseType: !43)
!253 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!254 = !{!255, !247}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !257, file: !258, line: 198, type: !408, isLocal: true, isDefinition: true)
!257 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !258, file: !258, line: 175, type: !259, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !249, retainedNodes: !403)
!258 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!259 = !DISubroutineType(types: !260)
!260 = !{null, !261}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !263, line: 245, size: 1472, elements: !264)
!263 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!264 = !{!265, !334, !347, !348, !349, !354, !366, !367, !371, !372, !378, !398}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !262, file: !263, line: 247, baseType: !266, size: 384)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !263, line: 57, size: 384, elements: !267)
!267 = !{!268, !296, !304, !305, !306, !319, !320, !321}
!268 = !DIDerivedType(tag: DW_TAG_member, scope: !266, file: !263, line: 60, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !263, line: 60, size: 64, elements: !270)
!270 = !{!271, !287}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !269, file: !263, line: 61, baseType: !272, size: 64)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !273, line: 49, baseType: !274)
!273 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !273, line: 37, size: 64, elements: !275)
!275 = !{!276, !282}
!276 = !DIDerivedType(tag: DW_TAG_member, scope: !274, file: !273, line: 38, baseType: !277, size: 32)
!277 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !274, file: !273, line: 38, size: 32, elements: !278)
!278 = !{!279, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !277, file: !273, line: 39, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !273, line: 40, baseType: !280, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, scope: !274, file: !273, line: 42, baseType: !283, size: 32, offset: 32)
!283 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !274, file: !273, line: 42, size: 32, elements: !284)
!284 = !{!285, !286}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !283, file: !273, line: 43, baseType: !280, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !283, file: !273, line: 44, baseType: !280, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !269, file: !263, line: 62, baseType: !288, size: 64)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !289, line: 49, size: 64, elements: !290)
!289 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !288, file: !289, line: 50, baseType: !292, size: 64)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 64, elements: !294)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!294 = !{!295}
!295 = !DISubrange(count: 2)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !266, file: !263, line: 68, baseType: !297, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !299, line: 233, baseType: !300)
!299 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !299, line: 231, size: 64, elements: !301)
!301 = !{!302}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !300, file: !299, line: 232, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !273, line: 48, baseType: !274)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !266, file: !263, line: 71, baseType: !206, size: 8, offset: 96)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !266, file: !263, line: 74, baseType: !206, size: 8, offset: 104)
!306 = !DIDerivedType(tag: DW_TAG_member, scope: !266, file: !263, line: 90, baseType: !307, size: 16, offset: 112)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !263, line: 90, size: 16, elements: !308)
!308 = !{!309, !316}
!309 = !DIDerivedType(tag: DW_TAG_member, scope: !307, file: !263, line: 91, baseType: !310, size: 16)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !307, file: !263, line: 91, size: 16, elements: !311)
!311 = !{!312, !315}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !310, file: !263, line: 96, baseType: !313, size: 8)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !314)
!314 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !310, file: !263, line: 97, baseType: !206, size: 8, offset: 8)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !307, file: !263, line: 100, baseType: !317, size: 16)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !318)
!318 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !266, file: !263, line: 107, baseType: !126, size: 32, offset: 128)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !266, file: !263, line: 127, baseType: !118, size: 32, offset: 160)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !266, file: !263, line: 131, baseType: !322, size: 192, offset: 192)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !299, line: 244, size: 192, elements: !323)
!323 = !{!324, !325, !331}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !322, file: !299, line: 245, baseType: !272, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !322, file: !299, line: 246, baseType: !326, size: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !299, line: 242, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !330}
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !322, file: !299, line: 249, baseType: !332, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !333)
!333 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !262, file: !263, line: 250, baseType: !335, size: 288, offset: 384)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !336, line: 25, size: 288, elements: !337)
!336 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!337 = !{!338, !339, !340, !341, !342, !343, !344, !345, !346}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !335, file: !336, line: 26, baseType: !126, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !335, file: !336, line: 27, baseType: !126, size: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !335, file: !336, line: 28, baseType: !126, size: 32, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !335, file: !336, line: 29, baseType: !126, size: 32, offset: 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !335, file: !336, line: 30, baseType: !126, size: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !335, file: !336, line: 31, baseType: !126, size: 32, offset: 160)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !335, file: !336, line: 32, baseType: !126, size: 32, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !335, file: !336, line: 33, baseType: !126, size: 32, offset: 224)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !335, file: !336, line: 34, baseType: !126, size: 32, offset: 256)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !262, file: !263, line: 253, baseType: !118, size: 32, offset: 672)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !262, file: !263, line: 256, baseType: !298, size: 64, offset: 704)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !262, file: !263, line: 259, baseType: !350, size: 16, offset: 768)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_poller", file: !263, line: 236, size: 16, elements: !351)
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "is_polling", scope: !350, file: !263, line: 237, baseType: !209, size: 8)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !350, file: !263, line: 238, baseType: !206, size: 8, offset: 8)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !262, file: !263, line: 271, baseType: !355, size: 128, offset: 800)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !263, line: 34, size: 128, elements: !356)
!356 = !{!357, !363, !364, !365}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !355, file: !263, line: 35, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !359, line: 46, baseType: !360)
!359 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !118, !118, !118}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !355, file: !263, line: 36, baseType: !118, size: 32, offset: 32)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !355, file: !263, line: 37, baseType: !118, size: 32, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !355, file: !263, line: 38, baseType: !118, size: 32, offset: 96)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !262, file: !263, line: 274, baseType: !261, size: 32, offset: 928)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !262, file: !263, line: 279, baseType: !368, size: 256, offset: 960)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 256, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !262, file: !263, line: 294, baseType: !32, size: 32, offset: 1216)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !262, file: !263, line: 300, baseType: !373, size: 96, offset: 1248)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !263, line: 149, size: 96, elements: !374)
!374 = !{!375, !376, !377}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !373, file: !263, line: 153, baseType: !22, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !373, file: !263, line: 162, baseType: !252, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !373, file: !263, line: 168, baseType: !252, size: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !262, file: !263, line: 325, baseType: !379, size: 32, offset: 1344)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 32)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !381, line: 5073, size: 192, elements: !382)
!381 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!382 = !{!383, !392, !393}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !380, file: !381, line: 5074, baseType: !384, size: 96)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !385, line: 56, size: 96, elements: !386)
!385 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!386 = !{!387, !390, !391}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !384, file: !385, line: 57, baseType: !388, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !385, line: 57, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !384, file: !385, line: 58, baseType: !118, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !384, file: !385, line: 59, baseType: !252, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !380, file: !381, line: 5075, baseType: !298, size: 64, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !380, file: !381, line: 5076, baseType: !394, size: 32, offset: 160)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !395, line: 43, size: 32, elements: !396)
!395 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!396 = !{!397}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !394, file: !395, line: 52, baseType: !22, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !262, file: !263, line: 343, baseType: !399, size: 64, offset: 1376)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !336, line: 60, size: 64, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !399, file: !336, line: 63, baseType: !126, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !399, file: !336, line: 66, baseType: !126, size: 32, offset: 32)
!403 = !{!404, !405, !406, !407}
!404 = !DILocalVariable(name: "thread", arg: 1, scope: !257, file: !258, line: 175, type: !261)
!405 = !DILocalVariable(name: "region_num", scope: !257, file: !258, line: 200, type: !206)
!406 = !DILocalVariable(name: "guard_start", scope: !257, file: !258, line: 265, type: !22)
!407 = !DILocalVariable(name: "guard_size", scope: !257, file: !258, line: 266, type: !252)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 96, elements: !420)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !410, line: 52, size: 96, elements: !411)
!410 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!411 = !{!412, !413, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !409, file: !410, line: 53, baseType: !22, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !409, file: !410, line: 54, baseType: !252, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !409, file: !410, line: 55, baseType: !415, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !416, line: 151, baseType: !417)
!416 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !416, line: 149, size: 32, elements: !418)
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !417, file: !416, line: 150, baseType: !126, size: 32)
!420 = !{!421}
!421 = !DISubrange(count: 1)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 96, elements: !420)
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !409)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !426, file: !459, line: 39, type: !206, isLocal: true, isDefinition: true)
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !428, globals: !458, splitDebugInlining: false, nameTableKind: None)
!427 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/timer_synchronization")
!428 = !{!429, !118, !32, !446, !206}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !431, line: 1226, baseType: !432)
!431 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !431, line: 1213, size: 352, elements: !433)
!433 = !{!434, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !432, file: !431, line: 1215, baseType: !435, size: 32)
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !432, file: !431, line: 1216, baseType: !176, size: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !432, file: !431, line: 1217, baseType: !176, size: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !432, file: !431, line: 1218, baseType: !176, size: 32, offset: 96)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !432, file: !431, line: 1219, baseType: !176, size: 32, offset: 128)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !432, file: !431, line: 1220, baseType: !176, size: 32, offset: 160)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !432, file: !431, line: 1221, baseType: !176, size: 32, offset: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !432, file: !431, line: 1222, baseType: !176, size: 32, offset: 224)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !432, file: !431, line: 1223, baseType: !176, size: 32, offset: 256)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !432, file: !431, line: 1224, baseType: !176, size: 32, offset: 288)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !432, file: !431, line: 1225, baseType: !176, size: 32, offset: 320)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !449, line: 27, size: 96, elements: !450)
!449 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!450 = !{!451, !452, !453}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !448, file: !449, line: 29, baseType: !126, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !448, file: !449, line: 31, baseType: !134, size: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !448, file: !449, line: 37, baseType: !454, size: 32, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !416, line: 146, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !416, line: 141, size: 32, elements: !456)
!456 = !{!457}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !455, file: !416, line: 143, baseType: !126, size: 32)
!458 = !{!424}
!459 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !462, file: !469, line: 21, type: !162, isLocal: true, isDefinition: true)
!462 = distinct !DICompileUnit(language: DW_LANG_C99, file: !463, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !464, globals: !468, splitDebugInlining: false, nameTableKind: None)
!463 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/timer_synchronization")
!464 = !{!465, !32, !118}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !467, line: 22, baseType: !32)
!467 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!468 = !{!460}
!469 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !472, file: !477, line: 13, type: !494, isLocal: true, isDefinition: true)
!472 = distinct !DICompileUnit(language: DW_LANG_C99, file: !473, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !474, splitDebugInlining: false, nameTableKind: None)
!473 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/timer_synchronization")
!474 = !{!475, !470}
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "mpu_config", scope: !472, file: !477, line: 37, type: !478, isLocal: false, isDefinition: true)
!477 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !449, line: 41, size: 64, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !479, file: !449, line: 43, baseType: !126, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !479, file: !449, line: 45, baseType: !483, size: 32, offset: 32)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !449, line: 27, size: 96, elements: !486)
!486 = !{!487, !488, !489}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !485, file: !449, line: 29, baseType: !126, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !485, file: !449, line: 31, baseType: !134, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !485, file: !449, line: 37, baseType: !490, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !416, line: 146, baseType: !491)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !416, line: 141, size: 32, elements: !492)
!492 = !{!493}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !491, file: !416, line: 143, baseType: !126, size: 32)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !484, size: 192, elements: !294)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "cv2_timer_slab", scope: !497, file: !574, line: 16, type: !588, isLocal: false, isDefinition: true, align: 32)
!497 = distinct !DICompileUnit(language: DW_LANG_C99, file: !498, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !499, retainedTypes: !500, globals: !571, splitDebugInlining: false, nameTableKind: None)
!498 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/portability/cmsis_rtos_v2/timer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/timer_synchronization")
!499 = !{!42, !30, !47}
!500 = !{!118, !501, !502, !504, !505, !32, !126, !568, !570}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !503, line: 46, baseType: !332)
!503 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "osTimerId_t", file: !31, line: 211, baseType: !118)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 32)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv2_timer", file: !507, line: 28, size: 704, elements: !508)
!507 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v2/wrapper.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!508 = !{!509, !556, !558, !559, !563, !567}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "z_timer", scope: !506, file: !507, line: 29, baseType: !510, size: 448)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !381, line: 1318, size: 448, elements: !511)
!511 = !{!512, !537, !543, !548, !549, !554, !555}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !510, file: !381, line: 1324, baseType: !513, size: 192)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !299, line: 244, size: 192, elements: !514)
!514 = !{!515, !530, !536}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !513, file: !299, line: 245, baseType: !516, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !273, line: 49, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !273, line: 37, size: 64, elements: !518)
!518 = !{!519, !525}
!519 = !DIDerivedType(tag: DW_TAG_member, scope: !517, file: !273, line: 38, baseType: !520, size: 32)
!520 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !517, file: !273, line: 38, size: 32, elements: !521)
!521 = !{!522, !524}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !520, file: !273, line: 39, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !520, file: !273, line: 40, baseType: !523, size: 32)
!525 = !DIDerivedType(tag: DW_TAG_member, scope: !517, file: !273, line: 42, baseType: !526, size: 32, offset: 32)
!526 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !517, file: !273, line: 42, size: 32, elements: !527)
!527 = !{!528, !529}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !526, file: !273, line: 43, baseType: !523, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !526, file: !273, line: 44, baseType: !523, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !513, file: !299, line: 246, baseType: !531, size: 32, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !299, line: 242, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !513, file: !299, line: 249, baseType: !332, size: 64, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !510, file: !381, line: 1327, baseType: !538, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !299, line: 233, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !299, line: 231, size: 64, elements: !540)
!540 = !{!541}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !539, file: !299, line: 232, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !273, line: 48, baseType: !517)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !510, file: !381, line: 1330, baseType: !544, size: 32, offset: 256)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 32)
!545 = !DISubroutineType(types: !546)
!546 = !{null, !547}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !510, file: !381, line: 1333, baseType: !544, size: 32, offset: 288)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !510, file: !381, line: 1336, baseType: !550, size: 64, offset: 320)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !503, line: 67, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !503, line: 65, size: 64, elements: !552)
!552 = !{!553}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !551, file: !503, line: 66, baseType: !502, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !510, file: !381, line: 1339, baseType: !126, size: 32, offset: 384)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !510, file: !381, line: 1342, baseType: !118, size: 32, offset: 416)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !506, file: !507, line: 30, baseType: !557, size: 32, offset: 448)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "osTimerType_t", file: !31, line: 167, baseType: !42)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !506, file: !507, line: 31, baseType: !126, size: 32, offset: 480)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !506, file: !507, line: 32, baseType: !560, size: 128, offset: 512)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 128, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 16)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "callback_function", scope: !506, file: !507, line: 33, baseType: !564, size: 32, offset: 640)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!565 = !DISubroutineType(types: !566)
!566 = !{null, !118}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !506, file: !507, line: 34, baseType: !118, size: 32, offset: 672)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !569)
!569 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!571 = !{!495, !572, !578}
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "_k_mem_slab_buf_cv2_timer_slab", scope: !497, file: !574, line: 16, type: !575, isLocal: false, isDefinition: true, align: 32)
!574 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v2/timer.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 3520, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 440)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "init_timer_attrs", scope: !497, file: !574, line: 19, type: !580, isLocal: true, isDefinition: true)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "osTimerAttr_t", file: !31, line: 255, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 250, size: 128, elements: !583)
!583 = !{!584, !585, !586, !587}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !582, file: !31, line: 251, baseType: !134, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !582, file: !31, line: 252, baseType: !126, size: 32, offset: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !582, file: !31, line: 253, baseType: !118, size: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !582, file: !31, line: 254, baseType: !126, size: 32, offset: 96)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_slab", file: !381, line: 4836, size: 256, elements: !589)
!589 = !{!590, !591, !595, !596, !597, !598, !599}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !588, file: !381, line: 4837, baseType: !538, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !588, file: !381, line: 4838, baseType: !592, size: 32, offset: 64)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !395, line: 43, size: 32, elements: !593)
!593 = !{!594}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !592, file: !395, line: 52, baseType: !22, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !588, file: !381, line: 4839, baseType: !126, size: 32, offset: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !588, file: !381, line: 4840, baseType: !252, size: 32, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !588, file: !381, line: 4841, baseType: !570, size: 32, offset: 160)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "free_list", scope: !588, file: !381, line: 4842, baseType: !570, size: 32, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "num_used", scope: !588, file: !381, line: 4843, baseType: !126, size: 32, offset: 224)
!600 = !DIGlobalVariableExpression(var: !601, expr: !DIExpression())
!601 = distinct !DIGlobalVariable(name: "cv2_msgq_slab", scope: !602, file: !650, line: 11, type: !666, isLocal: false, isDefinition: true, align: 32)
!602 = distinct !DICompileUnit(language: DW_LANG_C99, file: !603, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !604, retainedTypes: !605, globals: !647, splitDebugInlining: false, nameTableKind: None)
!603 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/portability/cmsis_rtos_v2/msgq.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/timer_synchronization")
!604 = !{!30, !47}
!605 = !{!118, !501, !502, !123, !606, !32, !126, !568}
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 32)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cv2_msgq", file: !507, line: 55, size: 608, elements: !608)
!608 = !{!609, !644, !645, !646}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "z_msgq", scope: !607, file: !507, line: 56, baseType: !610, size: 416)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !381, line: 4204, size: 416, elements: !611)
!611 = !{!612, !631, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !610, file: !381, line: 4206, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !299, line: 233, baseType: !614)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !299, line: 231, size: 64, elements: !615)
!615 = !{!616}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !614, file: !299, line: 232, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !273, line: 48, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !273, line: 37, size: 64, elements: !619)
!619 = !{!620, !626}
!620 = !DIDerivedType(tag: DW_TAG_member, scope: !618, file: !273, line: 38, baseType: !621, size: 32)
!621 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !618, file: !273, line: 38, size: 32, elements: !622)
!622 = !{!623, !625}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !621, file: !273, line: 39, baseType: !624, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !621, file: !273, line: 40, baseType: !624, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, scope: !618, file: !273, line: 42, baseType: !627, size: 32, offset: 32)
!627 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !618, file: !273, line: 42, size: 32, elements: !628)
!628 = !{!629, !630}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !627, file: !273, line: 43, baseType: !624, size: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !627, file: !273, line: 44, baseType: !624, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !610, file: !381, line: 4208, baseType: !632, size: 32, offset: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !395, line: 43, size: 32, elements: !633)
!633 = !{!634}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !632, file: !395, line: 52, baseType: !22, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !610, file: !381, line: 4210, baseType: !252, size: 32, offset: 96)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !610, file: !381, line: 4212, baseType: !126, size: 32, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !610, file: !381, line: 4214, baseType: !570, size: 32, offset: 160)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !610, file: !381, line: 4216, baseType: !570, size: 32, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !610, file: !381, line: 4218, baseType: !570, size: 32, offset: 224)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !610, file: !381, line: 4220, baseType: !570, size: 32, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !610, file: !381, line: 4222, baseType: !126, size: 32, offset: 288)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !610, file: !381, line: 4224, baseType: !617, size: 64, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !610, file: !381, line: 4227, baseType: !206, size: 8, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "pool", scope: !607, file: !507, line: 57, baseType: !118, size: 32, offset: 416)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "is_dynamic_allocation", scope: !607, file: !507, line: 58, baseType: !136, size: 8, offset: 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !607, file: !507, line: 59, baseType: !560, size: 128, offset: 456)
!647 = !{!600, !648, !654}
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "_k_mem_slab_buf_cv2_msgq_slab", scope: !602, file: !650, line: 11, type: !651, isLocal: false, isDefinition: true, align: 32)
!650 = !DIFile(filename: "zephyr/subsys/portability/cmsis_rtos_v2/msgq.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 3040, elements: !652)
!652 = !{!653}
!653 = !DISubrange(count: 380)
!654 = !DIGlobalVariableExpression(var: !655, expr: !DIExpression())
!655 = distinct !DIGlobalVariable(name: "init_msgq_attrs", scope: !602, file: !650, line: 14, type: !656, isLocal: true, isDefinition: true)
!656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "osMessageQueueAttr_t", file: !31, line: 299, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !31, line: 292, size: 192, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !658, file: !31, line: 293, baseType: !134, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "attr_bits", scope: !658, file: !31, line: 294, baseType: !126, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "cb_mem", scope: !658, file: !31, line: 295, baseType: !118, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "cb_size", scope: !658, file: !31, line: 296, baseType: !126, size: 32, offset: 96)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mq_mem", scope: !658, file: !31, line: 297, baseType: !118, size: 32, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "mq_size", scope: !658, file: !31, line: 298, baseType: !126, size: 32, offset: 160)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mem_slab", file: !381, line: 4836, size: 256, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !673, !674}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !666, file: !381, line: 4837, baseType: !613, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !666, file: !381, line: 4838, baseType: !632, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "num_blocks", scope: !666, file: !381, line: 4839, baseType: !126, size: 32, offset: 96)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !666, file: !381, line: 4840, baseType: !252, size: 32, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !666, file: !381, line: 4841, baseType: !570, size: 32, offset: 160)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "free_list", scope: !666, file: !381, line: 4842, baseType: !570, size: 32, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "num_used", scope: !666, file: !381, line: 4843, baseType: !126, size: 32, offset: 224)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !677, file: !761, line: 72, type: !843, isLocal: true, isDefinition: true)
!677 = distinct !DICompileUnit(language: DW_LANG_C99, file: !678, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !679, retainedTypes: !747, globals: !758, splitDebugInlining: false, nameTableKind: None)
!678 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/timer_synchronization")
!679 = !{!47, !680}
!680 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !172, line: 65, baseType: !32, size: 32, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746}
!682 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!683 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!684 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!685 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!686 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!687 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!688 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!689 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!690 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!691 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!692 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!693 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!694 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!695 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!696 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!697 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!698 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!699 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!700 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!701 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!702 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!703 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!704 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!705 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!706 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!707 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!708 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!709 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!710 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!711 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!712 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!713 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!714 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!715 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!716 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!717 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!718 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!719 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!720 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!721 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!722 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!723 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!724 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!725 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!726 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!727 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!728 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!729 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!730 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!731 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!732 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!733 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!734 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!735 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!736 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!737 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!738 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!739 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!740 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!741 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!742 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!743 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!744 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!745 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!746 = !DIEnumerator(name: "SPI5_IRQn", value: 85)
!747 = !{!252, !32, !118, !748}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !172, line: 244, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 236, size: 192, elements: !751)
!751 = !{!752, !753, !754, !755, !756, !757}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !750, file: !172, line: 238, baseType: !176, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !750, file: !172, line: 239, baseType: !176, size: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !750, file: !172, line: 240, baseType: !176, size: 32, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !750, file: !172, line: 241, baseType: !176, size: 32, offset: 96)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !750, file: !172, line: 242, baseType: !176, size: 32, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !750, file: !172, line: 243, baseType: !176, size: 32, offset: 160)
!758 = !{!759, !763, !779, !790, !807, !675, !809, !823, !825, !827, !829, !831, !833, !835, !837, !839, !841}
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !677, file: !761, line: 424, type: !762, isLocal: false, isDefinition: true, align: 16)
!761 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 64, elements: !145)
!763 = !DIGlobalVariableExpression(var: !764, expr: !DIExpression())
!764 = distinct !DIGlobalVariable(name: "__device_dts_ord_39", scope: !677, file: !761, line: 424, type: !765, isLocal: false, isDefinition: true, align: 32)
!765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !767)
!767 = !{!768, !769, !770, !771, !777, !778}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !766, file: !196, line: 380, baseType: !134, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !766, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !766, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !766, file: !196, line: 386, baseType: !772, size: 32, offset: 96)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !773, file: !196, line: 359, baseType: !206, size: 8)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !773, file: !196, line: 364, baseType: !209, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !766, file: !196, line: 388, baseType: !118, size: 32, offset: 128)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !766, file: !196, line: 396, baseType: !212, size: 32, offset: 160)
!779 = !DIGlobalVariableExpression(var: !780, expr: !DIExpression())
!780 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_39", scope: !677, file: !761, line: 424, type: !781, isLocal: true, isDefinition: true, align: 32)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !783)
!783 = !{!784, !789}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !782, file: !187, line: 60, baseType: !785, size: 32)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 32)
!786 = !DISubroutineType(types: !787)
!787 = !{!32, !788}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !782, file: !187, line: 65, baseType: !788, size: 32, offset: 32)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(name: "exti_data", scope: !677, file: !761, line: 423, type: !792, isLocal: true, isDefinition: true)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !761, line: 107, size: 1472, elements: !793)
!793 = !{!794}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !792, file: !761, line: 109, baseType: !795, size: 1472)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !796, size: 1472, elements: !805)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !761, line: 101, size: 64, elements: !797)
!797 = !{!798, !804}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !796, file: !761, line: 102, baseType: !799, size: 32)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !800, line: 63, baseType: !801)
!800 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DISubroutineType(types: !803)
!803 = !{null, !32, !118}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !796, file: !761, line: 103, baseType: !118, size: 32, offset: 32)
!805 = !{!806}
!806 = !DISubrange(count: 23)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_39", scope: !677, file: !761, line: 424, type: !773, isLocal: true, isDefinition: true, align: 8)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !811, file: !761, line: 493, type: !816, isLocal: true, isDefinition: true, align: 32)
!811 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !761, file: !761, line: 460, type: !812, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !677, retainedNodes: !814)
!812 = !DISubroutineType(types: !813)
!813 = !{null, !788}
!814 = !{!815}
!815 = !DILocalVariable(name: "dev", arg: 1, scope: !811, file: !761, line: 460, type: !788)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !817)
!817 = !{!818, !820, !821, !822}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !816, file: !10, line: 55, baseType: !819, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !816, file: !10, line: 57, baseType: !819, size: 32, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !816, file: !10, line: 59, baseType: !118, size: 32, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !816, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!823 = !DIGlobalVariableExpression(var: !824, expr: !DIExpression())
!824 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !811, file: !761, line: 497, type: !816, isLocal: true, isDefinition: true, align: 32)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !811, file: !761, line: 507, type: !816, isLocal: true, isDefinition: true, align: 32)
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !811, file: !761, line: 512, type: !816, isLocal: true, isDefinition: true, align: 32)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !811, file: !761, line: 516, type: !816, isLocal: true, isDefinition: true, align: 32)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !811, file: !761, line: 523, type: !816, isLocal: true, isDefinition: true, align: 32)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !811, file: !761, line: 527, type: !816, isLocal: true, isDefinition: true, align: 32)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !811, file: !761, line: 581, type: !816, isLocal: true, isDefinition: true, align: 32)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !811, file: !761, line: 586, type: !816, isLocal: true, isDefinition: true, align: 32)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !811, file: !761, line: 591, type: !816, isLocal: true, isDefinition: true, align: 32)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !811, file: !761, line: 595, type: !816, isLocal: true, isDefinition: true, align: 32)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !844, size: 736, elements: !805)
!844 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !172, line: 134, baseType: !680)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_39", scope: !848, file: !853, line: 22, type: !875, isLocal: false, isDefinition: true, align: 16)
!848 = distinct !DICompileUnit(language: DW_LANG_C99, file: !849, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !850, splitDebugInlining: false, nameTableKind: None)
!849 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/timer_synchronization/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/timer_synchronization")
!850 = !{!851, !846, !857, !859, !861, !863, !865, !867, !869, !871, !873}
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !848, file: !853, line: 17, type: !854, isLocal: false, isDefinition: true, align: 16)
!853 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/timer_synchronization")
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 192, elements: !855)
!855 = !{!856}
!856 = !DISubrange(count: 12)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_73", scope: !848, file: !853, line: 29, type: !762, isLocal: false, isDefinition: true, align: 16)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_72", scope: !848, file: !853, line: 36, type: !762, isLocal: false, isDefinition: true, align: 16)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_71", scope: !848, file: !853, line: 43, type: !762, isLocal: false, isDefinition: true, align: 16)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_70", scope: !848, file: !853, line: 50, type: !762, isLocal: false, isDefinition: true, align: 16)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_69", scope: !848, file: !853, line: 57, type: !762, isLocal: false, isDefinition: true, align: 16)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_68", scope: !848, file: !853, line: 64, type: !762, isLocal: false, isDefinition: true, align: 16)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !848, file: !853, line: 71, type: !762, isLocal: false, isDefinition: true, align: 16)
!871 = !DIGlobalVariableExpression(var: !872, expr: !DIExpression())
!872 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_67", scope: !848, file: !853, line: 78, type: !762, isLocal: false, isDefinition: true, align: 16)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_45", scope: !848, file: !853, line: 85, type: !762, isLocal: false, isDefinition: true, align: 16)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 48, elements: !876)
!876 = !{!877}
!877 = !DISubrange(count: 3)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !880, file: !944, line: 398, type: !977, isLocal: true, isDefinition: true)
!880 = distinct !DICompileUnit(language: DW_LANG_C99, file: !881, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !882, retainedTypes: !895, globals: !941, splitDebugInlining: false, nameTableKind: None)
!881 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_neonkey/timer_synchronization")
!882 = !{!883, !47, !888}
!883 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !884, line: 197, baseType: !43, size: 32, elements: !885)
!884 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!885 = !{!886, !887}
!886 = !DIEnumerator(name: "SUCCESS", value: 0)
!887 = !DIEnumerator(name: "ERROR", value: 1)
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !889, line: 44, baseType: !43, size: 32, elements: !890)
!889 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!890 = !{!891, !892, !893, !894}
!891 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!892 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!893 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!894 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!895 = !{!118, !32, !126, !896, !934, !940}
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !172, line: 370, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !172, line: 336, size: 1152, elements: !899)
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !933}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !898, file: !172, line: 338, baseType: !176, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !898, file: !172, line: 339, baseType: !176, size: 32, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !898, file: !172, line: 340, baseType: !176, size: 32, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !898, file: !172, line: 341, baseType: !176, size: 32, offset: 96)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !898, file: !172, line: 342, baseType: !176, size: 32, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !898, file: !172, line: 343, baseType: !176, size: 32, offset: 160)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !898, file: !172, line: 344, baseType: !176, size: 32, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !898, file: !172, line: 345, baseType: !126, size: 32, offset: 224)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !898, file: !172, line: 346, baseType: !176, size: 32, offset: 256)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !898, file: !172, line: 347, baseType: !176, size: 32, offset: 288)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !898, file: !172, line: 348, baseType: !911, size: 64, offset: 320)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 64, elements: !294)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !898, file: !172, line: 349, baseType: !176, size: 32, offset: 384)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !898, file: !172, line: 350, baseType: !176, size: 32, offset: 416)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !898, file: !172, line: 351, baseType: !176, size: 32, offset: 448)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !898, file: !172, line: 352, baseType: !126, size: 32, offset: 480)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !898, file: !172, line: 353, baseType: !176, size: 32, offset: 512)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !898, file: !172, line: 354, baseType: !176, size: 32, offset: 544)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !898, file: !172, line: 355, baseType: !911, size: 64, offset: 576)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !898, file: !172, line: 356, baseType: !176, size: 32, offset: 640)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !898, file: !172, line: 357, baseType: !176, size: 32, offset: 672)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !898, file: !172, line: 358, baseType: !176, size: 32, offset: 704)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !898, file: !172, line: 359, baseType: !126, size: 32, offset: 736)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !898, file: !172, line: 360, baseType: !176, size: 32, offset: 768)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !898, file: !172, line: 361, baseType: !176, size: 32, offset: 800)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !898, file: !172, line: 362, baseType: !911, size: 64, offset: 832)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !898, file: !172, line: 363, baseType: !176, size: 32, offset: 896)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !898, file: !172, line: 364, baseType: !176, size: 32, offset: 928)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !898, file: !172, line: 365, baseType: !911, size: 64, offset: 960)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !898, file: !172, line: 366, baseType: !176, size: 32, offset: 1024)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !898, file: !172, line: 367, baseType: !176, size: 32, offset: 1056)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !898, file: !172, line: 368, baseType: !932, size: 32, offset: 1088)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 32, elements: !420)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !898, file: !172, line: 369, baseType: !176, size: 32, offset: 1120)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !936, line: 343, size: 64, elements: !937)
!936 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !935, file: !936, line: 344, baseType: !126, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !935, file: !936, line: 345, baseType: !126, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!941 = !{!942, !948, !964, !975, !878}
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !880, file: !944, line: 752, type: !945, isLocal: false, isDefinition: true, align: 16)
!944 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !213, size: 704, elements: !946)
!946 = !{!947}
!947 = !DISubrange(count: 44)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(name: "__device_dts_ord_8", scope: !880, file: !944, line: 752, type: !950, isLocal: false, isDefinition: true, align: 32)
!950 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !951)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !196, line: 378, size: 192, elements: !952)
!952 = !{!953, !954, !955, !956, !962, !963}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !951, file: !196, line: 380, baseType: !134, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !951, file: !196, line: 382, baseType: !13, size: 32, offset: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !951, file: !196, line: 384, baseType: !13, size: 32, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !951, file: !196, line: 386, baseType: !957, size: 32, offset: 96)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !196, line: 351, size: 16, elements: !959)
!959 = !{!960, !961}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !958, file: !196, line: 359, baseType: !206, size: 8)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !958, file: !196, line: 364, baseType: !209, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !951, file: !196, line: 388, baseType: !118, size: 32, offset: 128)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !951, file: !196, line: 396, baseType: !212, size: 32, offset: 160)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_8", scope: !880, file: !944, line: 752, type: !966, isLocal: true, isDefinition: true, align: 32)
!966 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !968)
!968 = !{!969, !974}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !967, file: !187, line: 60, baseType: !970, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!971 = !DISubroutineType(types: !972)
!972 = !{!32, !973}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !967, file: !187, line: 65, baseType: !973, size: 32, offset: 32)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_8", scope: !880, file: !944, line: 752, type: !958, isLocal: true, isDefinition: true, align: 8)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !889, line: 100, size: 224, elements: !978)
!978 = !{!979, !985, !986, !995, !1000, !1005, !1011}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !977, file: !889, line: 101, baseType: !980, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !889, line: 76, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 32)
!982 = !DISubroutineType(types: !983)
!983 = !{!32, !973, !984}
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !889, line: 56, baseType: !118)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !977, file: !889, line: 102, baseType: !980, size: 32, offset: 32)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !977, file: !889, line: 103, baseType: !987, size: 32, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !889, line: 83, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 32)
!989 = !DISubroutineType(types: !990)
!990 = !{!32, !973, !984, !991, !118}
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !889, line: 72, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DISubroutineType(types: !994)
!994 = !{null, !973, !984, !118}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !977, file: !889, line: 104, baseType: !996, size: 32, offset: 96)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !889, line: 79, baseType: !997)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 32)
!998 = !DISubroutineType(types: !999)
!999 = !{!32, !973, !984, !940}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !977, file: !889, line: 105, baseType: !1001, size: 32, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !889, line: 88, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 32)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!888, !973, !984}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !977, file: !889, line: 106, baseType: !1006, size: 32, offset: 160)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !889, line: 92, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 32)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!32, !973, !984, !1010}
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !889, line: 64, baseType: !118)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !977, file: !889, line: 107, baseType: !1012, size: 32, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !889, line: 96, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!32, !973, !984, !118}
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !1018, file: !1075, line: 603, type: !1077, isLocal: true, isDefinition: true, align: 32)
!1018 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1019, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !159, retainedTypes: !1020, globals: !1072, splitDebugInlining: false, nameTableKind: None)
