; ModuleID = './build/gdma_transfer_data_interrupt.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.hal_gdma_callback_context = type { void (i32, i8*)*, i8* }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_gdma_callback_context, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.DMA_INPUT = type { i32, i32, i32, i8*, void ()* }
%struct.DMA_FULLSIZE_HWMENU = type { %struct.DMA_TMODE, i32, i32, i32 }
%struct.DMA_TMODE = type { i8, i8 }
%struct.DMA_HWMENU = type { %struct.DMA_TMODE, i32, i32 }
%struct.DMA_SWCOPYMENU = type { i32, i32 }
%struct.DMA_FULLSIZE_HWRINGBUFF_MENU = type { %struct.DMA_TMODE, i32, i32, i32, i8*, i8* }
%struct.DMA_HWRINGBUFF_MENU = type { %struct.DMA_TMODE, i32, i32, i8*, i8* }
%struct.__va_list = type { i8* }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }

!38 = !DIEnumerator(name: "DMA_SWCOPY", value: 2)
!39 = !DIEnumerator(name: "DMA_HWTX_RINGBUFF", value: 3)
!40 = !DIEnumerator(name: "DMA_HWRX_RINGBUFF", value: 4)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 110, baseType: !7, size: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "DMA_BYTE", value: 0)
!44 = !DIEnumerator(name: "DMA_SHORT", value: 1)
!45 = !DIEnumerator(name: "DMA_LONG", value: 2)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 121, baseType: !7, size: 32, elements: !48)
!47 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!50 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !52, line: 47, baseType: !53, size: 32, elements: !54)
!52 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!55 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!56 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!57 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!58 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!59 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!60 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!61 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!62 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!63 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!64 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!65 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!66 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!67 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!68 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!69 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!70 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!71 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!72 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!73 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!74 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!75 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!76 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!77 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!78 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!79 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!80 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!81 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!82 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!83 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!84 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!85 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!86 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!87 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!88 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!89 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!90 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!91 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!92 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!93 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!94 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!95 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!96 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 129, baseType: !7, size: 32, elements: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!99 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!100 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!101 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!102 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!103 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!104 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!105 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!106 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!107 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!108 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!109 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!110 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!111 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!112 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!113 = !{!114, !115, !117, !139, !146, !152, !163, !172, !161, !173, !174}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !47, line: 116, baseType: !7)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !114)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_FULLSIZE_HWMENU", file: !6, line: 174, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 128, elements: !120)
!120 = !{!121, !133, !135, !138}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !119, file: !6, line: 170, baseType: !122, size: 16)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_TMODE", file: !6, line: 127, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 124, size: 16, elements: !124)
!124 = !{!125, !127}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "burst_mode", scope: !123, file: !6, line: 125, baseType: !126, size: 8)
!126 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !123, file: !6, line: 126, baseType: !128, size: 8, offset: 8)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !129, line: 24, baseType: !130)
!129 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !131, line: 43, baseType: !132)
!131 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!132 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !119, file: !6, line: 171, baseType: !134, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_Master", file: !6, line: 108, baseType: !5)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !119, file: !6, line: 172, baseType: !136, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !129, line: 48, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !131, line: 79, baseType: !7)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !119, file: !6, line: 173, baseType: !136, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_HWMENU", file: !6, line: 158, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 154, size: 96, elements: !142)
!142 = !{!143, !144, !145}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !141, file: !6, line: 155, baseType: !122, size: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !141, file: !6, line: 156, baseType: !134, size: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !141, file: !6, line: 157, baseType: !136, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_SWCOPYMENU", file: !6, line: 179, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 176, size: 64, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "srcaddr", scope: !148, file: !6, line: 177, baseType: !136, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "dstaddr", scope: !148, file: !6, line: 178, baseType: !136, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_FULLSIZE_HWRINGBUFF_MENU", file: !6, line: 167, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 160, size: 192, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !162}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !154, file: !6, line: 161, baseType: !122, size: 16)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !154, file: !6, line: 162, baseType: !134, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !154, file: !6, line: 163, baseType: !136, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !154, file: !6, line: 164, baseType: !136, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "WPPT", scope: !154, file: !6, line: 165, baseType: !161, size: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "WPTO", scope: !154, file: !6, line: 166, baseType: !161, size: 32, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_HWRINGBUFF_MENU", file: !6, line: 152, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 146, size: 160, elements: !166)
!166 = !{!167, !168, !169, !170, !171}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !165, file: !6, line: 147, baseType: !122, size: 16)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !165, file: !6, line: 148, baseType: !134, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !165, file: !6, line: 149, baseType: !136, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "WPPT", scope: !165, file: !6, line: 150, baseType: !161, size: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "WPTO", scope: !165, file: !6, line: 151, baseType: !161, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !52, line: 95, baseType: !51)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint8", file: !47, line: 108, baseType: !132)
!175 = !{!0, !176, !185, !187, !192, !194}
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "DMA_VFIFO_LISR_FUNC", scope: !2, file: !3, line: 60, type: !178, isLocal: false, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 448, elements: !183)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !6, line: 197, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DISubroutineType(types: !182)
!182 = !{null}
!183 = !{!184}
!184 = !DISubrange(count: 14)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "DMA_VFIFO_TO_LISR_FUNC", scope: !2, file: !3, line: 64, type: !178, isLocal: false, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "DMA_Owner", scope: !2, file: !3, line: 71, type: !189, isLocal: false, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 352, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 11)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "DMA_Channel_Status", scope: !2, file: !3, line: 68, type: !114, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "DMA_used_channel", scope: !2, file: !3, line: 69, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 88, elements: !190)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 352, elements: !190)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !200, file: !201, line: 43, type: !136, isLocal: true, isDefinition: true)
!200 = distinct !DICompileUnit(language: DW_LANG_C99, file: !201, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !202, globals: !210, splitDebugInlining: false, nameTableKind: None)
!201 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!202 = !{!203, !205, !206, !208}
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !47, line: 62, baseType: !7)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !136)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !205)
!210 = !{!198, !211}
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !200, file: !201, line: 44, type: !136, isLocal: true, isDefinition: true)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !215, file: !216, line: 54, type: !136, isLocal: false, isDefinition: true)
!215 = distinct !DICompileUnit(language: DW_LANG_C99, file: !216, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !217, retainedTypes: !224, globals: !232, splitDebugInlining: false, nameTableKind: None)
!216 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!217 = !{!218, !97}
!218 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !219, line: 71, baseType: !7, size: 32, elements: !220)
!219 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!220 = !{!221, !222, !223}
!221 = !DIEnumerator(name: "UART_PORT0", value: 0)
!222 = !DIEnumerator(name: "UART_PORT1", value: 1)
!223 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!224 = !{!203, !136, !225, !227, !229, !230, !205}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !47, line: 113, baseType: !228)
!228 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !47, line: 59, baseType: !132)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !229)
!232 = !{!213}
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !235, file: !236, line: 51, type: !315, isLocal: false, isDefinition: true)
!235 = distinct !DICompileUnit(language: DW_LANG_C99, file: !236, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !237, retainedTypes: !284, globals: !314, splitDebugInlining: false, nameTableKind: None)
!236 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!237 = !{!238, !249, !268, !275}
!238 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !239, line: 163, baseType: !53, size: 32, elements: !240)
!239 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!240 = !{!241, !242, !243, !244, !245, !246, !247, !248}
!241 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!242 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!243 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!244 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!245 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!246 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!247 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!248 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!249 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !239, line: 186, baseType: !7, size: 32, elements: !250)
!250 = !{!251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267}
!251 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!252 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!253 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!254 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!255 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!256 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!257 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!258 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!259 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!260 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!261 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!262 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!263 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!264 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!265 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!266 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!267 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!268 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !239, line: 176, baseType: !7, size: 32, elements: !269)
!269 = !{!270, !271, !272, !273, !274}
!270 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!271 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!272 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!273 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!274 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !276, line: 99, baseType: !7, size: 32, elements: !277)
!276 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!277 = !{!278, !279, !280, !281, !282, !283}
!278 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!279 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!280 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!281 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!282 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!283 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!284 = !{!285, !161}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !287, line: 72, baseType: !288)
!287 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !287, line: 56, size: 525312, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !304, !305, !309, !313}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !288, file: !287, line: 57, baseType: !207, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !288, file: !287, line: 58, baseType: !207, size: 32, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !288, file: !287, line: 59, baseType: !207, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !288, file: !287, line: 60, baseType: !207, size: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !288, file: !287, line: 61, baseType: !207, size: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !288, file: !287, line: 62, baseType: !207, size: 32, offset: 160)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !288, file: !287, line: 63, baseType: !207, size: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !288, file: !287, line: 64, baseType: !207, size: 32, offset: 224)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !288, file: !287, line: 65, baseType: !207, size: 32, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !288, file: !287, line: 66, baseType: !207, size: 32, offset: 288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !288, file: !287, line: 67, baseType: !301, size: 32, offset: 320)
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 32, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 1)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !288, file: !287, line: 68, baseType: !207, size: 32, offset: 352)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !288, file: !287, line: 69, baseType: !306, size: 523904, offset: 384)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 523904, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 16372)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !288, file: !287, line: 70, baseType: !310, size: 512, offset: 524288)
!310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 512, elements: !311)
!311 = !{!312}
!312 = !DISubrange(count: 16)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !288, file: !287, line: 71, baseType: !310, size: 512, offset: 524800)
!314 = !{!233}
!315 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !126)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !318, file: !319, line: 53, type: !407, isLocal: false, isDefinition: true)
!318 = distinct !DICompileUnit(language: DW_LANG_C99, file: !319, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !320, retainedTypes: !329, globals: !406, splitDebugInlining: false, nameTableKind: None)
!319 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!320 = !{!321, !51}
!321 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !322, line: 152, baseType: !53, size: 32, elements: !323)
!322 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!323 = !{!324, !325, !326, !327, !328}
!324 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!325 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!326 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!327 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!328 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!329 = !{!330, !161, !136, !331, !333, !367}
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !52, line: 97, baseType: !173)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !129, line: 44, baseType: !332)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !131, line: 77, baseType: !53)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !335, line: 378, baseType: !336)
!335 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 363, size: 28704, elements: !337)
!337 = !{!338, !342, !346, !347, !348, !349, !350, !351, !352, !353, !357, !362, !366}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !336, file: !335, line: 365, baseType: !339, size: 256)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 256, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 8)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !336, file: !335, line: 366, baseType: !343, size: 768, offset: 256)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 768, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 24)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !336, file: !335, line: 367, baseType: !339, size: 256, offset: 1024)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !336, file: !335, line: 368, baseType: !343, size: 768, offset: 1280)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !336, file: !335, line: 369, baseType: !339, size: 256, offset: 2048)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !336, file: !335, line: 370, baseType: !343, size: 768, offset: 2304)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !336, file: !335, line: 371, baseType: !339, size: 256, offset: 3072)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !336, file: !335, line: 372, baseType: !343, size: 768, offset: 3328)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !336, file: !335, line: 373, baseType: !339, size: 256, offset: 4096)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !336, file: !335, line: 374, baseType: !354, size: 1792, offset: 4352)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1792, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 56)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !336, file: !335, line: 375, baseType: !358, size: 1920, offset: 6144)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 1920, elements: !360)
!359 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !128)
!360 = !{!361}
!361 = !DISubrange(count: 240)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !336, file: !335, line: 376, baseType: !363, size: 20608, offset: 8064)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 20608, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 644)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !336, file: !335, line: 377, baseType: !207, size: 32, offset: 28672)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !335, line: 418, baseType: !369)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 395, size: 1120, elements: !370)
!370 = !{!371, !373, !374, !375, !376, !377, !378, !382, !383, !384, !385, !386, !387, !388, !389, !393, !394, !395, !399, !403, !405}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !369, file: !335, line: 397, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !369, file: !335, line: 398, baseType: !207, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !369, file: !335, line: 399, baseType: !207, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !369, file: !335, line: 400, baseType: !207, size: 32, offset: 96)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !369, file: !335, line: 401, baseType: !207, size: 32, offset: 128)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !369, file: !335, line: 402, baseType: !207, size: 32, offset: 160)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !369, file: !335, line: 403, baseType: !379, size: 96, offset: 192)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !359, size: 96, elements: !380)
!380 = !{!381}
!381 = !DISubrange(count: 12)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !369, file: !335, line: 404, baseType: !207, size: 32, offset: 288)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !369, file: !335, line: 405, baseType: !207, size: 32, offset: 320)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !369, file: !335, line: 406, baseType: !207, size: 32, offset: 352)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !369, file: !335, line: 407, baseType: !207, size: 32, offset: 384)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !369, file: !335, line: 408, baseType: !207, size: 32, offset: 416)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !369, file: !335, line: 409, baseType: !207, size: 32, offset: 448)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !369, file: !335, line: 410, baseType: !207, size: 32, offset: 480)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !369, file: !335, line: 411, baseType: !390, size: 64, offset: 512)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 64, elements: !391)
!391 = !{!392}
!392 = !DISubrange(count: 2)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !369, file: !335, line: 412, baseType: !372, size: 32, offset: 576)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !369, file: !335, line: 413, baseType: !372, size: 32, offset: 608)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !369, file: !335, line: 414, baseType: !396, size: 128, offset: 640)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 128, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 4)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !369, file: !335, line: 415, baseType: !400, size: 160, offset: 768)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !372, size: 160, elements: !401)
!401 = !{!402}
!402 = !DISubrange(count: 5)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !369, file: !335, line: 416, baseType: !404, size: 160, offset: 928)
!404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 160, elements: !401)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !369, file: !335, line: 417, baseType: !207, size: 32, offset: 1088)
!406 = !{!316}
!407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !408, size: 6144, elements: !416)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !319, line: 50, baseType: !409)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !319, line: 47, size: 64, elements: !410)
!410 = !{!411, !415}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !409, file: !319, line: 48, baseType: !412, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 32)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !330}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !409, file: !319, line: 49, baseType: !136, size: 32, offset: 32)
!416 = !{!417}
!417 = !DISubrange(count: 96)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "g_gdma_callback_context", scope: !420, file: !421, line: 51, type: !492, isLocal: true, isDefinition: true)
!420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !421, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !422, retainedTypes: !444, globals: !446, splitDebugInlining: false, nameTableKind: None)
!421 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gdma.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!422 = !{!423, !430, !34, !41, !5, !436, !440}
!423 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 192, baseType: !53, size: 32, elements: !425)
!424 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gdma.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!425 = !{!426, !427, !428, !429}
!426 = !DIEnumerator(name: "HAL_GDMA_STATUS_ERROR", value: -3)
!427 = !DIEnumerator(name: "HAL_GDMA_STATUS_ERROR_CHANNEL", value: -2)
!428 = !DIEnumerator(name: "HAL_GDMA_STATUS_INVALID_PARAMETER", value: -1)
!429 = !DIEnumerator(name: "HAL_GDMA_STATUS_OK", value: 0)
!430 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !431, line: 731, baseType: !7, size: 32, elements: !432)
!431 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!432 = !{!433, !434, !435}
!433 = !DIEnumerator(name: "HAL_GDMA_CHANNEL_0", value: 0)
!434 = !DIEnumerator(name: "HAL_GDMA_CHANNEL_1", value: 1)
!435 = !DIEnumerator(name: "HAL_GDMA_CHANNEL_MAX", value: 2)
!436 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 201, baseType: !53, size: 32, elements: !437)
!437 = !{!438, !439}
!438 = !DIEnumerator(name: "HAL_GDMA_EVENT_TRANSACTION_ERROR", value: -1)
!439 = !DIEnumerator(name: "HAL_GDMA_EVENT_TRANSACTION_SUCCESS", value: 0)
!440 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !424, line: 208, baseType: !7, size: 32, elements: !441)
!441 = !{!442, !443}
!442 = !DIEnumerator(name: "HAL_GDMA_IDLE", value: 0)
!443 = !DIEnumerator(name: "HAL_GDMA_BUSY", value: 1)
!444 = !{!445, !115, !128, !161}
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_TranSize", file: !6, line: 114, baseType: !41)
!446 = !{!447, !479, !418}
!447 = !DIGlobalVariableExpression(var: !448, expr: !DIExpression())
!448 = distinct !DIGlobalVariable(name: "invalid_handle", scope: !449, file: !421, line: 151, type: !478, isLocal: true, isDefinition: true)
!449 = distinct !DISubprogram(name: "hal_gdma_start_interrupt", scope: !421, file: !421, line: 142, type: !450, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !420, retainedNodes: !454)
!450 = !DISubroutineType(types: !451)
!451 = !{!452, !453, !136, !136, !136}
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gdma_status_t", file: !424, line: 197, baseType: !423)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gdma_channel_t", file: !431, line: 735, baseType: !430)
!454 = !{!455, !456, !457, !458, !459, !469, !470, !471, !477}
!455 = !DILocalVariable(name: "channel", arg: 1, scope: !449, file: !421, line: 142, type: !453)
!456 = !DILocalVariable(name: "destination_address", arg: 2, scope: !449, file: !421, line: 143, type: !136)
!457 = !DILocalVariable(name: "source_address", arg: 3, scope: !449, file: !421, line: 144, type: !136)
!458 = !DILocalVariable(name: "data_length", arg: 4, scope: !449, file: !421, line: 145, type: !136)
!459 = !DILocalVariable(name: "input", scope: !449, file: !421, line: 147, type: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_INPUT", file: !6, line: 195, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 189, size: 160, elements: !462)
!462 = !{!463, !465, !466, !467, !468}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !461, file: !6, line: 190, baseType: !464, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_Type", file: !6, line: 122, baseType: !34)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !461, file: !6, line: 191, baseType: !445, size: 32, offset: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !461, file: !6, line: 192, baseType: !136, size: 32, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "menu", scope: !461, file: !6, line: 193, baseType: !161, size: 32, offset: 96)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !461, file: !6, line: 194, baseType: !180, size: 32, offset: 128)
!469 = !DILocalVariable(name: "count", scope: !449, file: !421, line: 148, type: !136)
!470 = !DILocalVariable(name: "size", scope: !449, file: !421, line: 149, type: !136)
!471 = !DILocalVariable(name: "menu", scope: !449, file: !421, line: 150, type: !472)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_SWCOPYMENU", file: !6, line: 179, baseType: !473)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 176, size: 64, elements: !474)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "srcaddr", scope: !473, file: !6, line: 177, baseType: !136, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "dstaddr", scope: !473, file: !6, line: 178, baseType: !136, size: 32, offset: 32)
!477 = !DILocalVariable(name: "handle", scope: !449, file: !421, line: 152, type: !128)
!478 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "invalid_handle", scope: !481, file: !421, line: 217, type: !478, isLocal: true, isDefinition: true)
!481 = distinct !DISubprogram(name: "hal_gdma_start_polling", scope: !421, file: !421, line: 208, type: !450, scopeLine: 212, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !420, retainedNodes: !482)
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491}
!483 = !DILocalVariable(name: "channel", arg: 1, scope: !481, file: !421, line: 208, type: !453)
!484 = !DILocalVariable(name: "destination_address", arg: 2, scope: !481, file: !421, line: 209, type: !136)
!485 = !DILocalVariable(name: "source_address", arg: 3, scope: !481, file: !421, line: 210, type: !136)
!486 = !DILocalVariable(name: "data_length", arg: 4, scope: !481, file: !421, line: 211, type: !136)
!487 = !DILocalVariable(name: "input", scope: !481, file: !421, line: 213, type: !460)
!488 = !DILocalVariable(name: "count", scope: !481, file: !421, line: 214, type: !136)
!489 = !DILocalVariable(name: "size", scope: !481, file: !421, line: 215, type: !136)
!490 = !DILocalVariable(name: "menu", scope: !481, file: !421, line: 216, type: !472)
!491 = !DILocalVariable(name: "handle", scope: !481, file: !421, line: 218, type: !128)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 128, elements: !391)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gdma_callback_context", file: !421, line: 49, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 46, size: 64, elements: !495)
!495 = !{!496, !502}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !494, file: !421, line: 47, baseType: !497, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gdma_callback_t", file: !424, line: 230, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 32)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !501, !161}
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gdma_event_t", file: !424, line: 204, baseType: !436)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !494, file: !421, line: 48, baseType: !161, size: 32, offset: 32)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !505, file: !506, line: 77, type: !570, isLocal: true, isDefinition: true)
!505 = distinct !DICompileUnit(language: DW_LANG_C99, file: !506, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !507, retainedTypes: !557, globals: !559, splitDebugInlining: false, nameTableKind: None)
!506 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!507 = !{!508, !516, !521, !537, !543, !547, !218, !97, !552}
!508 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !509, line: 345, baseType: !53, size: 32, elements: !510)
!509 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!510 = !{!511, !512, !513, !514, !515}
!511 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!512 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!513 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!514 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!515 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!516 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !431, line: 109, baseType: !7, size: 32, elements: !517)
!517 = !{!518, !519, !520}
!518 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!519 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!520 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!521 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !509, line: 302, baseType: !7, size: 32, elements: !522)
!522 = !{!523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536}
!523 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!524 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!525 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!526 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!527 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!528 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!529 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!530 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!531 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!532 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!533 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!534 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!535 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!536 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!537 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !509, line: 321, baseType: !7, size: 32, elements: !538)
!538 = !{!539, !540, !541, !542}
!539 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!540 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!541 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!542 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!543 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !509, line: 330, baseType: !7, size: 32, elements: !544)
!544 = !{!545, !546}
!545 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!546 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!547 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !509, line: 337, baseType: !7, size: 32, elements: !548)
!548 = !{!549, !550, !551}
!549 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!550 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!551 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!552 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !509, line: 355, baseType: !53, size: 32, elements: !553)
!553 = !{!554, !555, !556}
!554 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!555 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!556 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!557 = !{!7, !161, !132, !558, !128}
!558 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!559 = !{!503, !560}
!560 = !DIGlobalVariableExpression(var: !561, expr: !DIExpression())
!561 = distinct !DIGlobalVariable(name: "func_tbl", scope: !562, file: !506, line: 536, type: !568, isLocal: true, isDefinition: true)
!562 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !506, file: !506, line: 534, type: !563, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !505, retainedNodes: !566)
!563 = !DISubroutineType(types: !564)
!564 = !{!179, !565}
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !431, line: 113, baseType: !516)
!566 = !{!567}
!567 = !DILocalVariable(name: "uart_port", arg: 1, scope: !562, file: !506, line: 534, type: !565)
!568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !569, size: 64, elements: !391)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 1024, elements: !391)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !506, line: 75, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !506, line: 68, size: 512, elements: !573)
!573 = !{!574, !575, !587, !588, !599, !600}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !572, file: !506, line: 69, baseType: !126, size: 8)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !572, file: !506, line: 70, baseType: !576, size: 128, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !509, line: 378, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 373, size: 128, elements: !578)
!578 = !{!579, !581, !583, !585}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !577, file: !509, line: 374, baseType: !580, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !509, line: 317, baseType: !521)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !577, file: !509, line: 375, baseType: !582, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !509, line: 326, baseType: !537)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !577, file: !509, line: 376, baseType: !584, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !509, line: 333, baseType: !543)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !577, file: !509, line: 377, baseType: !586, size: 32, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !509, line: 341, baseType: !547)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !572, file: !506, line: 71, baseType: !126, size: 8, offset: 160)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !572, file: !506, line: 72, baseType: !589, size: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !506, line: 66, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !506, line: 63, size: 64, elements: !591)
!591 = !{!592, !598}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !590, file: !506, line: 64, baseType: !593, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !509, line: 410, baseType: !594)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 32)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !597, !161}
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !509, line: 359, baseType: !552)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !590, file: !506, line: 65, baseType: !161, size: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !572, file: !506, line: 73, baseType: !126, size: 8, offset: 256)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !572, file: !506, line: 74, baseType: !601, size: 224, offset: 288)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !509, line: 390, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !509, line: 382, size: 224, elements: !603)
!603 = !{!604, !606, !607, !608, !609, !610, !611}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !602, file: !509, line: 383, baseType: !605, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !602, file: !509, line: 384, baseType: !136, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !602, file: !509, line: 385, baseType: !136, size: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !602, file: !509, line: 386, baseType: !605, size: 32, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !602, file: !509, line: 387, baseType: !136, size: 32, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !602, file: !509, line: 388, baseType: !136, size: 32, offset: 160)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !602, file: !509, line: 389, baseType: !136, size: 32, offset: 192)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "source_data", scope: !614, file: !615, line: 54, type: !655, isLocal: true, isDefinition: true, align: 32)
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !615, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !616, retainedTypes: !648, globals: !649, splitDebugInlining: false, nameTableKind: None)
!615 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!616 = !{!516, !521, !537, !543, !547, !617, !430, !436}
!617 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !431, line: 249, baseType: !7, size: 32, elements: !618)
!618 = !{!619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647}
!619 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!620 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!621 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!622 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!623 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!624 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!625 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!626 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!627 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!628 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!629 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!630 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!631 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!632 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!633 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!634 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!635 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!636 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!637 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!638 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!639 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!640 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!641 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!642 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!643 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!644 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!645 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!646 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!647 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!648 = !{!161, !136}
!649 = !{!650, !612, !653}
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression(DW_OP_constu, 64, DW_OP_stack_value))
!651 = distinct !DIGlobalVariable(name: "dma_length", scope: !614, file: !615, line: 53, type: !652, isLocal: true, isDefinition: true)
!652 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "destination_data", scope: !614, file: !615, line: 55, type: !655, isLocal: true, isDefinition: true, align: 32)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 512, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 64)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !660, file: !661, line: 59, type: !136, isLocal: false, isDefinition: true)
!660 = distinct !DICompileUnit(language: DW_LANG_C99, file: !661, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !662, globals: !715, splitDebugInlining: false, nameTableKind: None)
!661 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!662 = !{!663, !671, !696}
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !335, line: 656, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 650, size: 128, elements: !666)
!666 = !{!667, !668, !669, !670}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !665, file: !335, line: 652, baseType: !207, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !665, file: !335, line: 653, baseType: !207, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !665, file: !335, line: 654, baseType: !207, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !665, file: !335, line: 655, baseType: !372, size: 32, offset: 96)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !335, line: 418, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 395, size: 1120, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !673, file: !335, line: 397, baseType: !372, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !673, file: !335, line: 398, baseType: !207, size: 32, offset: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !673, file: !335, line: 399, baseType: !207, size: 32, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !673, file: !335, line: 400, baseType: !207, size: 32, offset: 96)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !673, file: !335, line: 401, baseType: !207, size: 32, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !673, file: !335, line: 402, baseType: !207, size: 32, offset: 160)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !673, file: !335, line: 403, baseType: !379, size: 96, offset: 192)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !673, file: !335, line: 404, baseType: !207, size: 32, offset: 288)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !673, file: !335, line: 405, baseType: !207, size: 32, offset: 320)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !673, file: !335, line: 406, baseType: !207, size: 32, offset: 352)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !673, file: !335, line: 407, baseType: !207, size: 32, offset: 384)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !673, file: !335, line: 408, baseType: !207, size: 32, offset: 416)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !673, file: !335, line: 409, baseType: !207, size: 32, offset: 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !673, file: !335, line: 410, baseType: !207, size: 32, offset: 480)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !673, file: !335, line: 411, baseType: !390, size: 64, offset: 512)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !673, file: !335, line: 412, baseType: !372, size: 32, offset: 576)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !673, file: !335, line: 413, baseType: !372, size: 32, offset: 608)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !673, file: !335, line: 414, baseType: !396, size: 128, offset: 640)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !673, file: !335, line: 415, baseType: !400, size: 160, offset: 768)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !673, file: !335, line: 416, baseType: !404, size: 160, offset: 928)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !673, file: !335, line: 417, baseType: !207, size: 32, offset: 1088)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !287, line: 72, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !287, line: 56, size: 525312, elements: !699)
!699 = !{!700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !698, file: !287, line: 57, baseType: !207, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !698, file: !287, line: 58, baseType: !207, size: 32, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !698, file: !287, line: 59, baseType: !207, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !698, file: !287, line: 60, baseType: !207, size: 32, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !698, file: !287, line: 61, baseType: !207, size: 32, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !698, file: !287, line: 62, baseType: !207, size: 32, offset: 160)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !698, file: !287, line: 63, baseType: !207, size: 32, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !698, file: !287, line: 64, baseType: !207, size: 32, offset: 224)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !698, file: !287, line: 65, baseType: !207, size: 32, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !698, file: !287, line: 66, baseType: !207, size: 32, offset: 288)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !698, file: !287, line: 67, baseType: !301, size: 32, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !698, file: !287, line: 68, baseType: !207, size: 32, offset: 352)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !698, file: !287, line: 69, baseType: !306, size: 523904, offset: 384)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !698, file: !287, line: 70, baseType: !310, size: 512, offset: 524288)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !698, file: !287, line: 71, baseType: !310, size: 512, offset: 524800)
!715 = !{!658, !716}
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !660, file: !661, line: 61, type: !207, isLocal: true, isDefinition: true)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "heap_end", scope: !720, file: !721, line: 66, type: !726, isLocal: true, isDefinition: true)
!720 = distinct !DISubprogram(name: "_sbrk_r", scope: !721, file: !721, line: 63, type: !722, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !918, retainedNodes: !922)
!721 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!722 = !DISubroutineType(types: !723)
!723 = !{!724, !727, !917}
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !725, line: 123, baseType: !726)
!725 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !729, line: 377, size: 1920, elements: !730)
!729 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!730 = !{!731, !732, !806, !807, !808, !809, !810, !811, !812, !815, !836, !840, !841, !842, !843, !853, !866, !867, !872, !891, !892, !899, !900, !916}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !728, file: !729, line: 381, baseType: !53, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !728, file: !729, line: 386, baseType: !733, size: 32, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !729, line: 292, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !729, line: 186, size: 832, elements: !736)
!736 = !{!737, !739, !740, !741, !743, !744, !749, !750, !751, !752, !756, !762, !769, !773, !774, !775, !776, !780, !782, !783, !784, !786, !792, !805}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !735, file: !729, line: 187, baseType: !738, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !735, file: !729, line: 188, baseType: !53, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !735, file: !729, line: 189, baseType: !53, size: 32, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !735, file: !729, line: 190, baseType: !742, size: 16, offset: 96)
!742 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !735, file: !729, line: 191, baseType: !742, size: 16, offset: 112)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !735, file: !729, line: 192, baseType: !745, size: 64, offset: 128)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !729, line: 122, size: 64, elements: !746)
!746 = !{!747, !748}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !745, file: !729, line: 123, baseType: !738, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !745, file: !729, line: 124, baseType: !53, size: 32, offset: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !735, file: !729, line: 193, baseType: !53, size: 32, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !735, file: !729, line: 196, baseType: !727, size: 32, offset: 224)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !735, file: !729, line: 200, baseType: !161, size: 32, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !735, file: !729, line: 202, baseType: !753, size: 32, offset: 288)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!754 = !DISubroutineType(types: !755)
!755 = !{!53, !727, !161, !726, !53}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !735, file: !729, line: 204, baseType: !757, size: 32, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = !DISubroutineType(types: !759)
!759 = !{!53, !727, !161, !760, !53}
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !558)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !735, file: !729, line: 207, baseType: !763, size: 32, offset: 352)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!764 = !DISubroutineType(types: !765)
!765 = !{!766, !727, !161, !766, !53}
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !767, line: 116, baseType: !768)
!767 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!768 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !735, file: !729, line: 208, baseType: !770, size: 32, offset: 384)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 32)
!771 = !DISubroutineType(types: !772)
!772 = !{!53, !727, !161}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !735, file: !729, line: 211, baseType: !745, size: 64, offset: 416)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !735, file: !729, line: 212, baseType: !738, size: 32, offset: 480)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !735, file: !729, line: 213, baseType: !53, size: 32, offset: 512)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !735, file: !729, line: 216, baseType: !777, size: 24, offset: 544)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 24, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 3)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !735, file: !729, line: 217, baseType: !781, size: 8, offset: 568)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 8, elements: !302)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !735, file: !729, line: 220, baseType: !745, size: 64, offset: 576)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !735, file: !729, line: 223, baseType: !53, size: 32, offset: 640)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !735, file: !729, line: 224, baseType: !785, size: 32, offset: 672)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !767, line: 46, baseType: !768)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !735, file: !729, line: 231, baseType: !787, size: 32, offset: 704)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !729, line: 35, baseType: !788)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !789, line: 34, baseType: !790)
!789 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!791 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !789, line: 33, flags: DIFlagFwdDecl)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !735, file: !729, line: 233, baseType: !793, size: 64, offset: 736)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !767, line: 170, baseType: !794)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !767, line: 162, size: 64, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !794, file: !767, line: 164, baseType: !53, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !794, file: !767, line: 169, baseType: !798, size: 32, offset: 32)
!798 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !794, file: !767, line: 165, size: 32, elements: !799)
!799 = !{!800, !803}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !798, file: !767, line: 167, baseType: !801, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !802, line: 116, baseType: !53)
!802 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !798, file: !767, line: 168, baseType: !804, size: 32)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 32, elements: !397)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !735, file: !729, line: 234, baseType: !53, size: 32, offset: 800)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !728, file: !729, line: 386, baseType: !733, size: 32, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !728, file: !729, line: 386, baseType: !733, size: 32, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !728, file: !729, line: 388, baseType: !53, size: 32, offset: 128)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !728, file: !729, line: 390, baseType: !726, size: 32, offset: 160)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !728, file: !729, line: 392, baseType: !53, size: 32, offset: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !728, file: !729, line: 394, baseType: !53, size: 32, offset: 224)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !728, file: !729, line: 395, baseType: !813, size: 32, offset: 256)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !729, line: 45, flags: DIFlagFwdDecl)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !728, file: !729, line: 397, baseType: !816, size: 32, offset: 288)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !729, line: 349, size: 128, elements: !818)
!818 = !{!819, !832, !833, !834}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !817, file: !729, line: 352, baseType: !820, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !729, line: 52, size: 192, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !821, file: !729, line: 54, baseType: !820, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !821, file: !729, line: 55, baseType: !53, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !821, file: !729, line: 55, baseType: !53, size: 32, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !821, file: !729, line: 55, baseType: !53, size: 32, offset: 96)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !821, file: !729, line: 55, baseType: !53, size: 32, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !821, file: !729, line: 56, baseType: !829, size: 32, offset: 160)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 32, elements: !302)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !729, line: 22, baseType: !831)
!831 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !817, file: !729, line: 353, baseType: !53, size: 32, offset: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !817, file: !729, line: 354, baseType: !820, size: 32, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !817, file: !729, line: 355, baseType: !835, size: 32, offset: 96)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !728, file: !729, line: 399, baseType: !837, size: 32, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!838 = !DISubroutineType(types: !839)
!839 = !{null, !727}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !728, file: !729, line: 401, baseType: !53, size: 32, offset: 352)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !728, file: !729, line: 404, baseType: !53, size: 32, offset: 384)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !728, file: !729, line: 405, baseType: !726, size: 32, offset: 416)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !728, file: !729, line: 407, baseType: !844, size: 32, offset: 448)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 32)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !729, line: 324, size: 192, elements: !846)
!846 = !{!847, !849, !850, !851}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !845, file: !729, line: 325, baseType: !848, size: 48)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 48, elements: !778)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !845, file: !729, line: 326, baseType: !848, size: 48, offset: 48)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !845, file: !729, line: 327, baseType: !228, size: 16, offset: 96)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !845, file: !729, line: 330, baseType: !852, size: 64, offset: 128)
!852 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !728, file: !729, line: 408, baseType: !854, size: 32, offset: 480)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !729, line: 60, size: 288, elements: !856)
!856 = !{!857, !858, !859, !860, !861, !862, !863, !864, !865}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !855, file: !729, line: 62, baseType: !53, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !855, file: !729, line: 63, baseType: !53, size: 32, offset: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !855, file: !729, line: 64, baseType: !53, size: 32, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !855, file: !729, line: 65, baseType: !53, size: 32, offset: 96)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !855, file: !729, line: 66, baseType: !53, size: 32, offset: 128)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !855, file: !729, line: 67, baseType: !53, size: 32, offset: 160)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !855, file: !729, line: 68, baseType: !53, size: 32, offset: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !855, file: !729, line: 69, baseType: !53, size: 32, offset: 224)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !855, file: !729, line: 70, baseType: !53, size: 32, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !728, file: !729, line: 409, baseType: !726, size: 32, offset: 512)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !728, file: !729, line: 412, baseType: !868, size: 32, offset: 544)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 32)
!870 = !DISubroutineType(types: !871)
!871 = !{null, !53}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !728, file: !729, line: 416, baseType: !873, size: 32, offset: 576)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 32)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !729, line: 90, size: 1120, elements: !875)
!875 = !{!876, !877, !878, !882}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !874, file: !729, line: 91, baseType: !873, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !874, file: !729, line: 92, baseType: !53, size: 32, offset: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !874, file: !729, line: 93, baseType: !879, size: 1024, offset: 64)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 1024, elements: !880)
!880 = !{!881}
!881 = !DISubrange(count: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !874, file: !729, line: 94, baseType: !883, size: 32, offset: 1088)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 32)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !729, line: 79, size: 2112, elements: !885)
!885 = !{!886, !888, !889, !890}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !884, file: !729, line: 80, baseType: !887, size: 1024)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1024, elements: !880)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !884, file: !729, line: 81, baseType: !887, size: 1024, offset: 1024)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !884, file: !729, line: 83, baseType: !830, size: 32, offset: 2048)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !884, file: !729, line: 86, baseType: !830, size: 32, offset: 2080)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !728, file: !729, line: 417, baseType: !874, size: 1120, offset: 608)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !728, file: !729, line: 420, baseType: !893, size: 96, offset: 1728)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !729, line: 296, size: 96, elements: !894)
!894 = !{!895, !897, !898}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !893, file: !729, line: 298, baseType: !896, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !893, file: !729, line: 299, baseType: !53, size: 32, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !893, file: !729, line: 300, baseType: !733, size: 32, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !728, file: !729, line: 421, baseType: !733, size: 32, offset: 1824)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !728, file: !729, line: 422, baseType: !901, size: 32, offset: 1856)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !729, line: 359, size: 640, elements: !903)
!903 = !{!904, !905, !906, !907, !908, !910, !911, !912, !913, !914, !915}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !902, file: !729, line: 362, baseType: !726, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !902, file: !729, line: 363, baseType: !793, size: 64, offset: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !902, file: !729, line: 364, baseType: !793, size: 64, offset: 96)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !902, file: !729, line: 365, baseType: !793, size: 64, offset: 160)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !902, file: !729, line: 366, baseType: !909, size: 64, offset: 224)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 64, elements: !340)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !902, file: !729, line: 367, baseType: !53, size: 32, offset: 288)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !902, file: !729, line: 368, baseType: !793, size: 64, offset: 320)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !902, file: !729, line: 369, baseType: !793, size: 64, offset: 384)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !902, file: !729, line: 370, baseType: !793, size: 64, offset: 448)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !902, file: !729, line: 371, baseType: !793, size: 64, offset: 512)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !902, file: !729, line: 372, baseType: !793, size: 64, offset: 576)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !728, file: !729, line: 423, baseType: !726, size: 32, offset: 1888)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !802, line: 46, baseType: !7)
!918 = distinct !DICompileUnit(language: DW_LANG_C99, file: !919, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !920, globals: !921, splitDebugInlining: false, nameTableKind: None)
!919 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!920 = !{!726, !724}
!921 = !{!718}
!922 = !{!923, !924, !925, !926}
!923 = !DILocalVariable(name: "r", arg: 1, scope: !720, file: !721, line: 63, type: !727)
!924 = !DILocalVariable(name: "nbytes", arg: 2, scope: !720, file: !721, line: 63, type: !917)
!925 = !DILocalVariable(name: "prev_heap_end", scope: !720, file: !721, line: 67, type: !726)
!926 = !DILocalVariable(name: "stack", scope: !720, file: !721, line: 68, type: !726)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !929, file: !934, line: 4, type: !938, isLocal: false, isDefinition: true)
!929 = distinct !DICompileUnit(language: DW_LANG_C99, file: !930, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !931, splitDebugInlining: false, nameTableKind: None)
!930 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!931 = !{!927, !932, !936}
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !929, file: !934, line: 5, type: !935, isLocal: false, isDefinition: true)
!934 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 88, elements: !190)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !929, file: !934, line: 6, type: !935, isLocal: false, isDefinition: true)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 248, elements: !939)
!939 = !{!940}
!940 = !DISubrange(count: 31)
!941 = distinct !DICompileUnit(language: DW_LANG_C99, file: !942, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !943, retainedTypes: !949, splitDebugInlining: false, nameTableKind: None)
!942 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!943 = !{!944}
!944 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !945, line: 1209, baseType: !7, size: 32, elements: !946)
!945 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!946 = !{!947, !948}
!947 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!948 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!949 = !{!115, !114}
!950 = distinct !DICompileUnit(language: DW_LANG_C99, file: !951, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !952, retainedTypes: !1030, splitDebugInlining: false, nameTableKind: None)
!951 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!952 = !{!953}
!953 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !954, line: 150, baseType: !7, size: 32, elements: !955)
!954 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!955 = !{!956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029}
!956 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!957 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!958 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!959 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!960 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!961 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!962 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!963 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!964 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!965 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!966 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!967 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!968 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!969 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!970 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!971 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!972 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!973 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!974 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!975 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!976 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!977 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!978 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!979 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!980 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!981 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!982 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!983 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!984 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!985 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!986 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!987 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!988 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!989 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!990 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!991 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!992 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!993 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!994 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!995 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!996 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!997 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!998 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!999 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!1000 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!1001 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!1002 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!1003 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!1004 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!1005 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!1006 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!1007 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!1008 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!1009 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!1010 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!1011 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!1012 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!1013 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!1014 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!1015 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!1016 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!1017 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!1018 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!1019 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!1020 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!1021 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!1022 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!1023 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!1024 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!1025 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!1026 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!1027 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!1028 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!1029 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!1030 = !{!115, !205}
!1031 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1032, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1033, splitDebugInlining: false, nameTableKind: None)
!1032 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!1033 = !{!1034, !1059}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !335, line: 418, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 395, size: 1120, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !1036, file: !335, line: 397, baseType: !372, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !1036, file: !335, line: 398, baseType: !207, size: 32, offset: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !1036, file: !335, line: 399, baseType: !207, size: 32, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !1036, file: !335, line: 400, baseType: !207, size: 32, offset: 96)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !1036, file: !335, line: 401, baseType: !207, size: 32, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !1036, file: !335, line: 402, baseType: !207, size: 32, offset: 160)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !1036, file: !335, line: 403, baseType: !379, size: 96, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !1036, file: !335, line: 404, baseType: !207, size: 32, offset: 288)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !1036, file: !335, line: 405, baseType: !207, size: 32, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !1036, file: !335, line: 406, baseType: !207, size: 32, offset: 352)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !1036, file: !335, line: 407, baseType: !207, size: 32, offset: 384)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !1036, file: !335, line: 408, baseType: !207, size: 32, offset: 416)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !1036, file: !335, line: 409, baseType: !207, size: 32, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !1036, file: !335, line: 410, baseType: !207, size: 32, offset: 480)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !1036, file: !335, line: 411, baseType: !390, size: 64, offset: 512)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !1036, file: !335, line: 412, baseType: !372, size: 32, offset: 576)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !1036, file: !335, line: 413, baseType: !372, size: 32, offset: 608)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !1036, file: !335, line: 414, baseType: !396, size: 128, offset: 640)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !1036, file: !335, line: 415, baseType: !400, size: 160, offset: 768)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1036, file: !335, line: 416, baseType: !404, size: 160, offset: 928)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !1036, file: !335, line: 417, baseType: !207, size: 32, offset: 1088)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 32)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !335, line: 378, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !335, line: 363, size: 28704, elements: !1062)
!1062 = !{!1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !1061, file: !335, line: 365, baseType: !339, size: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1061, file: !335, line: 366, baseType: !343, size: 768, offset: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !1061, file: !335, line: 367, baseType: !339, size: 256, offset: 1024)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !1061, file: !335, line: 368, baseType: !343, size: 768, offset: 1280)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !1061, file: !335, line: 369, baseType: !339, size: 256, offset: 2048)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1061, file: !335, line: 370, baseType: !343, size: 768, offset: 2304)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !1061, file: !335, line: 371, baseType: !339, size: 256, offset: 3072)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1061, file: !335, line: 372, baseType: !343, size: 768, offset: 3328)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !1061, file: !335, line: 373, baseType: !339, size: 256, offset: 4096)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1061, file: !335, line: 374, baseType: !354, size: 1792, offset: 4352)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !1061, file: !335, line: 375, baseType: !358, size: 1920, offset: 6144)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !1061, file: !335, line: 376, baseType: !363, size: 20608, offset: 8064)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !1061, file: !335, line: 377, baseType: !207, size: 32, offset: 28672)
!1076 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1077, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1078, splitDebugInlining: false, nameTableKind: None)
!1077 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/gdma_transfer_data_interrupt/GCC")
!1078 = !{!1079, !953}
