; ModuleID = 'build/96b_wistrio/getline/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.k_fifo = type { %struct.k_queue }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %union.anon }
%struct._sflist = type { %struct.z_heap_bucket*, %struct.z_heap_bucket* }
%struct.z_heap_bucket = type { i32 }
%struct.k_spinlock = type {}
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.console_input = type { i32, i8, [128 x i8] }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.stm32_exti_data = type { [16 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/getline/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/getline")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/getline")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/getline")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_stm32l1_init", scope: !111, file: !142, line: 60, type: !143, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !141, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/getline")
!113 = !{!114, !135}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 386, baseType: !117)
!116 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l151xba.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 370, size: 448, elements: !118)
!118 = !{!119, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !117, file: !116, line: 372, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !117, file: !116, line: 373, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !117, file: !116, line: 374, baseType: !120, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !117, file: !116, line: 375, baseType: !120, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !117, file: !116, line: 376, baseType: !120, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !117, file: !116, line: 377, baseType: !120, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !117, file: !116, line: 378, baseType: !120, size: 32, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !117, file: !116, line: 379, baseType: !120, size: 32, offset: 224)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !117, file: !116, line: 380, baseType: !120, size: 32, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !117, file: !116, line: 381, baseType: !120, size: 32, offset: 288)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !117, file: !116, line: 382, baseType: !120, size: 32, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !117, file: !116, line: 383, baseType: !120, size: 32, offset: 352)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !117, file: !116, line: 384, baseType: !120, size: 32, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !117, file: !116, line: 385, baseType: !120, size: 32, offset: 416)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !116, line: 364, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 360, size: 64, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !137, file: !116, line: 362, baseType: !120, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !137, file: !116, line: 363, baseType: !120, size: 32, offset: 32)
!141 = !{!109}
!142 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = !{!147, !178}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !144, file: !145, line: 60, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DISubroutineType(types: !150)
!150 = !{!103, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !155)
!154 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!155 = !{!156, !160, !161, !162, !171, !172}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !154, line: 380, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !153, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !153, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !153, file: !154, line: 386, baseType: !163, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !165)
!165 = !{!166, !169}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !164, file: !154, line: 359, baseType: !167, size: 8)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !168)
!168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !164, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!170 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !153, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !153, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !154, line: 43, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !177)
!177 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !144, file: !145, line: 65, baseType: !151, size: 32, offset: 32)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !181, file: !184, line: 71, type: !185, isLocal: true, isDefinition: true, align: 32)
!181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !182, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !183, splitDebugInlining: false, nameTableKind: None)
!182 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/getline")
!183 = !{!179}
!184 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !187)
!187 = !{!188, !207}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !186, file: !145, line: 60, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = !DISubroutineType(types: !191)
!191 = !{!103, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !195)
!195 = !{!196, !197, !198, !199, !205, !206}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !154, line: 380, baseType: !157, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !194, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !194, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !194, file: !154, line: 386, baseType: !200, size: 32, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !201, file: !154, line: 359, baseType: !167, size: 8)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !201, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !194, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !194, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !186, file: !145, line: 65, baseType: !192, size: 32, offset: 32)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "free_queue", scope: !210, file: !307, line: 17, type: !308, isLocal: true, isDefinition: true, align: 32)
!210 = distinct !DICompileUnit(language: DW_LANG_C99, file: !211, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !212, globals: !304, splitDebugInlining: false, nameTableKind: None)
!211 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/console/getline.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/getline")
!212 = !{!102, !213, !217, !103, !219}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !214, line: 46, baseType: !215)
!214 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !216)
!216 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !218, line: 214, baseType: !32)
!218 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !222, line: 336, size: 608, elements: !223)
!222 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!223 = !{!224, !244, !248, !252, !265, !270, !276, !282, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !221, file: !222, line: 365, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = !DISubroutineType(types: !227)
!227 = !{!103, !228, !243}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !231)
!231 = !{!232, !233, !234, !235, !241, !242}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !230, file: !154, line: 380, baseType: !157, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !230, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !230, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !230, file: !154, line: 386, baseType: !236, size: 32, offset: 96)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !238)
!238 = !{!239, !240}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !237, file: !154, line: 359, baseType: !167, size: 8)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !237, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !230, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !230, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !221, file: !222, line: 366, baseType: !245, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !228, !168}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !221, file: !222, line: 374, baseType: !249, size: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DISubroutineType(types: !251)
!251 = !{!103, !228}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !221, file: !222, line: 377, baseType: !253, size: 32, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 32)
!254 = !DISubroutineType(types: !255)
!255 = !{!103, !228, !256}
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !258)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !222, line: 122, size: 64, elements: !259)
!259 = !{!260, !261, !262, !263, !264}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !258, file: !222, line: 123, baseType: !121, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !258, file: !222, line: 124, baseType: !167, size: 8, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !258, file: !222, line: 125, baseType: !167, size: 8, offset: 40)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !258, file: !222, line: 126, baseType: !167, size: 8, offset: 48)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !258, file: !222, line: 127, baseType: !167, size: 8, offset: 56)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !221, file: !222, line: 379, baseType: !266, size: 32, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = !DISubroutineType(types: !268)
!268 = !{!103, !228, !269}
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !221, file: !222, line: 384, baseType: !271, size: 32, offset: 160)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DISubroutineType(types: !273)
!273 = !{!103, !228, !274, !103}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !221, file: !222, line: 393, baseType: !277, size: 32, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DISubroutineType(types: !279)
!279 = !{!103, !228, !280, !281}
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !221, file: !222, line: 402, baseType: !283, size: 32, offset: 224)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !228}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !221, file: !222, line: 405, baseType: !283, size: 32, offset: 256)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !221, file: !222, line: 408, baseType: !249, size: 32, offset: 288)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !221, file: !222, line: 411, baseType: !283, size: 32, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !221, file: !222, line: 414, baseType: !283, size: 32, offset: 352)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !221, file: !222, line: 417, baseType: !249, size: 32, offset: 384)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !221, file: !222, line: 420, baseType: !249, size: 32, offset: 416)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !221, file: !222, line: 423, baseType: !283, size: 32, offset: 448)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !221, file: !222, line: 426, baseType: !283, size: 32, offset: 480)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !221, file: !222, line: 429, baseType: !249, size: 32, offset: 512)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !221, file: !222, line: 432, baseType: !249, size: 32, offset: 544)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !221, file: !222, line: 435, baseType: !297, size: 32, offset: 576)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !228, !300, !102}
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !222, line: 142, baseType: !301)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = !DISubroutineType(types: !303)
!303 = !{null, !228, !102}
!304 = !{!208, !305, !352, !373}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "used_queue", scope: !210, file: !307, line: 18, type: !308, isLocal: true, isDefinition: true, align: 32)
!307 = !DIFile(filename: "zephyr/subsys/console/getline.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_fifo", file: !309, line: 2208, size: 128, elements: !310)
!309 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!310 = !{!311}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_queue", scope: !308, file: !309, line: 2209, baseType: !312, size: 128)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !309, line: 1709, size: 128, elements: !313)
!313 = !{!314, !327, !331}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !312, file: !309, line: 1710, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !316, line: 46, baseType: !317)
!316 = !DIFile(filename: "zephyr/include/zephyr/sys/sflist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !316, line: 41, size: 64, elements: !318)
!318 = !{!319, !326}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !317, file: !316, line: 42, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !316, line: 39, baseType: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !316, line: 35, size: 32, elements: !323)
!323 = !{!324}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !322, file: !316, line: 36, baseType: !325, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !316, line: 32, baseType: !121)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !317, file: !316, line: 43, baseType: !320, size: 32, offset: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !312, file: !309, line: 1711, baseType: !328, offset: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !329, line: 43, elements: !330)
!329 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!330 = !{}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !312, file: !309, line: 1712, baseType: !332, size: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !333, line: 233, baseType: !334)
!333 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 231, size: 64, elements: !335)
!335 = !{!336}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !334, file: !333, line: 232, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !338, line: 48, baseType: !339)
!338 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !338, line: 37, size: 64, elements: !340)
!340 = !{!341, !347}
!341 = !DIDerivedType(tag: DW_TAG_member, scope: !339, file: !338, line: 38, baseType: !342, size: 32)
!342 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !339, file: !338, line: 38, size: 32, elements: !343)
!343 = !{!344, !346}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !342, file: !338, line: 39, baseType: !345, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !342, file: !338, line: 40, baseType: !345, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, scope: !339, file: !338, line: 42, baseType: !348, size: 32, offset: 32)
!348 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !339, file: !338, line: 42, size: 32, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !348, file: !338, line: 43, baseType: !345, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !348, file: !338, line: 44, baseType: !345, size: 32)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "cmd", scope: !354, file: !307, line: 22, type: !361, isLocal: true, isDefinition: true)
!354 = distinct !DISubprogram(name: "console_getline", scope: !307, file: !307, line: 20, type: !355, scopeLine: 21, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !210, retainedNodes: !358)
!355 = !DISubroutineType(types: !356)
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!358 = !{!359}
!359 = !DILocalVariable(name: "ret", scope: !360, file: !307, line: 29, type: !102)
!360 = distinct !DILexicalBlock(scope: !354, file: !307, line: 29, column: 8)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "console_input", file: !363, line: 21, size: 1088, elements: !364)
!363 = !DIFile(filename: "zephyr/include/zephyr/drivers/console/console.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = !{!365, !368, !369}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !362, file: !363, line: 23, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !367)
!367 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "is_mcumgr", scope: !362, file: !363, line: 25, baseType: !167, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !362, file: !363, line: 27, baseType: !370, size: 1024, offset: 40)
!370 = !DICompositeType(tag: DW_TAG_array_type, baseType: !159, size: 1024, elements: !371)
!371 = !{!372}
!372 = !DISubrange(count: 128)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "line_bufs", scope: !210, file: !307, line: 15, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 2176, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 2)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "static_regions", scope: !380, file: !387, line: 62, type: !519, isLocal: true, isDefinition: true)
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !382, globals: !383, splitDebugInlining: false, nameTableKind: None)
!381 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/getline")
!382 = !{!217, !103, !121, !102}
!383 = !{!384, !378}
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !386, file: !387, line: 198, type: !505, isLocal: true, isDefinition: true)
!386 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !387, file: !387, line: 175, type: !388, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !380, retainedNodes: !500)
!387 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!388 = !DISubroutineType(types: !389)
!389 = !{null, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !392, line: 245, size: 1024, elements: !393)
!392 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!393 = !{!394, !457, !470, !471, !472, !473, !479, !495}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !391, file: !392, line: 247, baseType: !395, size: 384)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !392, line: 57, size: 384, elements: !396)
!396 = !{!397, !422, !429, !430, !431, !444, !445, !446}
!397 = !DIDerivedType(tag: DW_TAG_member, scope: !395, file: !392, line: 60, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !395, file: !392, line: 60, size: 64, elements: !399)
!399 = !{!400, !415}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !398, file: !392, line: 61, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !338, line: 49, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !338, line: 37, size: 64, elements: !403)
!403 = !{!404, !410}
!404 = !DIDerivedType(tag: DW_TAG_member, scope: !402, file: !338, line: 38, baseType: !405, size: 32)
!405 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !402, file: !338, line: 38, size: 32, elements: !406)
!406 = !{!407, !409}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !405, file: !338, line: 39, baseType: !408, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !405, file: !338, line: 40, baseType: !408, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, scope: !402, file: !338, line: 42, baseType: !411, size: 32, offset: 32)
!411 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !402, file: !338, line: 42, size: 32, elements: !412)
!412 = !{!413, !414}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !411, file: !338, line: 43, baseType: !408, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !411, file: !338, line: 44, baseType: !408, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !398, file: !392, line: 62, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !417, line: 49, size: 64, elements: !418)
!417 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!418 = !{!419}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !416, file: !417, line: 50, baseType: !420, size: 64)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 64, elements: !376)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !395, file: !392, line: 68, baseType: !423, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !333, line: 233, baseType: !425)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !333, line: 231, size: 64, elements: !426)
!426 = !{!427}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !425, file: !333, line: 232, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !338, line: 48, baseType: !402)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !395, file: !392, line: 71, baseType: !167, size: 8, offset: 96)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !395, file: !392, line: 74, baseType: !167, size: 8, offset: 104)
!431 = !DIDerivedType(tag: DW_TAG_member, scope: !395, file: !392, line: 90, baseType: !432, size: 16, offset: 112)
!432 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !395, file: !392, line: 90, size: 16, elements: !433)
!433 = !{!434, !441}
!434 = !DIDerivedType(tag: DW_TAG_member, scope: !432, file: !392, line: 91, baseType: !435, size: 16)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !432, file: !392, line: 91, size: 16, elements: !436)
!436 = !{!437, !440}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !435, file: !392, line: 96, baseType: !438, size: 8)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !439)
!439 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !435, file: !392, line: 97, baseType: !167, size: 8, offset: 8)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !432, file: !392, line: 100, baseType: !442, size: 16)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !443)
!443 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !395, file: !392, line: 107, baseType: !121, size: 32, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !395, file: !392, line: 127, baseType: !102, size: 32, offset: 160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !395, file: !392, line: 131, baseType: !447, size: 192, offset: 192)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !333, line: 244, size: 192, elements: !448)
!448 = !{!449, !450, !456}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !447, file: !333, line: 245, baseType: !401, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !447, file: !333, line: 246, baseType: !451, size: 32, offset: 64)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !333, line: 242, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 32)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !455}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !447, file: !333, line: 249, baseType: !215, size: 64, offset: 128)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !391, file: !392, line: 250, baseType: !458, size: 288, offset: 384)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !459, line: 25, size: 288, elements: !460)
!459 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !458, file: !459, line: 26, baseType: !121, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !458, file: !459, line: 27, baseType: !121, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !458, file: !459, line: 28, baseType: !121, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !458, file: !459, line: 29, baseType: !121, size: 32, offset: 96)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !458, file: !459, line: 30, baseType: !121, size: 32, offset: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !458, file: !459, line: 31, baseType: !121, size: 32, offset: 160)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !458, file: !459, line: 32, baseType: !121, size: 32, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !458, file: !459, line: 33, baseType: !121, size: 32, offset: 224)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !458, file: !459, line: 34, baseType: !121, size: 32, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !391, file: !392, line: 253, baseType: !102, size: 32, offset: 672)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !391, file: !392, line: 256, baseType: !424, size: 64, offset: 704)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !391, file: !392, line: 294, baseType: !103, size: 32, offset: 768)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !391, file: !392, line: 300, baseType: !474, size: 96, offset: 800)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !392, line: 149, size: 96, elements: !475)
!475 = !{!476, !477, !478}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !474, file: !392, line: 153, baseType: !22, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !474, file: !392, line: 162, baseType: !217, size: 32, offset: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !474, file: !392, line: 168, baseType: !217, size: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !391, file: !392, line: 325, baseType: !480, size: 32, offset: 896)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 32)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !309, line: 5073, size: 160, elements: !482)
!482 = !{!483, !492, !493}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !481, file: !309, line: 5074, baseType: !484, size: 96)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !485, line: 56, size: 96, elements: !486)
!485 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!486 = !{!487, !490, !491}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !484, file: !485, line: 57, baseType: !488, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !485, line: 57, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !484, file: !485, line: 58, baseType: !102, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !484, file: !485, line: 59, baseType: !217, size: 32, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !481, file: !309, line: 5075, baseType: !424, size: 64, offset: 96)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !481, file: !309, line: 5076, baseType: !494, offset: 160)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !329, line: 43, elements: !330)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !391, file: !392, line: 343, baseType: !496, size: 64, offset: 928)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !459, line: 60, size: 64, elements: !497)
!497 = !{!498, !499}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !496, file: !459, line: 63, baseType: !121, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !496, file: !459, line: 66, baseType: !121, size: 32, offset: 32)
!500 = !{!501, !502, !503, !504}
!501 = !DILocalVariable(name: "thread", arg: 1, scope: !386, file: !387, line: 175, type: !390)
!502 = !DILocalVariable(name: "region_num", scope: !386, file: !387, line: 200, type: !167)
!503 = !DILocalVariable(name: "guard_start", scope: !386, file: !387, line: 265, type: !22)
!504 = !DILocalVariable(name: "guard_size", scope: !386, file: !387, line: 266, type: !217)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 96, elements: !517)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !507, line: 52, size: 96, elements: !508)
!507 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!508 = !{!509, !510, !511}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !506, file: !507, line: 53, baseType: !22, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !506, file: !507, line: 54, baseType: !217, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !506, file: !507, line: 55, baseType: !512, size: 32, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !513, line: 151, baseType: !514)
!513 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !513, line: 149, size: 32, elements: !515)
!515 = !{!516}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !514, file: !513, line: 150, baseType: !121, size: 32)
!517 = !{!518}
!518 = !DISubrange(count: 1)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !520, size: 96, elements: !517)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !506)
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !523, file: !556, line: 39, type: !167, isLocal: true, isDefinition: true)
!523 = distinct !DICompileUnit(language: DW_LANG_C99, file: !524, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !525, globals: !555, splitDebugInlining: false, nameTableKind: None)
!524 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/getline")
!525 = !{!526, !102, !103, !543, !167}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !528, line: 1168, baseType: !529)
!528 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !528, line: 1155, size: 352, elements: !530)
!530 = !{!531, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !529, file: !528, line: 1157, baseType: !532, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !529, file: !528, line: 1158, baseType: !120, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !529, file: !528, line: 1159, baseType: !120, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !529, file: !528, line: 1160, baseType: !120, size: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !529, file: !528, line: 1161, baseType: !120, size: 32, offset: 128)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !529, file: !528, line: 1162, baseType: !120, size: 32, offset: 160)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !529, file: !528, line: 1163, baseType: !120, size: 32, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !529, file: !528, line: 1164, baseType: !120, size: 32, offset: 224)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !529, file: !528, line: 1165, baseType: !120, size: 32, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !529, file: !528, line: 1166, baseType: !120, size: 32, offset: 288)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !529, file: !528, line: 1167, baseType: !120, size: 32, offset: 320)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !545)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !546, line: 27, size: 96, elements: !547)
!546 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!547 = !{!548, !549, !550}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !545, file: !546, line: 29, baseType: !121, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !545, file: !546, line: 31, baseType: !157, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !545, file: !546, line: 37, baseType: !551, size: 32, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !513, line: 146, baseType: !552)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !513, line: 141, size: 32, elements: !553)
!553 = !{!554}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !552, file: !513, line: 143, baseType: !121, size: 32)
!555 = !{!521}
!556 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!557 = !DIGlobalVariableExpression(var: !558, expr: !DIExpression())
!558 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !559, file: !566, line: 21, type: !106, isLocal: true, isDefinition: true)
!559 = distinct !DICompileUnit(language: DW_LANG_C99, file: !560, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !561, globals: !565, splitDebugInlining: false, nameTableKind: None)
!560 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/getline")
!561 = !{!562, !103, !102}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !564, line: 22, baseType: !103)
!564 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!565 = !{!557}
!566 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!567 = !DIGlobalVariableExpression(var: !568, expr: !DIExpression())
!568 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !569, file: !574, line: 13, type: !591, isLocal: true, isDefinition: true)
!569 = distinct !DICompileUnit(language: DW_LANG_C99, file: !570, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !571, splitDebugInlining: false, nameTableKind: None)
!570 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/getline")
!571 = !{!572, !567}
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "mpu_config", scope: !569, file: !574, line: 37, type: !575, isLocal: false, isDefinition: true)
!574 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !546, line: 41, size: 64, elements: !577)
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !576, file: !546, line: 43, baseType: !121, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !576, file: !546, line: 45, baseType: !580, size: 32, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !546, line: 27, size: 96, elements: !583)
!583 = !{!584, !585, !586}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !582, file: !546, line: 29, baseType: !121, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !582, file: !546, line: 31, baseType: !157, size: 32, offset: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !582, file: !546, line: 37, baseType: !587, size: 32, offset: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !513, line: 146, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !513, line: 141, size: 32, elements: !589)
!589 = !{!590}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !588, file: !513, line: 143, baseType: !121, size: 32)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 192, elements: !376)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "__init_rf_init", scope: !594, file: !691, line: 36, type: !692, isLocal: true, isDefinition: true, align: 32)
!594 = distinct !DICompileUnit(language: DW_LANG_C99, file: !595, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !596, retainedTypes: !608, globals: !690, splitDebugInlining: false, nameTableKind: None)
!595 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/getline")
!596 = !{!597, !603}
!597 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !598, line: 506, baseType: !32, size: 32, elements: !599)
!598 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!599 = !{!600, !601, !602}
!600 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!601 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!602 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!603 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !598, line: 512, baseType: !32, size: 32, elements: !604)
!604 = !{!605, !606, !607}
!605 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!606 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!607 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!608 = !{!609, !679, !684, !644, !603, !597, !689, !102}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !598, line: 523, size: 288, elements: !612)
!612 = !{!613, !634, !640, !645, !649, !650, !651, !655, !675}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !611, file: !598, line: 524, baseType: !614, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 32)
!615 = !DISubroutineType(types: !616)
!616 = !{!103, !617, !632, !633}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !620)
!620 = !{!621, !622, !623, !624, !630, !631}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !619, file: !154, line: 380, baseType: !157, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !619, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !619, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !619, file: !154, line: 386, baseType: !625, size: 32, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 32)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !626, file: !154, line: 359, baseType: !167, size: 8)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !626, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !619, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !619, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !598, line: 237, baseType: !167)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !598, line: 257, baseType: !121)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !611, file: !598, line: 530, baseType: !635, size: 32, offset: 32)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!636 = !DISubroutineType(types: !637)
!637 = !{!103, !617, !638}
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !598, line: 229, baseType: !121)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !611, file: !598, line: 532, baseType: !641, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!642 = !DISubroutineType(types: !643)
!643 = !{!103, !617, !644, !639}
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !598, line: 216, baseType: !121)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !611, file: !598, line: 535, baseType: !646, size: 32, offset: 96)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 32)
!647 = !DISubroutineType(types: !648)
!648 = !{!103, !617, !644}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !611, file: !598, line: 537, baseType: !646, size: 32, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !611, file: !598, line: 539, baseType: !646, size: 32, offset: 160)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !611, file: !598, line: 541, baseType: !652, size: 32, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 32)
!653 = !DISubroutineType(types: !654)
!654 = !{!103, !617, !632, !597, !603}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !611, file: !598, line: 544, baseType: !656, size: 32, offset: 224)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 32)
!657 = !DISubroutineType(types: !658)
!658 = !{!103, !617, !659, !170}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 32)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !598, line: 478, size: 96, elements: !661)
!661 = !{!662, !669, !674}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !660, file: !598, line: 482, baseType: !663, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !664, line: 33, baseType: !665)
!664 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !664, line: 29, size: 32, elements: !666)
!666 = !{!667}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !665, file: !664, line: 30, baseType: !668, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !660, file: !598, line: 485, baseType: !670, size: 32, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !598, line: 464, baseType: !671)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !617, !659, !644}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !660, file: !598, line: 493, baseType: !644, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !611, file: !598, line: 547, baseType: !676, size: 32, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!677 = !DISubroutineType(types: !678)
!678 = !{!121, !617}
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !598, line: 428, size: 32, elements: !682)
!682 = !{!683}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !681, file: !598, line: 434, baseType: !644, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !598, line: 441, size: 32, elements: !687)
!687 = !{!688}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !686, file: !598, line: 447, baseType: !644, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!690 = !{!592}
!691 = !DIFile(filename: "zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!692 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !694)
!694 = !{!695, !699}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !693, file: !145, line: 60, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = !DISubroutineType(types: !698)
!698 = !{!103, !617}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !693, file: !145, line: 65, baseType: !617, size: 32, offset: 32)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !702, file: !774, line: 48, type: !850, isLocal: true, isDefinition: true)
!702 = distinct !DICompileUnit(language: DW_LANG_C99, file: !703, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !704, retainedTypes: !760, globals: !771, splitDebugInlining: false, nameTableKind: None)
!703 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/getline")
!704 = !{!30, !705}
!705 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 69, baseType: !103, size: 32, elements: !706)
!706 = !{!707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759}
!707 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!708 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!709 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!710 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!711 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!712 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!713 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!714 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!715 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!716 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!717 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!718 = !DIEnumerator(name: "TAMPER_STAMP_IRQn", value: 2)
!719 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!720 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!721 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!722 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!723 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!724 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!725 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!726 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!727 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!728 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!729 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!730 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!731 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!732 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!733 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!734 = !DIEnumerator(name: "ADC1_IRQn", value: 18)
!735 = !DIEnumerator(name: "USB_HP_IRQn", value: 19)
!736 = !DIEnumerator(name: "USB_LP_IRQn", value: 20)
!737 = !DIEnumerator(name: "DAC_IRQn", value: 21)
!738 = !DIEnumerator(name: "COMP_IRQn", value: 22)
!739 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!740 = !DIEnumerator(name: "TIM9_IRQn", value: 25)
!741 = !DIEnumerator(name: "TIM10_IRQn", value: 26)
!742 = !DIEnumerator(name: "TIM11_IRQn", value: 27)
!743 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!744 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!745 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!746 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!747 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!748 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!749 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!750 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!751 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!752 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!753 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!754 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!755 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!756 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!757 = !DIEnumerator(name: "USB_FS_WKUP_IRQn", value: 42)
!758 = !DIEnumerator(name: "TIM6_IRQn", value: 43)
!759 = !DIEnumerator(name: "TIM7_IRQn", value: 44)
!760 = !{!217, !103, !102, !761}
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !116, line: 270, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 262, size: 192, elements: !764)
!764 = !{!765, !766, !767, !768, !769, !770}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !763, file: !116, line: 264, baseType: !120, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !763, file: !116, line: 265, baseType: !120, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !763, file: !116, line: 266, baseType: !120, size: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !763, file: !116, line: 267, baseType: !120, size: 32, offset: 96)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !763, file: !116, line: 268, baseType: !120, size: 32, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !763, file: !116, line: 269, baseType: !120, size: 32, offset: 160)
!771 = !{!772, !778, !794, !805, !822, !700, !824, !838, !840, !842, !844, !846, !848}
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !702, file: !774, line: 424, type: !775, isLocal: false, isDefinition: true, align: 16)
!774 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 64, elements: !776)
!776 = !{!777}
!777 = !DISubrange(count: 4)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "__device_dts_ord_32", scope: !702, file: !774, line: 424, type: !780, isLocal: false, isDefinition: true, align: 32)
!780 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !782)
!782 = !{!783, !784, !785, !786, !792, !793}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !781, file: !154, line: 380, baseType: !157, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !781, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !781, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !781, file: !154, line: 386, baseType: !787, size: 32, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !789)
!789 = !{!790, !791}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !788, file: !154, line: 359, baseType: !167, size: 8)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !788, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !781, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !781, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_32", scope: !702, file: !774, line: 424, type: !796, isLocal: true, isDefinition: true, align: 32)
!796 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !798)
!798 = !{!799, !804}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !797, file: !145, line: 60, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 32)
!801 = !DISubroutineType(types: !802)
!802 = !{!103, !803}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !797, file: !145, line: 65, baseType: !803, size: 32, offset: 32)
!805 = !DIGlobalVariableExpression(var: !806, expr: !DIExpression())
!806 = distinct !DIGlobalVariable(name: "exti_data", scope: !702, file: !774, line: 423, type: !807, isLocal: true, isDefinition: true)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !774, line: 107, size: 1024, elements: !808)
!808 = !{!809}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !807, file: !774, line: 109, baseType: !810, size: 1024)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 1024, elements: !820)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !774, line: 101, size: 64, elements: !812)
!812 = !{!813, !819}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !811, file: !774, line: 102, baseType: !814, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !815, line: 63, baseType: !816)
!815 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 32)
!817 = !DISubroutineType(types: !818)
!818 = !{null, !103, !102}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !811, file: !774, line: 103, baseType: !102, size: 32, offset: 32)
!820 = !{!821}
!821 = !DISubrange(count: 16)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_32", scope: !702, file: !774, line: 424, type: !788, isLocal: true, isDefinition: true, align: 8)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !826, file: !774, line: 493, type: !831, isLocal: true, isDefinition: true, align: 32)
!826 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !774, file: !774, line: 460, type: !827, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !702, retainedNodes: !829)
!827 = !DISubroutineType(types: !828)
!828 = !{null, !803}
!829 = !{!830}
!830 = !DILocalVariable(name: "dev", arg: 1, scope: !826, file: !774, line: 460, type: !803)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !832)
!832 = !{!833, !835, !836, !837}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !831, file: !10, line: 55, baseType: !834, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !831, file: !10, line: 57, baseType: !834, size: 32, offset: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !831, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !831, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!838 = !DIGlobalVariableExpression(var: !839, expr: !DIExpression())
!839 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !826, file: !774, line: 497, type: !831, isLocal: true, isDefinition: true, align: 32)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !826, file: !774, line: 507, type: !831, isLocal: true, isDefinition: true, align: 32)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !826, file: !774, line: 512, type: !831, isLocal: true, isDefinition: true, align: 32)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !826, file: !774, line: 516, type: !831, isLocal: true, isDefinition: true, align: 32)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !826, file: !774, line: 523, type: !831, isLocal: true, isDefinition: true, align: 32)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !826, file: !774, line: 527, type: !831, isLocal: true, isDefinition: true, align: 32)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !851, size: 512, elements: !820)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !116, line: 127, baseType: !705)
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !855, file: !860, line: 21, type: !880, isLocal: false, isDefinition: true, align: 16)
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !857, splitDebugInlining: false, nameTableKind: None)
!856 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/getline/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/getline")
!857 = !{!858, !853, !864, !866, !868, !870, !872, !874, !876, !878}
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !855, file: !860, line: 16, type: !861, isLocal: false, isDefinition: true, align: 16)
!860 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/getline")
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 176, elements: !862)
!862 = !{!863}
!863 = !DISubrange(count: 11)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_17", scope: !855, file: !860, line: 28, type: !775, isLocal: false, isDefinition: true, align: 16)
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !855, file: !860, line: 35, type: !775, isLocal: false, isDefinition: true, align: 16)
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_53", scope: !855, file: !860, line: 42, type: !775, isLocal: false, isDefinition: true, align: 16)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_59", scope: !855, file: !860, line: 49, type: !775, isLocal: false, isDefinition: true, align: 16)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_15", scope: !855, file: !860, line: 56, type: !775, isLocal: false, isDefinition: true, align: 16)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !855, file: !860, line: 63, type: !775, isLocal: false, isDefinition: true, align: 16)
!876 = !DIGlobalVariableExpression(var: !877, expr: !DIExpression())
!877 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !855, file: !860, line: 70, type: !775, isLocal: false, isDefinition: true, align: 16)
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !855, file: !860, line: 77, type: !775, isLocal: false, isDefinition: true, align: 16)
!880 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 48, elements: !881)
!881 = !{!882}
!882 = !DISubrange(count: 3)
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !885, file: !929, line: 398, type: !962, isLocal: true, isDefinition: true)
!885 = distinct !DICompileUnit(language: DW_LANG_C99, file: !886, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !887, retainedTypes: !900, globals: !926, splitDebugInlining: false, nameTableKind: None)
!886 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/getline")
!887 = !{!888, !30, !893}
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !889, line: 190, baseType: !32, size: 32, elements: !890)
!889 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l1xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!890 = !{!891, !892}
!891 = !DIEnumerator(name: "SUCCESS", value: 0)
!892 = !DIEnumerator(name: "ERROR", value: 1)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !894, line: 44, baseType: !32, size: 32, elements: !895)
!894 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!895 = !{!896, !897, !898, !899}
!896 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!897 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!898 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!899 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!900 = !{!102, !103, !121, !901, !919, !925}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 386, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 370, size: 448, elements: !904)
!904 = !{!905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !903, file: !116, line: 372, baseType: !120, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !903, file: !116, line: 373, baseType: !120, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !903, file: !116, line: 374, baseType: !120, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !903, file: !116, line: 375, baseType: !120, size: 32, offset: 96)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !903, file: !116, line: 376, baseType: !120, size: 32, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !903, file: !116, line: 377, baseType: !120, size: 32, offset: 160)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !903, file: !116, line: 378, baseType: !120, size: 32, offset: 192)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !903, file: !116, line: 379, baseType: !120, size: 32, offset: 224)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !903, file: !116, line: 380, baseType: !120, size: 32, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !903, file: !116, line: 381, baseType: !120, size: 32, offset: 288)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !903, file: !116, line: 382, baseType: !120, size: 32, offset: 320)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !903, file: !116, line: 383, baseType: !120, size: 32, offset: 352)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !903, file: !116, line: 384, baseType: !120, size: 32, offset: 384)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !903, file: !116, line: 385, baseType: !120, size: 32, offset: 416)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 32)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !921, line: 343, size: 64, elements: !922)
!921 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !920, file: !921, line: 344, baseType: !121, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !920, file: !921, line: 345, baseType: !121, size: 32, offset: 32)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!926 = !{!927, !933, !949, !960, !883}
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !885, file: !929, line: 752, type: !930, isLocal: false, isDefinition: true, align: 16)
!929 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 512, elements: !931)
!931 = !{!932}
!932 = !DISubrange(count: 32)
!933 = !DIGlobalVariableExpression(var: !934, expr: !DIExpression())
!934 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !885, file: !929, line: 752, type: !935, isLocal: false, isDefinition: true, align: 32)
!935 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !937)
!937 = !{!938, !939, !940, !941, !947, !948}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !936, file: !154, line: 380, baseType: !157, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !936, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !936, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !936, file: !154, line: 386, baseType: !942, size: 32, offset: 96)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 32)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !943, file: !154, line: 359, baseType: !167, size: 8)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !943, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !936, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !936, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !885, file: !929, line: 752, type: !951, isLocal: true, isDefinition: true, align: 32)
!951 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !953)
!953 = !{!954, !959}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !952, file: !145, line: 60, baseType: !955, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!956 = !DISubroutineType(types: !957)
!957 = !{!103, !958}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !952, file: !145, line: 65, baseType: !958, size: 32, offset: 32)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !885, file: !929, line: 752, type: !943, isLocal: true, isDefinition: true, align: 8)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !894, line: 100, size: 224, elements: !963)
!963 = !{!964, !970, !971, !980, !985, !990, !996}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !962, file: !894, line: 101, baseType: !965, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !894, line: 76, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 32)
!967 = !DISubroutineType(types: !968)
!968 = !{!103, !958, !969}
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !894, line: 56, baseType: !102)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !962, file: !894, line: 102, baseType: !965, size: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !962, file: !894, line: 103, baseType: !972, size: 32, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !894, line: 83, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 32)
!974 = !DISubroutineType(types: !975)
!975 = !{!103, !958, !969, !976, !102}
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !894, line: 72, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 32)
!978 = !DISubroutineType(types: !979)
!979 = !{null, !958, !969, !102}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !962, file: !894, line: 104, baseType: !981, size: 32, offset: 96)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !894, line: 79, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 32)
!983 = !DISubroutineType(types: !984)
!984 = !{!103, !958, !969, !925}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !962, file: !894, line: 105, baseType: !986, size: 32, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !894, line: 88, baseType: !987)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!988 = !DISubroutineType(types: !989)
!989 = !{!893, !958, !969}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !962, file: !894, line: 106, baseType: !991, size: 32, offset: 160)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !894, line: 92, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DISubroutineType(types: !994)
!994 = !{!103, !958, !969, !995}
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !894, line: 64, baseType: !102)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !962, file: !894, line: 107, baseType: !997, size: 32, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !894, line: 96, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!103, !958, !969, !102}
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(name: "avail_queue", scope: !1003, file: !1007, line: 108, type: !1104, isLocal: true, isDefinition: true)
!1003 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1004, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1005, retainedTypes: !1014, globals: !1094, splitDebugInlining: false, nameTableKind: None)
!1004 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/getline")
!1005 = !{!30, !1006}
!1006 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1007, line: 214, baseType: !32, size: 32, elements: !1008)
!1007 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1008 = !{!1009, !1010, !1011, !1012, !1013}
!1009 = !DIEnumerator(name: "ESC_ESC", value: 0)
!1010 = !DIEnumerator(name: "ESC_ANSI", value: 1)
!1011 = !DIEnumerator(name: "ESC_ANSI_FIRST", value: 2)
!1012 = !DIEnumerator(name: "ESC_ANSI_VAL", value: 3)
!1013 = !DIEnumerator(name: "ESC_ANSI_VAL_2", value: 4)
!1014 = !{!102, !103, !1015, !32, !24}
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !222, line: 336, size: 608, elements: !1018)
!1018 = !{!1019, !1038, !1042, !1046, !1059, !1064, !1068, !1072, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !1017, file: !222, line: 365, baseType: !1020, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 32)
!1021 = !DISubroutineType(types: !1022)
!1022 = !{!103, !1023, !243}
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1024 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1025)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !1026)
!1026 = !{!1027, !1028, !1029, !1030, !1036, !1037}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1025, file: !154, line: 380, baseType: !157, size: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1025, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1025, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1025, file: !154, line: 386, baseType: !1031, size: 32, offset: 96)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 32)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !1033)
!1033 = !{!1034, !1035}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1032, file: !154, line: 359, baseType: !167, size: 8)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1032, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1025, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1025, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !1017, file: !222, line: 366, baseType: !1039, size: 32, offset: 32)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 32)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{null, !1023, !168}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !1017, file: !222, line: 374, baseType: !1043, size: 32, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 32)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!103, !1023}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !1017, file: !222, line: 377, baseType: !1047, size: 32, offset: 96)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 32)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!103, !1023, !1050}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 32)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !222, line: 122, size: 64, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057, !1058}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !1052, file: !222, line: 123, baseType: !121, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !1052, file: !222, line: 124, baseType: !167, size: 8, offset: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !1052, file: !222, line: 125, baseType: !167, size: 8, offset: 40)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !1052, file: !222, line: 126, baseType: !167, size: 8, offset: 48)
