; ModuleID = 'build/96b_argonkey/settings/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.settings_handler = type { i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i32, i32 (i8*, i8*, i32)*, i8*)*, i32 ()*, i32 (i32 (i8*, i8*, i32)*)*, %struct._snode }
%struct._snode = type { %struct._snode* }
%struct.settings_handler_static = type { i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i32, i32 (i8*, i8*, i32)*, i8*)*, i32 ()*, i32 (i32 (i8*, i8*, i32)*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.settings_store = type { %struct._snode, %struct.settings_store_itf* }
%struct.settings_store_itf = type { i32 (%struct.settings_store*, %struct.settings_load_arg*)*, i32 (%struct.settings_store*)*, i32 (%struct.settings_store*, i8*, i8*, i32)*, i32 (%struct.settings_store*)*, i8* (%struct.settings_store*)* }
%struct.settings_load_arg = type { i8*, i32 (i8*, i32, i32 (i8*, i8*, i32)*, i8*, i8*)*, i8* }
%struct.k_mutex = type { %union.anon, %struct.k_thread*, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 109, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 6208, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 97)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 3104, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "length_val", scope: !27, file: !33, line: 31, type: !47, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !29, globals: !54, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/settings/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings")
!29 = !{!30, !31, !13, !43}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "direct_immediate_value", file: !33, line: 332, size: 96, elements: !34)
!33 = !DIFile(filename: "zephyr/samples/subsys/settings/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!34 = !{!35, !39, !40}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !32, file: !33, line: 333, baseType: !36, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !37, line: 214, baseType: !38)
!37 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !32, file: !33, line: 334, baseType: !30, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "fetched", scope: !32, file: !33, line: 335, baseType: !41, size: 8, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !42)
!42 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "direct_length_data", file: !33, line: 264, size: 128, elements: !45)
!45 = !{!46, !49, !52}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !44, file: !33, line: 265, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !48)
!48 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "length_1", scope: !44, file: !33, line: 266, baseType: !50, size: 16, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !51)
!51 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "length_2", scope: !44, file: !33, line: 267, baseType: !53, size: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !38)
!54 = !{!25, !55, !57, !59, !63, !69, !110, !120}
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "length_1_val", scope: !27, file: !33, line: 32, type: !50, isLocal: false, isDefinition: true)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "length_2_val", scope: !27, file: !33, line: 33, type: !53, isLocal: false, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "voltage_val", scope: !27, file: !33, line: 34, type: !61, isLocal: false, isDefinition: true)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !62)
!62 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "source_name_val", scope: !27, file: !33, line: 35, type: !65, isLocal: false, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 48, elements: !67)
!66 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!67 = !{!68}
!68 = !DISubrange(count: 6)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "alph_handler", scope: !27, file: !33, line: 51, type: !71, isLocal: false, isDefinition: true)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings_handler", file: !72, line: 64, size: 192, elements: !73)
!72 = !DIFile(filename: "zephyr/include/zephyr/settings/settings.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!73 = !{!74, !77, !82, !92, !96, !103}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !71, file: !72, line: 66, baseType: !75, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "h_get", scope: !71, file: !72, line: 69, baseType: !78, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DISubroutineType(types: !80)
!80 = !{!62, !75, !81, !62}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "h_set", scope: !71, file: !72, line: 81, baseType: !83, size: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 32)
!84 = !DISubroutineType(types: !85)
!85 = !{!62, !75, !36, !86, !30}
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "settings_read_cb", file: !72, line: 57, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !30, !30, !36}
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !91, line: 28, baseType: !62)
!91 = !DIFile(filename: "zephyr/lib/libc/minimal/include/sys/types.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!92 = !DIDerivedType(tag: DW_TAG_member, name: "h_commit", scope: !71, file: !72, line: 96, baseType: !93, size: 32, offset: 96)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!94 = !DISubroutineType(types: !95)
!95 = !{!62}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "h_export", scope: !71, file: !72, line: 103, baseType: !97, size: 32, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DISubroutineType(types: !99)
!99 = !{!62, !100}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = !DISubroutineType(types: !102)
!102 = !{!62, !75, !13, !36}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !71, file: !72, line: 121, baseType: !104, size: 32, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !105, line: 33, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !105, line: 29, size: 32, elements: !107)
!107 = !{!108}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !106, file: !105, line: 30, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "settings_handler_beta", scope: !27, file: !33, line: 60, type: !112, isLocal: false, isDefinition: true, align: 32)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings_handler_static", file: !72, line: 130, size: 160, elements: !114)
!114 = !{!115, !116, !117, !118, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !72, line: 132, baseType: !75, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "h_get", scope: !113, file: !72, line: 135, baseType: !78, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "h_set", scope: !113, file: !72, line: 147, baseType: !83, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "h_commit", scope: !113, file: !72, line: 162, baseType: !93, size: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "h_export", scope: !113, file: !72, line: 167, baseType: !97, size: 32, offset: 128)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "angle_val", scope: !27, file: !33, line: 30, type: !41, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "_char_out", scope: !124, file: !199, line: 54, type: !200, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, retainedTypes: !197, globals: !198, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings")
!126 = !{!127}
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !128, line: 27, baseType: !38, size: 32, elements: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196}
!130 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!131 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!132 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!133 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!134 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!135 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!136 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!137 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!138 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!139 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!140 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!141 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!142 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!143 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!144 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!145 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!146 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!147 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!148 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!149 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!150 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!151 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!152 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!153 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!154 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!155 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!156 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!157 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!158 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!159 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!160 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!161 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!162 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!163 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!164 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!165 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!166 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!167 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!168 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!169 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!170 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!171 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!172 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!173 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!174 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!175 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!176 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!177 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!178 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!179 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!180 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!181 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!182 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!183 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!184 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!185 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!186 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!187 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!188 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!189 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!190 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!191 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!192 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!193 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!194 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!195 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!196 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!197 = !{!30, !62}
!198 = !{!122}
!199 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DISubroutineType(types: !202)
!202 = !{!62, !62}
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !205, file: !222, line: 56, type: !223, isLocal: true, isDefinition: true, align: 32)
!205 = distinct !DICompileUnit(language: DW_LANG_C99, file: !206, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !207, globals: !221, splitDebugInlining: false, nameTableKind: None)
!206 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings")
!207 = !{!208}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !210, line: 379, baseType: !211)
!210 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f412cx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 370, size: 224, elements: !212)
!212 = !{!213, !215, !216, !217, !218, !219, !220}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !211, file: !210, line: 372, baseType: !214, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !211, file: !210, line: 373, baseType: !214, size: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !211, file: !210, line: 374, baseType: !214, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !211, file: !210, line: 375, baseType: !214, size: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !211, file: !210, line: 376, baseType: !214, size: 32, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !211, file: !210, line: 377, baseType: !214, size: 32, offset: 160)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !211, file: !210, line: 378, baseType: !214, size: 32, offset: 192)
!221 = !{!203}
!222 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !225, line: 51, size: 64, elements: !226)
!225 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!226 = !{!227, !253}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !224, file: !225, line: 60, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DISubroutineType(types: !230)
!230 = !{!62, !231}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !234, line: 378, size: 192, elements: !235)
!234 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = !{!236, !237, !238, !239, !246, !247}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !234, line: 380, baseType: !75, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !233, file: !234, line: 382, baseType: !13, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !233, file: !234, line: 384, baseType: !13, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !233, file: !234, line: 386, baseType: !240, size: 32, offset: 96)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !234, line: 351, size: 16, elements: !242)
!242 = !{!243, !244}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !241, file: !234, line: 359, baseType: !41, size: 8)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !241, file: !234, line: 364, baseType: !245, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!245 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !233, file: !234, line: 388, baseType: !30, size: 32, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !233, file: !234, line: 396, baseType: !248, size: 32, offset: 160)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !234, line: 43, baseType: !251)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !252)
!252 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !224, file: !225, line: 65, baseType: !231, size: 32, offset: 32)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !256, file: !259, line: 71, type: !260, isLocal: true, isDefinition: true, align: 32)
!256 = distinct !DICompileUnit(language: DW_LANG_C99, file: !257, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !258, splitDebugInlining: false, nameTableKind: None)
!257 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings")
!258 = !{!254}
!259 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !225, line: 51, size: 64, elements: !262)
!262 = !{!263, !282}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !261, file: !225, line: 60, baseType: !264, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DISubroutineType(types: !266)
!266 = !{!62, !267}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !234, line: 378, size: 192, elements: !270)
!270 = !{!271, !272, !273, !274, !280, !281}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !269, file: !234, line: 380, baseType: !75, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !269, file: !234, line: 382, baseType: !13, size: 32, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !269, file: !234, line: 384, baseType: !13, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !269, file: !234, line: 386, baseType: !275, size: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !234, line: 351, size: 16, elements: !277)
!277 = !{!278, !279}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !276, file: !234, line: 359, baseType: !41, size: 8)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !276, file: !234, line: 364, baseType: !245, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !269, file: !234, line: 388, baseType: !30, size: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !269, file: !234, line: 396, baseType: !248, size: 32, offset: 160)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !261, file: !225, line: 65, baseType: !267, size: 32, offset: 32)
!283 = !DIGlobalVariableExpression(var: !284, expr: !DIExpression())
!284 = distinct !DIGlobalVariable(name: "settings_load_srcs", scope: !285, file: !346, line: 23, type: !347, isLocal: false, isDefinition: true)
!285 = distinct !DICompileUnit(language: DW_LANG_C99, file: !286, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, retainedTypes: !287, globals: !343, splitDebugInlining: false, nameTableKind: None)
!286 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/settings/src/settings_store.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings")
!287 = !{!288, !292, !81, !30, !334, !62}
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !289, line: 46, baseType: !290)
!289 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !291)
!291 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 32)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings_store", file: !72, line: 365, size: 64, elements: !294)
!294 = !{!295, !301}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "cs_next", scope: !293, file: !72, line: 366, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !105, line: 33, baseType: !297)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !105, line: 29, size: 32, elements: !298)
!298 = !{!299}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !297, file: !105, line: 30, baseType: !300, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "cs_itf", scope: !293, file: !72, line: 369, baseType: !302, size: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !304)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings_store_itf", file: !72, line: 403, size: 160, elements: !305)
!305 = !{!306, !321, !325, !329, !330}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "csi_load", scope: !304, file: !72, line: 404, baseType: !307, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!308 = !DISubroutineType(types: !309)
!309 = !{!62, !292, !310}
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings_load_arg", file: !72, line: 377, size: 96, elements: !313)
!313 = !{!314, !315, !320}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "subtree", scope: !312, file: !72, line: 383, baseType: !75, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !312, file: !72, line: 389, baseType: !316, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "settings_load_direct_cb", file: !72, line: 265, baseType: !317)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!318 = !DISubroutineType(types: !319)
!319 = !{!62, !75, !36, !86, !30, !30}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !312, file: !72, line: 395, baseType: !30, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "csi_save_start", scope: !304, file: !72, line: 419, baseType: !322, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DISubroutineType(types: !324)
!324 = !{!62, !292}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "csi_save", scope: !304, file: !72, line: 426, baseType: !326, size: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!327 = !DISubroutineType(types: !328)
!328 = !{!62, !292, !75, !75, !36}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "csi_save_end", scope: !304, file: !72, line: 437, baseType: !322, size: 32, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "csi_storage_get", scope: !304, file: !72, line: 449, baseType: !331, size: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DISubroutineType(types: !333)
!333 = !{!30, !292}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings_handler", file: !72, line: 64, size: 192, elements: !336)
!336 = !{!337, !338, !339, !340, !341, !342}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !335, file: !72, line: 66, baseType: !75, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "h_get", scope: !335, file: !72, line: 69, baseType: !78, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "h_set", scope: !335, file: !72, line: 81, baseType: !83, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "h_commit", scope: !335, file: !72, line: 96, baseType: !93, size: 32, offset: 96)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "h_export", scope: !335, file: !72, line: 103, baseType: !97, size: 32, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !335, file: !72, line: 121, baseType: !296, size: 32, offset: 160)
!343 = !{!283, !344}
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "settings_save_dst", scope: !285, file: !346, line: 24, type: !292, isLocal: false, isDefinition: true)
!346 = !DIFile(filename: "zephyr/subsys/settings/src/settings_store.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !105, line: 40, baseType: !348)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !105, line: 35, size: 64, elements: !349)
!349 = !{!350, !352}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !348, file: !105, line: 36, baseType: !351, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !348, file: !105, line: 37, baseType: !351, size: 32, offset: 32)
!353 = !DIGlobalVariableExpression(var: !354, expr: !DIExpression())
!354 = distinct !DIGlobalVariable(name: "settings_lock", scope: !355, file: !383, line: 25, type: !390, isLocal: false, isDefinition: true, align: 32)
!355 = distinct !DICompileUnit(language: DW_LANG_C99, file: !356, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, retainedTypes: !357, globals: !380, splitDebugInlining: false, nameTableKind: None)
!356 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/settings/src/settings.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings")
!357 = !{!288, !358, !81, !30, !372, !62}
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings_handler", file: !72, line: 64, size: 192, elements: !360)
!360 = !{!361, !362, !363, !364, !365, !366}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !359, file: !72, line: 66, baseType: !75, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "h_get", scope: !359, file: !72, line: 69, baseType: !78, size: 32, offset: 32)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "h_set", scope: !359, file: !72, line: 81, baseType: !83, size: 32, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "h_commit", scope: !359, file: !72, line: 96, baseType: !93, size: 32, offset: 96)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "h_export", scope: !359, file: !72, line: 103, baseType: !97, size: 32, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !359, file: !72, line: 121, baseType: !367, size: 32, offset: 160)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !105, line: 33, baseType: !368)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !105, line: 29, size: 32, elements: !369)
!369 = !{!370}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !368, file: !105, line: 30, baseType: !371, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 32)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings_handler_static", file: !72, line: 130, size: 160, elements: !374)
!374 = !{!375, !376, !377, !378, !379}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !373, file: !72, line: 132, baseType: !75, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "h_get", scope: !373, file: !72, line: 135, baseType: !78, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "h_set", scope: !373, file: !72, line: 147, baseType: !83, size: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "h_commit", scope: !373, file: !72, line: 162, baseType: !93, size: 32, offset: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "h_export", scope: !373, file: !72, line: 167, baseType: !97, size: 32, offset: 128)
!380 = !{!353, !381}
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "settings_handlers", scope: !355, file: !383, line: 22, type: !384, isLocal: false, isDefinition: true)
!383 = !DIFile(filename: "zephyr/subsys/settings/src/settings.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !105, line: 40, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !105, line: 35, size: 64, elements: !386)
!386 = !{!387, !389}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !385, file: !105, line: 36, baseType: !388, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !385, file: !105, line: 37, baseType: !388, size: 32, offset: 32)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !391, line: 2720, size: 160, elements: !392)
!391 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!392 = !{!393, !414, !509, !510}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !390, file: !391, line: 2722, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !395, line: 233, baseType: !396)
!395 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !395, line: 231, size: 64, elements: !397)
!397 = !{!398}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !396, file: !395, line: 232, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !400, line: 48, baseType: !401)
!400 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !400, line: 37, size: 64, elements: !402)
!402 = !{!403, !409}
!403 = !DIDerivedType(tag: DW_TAG_member, scope: !401, file: !400, line: 38, baseType: !404, size: 32)
!404 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !401, file: !400, line: 38, size: 32, elements: !405)
!405 = !{!406, !408}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !404, file: !400, line: 39, baseType: !407, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !404, file: !400, line: 40, baseType: !407, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, scope: !401, file: !400, line: 42, baseType: !410, size: 32, offset: 32)
!410 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !401, file: !400, line: 42, size: 32, elements: !411)
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !410, file: !400, line: 43, baseType: !407, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !410, file: !400, line: 44, baseType: !407, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !390, file: !391, line: 2724, baseType: !415, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !417, line: 245, size: 1024, elements: !418)
!417 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!418 = !{!419, !464, !477, !478, !479, !480, !486, !504}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !416, file: !417, line: 247, baseType: !420, size: 384)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !417, line: 57, size: 384, elements: !421)
!421 = !{!422, !436, !438, !439, !440, !451, !452, !453}
!422 = !DIDerivedType(tag: DW_TAG_member, scope: !420, file: !417, line: 60, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !420, file: !417, line: 60, size: 64, elements: !424)
!424 = !{!425, !427}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !423, file: !417, line: 61, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !400, line: 49, baseType: !401)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !423, file: !417, line: 62, baseType: !428, size: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !429, line: 49, size: 64, elements: !430)
!429 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !428, file: !429, line: 50, baseType: !432, size: 64)
!432 = !DICompositeType(tag: DW_TAG_array_type, baseType: !433, size: 64, elements: !434)
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 32)
!434 = !{!435}
!435 = !DISubrange(count: 2)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !420, file: !417, line: 68, baseType: !437, size: 32, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !420, file: !417, line: 71, baseType: !41, size: 8, offset: 96)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !420, file: !417, line: 74, baseType: !41, size: 8, offset: 104)
!440 = !DIDerivedType(tag: DW_TAG_member, scope: !420, file: !417, line: 90, baseType: !441, size: 16, offset: 112)
!441 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !420, file: !417, line: 90, size: 16, elements: !442)
!442 = !{!443, !450}
!443 = !DIDerivedType(tag: DW_TAG_member, scope: !441, file: !417, line: 91, baseType: !444, size: 16)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !441, file: !417, line: 91, size: 16, elements: !445)
!445 = !{!446, !449}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !444, file: !417, line: 96, baseType: !447, size: 8)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !448)
!448 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !444, file: !417, line: 97, baseType: !41, size: 8, offset: 8)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !441, file: !417, line: 100, baseType: !50, size: 16)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !420, file: !417, line: 107, baseType: !53, size: 32, offset: 128)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !420, file: !417, line: 127, baseType: !30, size: 32, offset: 160)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !420, file: !417, line: 131, baseType: !454, size: 192, offset: 192)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !395, line: 244, size: 192, elements: !455)
!455 = !{!456, !457, !463}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !454, file: !395, line: 245, baseType: !426, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !454, file: !395, line: 246, baseType: !458, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !395, line: 242, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !462}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !454, file: !395, line: 249, baseType: !290, size: 64, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !416, file: !417, line: 250, baseType: !465, size: 288, offset: 384)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !466, line: 25, size: 288, elements: !467)
!466 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!467 = !{!468, !469, !470, !471, !472, !473, !474, !475, !476}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !465, file: !466, line: 26, baseType: !53, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !465, file: !466, line: 27, baseType: !53, size: 32, offset: 32)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !465, file: !466, line: 28, baseType: !53, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !465, file: !466, line: 29, baseType: !53, size: 32, offset: 96)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !465, file: !466, line: 30, baseType: !53, size: 32, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !465, file: !466, line: 31, baseType: !53, size: 32, offset: 160)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !465, file: !466, line: 32, baseType: !53, size: 32, offset: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !465, file: !466, line: 33, baseType: !53, size: 32, offset: 224)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !465, file: !466, line: 34, baseType: !53, size: 32, offset: 256)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !416, file: !417, line: 253, baseType: !30, size: 32, offset: 672)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !416, file: !417, line: 256, baseType: !394, size: 64, offset: 704)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !416, file: !417, line: 294, baseType: !62, size: 32, offset: 768)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !416, file: !417, line: 300, baseType: !481, size: 96, offset: 800)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !417, line: 149, size: 96, elements: !482)
!482 = !{!483, !484, !485}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !481, file: !417, line: 153, baseType: !22, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !481, file: !417, line: 162, baseType: !36, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !481, file: !417, line: 168, baseType: !36, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !416, file: !417, line: 325, baseType: !487, size: 32, offset: 896)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !391, line: 5073, size: 160, elements: !489)
!489 = !{!490, !499, !500}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !488, file: !391, line: 5074, baseType: !491, size: 96)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !492, line: 56, size: 96, elements: !493)
!492 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!493 = !{!494, !497, !498}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !491, file: !492, line: 57, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 32)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !492, line: 57, flags: DIFlagFwdDecl)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !491, file: !492, line: 58, baseType: !30, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !491, file: !492, line: 59, baseType: !36, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !488, file: !391, line: 5075, baseType: !394, size: 64, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !488, file: !391, line: 5076, baseType: !501, offset: 160)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !502, line: 43, elements: !503)
!502 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!503 = !{}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !416, file: !417, line: 343, baseType: !505, size: 64, offset: 928)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !466, line: 60, size: 64, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !505, file: !466, line: 63, baseType: !53, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !505, file: !466, line: 66, baseType: !53, size: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !390, file: !391, line: 2727, baseType: !53, size: 32, offset: 96)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !390, file: !391, line: 2730, baseType: !62, size: 32, offset: 128)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "settings_subsys_initialized", scope: !513, file: !516, line: 19, type: !245, isLocal: false, isDefinition: true)
!513 = distinct !DICompileUnit(language: DW_LANG_C99, file: !514, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, retainedTypes: !197, globals: !515, splitDebugInlining: false, nameTableKind: None)
!514 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/settings/src/settings_init.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings")
!515 = !{!511}
!516 = !DIFile(filename: "zephyr/subsys/settings/src/settings_init.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!517 = !DIGlobalVariableExpression(var: !518, expr: !DIExpression())
!518 = distinct !DIGlobalVariable(name: "static_regions", scope: !519, file: !526, line: 62, type: !648, isLocal: true, isDefinition: true)
!519 = distinct !DICompileUnit(language: DW_LANG_C99, file: !520, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, retainedTypes: !521, globals: !522, splitDebugInlining: false, nameTableKind: None)
!520 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings")
!521 = !{!36, !62, !53, !30}
!522 = !{!523, !517}
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !525, file: !526, line: 198, type: !634, isLocal: true, isDefinition: true)
!525 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !526, file: !526, line: 175, type: !527, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !519, retainedNodes: !629)
!526 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!527 = !DISubroutineType(types: !528)
!528 = !{null, !529}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !417, line: 245, size: 1024, elements: !531)
!531 = !{!532, !590, !602, !603, !604, !605, !611, !624}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !530, file: !417, line: 247, baseType: !533, size: 384)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !417, line: 57, size: 384, elements: !534)
!534 = !{!535, !559, !566, !567, !568, !577, !578, !579}
!535 = !DIDerivedType(tag: DW_TAG_member, scope: !533, file: !417, line: 60, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !533, file: !417, line: 60, size: 64, elements: !537)
!537 = !{!538, !553}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !536, file: !417, line: 61, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !400, line: 49, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !400, line: 37, size: 64, elements: !541)
!541 = !{!542, !548}
!542 = !DIDerivedType(tag: DW_TAG_member, scope: !540, file: !400, line: 38, baseType: !543, size: 32)
!543 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !540, file: !400, line: 38, size: 32, elements: !544)
!544 = !{!545, !547}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !543, file: !400, line: 39, baseType: !546, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !543, file: !400, line: 40, baseType: !546, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, scope: !540, file: !400, line: 42, baseType: !549, size: 32, offset: 32)
!549 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !540, file: !400, line: 42, size: 32, elements: !550)
!550 = !{!551, !552}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !549, file: !400, line: 43, baseType: !546, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !549, file: !400, line: 44, baseType: !546, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !536, file: !417, line: 62, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !429, line: 49, size: 64, elements: !555)
!555 = !{!556}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !554, file: !429, line: 50, baseType: !557, size: 64)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 64, elements: !434)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !533, file: !417, line: 68, baseType: !560, size: 32, offset: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !395, line: 233, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !395, line: 231, size: 64, elements: !563)
!563 = !{!564}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !562, file: !395, line: 232, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !400, line: 48, baseType: !540)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !533, file: !417, line: 71, baseType: !41, size: 8, offset: 96)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !533, file: !417, line: 74, baseType: !41, size: 8, offset: 104)
!568 = !DIDerivedType(tag: DW_TAG_member, scope: !533, file: !417, line: 90, baseType: !569, size: 16, offset: 112)
!569 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !533, file: !417, line: 90, size: 16, elements: !570)
!570 = !{!571, !576}
!571 = !DIDerivedType(tag: DW_TAG_member, scope: !569, file: !417, line: 91, baseType: !572, size: 16)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !569, file: !417, line: 91, size: 16, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !572, file: !417, line: 96, baseType: !447, size: 8)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !572, file: !417, line: 97, baseType: !41, size: 8, offset: 8)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !569, file: !417, line: 100, baseType: !50, size: 16)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !533, file: !417, line: 107, baseType: !53, size: 32, offset: 128)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !533, file: !417, line: 127, baseType: !30, size: 32, offset: 160)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !533, file: !417, line: 131, baseType: !580, size: 192, offset: 192)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !395, line: 244, size: 192, elements: !581)
!581 = !{!582, !583, !589}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !580, file: !395, line: 245, baseType: !539, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !580, file: !395, line: 246, baseType: !584, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !395, line: 242, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !588}
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !580, file: !395, line: 249, baseType: !290, size: 64, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !530, file: !417, line: 250, baseType: !591, size: 288, offset: 384)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !466, line: 25, size: 288, elements: !592)
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !591, file: !466, line: 26, baseType: !53, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !591, file: !466, line: 27, baseType: !53, size: 32, offset: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !591, file: !466, line: 28, baseType: !53, size: 32, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !591, file: !466, line: 29, baseType: !53, size: 32, offset: 96)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !591, file: !466, line: 30, baseType: !53, size: 32, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !591, file: !466, line: 31, baseType: !53, size: 32, offset: 160)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !591, file: !466, line: 32, baseType: !53, size: 32, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !591, file: !466, line: 33, baseType: !53, size: 32, offset: 224)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !591, file: !466, line: 34, baseType: !53, size: 32, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !530, file: !417, line: 253, baseType: !30, size: 32, offset: 672)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !530, file: !417, line: 256, baseType: !561, size: 64, offset: 704)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !530, file: !417, line: 294, baseType: !62, size: 32, offset: 768)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !530, file: !417, line: 300, baseType: !606, size: 96, offset: 800)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !417, line: 149, size: 96, elements: !607)
!607 = !{!608, !609, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !606, file: !417, line: 153, baseType: !22, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !606, file: !417, line: 162, baseType: !36, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !606, file: !417, line: 168, baseType: !36, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !530, file: !417, line: 325, baseType: !612, size: 32, offset: 896)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !391, line: 5073, size: 160, elements: !614)
!614 = !{!615, !621, !622}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !613, file: !391, line: 5074, baseType: !616, size: 96)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !492, line: 56, size: 96, elements: !617)
!617 = !{!618, !619, !620}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !616, file: !492, line: 57, baseType: !495, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !616, file: !492, line: 58, baseType: !30, size: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !616, file: !492, line: 59, baseType: !36, size: 32, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !613, file: !391, line: 5075, baseType: !561, size: 64, offset: 96)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !613, file: !391, line: 5076, baseType: !623, offset: 160)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !502, line: 43, elements: !503)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !530, file: !417, line: 343, baseType: !625, size: 64, offset: 928)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !466, line: 60, size: 64, elements: !626)
!626 = !{!627, !628}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !625, file: !466, line: 63, baseType: !53, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !625, file: !466, line: 66, baseType: !53, size: 32, offset: 32)
!629 = !{!630, !631, !632, !633}
!630 = !DILocalVariable(name: "thread", arg: 1, scope: !525, file: !526, line: 175, type: !529)
!631 = !DILocalVariable(name: "region_num", scope: !525, file: !526, line: 200, type: !41)
!632 = !DILocalVariable(name: "guard_start", scope: !525, file: !526, line: 265, type: !22)
!633 = !DILocalVariable(name: "guard_size", scope: !525, file: !526, line: 266, type: !36)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !635, size: 96, elements: !646)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !636, line: 52, size: 96, elements: !637)
!636 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!637 = !{!638, !639, !640}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !635, file: !636, line: 53, baseType: !22, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !635, file: !636, line: 54, baseType: !36, size: 32, offset: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !635, file: !636, line: 55, baseType: !641, size: 32, offset: 64)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !642, line: 151, baseType: !643)
!642 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !642, line: 149, size: 32, elements: !644)
!644 = !{!645}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !643, file: !642, line: 150, baseType: !53, size: 32)
!646 = !{!647}
!647 = !DISubrange(count: 1)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 96, elements: !646)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !635)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !652, file: !685, line: 39, type: !41, isLocal: true, isDefinition: true)
!652 = distinct !DICompileUnit(language: DW_LANG_C99, file: !653, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, retainedTypes: !654, globals: !684, splitDebugInlining: false, nameTableKind: None)
!653 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings")
!654 = !{!655, !30, !62, !672, !41}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !657, line: 1226, baseType: !658)
!657 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !657, line: 1213, size: 352, elements: !659)
!659 = !{!660, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !658, file: !657, line: 1215, baseType: !661, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !658, file: !657, line: 1216, baseType: !214, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !658, file: !657, line: 1217, baseType: !214, size: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !658, file: !657, line: 1218, baseType: !214, size: 32, offset: 96)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !658, file: !657, line: 1219, baseType: !214, size: 32, offset: 128)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !658, file: !657, line: 1220, baseType: !214, size: 32, offset: 160)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !658, file: !657, line: 1221, baseType: !214, size: 32, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !658, file: !657, line: 1222, baseType: !214, size: 32, offset: 224)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !658, file: !657, line: 1223, baseType: !214, size: 32, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !658, file: !657, line: 1224, baseType: !214, size: 32, offset: 288)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !658, file: !657, line: 1225, baseType: !214, size: 32, offset: 320)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !675, line: 27, size: 96, elements: !676)
!675 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!676 = !{!677, !678, !679}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !674, file: !675, line: 29, baseType: !53, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !674, file: !675, line: 31, baseType: !75, size: 32, offset: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !674, file: !675, line: 37, baseType: !680, size: 32, offset: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !642, line: 146, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !642, line: 141, size: 32, elements: !682)
!682 = !{!683}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !681, file: !642, line: 143, baseType: !53, size: 32)
!684 = !{!650}
!685 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !688, file: !695, line: 21, type: !200, isLocal: true, isDefinition: true)
!688 = distinct !DICompileUnit(language: DW_LANG_C99, file: !689, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, retainedTypes: !690, globals: !694, splitDebugInlining: false, nameTableKind: None)
!689 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings")
!690 = !{!691, !62, !30}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !693, line: 22, baseType: !62)
!693 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!694 = !{!686}
!695 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !698, file: !703, line: 13, type: !720, isLocal: true, isDefinition: true)
!698 = distinct !DICompileUnit(language: DW_LANG_C99, file: !699, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !700, splitDebugInlining: false, nameTableKind: None)
!699 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings")
!700 = !{!701, !696}
!701 = !DIGlobalVariableExpression(var: !702, expr: !DIExpression())
!702 = distinct !DIGlobalVariable(name: "mpu_config", scope: !698, file: !703, line: 37, type: !704, isLocal: false, isDefinition: true)
!703 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!704 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !675, line: 41, size: 64, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !705, file: !675, line: 43, baseType: !53, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !705, file: !675, line: 45, baseType: !709, size: 32, offset: 32)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !675, line: 27, size: 96, elements: !712)
!712 = !{!713, !714, !715}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !711, file: !675, line: 29, baseType: !53, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !711, file: !675, line: 31, baseType: !75, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !711, file: !675, line: 37, baseType: !716, size: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !642, line: 146, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !642, line: 141, size: 32, elements: !718)
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !717, file: !642, line: 143, baseType: !53, size: 32)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !710, size: 192, elements: !434)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !723, file: !827, line: 72, type: !910, isLocal: true, isDefinition: true)
!723 = distinct !DICompileUnit(language: DW_LANG_C99, file: !724, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !725, retainedTypes: !813, globals: !824, splitDebugInlining: false, nameTableKind: None)
!724 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings")
!725 = !{!127, !726}
!726 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !210, line: 65, baseType: !62, size: 32, elements: !727)
!727 = !{!728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812}
!728 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!729 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!730 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!731 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!732 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!733 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!734 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!735 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!736 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!737 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!738 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!739 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!740 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!741 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!742 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!743 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!744 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!745 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!746 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!747 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!748 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!749 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!750 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!751 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!752 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!753 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!754 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!755 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!756 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!757 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!758 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!759 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!760 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!761 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!762 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!763 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!764 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!765 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!766 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!767 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!768 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!769 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!770 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!771 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!772 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!773 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!774 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!775 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!776 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!777 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!778 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!779 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!780 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!781 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!782 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!783 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!784 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!785 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!786 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!787 = !DIEnumerator(name: "TIM6_IRQn", value: 54)
!788 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!789 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!790 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!791 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!792 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!793 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!794 = !DIEnumerator(name: "DFSDM1_FLT0_IRQn", value: 61)
!795 = !DIEnumerator(name: "DFSDM1_FLT1_IRQn", value: 62)
!796 = !DIEnumerator(name: "CAN2_TX_IRQn", value: 63)
!797 = !DIEnumerator(name: "CAN2_RX0_IRQn", value: 64)
!798 = !DIEnumerator(name: "CAN2_RX1_IRQn", value: 65)
!799 = !DIEnumerator(name: "CAN2_SCE_IRQn", value: 66)
!800 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!801 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!802 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!803 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!804 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!805 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!806 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!807 = !DIEnumerator(name: "RNG_IRQn", value: 80)
!808 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!809 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!810 = !DIEnumerator(name: "SPI5_IRQn", value: 85)
!811 = !DIEnumerator(name: "FMPI2C1_EV_IRQn", value: 95)
!812 = !DIEnumerator(name: "FMPI2C1_ER_IRQn", value: 96)
!813 = !{!36, !62, !30, !814}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !210, line: 364, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 356, size: 192, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !816, file: !210, line: 358, baseType: !214, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !816, file: !210, line: 359, baseType: !214, size: 32, offset: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !816, file: !210, line: 360, baseType: !214, size: 32, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !816, file: !210, line: 361, baseType: !214, size: 32, offset: 96)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !816, file: !210, line: 362, baseType: !214, size: 32, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !816, file: !210, line: 363, baseType: !214, size: 32, offset: 160)
!824 = !{!825, !831, !847, !858, !875, !721, !877, !890, !892, !894, !896, !898, !900, !902, !904, !906, !908}
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_35", scope: !723, file: !827, line: 424, type: !828, isLocal: false, isDefinition: true, align: 16)
!827 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 64, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 4)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "__device_dts_ord_35", scope: !723, file: !827, line: 424, type: !833, isLocal: false, isDefinition: true, align: 32)
!833 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !234, line: 378, size: 192, elements: !835)
!835 = !{!836, !837, !838, !839, !845, !846}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !834, file: !234, line: 380, baseType: !75, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !834, file: !234, line: 382, baseType: !13, size: 32, offset: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !834, file: !234, line: 384, baseType: !13, size: 32, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !834, file: !234, line: 386, baseType: !840, size: 32, offset: 96)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !234, line: 351, size: 16, elements: !842)
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !841, file: !234, line: 359, baseType: !41, size: 8)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !841, file: !234, line: 364, baseType: !245, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !834, file: !234, line: 388, baseType: !30, size: 32, offset: 128)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !834, file: !234, line: 396, baseType: !248, size: 32, offset: 160)
!847 = !DIGlobalVariableExpression(var: !848, expr: !DIExpression())
!848 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_35", scope: !723, file: !827, line: 424, type: !849, isLocal: true, isDefinition: true, align: 32)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !850)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !225, line: 51, size: 64, elements: !851)
!851 = !{!852, !857}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !850, file: !225, line: 60, baseType: !853, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 32)
!854 = !DISubroutineType(types: !855)
!855 = !{!62, !856}
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !850, file: !225, line: 65, baseType: !856, size: 32, offset: 32)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "exti_data", scope: !723, file: !827, line: 423, type: !860, isLocal: true, isDefinition: true)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !827, line: 107, size: 1472, elements: !861)
!861 = !{!862}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !860, file: !827, line: 109, baseType: !863, size: 1472)
!863 = !DICompositeType(tag: DW_TAG_array_type, baseType: !864, size: 1472, elements: !873)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !827, line: 101, size: 64, elements: !865)
!865 = !{!866, !872}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !864, file: !827, line: 102, baseType: !867, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !868, line: 63, baseType: !869)
!868 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 32)
!870 = !DISubroutineType(types: !871)
!871 = !{null, !62, !30}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !864, file: !827, line: 103, baseType: !30, size: 32, offset: 32)
!873 = !{!874}
!874 = !DISubrange(count: 23)
!875 = !DIGlobalVariableExpression(var: !876, expr: !DIExpression())
!876 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_35", scope: !723, file: !827, line: 424, type: !841, isLocal: true, isDefinition: true, align: 8)
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !879, file: !827, line: 493, type: !884, isLocal: true, isDefinition: true, align: 32)
!879 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !827, file: !827, line: 460, type: !880, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !723, retainedNodes: !882)
!880 = !DISubroutineType(types: !881)
!881 = !{null, !856}
!882 = !{!883}
!883 = !DILocalVariable(name: "dev", arg: 1, scope: !879, file: !827, line: 460, type: !856)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !885)
!885 = !{!886, !887, !888, !889}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !884, file: !10, line: 55, baseType: !61, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !884, file: !10, line: 57, baseType: !61, size: 32, offset: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !884, file: !10, line: 59, baseType: !30, size: 32, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !884, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !879, file: !827, line: 497, type: !884, isLocal: true, isDefinition: true, align: 32)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !879, file: !827, line: 507, type: !884, isLocal: true, isDefinition: true, align: 32)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !879, file: !827, line: 512, type: !884, isLocal: true, isDefinition: true, align: 32)
!896 = !DIGlobalVariableExpression(var: !897, expr: !DIExpression())
!897 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !879, file: !827, line: 516, type: !884, isLocal: true, isDefinition: true, align: 32)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !879, file: !827, line: 523, type: !884, isLocal: true, isDefinition: true, align: 32)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !879, file: !827, line: 527, type: !884, isLocal: true, isDefinition: true, align: 32)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !879, file: !827, line: 581, type: !884, isLocal: true, isDefinition: true, align: 32)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !879, file: !827, line: 586, type: !884, isLocal: true, isDefinition: true, align: 32)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !879, file: !827, line: 591, type: !884, isLocal: true, isDefinition: true, align: 32)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !879, file: !827, line: 595, type: !884, isLocal: true, isDefinition: true, align: 32)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !911, size: 736, elements: !873)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !210, line: 154, baseType: !726)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_35", scope: !915, file: !920, line: 22, type: !944, isLocal: false, isDefinition: true, align: 16)
!915 = distinct !DICompileUnit(language: DW_LANG_C99, file: !916, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !917, splitDebugInlining: false, nameTableKind: None)
!916 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings")
!917 = !{!918, !913, !924, !926, !928, !930, !932, !934, !936, !938, !940, !942}
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !915, file: !920, line: 17, type: !921, isLocal: false, isDefinition: true, align: 16)
!920 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings")
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 192, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 12)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_79", scope: !915, file: !920, line: 29, type: !828, isLocal: false, isDefinition: true, align: 16)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_78", scope: !915, file: !920, line: 36, type: !828, isLocal: false, isDefinition: true, align: 16)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_77", scope: !915, file: !920, line: 43, type: !828, isLocal: false, isDefinition: true, align: 16)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_76", scope: !915, file: !920, line: 50, type: !828, isLocal: false, isDefinition: true, align: 16)
!932 = !DIGlobalVariableExpression(var: !933, expr: !DIExpression())
!933 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_75", scope: !915, file: !920, line: 57, type: !828, isLocal: false, isDefinition: true, align: 16)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_22", scope: !915, file: !920, line: 64, type: !828, isLocal: false, isDefinition: true, align: 16)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_24", scope: !915, file: !920, line: 71, type: !828, isLocal: false, isDefinition: true, align: 16)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !915, file: !920, line: 78, type: !828, isLocal: false, isDefinition: true, align: 16)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_44", scope: !915, file: !920, line: 85, type: !828, isLocal: false, isDefinition: true, align: 16)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_59", scope: !915, file: !920, line: 90, type: !944, isLocal: false, isDefinition: true, align: 16)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 48, elements: !945)
!945 = !{!946}
!946 = !DISubrange(count: 3)
!947 = !DIGlobalVariableExpression(var: !948, expr: !DIExpression())
!948 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !949, file: !1011, line: 398, type: !1044, isLocal: true, isDefinition: true)
!949 = distinct !DICompileUnit(language: DW_LANG_C99, file: !950, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !951, retainedTypes: !964, globals: !1008, splitDebugInlining: false, nameTableKind: None)
!950 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_argonkey/settings")
!951 = !{!952, !127, !957}
!952 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !953, line: 197, baseType: !38, size: 32, elements: !954)
!953 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!954 = !{!955, !956}
!955 = !DIEnumerator(name: "SUCCESS", value: 0)
!956 = !DIEnumerator(name: "ERROR", value: 1)
!957 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !958, line: 44, baseType: !38, size: 32, elements: !959)
!958 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!959 = !{!960, !961, !962, !963}
!960 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!961 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!962 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!963 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!964 = !{!30, !62, !53, !965, !1001, !1007}
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !210, line: 510, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 477, size: 1216, elements: !968)
!968 = !{!969, !970, !971, !972, !973, !974, !975, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !967, file: !210, line: 479, baseType: !214, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !967, file: !210, line: 480, baseType: !214, size: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !967, file: !210, line: 481, baseType: !214, size: 32, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !967, file: !210, line: 482, baseType: !214, size: 32, offset: 96)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !967, file: !210, line: 483, baseType: !214, size: 32, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !967, file: !210, line: 484, baseType: !214, size: 32, offset: 160)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !967, file: !210, line: 485, baseType: !976, size: 64, offset: 192)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 64, elements: !434)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !967, file: !210, line: 486, baseType: !214, size: 32, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !967, file: !210, line: 487, baseType: !214, size: 32, offset: 288)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !967, file: !210, line: 488, baseType: !976, size: 64, offset: 320)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !967, file: !210, line: 489, baseType: !214, size: 32, offset: 384)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !967, file: !210, line: 490, baseType: !214, size: 32, offset: 416)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !967, file: !210, line: 491, baseType: !976, size: 64, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !967, file: !210, line: 492, baseType: !214, size: 32, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !967, file: !210, line: 493, baseType: !214, size: 32, offset: 544)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !967, file: !210, line: 494, baseType: !976, size: 64, offset: 576)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !967, file: !210, line: 495, baseType: !214, size: 32, offset: 640)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !967, file: !210, line: 496, baseType: !214, size: 32, offset: 672)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !967, file: !210, line: 497, baseType: !976, size: 64, offset: 704)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !967, file: !210, line: 498, baseType: !214, size: 32, offset: 768)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !967, file: !210, line: 499, baseType: !214, size: 32, offset: 800)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !967, file: !210, line: 500, baseType: !976, size: 64, offset: 832)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !967, file: !210, line: 501, baseType: !214, size: 32, offset: 896)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !967, file: !210, line: 502, baseType: !214, size: 32, offset: 928)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !967, file: !210, line: 503, baseType: !976, size: 64, offset: 960)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !967, file: !210, line: 504, baseType: !214, size: 32, offset: 1024)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !967, file: !210, line: 505, baseType: !214, size: 32, offset: 1056)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !967, file: !210, line: 506, baseType: !53, size: 32, offset: 1088)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !967, file: !210, line: 507, baseType: !214, size: 32, offset: 1120)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "CKGATENR", scope: !967, file: !210, line: 508, baseType: !214, size: 32, offset: 1152)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR2", scope: !967, file: !210, line: 509, baseType: !214, size: 32, offset: 1184)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 32)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !1003, line: 343, size: 64, elements: !1004)
!1003 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1004 = !{!1005, !1006}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !1002, file: !1003, line: 344, baseType: !53, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !1002, file: !1003, line: 345, baseType: !53, size: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 32)
!1008 = !{!1009, !1015, !1031, !1042, !947}
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !949, file: !1011, line: 752, type: !1012, isLocal: false, isDefinition: true, align: 16)
!1011 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !249, size: 848, elements: !1013)
!1013 = !{!1014}
!1014 = !DISubrange(count: 53)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "__device_dts_ord_8", scope: !949, file: !1011, line: 752, type: !1017, isLocal: false, isDefinition: true, align: 32)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !234, line: 378, size: 192, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1029, !1030}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1018, file: !234, line: 380, baseType: !75, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1018, file: !234, line: 382, baseType: !13, size: 32, offset: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1018, file: !234, line: 384, baseType: !13, size: 32, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1018, file: !234, line: 386, baseType: !1024, size: 32, offset: 96)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 32)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !234, line: 351, size: 16, elements: !1026)
!1026 = !{!1027, !1028}
