; ModuleID = 'build/adafruit_feather_m0_basic_proto/sensor/fxas21002/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_sem = type { %struct._wait_q_t, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon, i8*, i32 }
%union.anon = type { i32 }
%struct.mpsc_pbuf_buffer.21 = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon }
%struct.mpsc_pbuf_buffer_config.22 = type { i32*, i32, void (%struct.mpsc_pbuf_buffer.21*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/sensor/fxas21002/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/sensor/fxas21002")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/sensor/fxas21002")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "sem", scope: !27, file: !278, line: 11, type: !279, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !200, globals: !277, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/sensor/fxas21002/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/sensor/fxas21002")
!29 = !{!30, !101, !165, !185}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_channel", file: !102, line: 53, baseType: !32, size: 32, elements: !103)
!102 = !DIFile(filename: "zephyr/include/zephyr/drivers/sensor.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164}
!104 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_X", value: 0)
!105 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_Y", value: 1)
!106 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_Z", value: 2)
!107 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_XYZ", value: 3)
!108 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_X", value: 4)
!109 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_Y", value: 5)
!110 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_Z", value: 6)
!111 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_XYZ", value: 7)
!112 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_X", value: 8)
!113 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_Y", value: 9)
!114 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_Z", value: 10)
!115 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_XYZ", value: 11)
!116 = !DIEnumerator(name: "SENSOR_CHAN_DIE_TEMP", value: 12)
!117 = !DIEnumerator(name: "SENSOR_CHAN_AMBIENT_TEMP", value: 13)
!118 = !DIEnumerator(name: "SENSOR_CHAN_PRESS", value: 14)
!119 = !DIEnumerator(name: "SENSOR_CHAN_PROX", value: 15)
!120 = !DIEnumerator(name: "SENSOR_CHAN_HUMIDITY", value: 16)
!121 = !DIEnumerator(name: "SENSOR_CHAN_LIGHT", value: 17)
!122 = !DIEnumerator(name: "SENSOR_CHAN_IR", value: 18)
!123 = !DIEnumerator(name: "SENSOR_CHAN_RED", value: 19)
!124 = !DIEnumerator(name: "SENSOR_CHAN_GREEN", value: 20)
!125 = !DIEnumerator(name: "SENSOR_CHAN_BLUE", value: 21)
!126 = !DIEnumerator(name: "SENSOR_CHAN_ALTITUDE", value: 22)
!127 = !DIEnumerator(name: "SENSOR_CHAN_PM_1_0", value: 23)
!128 = !DIEnumerator(name: "SENSOR_CHAN_PM_2_5", value: 24)
!129 = !DIEnumerator(name: "SENSOR_CHAN_PM_10", value: 25)
!130 = !DIEnumerator(name: "SENSOR_CHAN_DISTANCE", value: 26)
!131 = !DIEnumerator(name: "SENSOR_CHAN_CO2", value: 27)
!132 = !DIEnumerator(name: "SENSOR_CHAN_VOC", value: 28)
!133 = !DIEnumerator(name: "SENSOR_CHAN_GAS_RES", value: 29)
!134 = !DIEnumerator(name: "SENSOR_CHAN_VOLTAGE", value: 30)
!135 = !DIEnumerator(name: "SENSOR_CHAN_CURRENT", value: 31)
!136 = !DIEnumerator(name: "SENSOR_CHAN_POWER", value: 32)
!137 = !DIEnumerator(name: "SENSOR_CHAN_RESISTANCE", value: 33)
!138 = !DIEnumerator(name: "SENSOR_CHAN_ROTATION", value: 34)
!139 = !DIEnumerator(name: "SENSOR_CHAN_POS_DX", value: 35)
!140 = !DIEnumerator(name: "SENSOR_CHAN_POS_DY", value: 36)
!141 = !DIEnumerator(name: "SENSOR_CHAN_POS_DZ", value: 37)
!142 = !DIEnumerator(name: "SENSOR_CHAN_RPM", value: 38)
!143 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_VOLTAGE", value: 39)
!144 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_AVG_CURRENT", value: 40)
!145 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STDBY_CURRENT", value: 41)
!146 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_MAX_LOAD_CURRENT", value: 42)
!147 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TEMP", value: 43)
!148 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STATE_OF_CHARGE", value: 44)
!149 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_FULL_CHARGE_CAPACITY", value: 45)
!150 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_REMAINING_CHARGE_CAPACITY", value: 46)
!151 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_NOM_AVAIL_CAPACITY", value: 47)
!152 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_FULL_AVAIL_CAPACITY", value: 48)
!153 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_AVG_POWER", value: 49)
!154 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STATE_OF_HEALTH", value: 50)
!155 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TIME_TO_EMPTY", value: 51)
!156 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TIME_TO_FULL", value: 52)
!157 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_CYCLE_COUNT", value: 53)
!158 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIGN_VOLTAGE", value: 54)
!159 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIRED_VOLTAGE", value: 55)
!160 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIRED_CHARGING_CURRENT", value: 56)
!161 = !DIEnumerator(name: "SENSOR_CHAN_ALL", value: 57)
!162 = !DIEnumerator(name: "SENSOR_CHAN_COMMON_COUNT", value: 58)
!163 = !DIEnumerator(name: "SENSOR_CHAN_PRIV_START", value: 58)
!164 = !DIEnumerator(name: "SENSOR_CHAN_MAX", value: 32767)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_attribute", file: !102, line: 274, baseType: !32, size: 32, elements: !166)
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184}
!167 = !DIEnumerator(name: "SENSOR_ATTR_SAMPLING_FREQUENCY", value: 0)
!168 = !DIEnumerator(name: "SENSOR_ATTR_LOWER_THRESH", value: 1)
!169 = !DIEnumerator(name: "SENSOR_ATTR_UPPER_THRESH", value: 2)
!170 = !DIEnumerator(name: "SENSOR_ATTR_SLOPE_TH", value: 3)
!171 = !DIEnumerator(name: "SENSOR_ATTR_SLOPE_DUR", value: 4)
!172 = !DIEnumerator(name: "SENSOR_ATTR_HYSTERESIS", value: 5)
!173 = !DIEnumerator(name: "SENSOR_ATTR_OVERSAMPLING", value: 6)
!174 = !DIEnumerator(name: "SENSOR_ATTR_FULL_SCALE", value: 7)
!175 = !DIEnumerator(name: "SENSOR_ATTR_OFFSET", value: 8)
!176 = !DIEnumerator(name: "SENSOR_ATTR_CALIB_TARGET", value: 9)
!177 = !DIEnumerator(name: "SENSOR_ATTR_CONFIGURATION", value: 10)
!178 = !DIEnumerator(name: "SENSOR_ATTR_CALIBRATION", value: 11)
!179 = !DIEnumerator(name: "SENSOR_ATTR_FEATURE_MASK", value: 12)
!180 = !DIEnumerator(name: "SENSOR_ATTR_ALERT", value: 13)
!181 = !DIEnumerator(name: "SENSOR_ATTR_FF_DUR", value: 14)
!182 = !DIEnumerator(name: "SENSOR_ATTR_COMMON_COUNT", value: 15)
!183 = !DIEnumerator(name: "SENSOR_ATTR_PRIV_START", value: 15)
!184 = !DIEnumerator(name: "SENSOR_ATTR_MAX", value: 32767)
!185 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_trigger_type", file: !102, line: 203, baseType: !32, size: 32, elements: !186)
!186 = !{!187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199}
!187 = !DIEnumerator(name: "SENSOR_TRIG_TIMER", value: 0)
!188 = !DIEnumerator(name: "SENSOR_TRIG_DATA_READY", value: 1)
!189 = !DIEnumerator(name: "SENSOR_TRIG_DELTA", value: 2)
!190 = !DIEnumerator(name: "SENSOR_TRIG_NEAR_FAR", value: 3)
!191 = !DIEnumerator(name: "SENSOR_TRIG_THRESHOLD", value: 4)
!192 = !DIEnumerator(name: "SENSOR_TRIG_TAP", value: 5)
!193 = !DIEnumerator(name: "SENSOR_TRIG_DOUBLE_TAP", value: 6)
!194 = !DIEnumerator(name: "SENSOR_TRIG_FREEFALL", value: 7)
!195 = !DIEnumerator(name: "SENSOR_TRIG_MOTION", value: 8)
!196 = !DIEnumerator(name: "SENSOR_TRIG_STATIONARY", value: 9)
!197 = !DIEnumerator(name: "SENSOR_TRIG_COMMON_COUNT", value: 10)
!198 = !DIEnumerator(name: "SENSOR_TRIG_PRIV_START", value: 10)
!199 = !DIEnumerator(name: "SENSOR_TRIG_MAX", value: 32767)
!200 = !{!201, !202, !203}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!202 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_driver_api", file: !102, line: 397, size: 160, elements: !206)
!206 = !{!207, !246, !252, !267, !272}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "attr_set", scope: !205, file: !102, line: 398, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_attr_set_t", file: !102, line: 354, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DISubroutineType(types: !211)
!211 = !{!202, !212, !101, !165, !239}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !215, line: 378, size: 192, elements: !216)
!215 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!216 = !{!217, !221, !222, !223, !232, !233}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !214, file: !215, line: 380, baseType: !218, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !220)
!220 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !214, file: !215, line: 382, baseType: !13, size: 32, offset: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !214, file: !215, line: 384, baseType: !13, size: 32, offset: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !214, file: !215, line: 386, baseType: !224, size: 32, offset: 96)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !215, line: 351, size: 16, elements: !226)
!226 = !{!227, !230}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !225, file: !215, line: 359, baseType: !228, size: 8)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !229)
!229 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !225, file: !215, line: 364, baseType: !231, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!231 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !214, file: !215, line: 388, baseType: !201, size: 32, offset: 128)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !214, file: !215, line: 396, baseType: !234, size: 32, offset: 160)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !215, line: 43, baseType: !237)
!237 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !238)
!238 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_value", file: !102, line: 43, size: 64, elements: !242)
!242 = !{!243, !245}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !241, file: !102, line: 45, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !202)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !241, file: !102, line: 47, baseType: !244, size: 32, offset: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "attr_get", scope: !205, file: !102, line: 399, baseType: !247, size: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_attr_get_t", file: !102, line: 365, baseType: !248)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DISubroutineType(types: !250)
!250 = !{!202, !212, !101, !165, !251}
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "trigger_set", scope: !205, file: !102, line: 400, baseType: !253, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_trigger_set_t", file: !102, line: 376, baseType: !254)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DISubroutineType(types: !256)
!256 = !{!202, !212, !257, !263}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_trigger", file: !102, line: 264, size: 64, elements: !260)
!260 = !{!261, !262}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !259, file: !102, line: 266, baseType: !185, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "chan", scope: !259, file: !102, line: 268, baseType: !101, size: 32, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_trigger_handler_t", file: !102, line: 345, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !212, !257}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fetch", scope: !205, file: !102, line: 401, baseType: !268, size: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_sample_fetch_t", file: !102, line: 385, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DISubroutineType(types: !271)
!271 = !{!202, !212, !101}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "channel_get", scope: !205, file: !102, line: 402, baseType: !273, size: 32, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_channel_get_t", file: !102, line: 393, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DISubroutineType(types: !276)
!276 = !{!202, !212, !101, !251}
!277 = !{!25}
!278 = !DIFile(filename: "zephyr/samples/sensor/fxas21002/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !280, line: 2909, size: 128, elements: !281)
!280 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!281 = !{!282, !303, !304}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !279, file: !280, line: 2910, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !284, line: 233, baseType: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !284, line: 231, size: 64, elements: !286)
!286 = !{!287}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !285, file: !284, line: 232, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !289, line: 48, baseType: !290)
!289 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !289, line: 37, size: 64, elements: !291)
!291 = !{!292, !298}
!292 = !DIDerivedType(tag: DW_TAG_member, scope: !290, file: !289, line: 38, baseType: !293, size: 32)
!293 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !290, file: !289, line: 38, size: 32, elements: !294)
!294 = !{!295, !297}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !293, file: !289, line: 39, baseType: !296, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !293, file: !289, line: 40, baseType: !296, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, scope: !290, file: !289, line: 42, baseType: !299, size: 32, offset: 32)
!299 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !290, file: !289, line: 42, size: 32, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !299, file: !289, line: 43, baseType: !296, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !299, file: !289, line: 44, baseType: !296, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !279, file: !280, line: 2911, baseType: !32, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !279, file: !280, line: 2912, baseType: !32, size: 32, offset: 96)
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !307, file: !379, line: 18, type: !381, isLocal: false, isDefinition: true)
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !309, retainedTypes: !316, globals: !376, splitDebugInlining: false, nameTableKind: None)
!308 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/sensor/fxas21002")
!309 = !{!310}
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !311, line: 121, baseType: !32, size: 32, elements: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = !{!313, !314, !315}
!313 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!314 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!315 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!316 = !{!22, !201, !24, !317, !319, !321, !322, !202, !324, !325, !327, !329, !330, !331, !332, !334, !346, !228, !347, !357, !218}
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!318 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !323, line: 214, baseType: !32)
!323 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !333)
!333 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !336, line: 78, size: 32, elements: !337)
!336 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!337 = !{!338, !345}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !335, file: !336, line: 80, baseType: !339, size: 32)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !336, line: 45, size: 32, elements: !340)
!340 = !{!341, !342, !343, !344}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !339, file: !336, line: 47, baseType: !228, size: 8)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !339, file: !336, line: 50, baseType: !228, size: 8, offset: 8)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !339, file: !336, line: 53, baseType: !228, size: 8, offset: 16)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !339, file: !336, line: 56, baseType: !228, size: 8, offset: 24)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !335, file: !336, line: 82, baseType: !201, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !311, line: 88, size: 128, elements: !349)
!349 = !{!350, !368, !372}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !348, file: !311, line: 89, baseType: !351, size: 96)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !311, line: 66, size: 96, elements: !352)
!352 = !{!353, !365, !366}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !351, file: !311, line: 67, baseType: !354, size: 32)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !311, line: 51, size: 32, elements: !355)
!355 = !{!356, !358, !359, !360, !361, !362, !363, !364}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !354, file: !311, line: 52, baseType: !357, size: 1, flags: DIFlagBitField, extraData: i64 0)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !354, file: !311, line: 52, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !354, file: !311, line: 52, baseType: !357, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !354, file: !311, line: 53, baseType: !357, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !354, file: !311, line: 54, baseType: !357, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !354, file: !311, line: 55, baseType: !357, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !354, file: !311, line: 56, baseType: !357, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !354, file: !311, line: 57, baseType: !357, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !351, file: !311, line: 75, baseType: !13, size: 32, offset: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !351, file: !311, line: 76, baseType: !367, size: 32, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !311, line: 35, baseType: !357)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !348, file: !311, line: 93, baseType: !369, size: 32, offset: 96)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, size: 32, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 4)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !348, file: !311, line: 94, baseType: !373, offset: 128)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !228, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: -1)
!376 = !{!305, !377}
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !307, file: !379, line: 18, type: !380, isLocal: true, isDefinition: true)
!379 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !383, line: 16, size: 64, elements: !384)
!383 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !382, file: !383, line: 17, baseType: !218, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !382, file: !383, line: 18, baseType: !228, size: 8, offset: 32)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "_char_out", scope: !389, file: !394, line: 54, type: !395, isLocal: false, isDefinition: true)
!389 = distinct !DICompileUnit(language: DW_LANG_C99, file: !390, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !391, retainedTypes: !392, globals: !393, splitDebugInlining: false, nameTableKind: None)
!390 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/sensor/fxas21002")
!391 = !{!30}
!392 = !{!201, !202}
!393 = !{!387}
!394 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!396 = !DISubroutineType(types: !397)
!397 = !{!202, !202}
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !400, file: !1134, line: 202, type: !1135, isLocal: true, isDefinition: true, align: 32)
!400 = distinct !DICompileUnit(language: DW_LANG_C99, file: !401, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !391, retainedTypes: !402, globals: !1133, splitDebugInlining: false, nameTableKind: None)
!401 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/sensor/fxas21002")
!402 = !{!201, !202, !403, !527, !864, !865, !932}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !405, line: 335, baseType: !406)
!405 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !405, line: 320, size: 288, elements: !407)
!407 = !{!408, !419, !427, !441, !452, !463, !467, !478, !479, !490, !491, !506, !507, !517}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !406, file: !405, line: 321, baseType: !409, size: 16)
!409 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !410)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !405, line: 50, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 43, size: 16, elements: !412)
!412 = !{!413, !418}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !411, file: !405, line: 48, baseType: !414, size: 16)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !411, file: !405, line: 44, size: 16, elements: !415)
!415 = !{!416, !417}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !414, file: !405, line: 45, baseType: !332, size: 7, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !414, file: !405, line: 47, baseType: !332, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !411, file: !405, line: 49, baseType: !332, size: 16)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !406, file: !405, line: 322, baseType: !420, size: 16, offset: 16)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 16, elements: !425)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !422, line: 52, baseType: !423)
!422 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !424)
!424 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !228)
!425 = !{!426}
!426 = !DISubrange(count: 2)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !406, file: !405, line: 323, baseType: !428, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !429)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !405, line: 107, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 94, size: 32, elements: !431)
!431 = !{!432, !440}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !430, file: !405, line: 105, baseType: !433, size: 32)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !430, file: !405, line: 95, size: 32, elements: !434)
!434 = !{!435, !436, !437, !438, !439}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !433, file: !405, line: 97, baseType: !357, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !433, file: !405, line: 99, baseType: !357, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !433, file: !405, line: 100, baseType: !357, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !433, file: !405, line: 102, baseType: !357, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !433, file: !405, line: 103, baseType: !357, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !430, file: !405, line: 106, baseType: !357, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !406, file: !405, line: 324, baseType: !442, size: 32, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !405, line: 155, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 148, size: 32, elements: !445)
!445 = !{!446, !451}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !444, file: !405, line: 153, baseType: !447, size: 32)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !444, file: !405, line: 149, size: 32, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !447, file: !405, line: 150, baseType: !357, size: 16, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !447, file: !405, line: 151, baseType: !357, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !444, file: !405, line: 154, baseType: !357, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !406, file: !405, line: 325, baseType: !453, size: 8, offset: 96)
!453 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !405, line: 194, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 187, size: 8, elements: !456)
!456 = !{!457, !462}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !455, file: !405, line: 192, baseType: !458, size: 8)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !455, file: !405, line: 188, size: 8, elements: !459)
!459 = !{!460, !461}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !458, file: !405, line: 189, baseType: !228, size: 1, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !458, file: !405, line: 190, baseType: !228, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !455, file: !405, line: 193, baseType: !228, size: 8)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !406, file: !405, line: 326, baseType: !464, size: 24, offset: 104)
!464 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 24, elements: !465)
!465 = !{!466}
!466 = !DISubrange(count: 3)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !406, file: !405, line: 327, baseType: !468, size: 8, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !469)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !405, line: 215, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 208, size: 8, elements: !471)
!471 = !{!472, !477}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !470, file: !405, line: 213, baseType: !473, size: 8)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !470, file: !405, line: 209, size: 8, elements: !474)
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !473, file: !405, line: 210, baseType: !228, size: 1, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !473, file: !405, line: 211, baseType: !228, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !470, file: !405, line: 214, baseType: !228, size: 8)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !406, file: !405, line: 328, baseType: !464, size: 24, offset: 136)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !406, file: !405, line: 329, baseType: !480, size: 8, offset: 160)
!480 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !405, line: 236, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 229, size: 8, elements: !483)
!483 = !{!484, !489}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !482, file: !405, line: 234, baseType: !485, size: 8)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !405, line: 230, size: 8, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !485, file: !405, line: 231, baseType: !423, size: 1, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !485, file: !405, line: 232, baseType: !423, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !482, file: !405, line: 235, baseType: !228, size: 8)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !406, file: !405, line: 330, baseType: !464, size: 24, offset: 168)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !406, file: !405, line: 331, baseType: !492, size: 16, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !405, line: 262, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 250, size: 16, elements: !495)
!495 = !{!496, !505}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !494, file: !405, line: 260, baseType: !497, size: 16)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !494, file: !405, line: 251, size: 16, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !504}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !497, file: !405, line: 252, baseType: !332, size: 1, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !497, file: !405, line: 253, baseType: !332, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !497, file: !405, line: 254, baseType: !332, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !497, file: !405, line: 255, baseType: !332, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !497, file: !405, line: 256, baseType: !332, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !497, file: !405, line: 258, baseType: !332, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !494, file: !405, line: 261, baseType: !332, size: 16)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !406, file: !405, line: 332, baseType: !420, size: 16, offset: 208)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !406, file: !405, line: 333, baseType: !508, size: 32, offset: 224)
!508 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !509)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !405, line: 290, baseType: !510)
!510 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 284, size: 32, elements: !511)
!511 = !{!512, !516}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !510, file: !405, line: 288, baseType: !513, size: 32)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !510, file: !405, line: 285, size: 32, elements: !514)
!514 = !{!515}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !513, file: !405, line: 286, baseType: !357, size: 22, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !510, file: !405, line: 289, baseType: !357, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !406, file: !405, line: 334, baseType: !518, size: 16, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !405, line: 308, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !405, line: 303, size: 16, elements: !521)
!521 = !{!522, !526}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !520, file: !405, line: 306, baseType: !523, size: 16)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !520, file: !405, line: 304, size: 16, elements: !524)
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !523, file: !405, line: 305, baseType: !332, size: 16, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !520, file: !405, line: 307, baseType: !332, size: 16)
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !529, line: 928, baseType: !530)
!529 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !529, line: 899, size: 672, elements: !531)
!531 = !{!532, !556, !580, !606, !631, !647, !648, !666, !667, !684, !695, !696, !711, !731, !732, !744, !756, !766, !767, !784, !786, !797, !798, !810, !822, !823, !834, !850}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !530, file: !529, line: 900, baseType: !533, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !529, line: 64, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 43, size: 32, elements: !536)
!536 = !{!537, !555}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !535, file: !529, line: 62, baseType: !538, size: 32)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !535, file: !529, line: 44, size: 32, elements: !539)
!539 = !{!540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !538, file: !529, line: 45, baseType: !357, size: 1, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !538, file: !529, line: 46, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !538, file: !529, line: 47, baseType: !357, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !538, file: !529, line: 48, baseType: !357, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !538, file: !529, line: 49, baseType: !357, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !538, file: !529, line: 50, baseType: !357, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !538, file: !529, line: 51, baseType: !357, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !538, file: !529, line: 52, baseType: !357, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !538, file: !529, line: 53, baseType: !357, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !538, file: !529, line: 54, baseType: !357, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !538, file: !529, line: 55, baseType: !357, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !538, file: !529, line: 56, baseType: !357, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !538, file: !529, line: 58, baseType: !357, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !538, file: !529, line: 59, baseType: !357, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !538, file: !529, line: 60, baseType: !357, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !535, file: !529, line: 63, baseType: !357, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !530, file: !529, line: 901, baseType: !557, size: 32, offset: 32)
!557 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !529, line: 125, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 104, size: 32, elements: !560)
!560 = !{!561, !579}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !559, file: !529, line: 123, baseType: !562, size: 32)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !559, file: !529, line: 105, size: 32, elements: !563)
!563 = !{!564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !562, file: !529, line: 106, baseType: !357, size: 1, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !562, file: !529, line: 107, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !562, file: !529, line: 108, baseType: !357, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !562, file: !529, line: 109, baseType: !357, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !562, file: !529, line: 110, baseType: !357, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !562, file: !529, line: 111, baseType: !357, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !562, file: !529, line: 112, baseType: !357, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !562, file: !529, line: 113, baseType: !357, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !562, file: !529, line: 114, baseType: !357, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !562, file: !529, line: 115, baseType: !357, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !562, file: !529, line: 116, baseType: !357, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !562, file: !529, line: 117, baseType: !357, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !562, file: !529, line: 119, baseType: !357, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !562, file: !529, line: 120, baseType: !357, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !562, file: !529, line: 121, baseType: !357, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !559, file: !529, line: 124, baseType: !357, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !530, file: !529, line: 902, baseType: !581, size: 32, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !529, line: 186, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 165, size: 32, elements: !584)
!584 = !{!585, !605}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !583, file: !529, line: 184, baseType: !586, size: 32)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !583, file: !529, line: 166, size: 32, elements: !587)
!587 = !{!588, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !586, file: !529, line: 167, baseType: !589, size: 1, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !357)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !586, file: !529, line: 168, baseType: !589, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !586, file: !529, line: 169, baseType: !589, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !586, file: !529, line: 170, baseType: !589, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !586, file: !529, line: 171, baseType: !589, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !586, file: !529, line: 172, baseType: !589, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !586, file: !529, line: 173, baseType: !589, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !586, file: !529, line: 174, baseType: !589, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !586, file: !529, line: 175, baseType: !589, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !586, file: !529, line: 176, baseType: !589, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !586, file: !529, line: 177, baseType: !589, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !586, file: !529, line: 178, baseType: !589, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !586, file: !529, line: 180, baseType: !589, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !586, file: !529, line: 181, baseType: !589, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !586, file: !529, line: 182, baseType: !589, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !583, file: !529, line: 185, baseType: !357, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !530, file: !529, line: 903, baseType: !607, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !529, line: 247, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 226, size: 32, elements: !611)
!611 = !{!612, !630}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !610, file: !529, line: 245, baseType: !613, size: 32)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !610, file: !529, line: 227, size: 32, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !613, file: !529, line: 228, baseType: !357, size: 1, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !613, file: !529, line: 229, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !613, file: !529, line: 230, baseType: !357, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !613, file: !529, line: 231, baseType: !357, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !613, file: !529, line: 232, baseType: !357, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !613, file: !529, line: 233, baseType: !357, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !613, file: !529, line: 234, baseType: !357, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !613, file: !529, line: 235, baseType: !357, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !613, file: !529, line: 236, baseType: !357, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !613, file: !529, line: 237, baseType: !357, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !613, file: !529, line: 238, baseType: !357, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !613, file: !529, line: 239, baseType: !357, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !613, file: !529, line: 241, baseType: !357, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !613, file: !529, line: 242, baseType: !357, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !613, file: !529, line: 243, baseType: !357, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !610, file: !529, line: 246, baseType: !357, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !530, file: !529, line: 904, baseType: !632, size: 16, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !529, line: 300, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 287, size: 16, elements: !635)
!635 = !{!636, !646}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !634, file: !529, line: 298, baseType: !637, size: 16)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !634, file: !529, line: 288, size: 16, elements: !638)
!638 = !{!639, !640, !641, !642, !643, !644, !645}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !637, file: !529, line: 290, baseType: !332, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !637, file: !529, line: 291, baseType: !332, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !637, file: !529, line: 293, baseType: !332, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !637, file: !529, line: 294, baseType: !332, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !637, file: !529, line: 295, baseType: !332, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !637, file: !529, line: 296, baseType: !332, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !637, file: !529, line: 297, baseType: !332, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !634, file: !529, line: 299, baseType: !332, size: 16)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !530, file: !529, line: 905, baseType: !420, size: 16, offset: 144)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !530, file: !529, line: 906, baseType: !649, size: 16, offset: 160)
!649 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !529, line: 352, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 336, size: 16, elements: !652)
!652 = !{!653, !665}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !651, file: !529, line: 350, baseType: !654, size: 16)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !651, file: !529, line: 337, size: 16, elements: !655)
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !654, file: !529, line: 339, baseType: !332, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !654, file: !529, line: 340, baseType: !332, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !654, file: !529, line: 341, baseType: !332, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !654, file: !529, line: 342, baseType: !332, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !654, file: !529, line: 343, baseType: !332, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !654, file: !529, line: 344, baseType: !332, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !654, file: !529, line: 345, baseType: !332, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !654, file: !529, line: 346, baseType: !332, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !654, file: !529, line: 348, baseType: !332, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !651, file: !529, line: 351, baseType: !332, size: 16)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !530, file: !529, line: 907, baseType: !420, size: 16, offset: 176)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !530, file: !529, line: 908, baseType: !668, size: 32, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !529, line: 398, baseType: !670)
!670 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 381, size: 32, elements: !671)
!671 = !{!672, !683}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !670, file: !529, line: 396, baseType: !673, size: 32)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !670, file: !529, line: 382, size: 32, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !673, file: !529, line: 384, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !673, file: !529, line: 385, baseType: !357, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !673, file: !529, line: 386, baseType: !357, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !673, file: !529, line: 388, baseType: !357, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !673, file: !529, line: 389, baseType: !357, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !673, file: !529, line: 390, baseType: !357, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !673, file: !529, line: 392, baseType: !357, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !673, file: !529, line: 394, baseType: !357, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !670, file: !529, line: 397, baseType: !357, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !530, file: !529, line: 909, baseType: !685, size: 8, offset: 224)
!685 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !529, line: 433, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 426, size: 8, elements: !688)
!688 = !{!689, !694}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !687, file: !529, line: 431, baseType: !690, size: 8)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !687, file: !529, line: 427, size: 8, elements: !691)
!691 = !{!692, !693}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !690, file: !529, line: 428, baseType: !228, size: 5, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !690, file: !529, line: 430, baseType: !228, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !687, file: !529, line: 432, baseType: !228, size: 8)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !530, file: !529, line: 910, baseType: !464, size: 24, offset: 232)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !530, file: !529, line: 911, baseType: !697, size: 32, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !529, line: 462, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 448, size: 32, elements: !700)
!700 = !{!701, !710}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !699, file: !529, line: 460, baseType: !702, size: 32)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !699, file: !529, line: 449, size: 32, elements: !703)
!703 = !{!704, !705, !706, !707, !708, !709}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !702, file: !529, line: 451, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !702, file: !529, line: 453, baseType: !357, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !702, file: !529, line: 454, baseType: !357, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !702, file: !529, line: 455, baseType: !357, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !702, file: !529, line: 457, baseType: !357, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !702, file: !529, line: 459, baseType: !357, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !699, file: !529, line: 461, baseType: !357, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !530, file: !529, line: 912, baseType: !712, size: 16, offset: 288)
!712 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !529, line: 520, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 503, size: 16, elements: !715)
!715 = !{!716, !730}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !714, file: !529, line: 518, baseType: !717, size: 16)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !529, line: 504, size: 16, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !717, file: !529, line: 506, baseType: !332, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !717, file: !529, line: 507, baseType: !332, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !717, file: !529, line: 508, baseType: !332, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !717, file: !529, line: 509, baseType: !332, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !717, file: !529, line: 510, baseType: !332, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !717, file: !529, line: 511, baseType: !332, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !717, file: !529, line: 512, baseType: !332, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !717, file: !529, line: 513, baseType: !332, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !717, file: !529, line: 514, baseType: !332, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !717, file: !529, line: 515, baseType: !332, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !717, file: !529, line: 516, baseType: !332, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !714, file: !529, line: 519, baseType: !332, size: 16)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !530, file: !529, line: 913, baseType: !420, size: 16, offset: 304)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !530, file: !529, line: 914, baseType: !733, size: 32, offset: 320)
!733 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !734)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !529, line: 559, baseType: !735)
!735 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 552, size: 32, elements: !736)
!736 = !{!737, !743}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !735, file: !529, line: 557, baseType: !738, size: 32)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !735, file: !529, line: 553, size: 32, elements: !739)
!739 = !{!740, !741, !742}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !738, file: !529, line: 554, baseType: !357, size: 10, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !738, file: !529, line: 555, baseType: !357, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !738, file: !529, line: 556, baseType: !357, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !735, file: !529, line: 558, baseType: !357, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !530, file: !529, line: 915, baseType: !745, size: 32, offset: 352)
!745 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !529, line: 585, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 578, size: 32, elements: !748)
!748 = !{!749, !755}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !747, file: !529, line: 583, baseType: !750, size: 32)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !747, file: !529, line: 579, size: 32, elements: !751)
!751 = !{!752, !753, !754}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !750, file: !529, line: 580, baseType: !357, size: 16, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !750, file: !529, line: 581, baseType: !357, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !750, file: !529, line: 582, baseType: !357, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !747, file: !529, line: 584, baseType: !357, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !530, file: !529, line: 916, baseType: !757, size: 8, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !529, line: 610, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 604, size: 8, elements: !760)
!760 = !{!761, !765}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !759, file: !529, line: 608, baseType: !762, size: 8)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !759, file: !529, line: 605, size: 8, elements: !763)
!763 = !{!764}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !762, file: !529, line: 607, baseType: !228, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !759, file: !529, line: 609, baseType: !228, size: 8)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !530, file: !529, line: 917, baseType: !464, size: 24, offset: 392)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !530, file: !529, line: 918, baseType: !768, size: 32, offset: 416)
!768 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !529, line: 639, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 622, size: 32, elements: !771)
!771 = !{!772, !783}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !770, file: !529, line: 637, baseType: !773, size: 32)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !770, file: !529, line: 623, size: 32, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780, !781, !782}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !773, file: !529, line: 625, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !773, file: !529, line: 626, baseType: !357, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !773, file: !529, line: 627, baseType: !357, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !773, file: !529, line: 629, baseType: !357, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !773, file: !529, line: 631, baseType: !357, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !773, file: !529, line: 632, baseType: !357, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !773, file: !529, line: 634, baseType: !357, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !773, file: !529, line: 635, baseType: !357, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !770, file: !529, line: 638, baseType: !357, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !530, file: !529, line: 919, baseType: !785, size: 32, offset: 448)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 32, elements: !370)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !530, file: !529, line: 920, baseType: !787, size: 16, offset: 480)
!787 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !788)
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !529, line: 715, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 706, size: 16, elements: !790)
!790 = !{!791, !796}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !789, file: !529, line: 713, baseType: !792, size: 16)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !789, file: !529, line: 707, size: 16, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !792, file: !529, line: 709, baseType: !332, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !792, file: !529, line: 711, baseType: !332, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !789, file: !529, line: 714, baseType: !332, size: 16)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !530, file: !529, line: 921, baseType: !420, size: 16, offset: 496)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !530, file: !529, line: 922, baseType: !799, size: 32, offset: 512)
!799 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !529, line: 739, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 729, size: 32, elements: !802)
!802 = !{!803, !809}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !801, file: !529, line: 737, baseType: !804, size: 32)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !801, file: !529, line: 730, size: 32, elements: !805)
!805 = !{!806, !807, !808}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !804, file: !529, line: 732, baseType: !357, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !804, file: !529, line: 733, baseType: !357, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !804, file: !529, line: 735, baseType: !357, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !801, file: !529, line: 738, baseType: !357, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !530, file: !529, line: 923, baseType: !811, size: 8, offset: 544)
!811 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !812)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !529, line: 765, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 756, size: 8, elements: !814)
!814 = !{!815, !821}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !813, file: !529, line: 763, baseType: !816, size: 8)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !813, file: !529, line: 757, size: 8, elements: !817)
!817 = !{!818, !819, !820}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !816, file: !529, line: 759, baseType: !228, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !816, file: !529, line: 761, baseType: !228, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !816, file: !529, line: 762, baseType: !228, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !813, file: !529, line: 764, baseType: !228, size: 8)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !530, file: !529, line: 924, baseType: !464, size: 24, offset: 552)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !530, file: !529, line: 925, baseType: !824, size: 32, offset: 576)
!824 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !529, line: 789, baseType: !826)
!826 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 781, size: 32, elements: !827)
!827 = !{!828, !833}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !826, file: !529, line: 787, baseType: !829, size: 32)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !826, file: !529, line: 782, size: 32, elements: !830)
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !829, file: !529, line: 783, baseType: !357, size: 12, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !829, file: !529, line: 785, baseType: !357, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !826, file: !529, line: 788, baseType: !357, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !530, file: !529, line: 926, baseType: !835, size: 32, offset: 608)
!835 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !529, line: 820, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 805, size: 32, elements: !838)
!838 = !{!839, !849}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !837, file: !529, line: 818, baseType: !840, size: 32)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !837, file: !529, line: 806, size: 32, elements: !841)
!841 = !{!842, !843, !844, !845, !846, !847, !848}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !840, file: !529, line: 807, baseType: !357, size: 2, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !840, file: !529, line: 808, baseType: !357, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !840, file: !529, line: 809, baseType: !357, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !840, file: !529, line: 810, baseType: !357, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !840, file: !529, line: 812, baseType: !357, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !840, file: !529, line: 814, baseType: !357, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !840, file: !529, line: 816, baseType: !357, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !837, file: !529, line: 819, baseType: !357, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !530, file: !529, line: 927, baseType: !851, size: 8, offset: 640)
!851 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !853)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !529, line: 881, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !529, line: 872, size: 8, elements: !855)
!855 = !{!856, !863}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !854, file: !529, line: 879, baseType: !857, size: 8)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !854, file: !529, line: 873, size: 8, elements: !858)
!858 = !{!859, !860, !861, !862}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !857, file: !529, line: 874, baseType: !228, size: 1, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !857, file: !529, line: 875, baseType: !228, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !857, file: !529, line: 876, baseType: !228, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !857, file: !529, line: 877, baseType: !228, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !854, file: !529, line: 880, baseType: !228, size: 8)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !867, line: 290, baseType: !868)
!867 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !867, line: 284, size: 96, elements: !869)
!869 = !{!870, !880, !891, !904, !921}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !868, file: !867, line: 285, baseType: !871, size: 8)
!871 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !872)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !867, line: 49, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !867, line: 43, size: 8, elements: !874)
!874 = !{!875, !879}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !873, file: !867, line: 47, baseType: !876, size: 8)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !873, file: !867, line: 44, size: 8, elements: !877)
!877 = !{!878}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !876, file: !867, line: 45, baseType: !228, size: 1, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !873, file: !867, line: 48, baseType: !228, size: 8)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !868, file: !867, line: 286, baseType: !881, size: 8, offset: 8)
!881 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !883)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !867, line: 67, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !867, line: 61, size: 8, elements: !885)
!885 = !{!886, !890}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !884, file: !867, line: 65, baseType: !887, size: 8)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !884, file: !867, line: 62, size: 8, elements: !888)
!888 = !{!889}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !887, file: !867, line: 64, baseType: !228, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !884, file: !867, line: 66, baseType: !228, size: 8)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !868, file: !867, line: 287, baseType: !892, size: 16, offset: 16)
!892 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !893)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !867, line: 89, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !867, line: 79, size: 16, elements: !895)
!895 = !{!896, !903}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !894, file: !867, line: 87, baseType: !897, size: 16)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !894, file: !867, line: 80, size: 16, elements: !898)
!898 = !{!899, !900, !901, !902}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !897, file: !867, line: 81, baseType: !332, size: 6, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !897, file: !867, line: 83, baseType: !332, size: 4, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "CLKEN", scope: !897, file: !867, line: 85, baseType: !332, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !897, file: !867, line: 86, baseType: !332, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !894, file: !867, line: 88, baseType: !332, size: 16)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !868, file: !867, line: 288, baseType: !905, size: 32, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !906)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !867, line: 214, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !867, line: 199, size: 32, elements: !908)
!908 = !{!909, !920}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !907, file: !867, line: 212, baseType: !910, size: 32)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !907, file: !867, line: 200, size: 32, elements: !911)
!911 = !{!912, !913, !914, !915, !916, !917, !918, !919}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !910, file: !867, line: 201, baseType: !357, size: 4, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !910, file: !867, line: 203, baseType: !357, size: 5, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !910, file: !867, line: 205, baseType: !357, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !910, file: !867, line: 206, baseType: !357, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !910, file: !867, line: 207, baseType: !357, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !910, file: !867, line: 208, baseType: !357, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !910, file: !867, line: 209, baseType: !357, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !910, file: !867, line: 210, baseType: !357, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !907, file: !867, line: 213, baseType: !357, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "GENDIV", scope: !868, file: !867, line: 289, baseType: !922, size: 32, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENDIV_Type", file: !867, line: 268, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !867, line: 260, size: 32, elements: !925)
!925 = !{!926, !931}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !924, file: !867, line: 266, baseType: !927, size: 32)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !924, file: !867, line: 261, size: 32, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !927, file: !867, line: 262, baseType: !357, size: 4, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !927, file: !867, line: 264, baseType: !357, size: 16, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !924, file: !867, line: 267, baseType: !357, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pm", file: !934, line: 513, baseType: !935)
!934 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !934, line: 494, size: 480, elements: !936)
!936 = !{!937, !943, !953, !957, !967, !977, !987, !997, !1001, !1017, !1033, !1049, !1079, !1083, !1093, !1103, !1113, !1117}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !935, file: !934, line: 495, baseType: !938, size: 8)
!938 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !939)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_CTRL_Type", file: !934, line: 45, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !934, line: 43, size: 8, elements: !941)
!941 = !{!942}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !940, file: !934, line: 44, baseType: !228, size: 8)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP", scope: !935, file: !934, line: 496, baseType: !944, size: 8, offset: 8)
!944 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "PM_SLEEP_Type", file: !934, line: 61, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !934, line: 55, size: 8, elements: !947)
!947 = !{!948, !952}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !946, file: !934, line: 59, baseType: !949, size: 8)
