; ModuleID = 'build/96b_stm32_sensor_mez/ipm_mcux/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %union.anon.1, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/ipm_mcux/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/ipm_mcux")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 109, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/ipm_mcux")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 6208, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 97)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 3104, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "gcounter", scope: !27, file: !170, line: 12, type: !103, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !169, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/ipm/ipm_mcux/src/main_master.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/ipm_mcux")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !104, !103, !105}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipm_driver_api", file: !108, line: 98, size: 160, elements: !109)
!108 = !DIFile(filename: "zephyr/include/zephyr/drivers/ipm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !{!110, !143, !154, !159, !164}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !107, file: !108, line: 99, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_send_t", file: !108, line: 54, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!113 = !DISubroutineType(types: !114)
!114 = !{!103, !115, !103, !142, !13, !103}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120, !124, !125, !126, !135, !136}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !118, line: 380, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !117, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !117, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !117, file: !118, line: 386, baseType: !127, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !129)
!129 = !{!130, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !128, file: !118, line: 359, baseType: !131, size: 8)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !132)
!132 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !128, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!134 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !117, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !118, line: 43, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !141)
!141 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "register_callback", scope: !107, file: !108, line: 100, baseType: !144, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_register_callback_t", file: !108, line: 78, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !115, !148, !104}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_callback_t", file: !108, line: 45, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !115, !104, !142, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "max_data_size_get", scope: !107, file: !108, line: 101, baseType: !155, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_data_size_get_t", file: !108, line: 62, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DISubroutineType(types: !158)
!158 = !{!103, !115}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "max_id_val_get", scope: !107, file: !108, line: 102, baseType: !160, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_id_val_get_t", file: !108, line: 70, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{!142, !115}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "set_enabled", scope: !107, file: !108, line: 103, baseType: !165, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_set_enabled_t", file: !108, line: 88, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DISubroutineType(types: !168)
!168 = !{!103, !115, !103}
!169 = !{!25}
!170 = !DIFile(filename: "zephyr/samples/drivers/ipm/ipm_mcux/src/main_master.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "_char_out", scope: !173, file: !177, line: 54, type: !178, isLocal: false, isDefinition: true)
!173 = distinct !DICompileUnit(language: DW_LANG_C99, file: !174, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !175, globals: !176, splitDebugInlining: false, nameTableKind: None)
!174 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/ipm_mcux")
!175 = !{!104, !103}
!176 = !{!171}
!177 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DISubroutineType(types: !180)
!180 = !{!103, !103}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !183, file: !200, line: 56, type: !201, isLocal: true, isDefinition: true, align: 32)
!183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !185, globals: !199, splitDebugInlining: false, nameTableKind: None)
!184 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/ipm_mcux")
!185 = !{!186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !188, line: 407, baseType: !189)
!188 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f446xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 398, size: 224, elements: !190)
!190 = !{!191, !193, !194, !195, !196, !197, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !189, file: !188, line: 400, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !142)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !189, file: !188, line: 401, baseType: !192, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !189, file: !188, line: 402, baseType: !192, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !189, file: !188, line: 403, baseType: !192, size: 32, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !189, file: !188, line: 404, baseType: !192, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !189, file: !188, line: 405, baseType: !192, size: 32, offset: 160)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !189, file: !188, line: 406, baseType: !192, size: 32, offset: 192)
!199 = !{!181}
!200 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !203, line: 51, size: 64, elements: !204)
!203 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !{!205, !224}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !202, file: !203, line: 60, baseType: !206, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!207 = !DISubroutineType(types: !208)
!208 = !{!103, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !212)
!212 = !{!213, !214, !215, !216, !222, !223}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !211, file: !118, line: 380, baseType: !121, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !211, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !211, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !211, file: !118, line: 386, baseType: !217, size: 32, offset: 96)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !218, file: !118, line: 359, baseType: !131, size: 8)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !218, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !211, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !211, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !202, file: !203, line: 65, baseType: !209, size: 32, offset: 32)
!225 = !DIGlobalVariableExpression(var: !226, expr: !DIExpression())
!226 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !227, file: !230, line: 71, type: !231, isLocal: true, isDefinition: true, align: 32)
!227 = distinct !DICompileUnit(language: DW_LANG_C99, file: !228, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !229, splitDebugInlining: false, nameTableKind: None)
!228 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/ipm_mcux")
!229 = !{!225}
!230 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !232)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !203, line: 51, size: 64, elements: !233)
!233 = !{!234, !253}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !232, file: !203, line: 60, baseType: !235, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = !DISubroutineType(types: !237)
!237 = !{!103, !238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !241)
!241 = !{!242, !243, !244, !245, !251, !252}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !240, file: !118, line: 380, baseType: !121, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !240, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !240, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !240, file: !118, line: 386, baseType: !246, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !248)
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !247, file: !118, line: 359, baseType: !131, size: 8)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !247, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !240, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !240, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !232, file: !203, line: 65, baseType: !238, size: 32, offset: 32)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "static_regions", scope: !256, file: !265, line: 62, type: !406, isLocal: true, isDefinition: true)
!256 = distinct !DICompileUnit(language: DW_LANG_C99, file: !257, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !258, globals: !261, splitDebugInlining: false, nameTableKind: None)
!257 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/ipm_mcux")
!258 = !{!259, !103, !142, !104}
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !260, line: 214, baseType: !32)
!260 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!261 = !{!262, !254}
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !264, file: !265, line: 198, type: !392, isLocal: true, isDefinition: true)
!264 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !265, file: !265, line: 175, type: !266, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !256, retainedNodes: !387)
!265 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!266 = !DISubroutineType(types: !267)
!267 = !{null, !268}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !270, line: 245, size: 1024, elements: !271)
!270 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!271 = !{!272, !341, !354, !355, !356, !357, !363, !382}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !269, file: !270, line: 247, baseType: !273, size: 384)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !270, line: 57, size: 384, elements: !274)
!274 = !{!275, !303, !311, !312, !313, !326, !327, !328}
!275 = !DIDerivedType(tag: DW_TAG_member, scope: !273, file: !270, line: 60, baseType: !276, size: 64)
!276 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !273, file: !270, line: 60, size: 64, elements: !277)
!277 = !{!278, !294}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !276, file: !270, line: 61, baseType: !279, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !280, line: 49, baseType: !281)
!280 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !280, line: 37, size: 64, elements: !282)
!282 = !{!283, !289}
!283 = !DIDerivedType(tag: DW_TAG_member, scope: !281, file: !280, line: 38, baseType: !284, size: 32)
!284 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !281, file: !280, line: 38, size: 32, elements: !285)
!285 = !{!286, !288}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !284, file: !280, line: 39, baseType: !287, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !284, file: !280, line: 40, baseType: !287, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, scope: !281, file: !280, line: 42, baseType: !290, size: 32, offset: 32)
!290 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !281, file: !280, line: 42, size: 32, elements: !291)
!291 = !{!292, !293}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !290, file: !280, line: 43, baseType: !287, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !290, file: !280, line: 44, baseType: !287, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !276, file: !270, line: 62, baseType: !295, size: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !296, line: 49, size: 64, elements: !297)
!296 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!297 = !{!298}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !295, file: !296, line: 50, baseType: !299, size: 64)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 64, elements: !301)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!301 = !{!302}
!302 = !DISubrange(count: 2)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !273, file: !270, line: 68, baseType: !304, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !306, line: 233, baseType: !307)
!306 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !306, line: 231, size: 64, elements: !308)
!308 = !{!309}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !307, file: !306, line: 232, baseType: !310, size: 64)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !280, line: 48, baseType: !281)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !273, file: !270, line: 71, baseType: !131, size: 8, offset: 96)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !273, file: !270, line: 74, baseType: !131, size: 8, offset: 104)
!313 = !DIDerivedType(tag: DW_TAG_member, scope: !273, file: !270, line: 90, baseType: !314, size: 16, offset: 112)
!314 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !273, file: !270, line: 90, size: 16, elements: !315)
!315 = !{!316, !323}
!316 = !DIDerivedType(tag: DW_TAG_member, scope: !314, file: !270, line: 91, baseType: !317, size: 16)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !314, file: !270, line: 91, size: 16, elements: !318)
!318 = !{!319, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !317, file: !270, line: 96, baseType: !320, size: 8)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !321)
!321 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !317, file: !270, line: 97, baseType: !131, size: 8, offset: 8)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !314, file: !270, line: 100, baseType: !324, size: 16)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !325)
!325 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !273, file: !270, line: 107, baseType: !142, size: 32, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !273, file: !270, line: 127, baseType: !104, size: 32, offset: 160)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !273, file: !270, line: 131, baseType: !329, size: 192, offset: 192)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !306, line: 244, size: 192, elements: !330)
!330 = !{!331, !332, !338}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !329, file: !306, line: 245, baseType: !279, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !329, file: !306, line: 246, baseType: !333, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !306, line: 242, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !337}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !329, file: !306, line: 249, baseType: !339, size: 64, offset: 128)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !340)
!340 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !269, file: !270, line: 250, baseType: !342, size: 288, offset: 384)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !343, line: 25, size: 288, elements: !344)
!343 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !342, file: !343, line: 26, baseType: !142, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !342, file: !343, line: 27, baseType: !142, size: 32, offset: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !342, file: !343, line: 28, baseType: !142, size: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !342, file: !343, line: 29, baseType: !142, size: 32, offset: 96)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !342, file: !343, line: 30, baseType: !142, size: 32, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !342, file: !343, line: 31, baseType: !142, size: 32, offset: 160)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !342, file: !343, line: 32, baseType: !142, size: 32, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !342, file: !343, line: 33, baseType: !142, size: 32, offset: 224)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !342, file: !343, line: 34, baseType: !142, size: 32, offset: 256)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !269, file: !270, line: 253, baseType: !104, size: 32, offset: 672)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !269, file: !270, line: 256, baseType: !305, size: 64, offset: 704)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !269, file: !270, line: 294, baseType: !103, size: 32, offset: 768)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !269, file: !270, line: 300, baseType: !358, size: 96, offset: 800)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !270, line: 149, size: 96, elements: !359)
!359 = !{!360, !361, !362}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !358, file: !270, line: 153, baseType: !22, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !358, file: !270, line: 162, baseType: !259, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !358, file: !270, line: 168, baseType: !259, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !269, file: !270, line: 325, baseType: !364, size: 32, offset: 896)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !366, line: 5073, size: 160, elements: !367)
!366 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!367 = !{!368, !377, !378}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !365, file: !366, line: 5074, baseType: !369, size: 96)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !370, line: 56, size: 96, elements: !371)
!370 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!371 = !{!372, !375, !376}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !369, file: !370, line: 57, baseType: !373, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !370, line: 57, flags: DIFlagFwdDecl)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !369, file: !370, line: 58, baseType: !104, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !369, file: !370, line: 59, baseType: !259, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !365, file: !366, line: 5075, baseType: !305, size: 64, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !365, file: !366, line: 5076, baseType: !379, offset: 160)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !380, line: 43, elements: !381)
!380 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!381 = !{}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !269, file: !270, line: 343, baseType: !383, size: 64, offset: 928)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !343, line: 60, size: 64, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !383, file: !343, line: 63, baseType: !142, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !383, file: !343, line: 66, baseType: !142, size: 32, offset: 32)
!387 = !{!388, !389, !390, !391}
!388 = !DILocalVariable(name: "thread", arg: 1, scope: !264, file: !265, line: 175, type: !268)
!389 = !DILocalVariable(name: "region_num", scope: !264, file: !265, line: 200, type: !131)
!390 = !DILocalVariable(name: "guard_start", scope: !264, file: !265, line: 265, type: !22)
!391 = !DILocalVariable(name: "guard_size", scope: !264, file: !265, line: 266, type: !259)
!392 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 96, elements: !404)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !394, line: 52, size: 96, elements: !395)
!394 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = !{!396, !397, !398}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !393, file: !394, line: 53, baseType: !22, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !393, file: !394, line: 54, baseType: !259, size: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !393, file: !394, line: 55, baseType: !399, size: 32, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !400, line: 151, baseType: !401)
!400 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !400, line: 149, size: 32, elements: !402)
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !401, file: !400, line: 150, baseType: !142, size: 32)
!404 = !{!405}
!405 = !DISubrange(count: 1)
!406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !407, size: 96, elements: !404)
!407 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !393)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !410, file: !443, line: 39, type: !131, isLocal: true, isDefinition: true)
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !412, globals: !442, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/ipm_mcux")
!412 = !{!413, !104, !103, !430, !131}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !415, line: 1226, baseType: !416)
!415 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !415, line: 1213, size: 352, elements: !417)
!417 = !{!418, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !416, file: !415, line: 1215, baseType: !419, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !416, file: !415, line: 1216, baseType: !192, size: 32, offset: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !416, file: !415, line: 1217, baseType: !192, size: 32, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !416, file: !415, line: 1218, baseType: !192, size: 32, offset: 96)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !416, file: !415, line: 1219, baseType: !192, size: 32, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !416, file: !415, line: 1220, baseType: !192, size: 32, offset: 160)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !416, file: !415, line: 1221, baseType: !192, size: 32, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !416, file: !415, line: 1222, baseType: !192, size: 32, offset: 224)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !416, file: !415, line: 1223, baseType: !192, size: 32, offset: 256)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !416, file: !415, line: 1224, baseType: !192, size: 32, offset: 288)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !416, file: !415, line: 1225, baseType: !192, size: 32, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !433, line: 27, size: 96, elements: !434)
!433 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!434 = !{!435, !436, !437}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !432, file: !433, line: 29, baseType: !142, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !432, file: !433, line: 31, baseType: !121, size: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !432, file: !433, line: 37, baseType: !438, size: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !400, line: 146, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !400, line: 141, size: 32, elements: !440)
!440 = !{!441}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !439, file: !400, line: 143, baseType: !142, size: 32)
!442 = !{!408}
!443 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !446, file: !453, line: 21, type: !178, isLocal: true, isDefinition: true)
!446 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !448, globals: !452, splitDebugInlining: false, nameTableKind: None)
!447 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/ipm_mcux")
!448 = !{!449, !103, !104}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !451, line: 22, baseType: !103)
!451 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!452 = !{!444}
!453 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !456, file: !461, line: 13, type: !478, isLocal: true, isDefinition: true)
!456 = distinct !DICompileUnit(language: DW_LANG_C99, file: !457, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !458, splitDebugInlining: false, nameTableKind: None)
!457 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/ipm_mcux")
!458 = !{!459, !454}
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "mpu_config", scope: !456, file: !461, line: 37, type: !462, isLocal: false, isDefinition: true)
!461 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!462 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !433, line: 41, size: 64, elements: !464)
!464 = !{!465, !466}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !463, file: !433, line: 43, baseType: !142, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !463, file: !433, line: 45, baseType: !467, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !433, line: 27, size: 96, elements: !470)
!470 = !{!471, !472, !473}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !469, file: !433, line: 29, baseType: !142, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !469, file: !433, line: 31, baseType: !121, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !469, file: !433, line: 37, baseType: !474, size: 32, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !400, line: 146, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !400, line: 141, size: 32, elements: !476)
!476 = !{!477}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !475, file: !400, line: 143, baseType: !142, size: 32)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 192, elements: !301)
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !481, file: !594, line: 72, type: !678, isLocal: true, isDefinition: true)
!481 = distinct !DICompileUnit(language: DW_LANG_C99, file: !482, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !483, retainedTypes: !580, globals: !591, splitDebugInlining: false, nameTableKind: None)
!482 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/ipm_mcux")
!483 = !{!30, !484}
!484 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !188, line: 65, baseType: !103, size: 32, elements: !485)
!485 = !{!486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579}
!486 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!487 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!488 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!489 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!490 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!491 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!492 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!493 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!494 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!495 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!496 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!497 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!498 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!499 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!500 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!501 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!502 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!503 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!504 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!505 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!506 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!507 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!508 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!509 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!510 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!511 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!512 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!513 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!514 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!515 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!516 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!517 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!518 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!519 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!520 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!521 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!522 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!523 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!524 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!525 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!526 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!527 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!528 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!529 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!530 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!531 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!532 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!533 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!534 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!535 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!536 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!537 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!538 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!539 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!540 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!541 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!542 = !DIEnumerator(name: "FMC_IRQn", value: 48)
!543 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!544 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!545 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!546 = !DIEnumerator(name: "UART4_IRQn", value: 52)
!547 = !DIEnumerator(name: "UART5_IRQn", value: 53)
!548 = !DIEnumerator(name: "TIM6_DAC_IRQn", value: 54)
!549 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!550 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!551 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!552 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!553 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!554 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!555 = !DIEnumerator(name: "CAN2_TX_IRQn", value: 63)
!556 = !DIEnumerator(name: "CAN2_RX0_IRQn", value: 64)
!557 = !DIEnumerator(name: "CAN2_RX1_IRQn", value: 65)
!558 = !DIEnumerator(name: "CAN2_SCE_IRQn", value: 66)
!559 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!560 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!561 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!562 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!563 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!564 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!565 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!566 = !DIEnumerator(name: "OTG_HS_EP1_OUT_IRQn", value: 74)
!567 = !DIEnumerator(name: "OTG_HS_EP1_IN_IRQn", value: 75)
!568 = !DIEnumerator(name: "OTG_HS_WKUP_IRQn", value: 76)
!569 = !DIEnumerator(name: "OTG_HS_IRQn", value: 77)
!570 = !DIEnumerator(name: "DCMI_IRQn", value: 78)
!571 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!572 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!573 = !DIEnumerator(name: "SAI1_IRQn", value: 87)
!574 = !DIEnumerator(name: "SAI2_IRQn", value: 91)
!575 = !DIEnumerator(name: "QUADSPI_IRQn", value: 92)
!576 = !DIEnumerator(name: "CEC_IRQn", value: 93)
!577 = !DIEnumerator(name: "SPDIF_RX_IRQn", value: 94)
!578 = !DIEnumerator(name: "FMPI2C1_EV_IRQn", value: 95)
!579 = !DIEnumerator(name: "FMPI2C1_ER_IRQn", value: 96)
!580 = !{!259, !103, !104, !581}
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !188, line: 392, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 384, size: 192, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !583, file: !188, line: 386, baseType: !192, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !583, file: !188, line: 387, baseType: !192, size: 32, offset: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !583, file: !188, line: 388, baseType: !192, size: 32, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !583, file: !188, line: 389, baseType: !192, size: 32, offset: 96)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !583, file: !188, line: 390, baseType: !192, size: 32, offset: 128)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !583, file: !188, line: 391, baseType: !192, size: 32, offset: 160)
!591 = !{!592, !598, !614, !625, !642, !479, !644, !658, !660, !662, !664, !666, !668, !670, !672, !674, !676}
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !481, file: !594, line: 424, type: !595, isLocal: false, isDefinition: true, align: 16)
!594 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!595 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !596)
!596 = !{!597}
!597 = !DISubrange(count: 4)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "__device_dts_ord_36", scope: !481, file: !594, line: 424, type: !600, isLocal: false, isDefinition: true, align: 32)
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !602)
!602 = !{!603, !604, !605, !606, !612, !613}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !601, file: !118, line: 380, baseType: !121, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !601, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !601, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !601, file: !118, line: 386, baseType: !607, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !609)
!609 = !{!610, !611}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !608, file: !118, line: 359, baseType: !131, size: 8)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !608, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !601, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !601, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_36", scope: !481, file: !594, line: 424, type: !616, isLocal: true, isDefinition: true, align: 32)
!616 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !203, line: 51, size: 64, elements: !618)
!618 = !{!619, !624}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !617, file: !203, line: 60, baseType: !620, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!621 = !DISubroutineType(types: !622)
!622 = !{!103, !623}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !617, file: !203, line: 65, baseType: !623, size: 32, offset: 32)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "exti_data", scope: !481, file: !594, line: 423, type: !627, isLocal: true, isDefinition: true)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !594, line: 107, size: 1472, elements: !628)
!628 = !{!629}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !627, file: !594, line: 109, baseType: !630, size: 1472)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 1472, elements: !640)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !594, line: 101, size: 64, elements: !632)
!632 = !{!633, !639}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !631, file: !594, line: 102, baseType: !634, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !635, line: 63, baseType: !636)
!635 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 32)
!637 = !DISubroutineType(types: !638)
!638 = !{null, !103, !104}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !631, file: !594, line: 103, baseType: !104, size: 32, offset: 32)
!640 = !{!641}
!641 = !DISubrange(count: 23)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_36", scope: !481, file: !594, line: 424, type: !608, isLocal: true, isDefinition: true, align: 8)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !646, file: !594, line: 493, type: !651, isLocal: true, isDefinition: true, align: 32)
!646 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !594, file: !594, line: 460, type: !647, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !481, retainedNodes: !649)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !623}
!649 = !{!650}
!650 = !DILocalVariable(name: "dev", arg: 1, scope: !646, file: !594, line: 460, type: !623)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !652)
!652 = !{!653, !655, !656, !657}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !651, file: !10, line: 55, baseType: !654, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !651, file: !10, line: 57, baseType: !654, size: 32, offset: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !651, file: !10, line: 59, baseType: !104, size: 32, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !651, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !646, file: !594, line: 497, type: !651, isLocal: true, isDefinition: true, align: 32)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !646, file: !594, line: 507, type: !651, isLocal: true, isDefinition: true, align: 32)
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !646, file: !594, line: 512, type: !651, isLocal: true, isDefinition: true, align: 32)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !646, file: !594, line: 516, type: !651, isLocal: true, isDefinition: true, align: 32)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !646, file: !594, line: 523, type: !651, isLocal: true, isDefinition: true, align: 32)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !646, file: !594, line: 527, type: !651, isLocal: true, isDefinition: true, align: 32)
!670 = !DIGlobalVariableExpression(var: !671, expr: !DIExpression())
!671 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !646, file: !594, line: 581, type: !651, isLocal: true, isDefinition: true, align: 32)
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !646, file: !594, line: 586, type: !651, isLocal: true, isDefinition: true, align: 32)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !646, file: !594, line: 591, type: !651, isLocal: true, isDefinition: true, align: 32)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !646, file: !594, line: 595, type: !651, isLocal: true, isDefinition: true, align: 32)
!678 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 736, elements: !640)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !188, line: 163, baseType: !484)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !683, file: !688, line: 25, type: !716, isLocal: false, isDefinition: true, align: 16)
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !685, splitDebugInlining: false, nameTableKind: None)
!684 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/ipm_mcux/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/ipm_mcux")
!685 = !{!686, !681, !692, !694, !696, !698, !700, !702, !704, !706, !708, !710, !712, !714}
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !683, file: !688, line: 20, type: !689, isLocal: false, isDefinition: true, align: 16)
!688 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/ipm_mcux")
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 240, elements: !690)
!690 = !{!691}
!691 = !DISubrange(count: 15)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_96", scope: !683, file: !688, line: 32, type: !595, isLocal: false, isDefinition: true, align: 16)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_95", scope: !683, file: !688, line: 39, type: !595, isLocal: false, isDefinition: true, align: 16)
!696 = !DIGlobalVariableExpression(var: !697, expr: !DIExpression())
!697 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_94", scope: !683, file: !688, line: 46, type: !595, isLocal: false, isDefinition: true, align: 16)
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_93", scope: !683, file: !688, line: 53, type: !595, isLocal: false, isDefinition: true, align: 16)
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !683, file: !688, line: 60, type: !595, isLocal: false, isDefinition: true, align: 16)
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_92", scope: !683, file: !688, line: 67, type: !595, isLocal: false, isDefinition: true, align: 16)
!704 = !DIGlobalVariableExpression(var: !705, expr: !DIExpression())
!705 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_91", scope: !683, file: !688, line: 74, type: !595, isLocal: false, isDefinition: true, align: 16)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_90", scope: !683, file: !688, line: 81, type: !595, isLocal: false, isDefinition: true, align: 16)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_48", scope: !683, file: !688, line: 88, type: !595, isLocal: false, isDefinition: true, align: 16)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_45", scope: !683, file: !688, line: 95, type: !595, isLocal: false, isDefinition: true, align: 16)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !683, file: !688, line: 102, type: !595, isLocal: false, isDefinition: true, align: 16)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_52", scope: !683, file: !688, line: 109, type: !595, isLocal: false, isDefinition: true, align: 16)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 48, elements: !717)
!717 = !{!718}
!718 = !DISubrange(count: 3)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !721, file: !786, line: 398, type: !819, isLocal: true, isDefinition: true)
!721 = distinct !DICompileUnit(language: DW_LANG_C99, file: !722, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !723, retainedTypes: !736, globals: !783, splitDebugInlining: false, nameTableKind: None)
!722 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/ipm_mcux")
!723 = !{!724, !30, !729}
!724 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !725, line: 197, baseType: !32, size: 32, elements: !726)
!725 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!726 = !{!727, !728}
!727 = !DIEnumerator(name: "SUCCESS", value: 0)
!728 = !DIEnumerator(name: "ERROR", value: 1)
!729 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !730, line: 44, baseType: !32, size: 32, elements: !731)
!730 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!731 = !{!732, !733, !734, !735}
!732 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!733 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!734 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!735 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!736 = !{!104, !103, !142, !737, !776, !782}
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 32)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !188, line: 586, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 550, size: 1216, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !739, file: !188, line: 552, baseType: !192, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !739, file: !188, line: 553, baseType: !192, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !739, file: !188, line: 554, baseType: !192, size: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !739, file: !188, line: 555, baseType: !192, size: 32, offset: 96)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !739, file: !188, line: 556, baseType: !192, size: 32, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !739, file: !188, line: 557, baseType: !192, size: 32, offset: 160)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !739, file: !188, line: 558, baseType: !192, size: 32, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !739, file: !188, line: 559, baseType: !142, size: 32, offset: 224)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !739, file: !188, line: 560, baseType: !192, size: 32, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !739, file: !188, line: 561, baseType: !192, size: 32, offset: 288)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !739, file: !188, line: 562, baseType: !752, size: 64, offset: 320)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 64, elements: !301)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !739, file: !188, line: 563, baseType: !192, size: 32, offset: 384)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !739, file: !188, line: 564, baseType: !192, size: 32, offset: 416)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !739, file: !188, line: 565, baseType: !192, size: 32, offset: 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !739, file: !188, line: 566, baseType: !142, size: 32, offset: 480)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !739, file: !188, line: 567, baseType: !192, size: 32, offset: 512)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !739, file: !188, line: 568, baseType: !192, size: 32, offset: 544)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !739, file: !188, line: 569, baseType: !752, size: 64, offset: 576)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !739, file: !188, line: 570, baseType: !192, size: 32, offset: 640)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !739, file: !188, line: 571, baseType: !192, size: 32, offset: 672)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !739, file: !188, line: 572, baseType: !192, size: 32, offset: 704)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !739, file: !188, line: 573, baseType: !142, size: 32, offset: 736)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !739, file: !188, line: 574, baseType: !192, size: 32, offset: 768)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !739, file: !188, line: 575, baseType: !192, size: 32, offset: 800)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !739, file: !188, line: 576, baseType: !752, size: 64, offset: 832)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !739, file: !188, line: 577, baseType: !192, size: 32, offset: 896)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !739, file: !188, line: 578, baseType: !192, size: 32, offset: 928)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !739, file: !188, line: 579, baseType: !752, size: 64, offset: 960)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !739, file: !188, line: 580, baseType: !192, size: 32, offset: 1024)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !739, file: !188, line: 581, baseType: !192, size: 32, offset: 1056)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "PLLSAICFGR", scope: !739, file: !188, line: 582, baseType: !192, size: 32, offset: 1088)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !739, file: !188, line: 583, baseType: !192, size: 32, offset: 1120)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "CKGATENR", scope: !739, file: !188, line: 584, baseType: !192, size: 32, offset: 1152)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR2", scope: !739, file: !188, line: 585, baseType: !192, size: 32, offset: 1184)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !778, line: 343, size: 64, elements: !779)
!778 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !777, file: !778, line: 344, baseType: !142, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !777, file: !778, line: 345, baseType: !142, size: 32, offset: 32)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!783 = !{!784, !790, !806, !817, !719}
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !721, file: !786, line: 752, type: !787, isLocal: false, isDefinition: true, align: 16)
!786 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 800, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 50)
!790 = !DIGlobalVariableExpression(var: !791, expr: !DIExpression())
!791 = distinct !DIGlobalVariable(name: "__device_dts_ord_8", scope: !721, file: !786, line: 752, type: !792, isLocal: false, isDefinition: true, align: 32)
!792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !793)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !794)
!794 = !{!795, !796, !797, !798, !804, !805}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !793, file: !118, line: 380, baseType: !121, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !793, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !793, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !793, file: !118, line: 386, baseType: !799, size: 32, offset: 96)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !800, file: !118, line: 359, baseType: !131, size: 8)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !800, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !793, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !793, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_8", scope: !721, file: !786, line: 752, type: !808, isLocal: true, isDefinition: true, align: 32)
!808 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !203, line: 51, size: 64, elements: !810)
!810 = !{!811, !816}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !809, file: !203, line: 60, baseType: !812, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = !DISubroutineType(types: !814)
!814 = !{!103, !815}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !809, file: !203, line: 65, baseType: !815, size: 32, offset: 32)
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_8", scope: !721, file: !786, line: 752, type: !800, isLocal: true, isDefinition: true, align: 8)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !730, line: 100, size: 224, elements: !820)
!820 = !{!821, !827, !828, !837, !842, !847, !853}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !819, file: !730, line: 101, baseType: !822, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !730, line: 76, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DISubroutineType(types: !825)
!825 = !{!103, !815, !826}
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !730, line: 56, baseType: !104)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !819, file: !730, line: 102, baseType: !822, size: 32, offset: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !819, file: !730, line: 103, baseType: !829, size: 32, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !730, line: 83, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!831 = !DISubroutineType(types: !832)
!832 = !{!103, !815, !826, !833, !104}
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !730, line: 72, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!835 = !DISubroutineType(types: !836)
!836 = !{null, !815, !826, !104}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !819, file: !730, line: 104, baseType: !838, size: 32, offset: 96)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !730, line: 79, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 32)
!840 = !DISubroutineType(types: !841)
!841 = !{!103, !815, !826, !782}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !819, file: !730, line: 105, baseType: !843, size: 32, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !730, line: 88, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 32)
!845 = !DISubroutineType(types: !846)
!846 = !{!729, !815, !826}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !819, file: !730, line: 106, baseType: !848, size: 32, offset: 160)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !730, line: 92, baseType: !849)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 32)
!850 = !DISubroutineType(types: !851)
!851 = !{!103, !815, !826, !852}
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !730, line: 64, baseType: !104)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !819, file: !730, line: 107, baseType: !854, size: 32, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !730, line: 96, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 32)
!856 = !DISubroutineType(types: !857)
!857 = !{!103, !815, !826, !104}
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !860, file: !917, line: 603, type: !919, isLocal: true, isDefinition: true, align: 32)
!860 = distinct !DICompileUnit(language: DW_LANG_C99, file: !861, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !862, globals: !914, splitDebugInlining: false, nameTableKind: None)
!861 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/ipm_mcux")
!862 = !{!104, !103, !863}
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !866, line: 336, size: 160, elements: !867)
!866 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!867 = !{!868, !888, !892, !896, !909}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !865, file: !866, line: 365, baseType: !869, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 32)
!870 = !DISubroutineType(types: !871)
!871 = !{!103, !872, !887}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !875)
!875 = !{!876, !877, !878, !879, !885, !886}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !874, file: !118, line: 380, baseType: !121, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !874, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !874, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !874, file: !118, line: 386, baseType: !880, size: 32, offset: 96)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 32)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !882)
!882 = !{!883, !884}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !881, file: !118, line: 359, baseType: !131, size: 8)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !881, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !874, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !874, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !865, file: !866, line: 366, baseType: !889, size: 32, offset: 32)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 32)
!890 = !DISubroutineType(types: !891)
!891 = !{null, !872, !132}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !865, file: !866, line: 374, baseType: !893, size: 32, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!894 = !DISubroutineType(types: !895)
!895 = !{!103, !872}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !865, file: !866, line: 377, baseType: !897, size: 32, offset: 96)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DISubroutineType(types: !899)
!899 = !{!103, !872, !900}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!901 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !902)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !866, line: 122, size: 64, elements: !903)
!903 = !{!904, !905, !906, !907, !908}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !902, file: !866, line: 123, baseType: !142, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !902, file: !866, line: 124, baseType: !131, size: 8, offset: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !902, file: !866, line: 125, baseType: !131, size: 8, offset: 40)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !902, file: !866, line: 126, baseType: !131, size: 8, offset: 48)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !902, file: !866, line: 127, baseType: !131, size: 8, offset: 56)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !865, file: !866, line: 379, baseType: !910, size: 32, offset: 128)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = !DISubroutineType(types: !912)
!912 = !{!103, !872, !913}
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!914 = !{!858, !915}
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !860, file: !917, line: 38, type: !918, isLocal: true, isDefinition: true)
!917 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !872)
!919 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !920)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !203, line: 51, size: 64, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !920, file: !203, line: 60, baseType: !893, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !920, file: !203, line: 65, baseType: !872, size: 32, offset: 32)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !926, file: !1098, line: 762, type: !1207, isLocal: true, isDefinition: true)
!926 = distinct !DICompileUnit(language: DW_LANG_C99, file: !927, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !928, retainedTypes: !946, globals: !1095, splitDebugInlining: false, nameTableKind: None)
!927 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_stm32_sensor_mez/ipm_mcux")
!928 = !{!30, !929, !935, !940, !729}
!929 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !930, line: 506, baseType: !32, size: 32, elements: !931)
!930 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!931 = !{!932, !933, !934}
!932 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!933 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!934 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!935 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !930, line: 512, baseType: !32, size: 32, elements: !936)
!936 = !{!937, !938, !939}
!937 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!938 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!939 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!940 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !635, line: 43, baseType: !32, size: 32, elements: !941)
!941 = !{!942, !943, !944, !945}
!942 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!943 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!944 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!945 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!946 = !{!104, !103, !947, !1017, !1022, !982, !935, !929, !1027, !1028, !142, !1042, !997, !1054, !1055, !1056}
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !930, line: 523, size: 288, elements: !950)
!950 = !{!951, !972, !978, !983, !987, !988, !989, !993, !1013}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !949, file: !930, line: 524, baseType: !952, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 32)
!953 = !DISubroutineType(types: !954)
!954 = !{!103, !955, !970, !971}
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !958)
!958 = !{!959, !960, !961, !962, !968, !969}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !957, file: !118, line: 380, baseType: !121, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !957, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !957, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !957, file: !118, line: 386, baseType: !963, size: 32, offset: 96)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 32)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !965)
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !964, file: !118, line: 359, baseType: !131, size: 8)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !964, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !957, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !957, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !930, line: 237, baseType: !131)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !930, line: 257, baseType: !142)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !949, file: !930, line: 530, baseType: !973, size: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 32)
!974 = !DISubroutineType(types: !975)
!975 = !{!103, !955, !976}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !930, line: 229, baseType: !142)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !949, file: !930, line: 532, baseType: !979, size: 32, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 32)
!980 = !DISubroutineType(types: !981)
!981 = !{!103, !955, !982, !977}
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !930, line: 216, baseType: !142)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !949, file: !930, line: 535, baseType: !984, size: 32, offset: 96)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DISubroutineType(types: !986)
!986 = !{!103, !955, !982}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !949, file: !930, line: 537, baseType: !984, size: 32, offset: 128)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !949, file: !930, line: 539, baseType: !984, size: 32, offset: 160)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !949, file: !930, line: 541, baseType: !990, size: 32, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = !DISubroutineType(types: !992)
!992 = !{!103, !955, !970, !929, !935}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !949, file: !930, line: 544, baseType: !994, size: 32, offset: 224)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 32)
!995 = !DISubroutineType(types: !996)
!996 = !{!103, !955, !997, !134}
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 32)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !930, line: 478, size: 96, elements: !999)
!999 = !{!1000, !1007, !1012}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !998, file: !930, line: 482, baseType: !1001, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !1002, line: 33, baseType: !1003)
!1002 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !1002, line: 29, size: 32, elements: !1004)
!1004 = !{!1005}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1003, file: !1002, line: 30, baseType: !1006, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !998, file: !930, line: 485, baseType: !1008, size: 32, offset: 32)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !930, line: 464, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{null, !955, !997, !982}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !998, file: !930, line: 493, baseType: !982, size: 32, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !949, file: !930, line: 547, baseType: !1014, size: 32, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 32)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!142, !955}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !930, line: 428, size: 32, elements: !1020)
!1020 = !{!1021}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !1019, file: !930, line: 434, baseType: !982, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !930, line: 441, size: 32, elements: !1025)
!1025 = !{!1026}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1024, file: !930, line: 447, baseType: !982, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !188, line: 469, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 458, size: 320, elements: !1031)
!1031 = !{!1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !1030, file: !188, line: 460, baseType: !192, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !1030, file: !188, line: 461, baseType: !192, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !1030, file: !188, line: 462, baseType: !192, size: 32, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !1030, file: !188, line: 463, baseType: !192, size: 32, offset: 96)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !1030, file: !188, line: 464, baseType: !192, size: 32, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !1030, file: !188, line: 465, baseType: !192, size: 32, offset: 160)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !1030, file: !188, line: 466, baseType: !192, size: 32, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !1030, file: !188, line: 467, baseType: !192, size: 32, offset: 224)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !1030, file: !188, line: 468, baseType: !1041, size: 64, offset: 256)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 64, elements: !301)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !188, line: 484, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !188, line: 475, size: 384, elements: !1045)
!1045 = !{!1046, !1047, !1048, !1050, !1051, !1052, !1053}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !1044, file: !188, line: 477, baseType: !192, size: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !1044, file: !188, line: 478, baseType: !192, size: 32, offset: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !1044, file: !188, line: 479, baseType: !1049, size: 128, offset: 64)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !192, size: 128, elements: !596)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !1044, file: !188, line: 480, baseType: !752, size: 64, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !1044, file: !188, line: 481, baseType: !192, size: 32, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !1044, file: !188, line: 482, baseType: !752, size: 64, offset: 288)
