; ModuleID = 'build/actinius_icarus_bee_ns/settings/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.settings_handler = type { i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i32, i32 (i8*, i8*, i32)*, i8*)*, i32 ()*, i32 (i32 (i8*, i8*, i32)*)*, %struct._snode }
%struct._snode = type { %struct._snode* }
%struct.settings_handler_static = type { i8*, i32 (i8*, i8*, i32)*, i32 (i8*, i32, i32 (i8*, i8*, i32)*, i8*)*, i32 ()*, i32 (i32 (i8*, i8*, i32)*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.settings_store = type { %struct._snode, %struct.settings_store_itf* }
%struct.settings_store_itf = type { i32 (%struct.settings_store*, %struct.settings_load_arg*)*, i32 (%struct.settings_store*)*, i32 (%struct.settings_store*, i8*, i8*, i32)*, i32 (%struct.settings_store*)*, i8* (%struct.settings_store*)* }
%struct.settings_load_arg = type { i8*, i32 (i8*, i32, i32 (i8*, i8*, i32)*, i8*, i8*)*, i8* }
%struct.k_mutex = type { %union.anon, %struct.k_thread*, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/settings/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/settings")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/settings")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "length_val", scope: !27, file: !33, line: 31, type: !47, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !29, globals: !54, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/settings/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/settings")
!29 = !{!30, !31, !13, !43}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "direct_immediate_value", file: !33, line: 332, size: 96, elements: !34)
!33 = !DIFile(filename: "zephyr/samples/subsys/settings/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!34 = !{!35, !39, !40}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !32, file: !33, line: 333, baseType: !36, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !37, line: 214, baseType: !38)
!37 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !32, file: !33, line: 334, baseType: !30, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "fetched", scope: !32, file: !33, line: 335, baseType: !41, size: 8, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !42)
!42 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 32)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "direct_length_data", file: !33, line: 264, size: 128, elements: !45)
!45 = !{!46, !49, !52}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !44, file: !33, line: 265, baseType: !47, size: 64)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !48)
!48 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "length_1", scope: !44, file: !33, line: 266, baseType: !50, size: 16, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !51)
!51 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "length_2", scope: !44, file: !33, line: 267, baseType: !53, size: 32, offset: 96)
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !38)
!54 = !{!25, !55, !57, !59, !63, !69, !110, !120}
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "length_1_val", scope: !27, file: !33, line: 32, type: !50, isLocal: false, isDefinition: true)
!57 = !DIGlobalVariableExpression(var: !58, expr: !DIExpression())
!58 = distinct !DIGlobalVariable(name: "length_2_val", scope: !27, file: !33, line: 33, type: !53, isLocal: false, isDefinition: true)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "voltage_val", scope: !27, file: !33, line: 34, type: !61, isLocal: false, isDefinition: true)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !62)
!62 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!63 = !DIGlobalVariableExpression(var: !64, expr: !DIExpression())
!64 = distinct !DIGlobalVariable(name: "source_name_val", scope: !27, file: !33, line: 35, type: !65, isLocal: false, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 48, elements: !67)
!66 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!67 = !{!68}
!68 = !DISubrange(count: 6)
!69 = !DIGlobalVariableExpression(var: !70, expr: !DIExpression())
!70 = distinct !DIGlobalVariable(name: "alph_handler", scope: !27, file: !33, line: 51, type: !71, isLocal: false, isDefinition: true)
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings_handler", file: !72, line: 64, size: 192, elements: !73)
!72 = !DIFile(filename: "zephyr/include/zephyr/settings/settings.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!73 = !{!74, !77, !82, !92, !96, !103}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !71, file: !72, line: 66, baseType: !75, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 32)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !66)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "h_get", scope: !71, file: !72, line: 69, baseType: !78, size: 32, offset: 32)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 32)
!79 = !DISubroutineType(types: !80)
!80 = !{!62, !75, !81, !62}
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "h_set", scope: !71, file: !72, line: 81, baseType: !83, size: 32, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 32)
!84 = !DISubroutineType(types: !85)
!85 = !{!62, !75, !36, !86, !30}
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "settings_read_cb", file: !72, line: 57, baseType: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32)
!88 = !DISubroutineType(types: !89)
!89 = !{!90, !30, !30, !36}
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !91, line: 28, baseType: !62)
!91 = !DIFile(filename: "zephyr/lib/libc/minimal/include/sys/types.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!92 = !DIDerivedType(tag: DW_TAG_member, name: "h_commit", scope: !71, file: !72, line: 96, baseType: !93, size: 32, offset: 96)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 32)
!94 = !DISubroutineType(types: !95)
!95 = !{!62}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "h_export", scope: !71, file: !72, line: 103, baseType: !97, size: 32, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 32)
!98 = !DISubroutineType(types: !99)
!99 = !{!62, !100}
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 32)
!101 = !DISubroutineType(types: !102)
!102 = !{!62, !75, !13, !36}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !71, file: !72, line: 121, baseType: !104, size: 32, offset: 160)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !105, line: 33, baseType: !106)
!105 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !105, line: 29, size: 32, elements: !107)
!107 = !{!108}
!108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !106, file: !105, line: 30, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "settings_handler_beta", scope: !27, file: !33, line: 60, type: !112, isLocal: false, isDefinition: true, align: 32)
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings_handler_static", file: !72, line: 130, size: 160, elements: !114)
!114 = !{!115, !116, !117, !118, !119}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !72, line: 132, baseType: !75, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "h_get", scope: !113, file: !72, line: 135, baseType: !78, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "h_set", scope: !113, file: !72, line: 147, baseType: !83, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "h_commit", scope: !113, file: !72, line: 162, baseType: !93, size: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "h_export", scope: !113, file: !72, line: 167, baseType: !97, size: 32, offset: 128)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "angle_val", scope: !27, file: !33, line: 30, type: !41, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "_char_out", scope: !124, file: !199, line: 54, type: !200, isLocal: false, isDefinition: true)
!124 = distinct !DICompileUnit(language: DW_LANG_C99, file: !125, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, retainedTypes: !197, globals: !198, splitDebugInlining: false, nameTableKind: None)
!125 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/settings")
!126 = !{!127}
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !128, line: 27, baseType: !38, size: 32, elements: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = !{!130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196}
!130 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!131 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!132 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!133 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!134 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!135 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!136 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!137 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!138 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!139 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!140 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!141 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!142 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!143 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!144 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!145 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!146 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!147 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!148 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!149 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!150 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!151 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!152 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!153 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!154 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!155 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!156 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!157 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!158 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!159 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!160 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!161 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!162 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!163 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!164 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!165 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!166 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!167 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!168 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!169 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!170 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!171 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!172 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!173 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!174 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!175 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!176 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!177 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!178 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!179 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!180 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!181 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!182 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!183 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!184 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!185 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!186 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!187 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!188 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!189 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!190 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!191 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!192 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!193 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!194 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!195 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!196 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!197 = !{!30, !62}
!198 = !{!122}
!199 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = !DISubroutineType(types: !202)
!202 = !{!62, !62}
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !205, file: !264, line: 65, type: !265, isLocal: true, isDefinition: true, align: 32)
!205 = distinct !DICompileUnit(language: DW_LANG_C99, file: !206, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, retainedTypes: !207, globals: !259, splitDebugInlining: false, nameTableKind: None)
!206 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/settings")
!207 = !{!30, !62, !208, !53, !219}
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !210, file: !209, line: 167, baseType: !218)
!209 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !209, file: !209, line: 134, type: !211, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !205, retainedNodes: !213)
!211 = !DISubroutineType(types: !212)
!212 = !{null, !53}
!213 = !{!214, !215, !217}
!214 = !DILocalVariable(name: "time_us", arg: 1, scope: !210, file: !209, line: 134, type: !53)
!215 = !DILocalVariable(name: "delay_cycles", scope: !210, file: !209, line: 168, type: !216)
!216 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!217 = !DILocalVariable(name: "cycles", scope: !210, file: !209, line: 171, type: !53)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !221, line: 1928, baseType: !222)
!221 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !221, line: 1909, size: 11360, elements: !223)
!223 = !{!224, !230, !231, !232, !233, !237, !238, !239, !240, !244, !245, !249, !250, !251, !252, !253, !257, !258}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !222, file: !221, line: 1910, baseType: !225, size: 8192)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 8192, elements: !228)
!226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !227)
!227 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !53)
!228 = !{!229}
!229 = !DISubrange(count: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !222, file: !221, line: 1911, baseType: !226, size: 32, offset: 8192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !222, file: !221, line: 1912, baseType: !226, size: 32, offset: 8224)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !222, file: !221, line: 1913, baseType: !226, size: 32, offset: 8256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !222, file: !221, line: 1914, baseType: !234, size: 1984, offset: 8288)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 1984, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 62)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !222, file: !221, line: 1915, baseType: !227, size: 32, offset: 10272)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !222, file: !221, line: 1916, baseType: !226, size: 32, offset: 10304)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !222, file: !221, line: 1917, baseType: !227, size: 32, offset: 10336)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !222, file: !221, line: 1918, baseType: !241, size: 96, offset: 10368)
!241 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 96, elements: !242)
!242 = !{!243}
!243 = !DISubrange(count: 3)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !222, file: !221, line: 1919, baseType: !227, size: 32, offset: 10464)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !222, file: !221, line: 1920, baseType: !246, size: 256, offset: 10496)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 256, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 8)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !222, file: !221, line: 1921, baseType: !227, size: 32, offset: 10752)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !222, file: !221, line: 1922, baseType: !226, size: 32, offset: 10784)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !222, file: !221, line: 1923, baseType: !227, size: 32, offset: 10816)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !222, file: !221, line: 1924, baseType: !227, size: 32, offset: 10848)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !222, file: !221, line: 1925, baseType: !254, size: 416, offset: 10880)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 416, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 13)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !222, file: !221, line: 1926, baseType: !227, size: 32, offset: 11296)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !222, file: !221, line: 1927, baseType: !227, size: 32, offset: 11328)
!259 = !{!203, !260}
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !210, file: !209, line: 161, type: !262, isLocal: true, isDefinition: true, align: 128)
!262 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 48, elements: !242)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !50)
!264 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !267, line: 51, size: 64, elements: !268)
!267 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!268 = !{!269, !276}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !266, file: !267, line: 60, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!271 = !DISubroutineType(types: !272)
!272 = !{!62, !273}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !267, line: 48, flags: DIFlagFwdDecl)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !266, file: !267, line: 65, baseType: !273, size: 32, offset: 32)
!277 = !DIGlobalVariableExpression(var: !278, expr: !DIExpression())
!278 = distinct !DIGlobalVariable(name: "settings_load_srcs", scope: !279, file: !340, line: 23, type: !341, isLocal: false, isDefinition: true)
!279 = distinct !DICompileUnit(language: DW_LANG_C99, file: !280, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, retainedTypes: !281, globals: !337, splitDebugInlining: false, nameTableKind: None)
!280 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/settings/src/settings_store.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/settings")
!281 = !{!282, !286, !81, !30, !328, !62}
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !283, line: 46, baseType: !284)
!283 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !285)
!285 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings_store", file: !72, line: 365, size: 64, elements: !288)
!288 = !{!289, !295}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "cs_next", scope: !287, file: !72, line: 366, baseType: !290, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !105, line: 33, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !105, line: 29, size: 32, elements: !292)
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !291, file: !105, line: 30, baseType: !294, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "cs_itf", scope: !287, file: !72, line: 369, baseType: !296, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings_store_itf", file: !72, line: 403, size: 160, elements: !299)
!299 = !{!300, !315, !319, !323, !324}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "csi_load", scope: !298, file: !72, line: 404, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = !DISubroutineType(types: !303)
!303 = !{!62, !286, !304}
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings_load_arg", file: !72, line: 377, size: 96, elements: !307)
!307 = !{!308, !309, !314}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "subtree", scope: !306, file: !72, line: 383, baseType: !75, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !306, file: !72, line: 389, baseType: !310, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "settings_load_direct_cb", file: !72, line: 265, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = !DISubroutineType(types: !313)
!313 = !{!62, !75, !36, !86, !30, !30}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !306, file: !72, line: 395, baseType: !30, size: 32, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "csi_save_start", scope: !298, file: !72, line: 419, baseType: !316, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = !DISubroutineType(types: !318)
!318 = !{!62, !286}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "csi_save", scope: !298, file: !72, line: 426, baseType: !320, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 32)
!321 = !DISubroutineType(types: !322)
!322 = !{!62, !286, !75, !75, !36}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "csi_save_end", scope: !298, file: !72, line: 437, baseType: !316, size: 32, offset: 96)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "csi_storage_get", scope: !298, file: !72, line: 449, baseType: !325, size: 32, offset: 128)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 32)
!326 = !DISubroutineType(types: !327)
!327 = !{!30, !286}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings_handler", file: !72, line: 64, size: 192, elements: !330)
!330 = !{!331, !332, !333, !334, !335, !336}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !329, file: !72, line: 66, baseType: !75, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "h_get", scope: !329, file: !72, line: 69, baseType: !78, size: 32, offset: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "h_set", scope: !329, file: !72, line: 81, baseType: !83, size: 32, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "h_commit", scope: !329, file: !72, line: 96, baseType: !93, size: 32, offset: 96)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "h_export", scope: !329, file: !72, line: 103, baseType: !97, size: 32, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !329, file: !72, line: 121, baseType: !290, size: 32, offset: 160)
!337 = !{!277, !338}
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "settings_save_dst", scope: !279, file: !340, line: 24, type: !286, isLocal: false, isDefinition: true)
!340 = !DIFile(filename: "zephyr/subsys/settings/src/settings_store.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !105, line: 40, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !105, line: 35, size: 64, elements: !343)
!343 = !{!344, !346}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !342, file: !105, line: 36, baseType: !345, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !342, file: !105, line: 37, baseType: !345, size: 32, offset: 32)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "settings_lock", scope: !349, file: !377, line: 25, type: !384, isLocal: false, isDefinition: true, align: 32)
!349 = distinct !DICompileUnit(language: DW_LANG_C99, file: !350, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, retainedTypes: !351, globals: !374, splitDebugInlining: false, nameTableKind: None)
!350 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/settings/src/settings.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/settings")
!351 = !{!282, !352, !81, !30, !366, !62}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 32)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings_handler", file: !72, line: 64, size: 192, elements: !354)
!354 = !{!355, !356, !357, !358, !359, !360}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !353, file: !72, line: 66, baseType: !75, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "h_get", scope: !353, file: !72, line: 69, baseType: !78, size: 32, offset: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "h_set", scope: !353, file: !72, line: 81, baseType: !83, size: 32, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "h_commit", scope: !353, file: !72, line: 96, baseType: !93, size: 32, offset: 96)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "h_export", scope: !353, file: !72, line: 103, baseType: !97, size: 32, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !353, file: !72, line: 121, baseType: !361, size: 32, offset: 160)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !105, line: 33, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !105, line: 29, size: 32, elements: !363)
!363 = !{!364}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !362, file: !105, line: 30, baseType: !365, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 32)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "settings_handler_static", file: !72, line: 130, size: 160, elements: !368)
!368 = !{!369, !370, !371, !372, !373}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !367, file: !72, line: 132, baseType: !75, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "h_get", scope: !367, file: !72, line: 135, baseType: !78, size: 32, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "h_set", scope: !367, file: !72, line: 147, baseType: !83, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "h_commit", scope: !367, file: !72, line: 162, baseType: !93, size: 32, offset: 96)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "h_export", scope: !367, file: !72, line: 167, baseType: !97, size: 32, offset: 128)
!374 = !{!347, !375}
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "settings_handlers", scope: !349, file: !377, line: 22, type: !378, isLocal: false, isDefinition: true)
!377 = !DIFile(filename: "zephyr/subsys/settings/src/settings.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !105, line: 40, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !105, line: 35, size: 64, elements: !380)
!380 = !{!381, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !379, file: !105, line: 36, baseType: !382, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !379, file: !105, line: 37, baseType: !382, size: 32, offset: 32)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !385, line: 2720, size: 160, elements: !386)
!385 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!386 = !{!387, !408, !503, !504}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !384, file: !385, line: 2722, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !389, line: 233, baseType: !390)
!389 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !389, line: 231, size: 64, elements: !391)
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !390, file: !389, line: 232, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !394, line: 48, baseType: !395)
!394 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !394, line: 37, size: 64, elements: !396)
!396 = !{!397, !403}
!397 = !DIDerivedType(tag: DW_TAG_member, scope: !395, file: !394, line: 38, baseType: !398, size: 32)
!398 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !395, file: !394, line: 38, size: 32, elements: !399)
!399 = !{!400, !402}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !398, file: !394, line: 39, baseType: !401, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !398, file: !394, line: 40, baseType: !401, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, scope: !395, file: !394, line: 42, baseType: !404, size: 32, offset: 32)
!404 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !395, file: !394, line: 42, size: 32, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !404, file: !394, line: 43, baseType: !401, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !404, file: !394, line: 44, baseType: !401, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !384, file: !385, line: 2724, baseType: !409, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !411, line: 245, size: 1024, elements: !412)
!411 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!412 = !{!413, !458, !471, !472, !473, !474, !480, !498}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !410, file: !411, line: 247, baseType: !414, size: 384)
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !411, line: 57, size: 384, elements: !415)
!415 = !{!416, !430, !432, !433, !434, !445, !446, !447}
!416 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !411, line: 60, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !414, file: !411, line: 60, size: 64, elements: !418)
!418 = !{!419, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !417, file: !411, line: 61, baseType: !420, size: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !394, line: 49, baseType: !395)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !417, file: !411, line: 62, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !423, line: 49, size: 64, elements: !424)
!423 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !422, file: !423, line: 50, baseType: !426, size: 64)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 64, elements: !428)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!428 = !{!429}
!429 = !DISubrange(count: 2)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !414, file: !411, line: 68, baseType: !431, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !414, file: !411, line: 71, baseType: !41, size: 8, offset: 96)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !414, file: !411, line: 74, baseType: !41, size: 8, offset: 104)
!434 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !411, line: 90, baseType: !435, size: 16, offset: 112)
!435 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !414, file: !411, line: 90, size: 16, elements: !436)
!436 = !{!437, !444}
!437 = !DIDerivedType(tag: DW_TAG_member, scope: !435, file: !411, line: 91, baseType: !438, size: 16)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !435, file: !411, line: 91, size: 16, elements: !439)
!439 = !{!440, !443}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !438, file: !411, line: 96, baseType: !441, size: 8)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !442)
!442 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !438, file: !411, line: 97, baseType: !41, size: 8, offset: 8)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !435, file: !411, line: 100, baseType: !50, size: 16)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !414, file: !411, line: 107, baseType: !53, size: 32, offset: 128)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !414, file: !411, line: 127, baseType: !30, size: 32, offset: 160)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !414, file: !411, line: 131, baseType: !448, size: 192, offset: 192)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !389, line: 244, size: 192, elements: !449)
!449 = !{!450, !451, !457}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !448, file: !389, line: 245, baseType: !420, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !448, file: !389, line: 246, baseType: !452, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !389, line: 242, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !456}
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !448, file: !389, line: 249, baseType: !284, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !410, file: !411, line: 250, baseType: !459, size: 288, offset: 384)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !460, line: 25, size: 288, elements: !461)
!460 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !470}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !459, file: !460, line: 26, baseType: !53, size: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !459, file: !460, line: 27, baseType: !53, size: 32, offset: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !459, file: !460, line: 28, baseType: !53, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !459, file: !460, line: 29, baseType: !53, size: 32, offset: 96)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !459, file: !460, line: 30, baseType: !53, size: 32, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !459, file: !460, line: 31, baseType: !53, size: 32, offset: 160)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !459, file: !460, line: 32, baseType: !53, size: 32, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !459, file: !460, line: 33, baseType: !53, size: 32, offset: 224)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !459, file: !460, line: 34, baseType: !53, size: 32, offset: 256)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !410, file: !411, line: 253, baseType: !30, size: 32, offset: 672)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !410, file: !411, line: 256, baseType: !388, size: 64, offset: 704)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !410, file: !411, line: 294, baseType: !62, size: 32, offset: 768)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !410, file: !411, line: 300, baseType: !475, size: 96, offset: 800)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !411, line: 149, size: 96, elements: !476)
!476 = !{!477, !478, !479}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !475, file: !411, line: 153, baseType: !22, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !475, file: !411, line: 162, baseType: !36, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !475, file: !411, line: 168, baseType: !36, size: 32, offset: 64)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !410, file: !411, line: 325, baseType: !481, size: 32, offset: 896)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !385, line: 5073, size: 160, elements: !483)
!483 = !{!484, !493, !494}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !482, file: !385, line: 5074, baseType: !485, size: 96)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !486, line: 56, size: 96, elements: !487)
!486 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!487 = !{!488, !491, !492}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !485, file: !486, line: 57, baseType: !489, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !490, size: 32)
!490 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !486, line: 57, flags: DIFlagFwdDecl)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !485, file: !486, line: 58, baseType: !30, size: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !485, file: !486, line: 59, baseType: !36, size: 32, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !482, file: !385, line: 5075, baseType: !388, size: 64, offset: 96)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !482, file: !385, line: 5076, baseType: !495, offset: 160)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !496, line: 43, elements: !497)
!496 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!497 = !{}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !410, file: !411, line: 343, baseType: !499, size: 64, offset: 928)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !460, line: 60, size: 64, elements: !500)
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !499, file: !460, line: 63, baseType: !53, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !499, file: !460, line: 66, baseType: !53, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !384, file: !385, line: 2727, baseType: !53, size: 32, offset: 96)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !384, file: !385, line: 2730, baseType: !62, size: 32, offset: 128)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "settings_subsys_initialized", scope: !507, file: !510, line: 19, type: !511, isLocal: false, isDefinition: true)
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, retainedTypes: !197, globals: !509, splitDebugInlining: false, nameTableKind: None)
!508 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/settings/src/settings_init.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/settings")
!509 = !{!505}
!510 = !DIFile(filename: "zephyr/subsys/settings/src/settings_init.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!511 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !514, file: !547, line: 27, type: !572, isLocal: true, isDefinition: true)
!514 = distinct !DICompileUnit(language: DW_LANG_C99, file: !515, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !516, retainedTypes: !528, globals: !544, splitDebugInlining: false, nameTableKind: None)
!515 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/settings")
!516 = !{!517, !127}
!517 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !518, line: 27, baseType: !38, size: 32, elements: !519)
!518 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!519 = !{!520, !521, !522, !523, !524, !525, !526, !527}
!520 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!521 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!522 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!523 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!524 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!525 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!526 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!527 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!528 = !{!30, !282, !62, !24, !529, !81, !53, !47}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !531, line: 54, size: 96, elements: !532)
!531 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!532 = !{!533, !539, !543}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !530, file: !531, line: 55, baseType: !534, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !105, line: 33, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !105, line: 29, size: 32, elements: !536)
!536 = !{!537}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !535, file: !105, line: 30, baseType: !538, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !530, file: !531, line: 60, baseType: !540, size: 32, offset: 32)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !517}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !530, file: !531, line: 65, baseType: !540, size: 32, offset: 64)
!544 = !{!512, !545, !549, !551, !562, !564}
!545 = !DIGlobalVariableExpression(var: !546, expr: !DIExpression())
!546 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !514, file: !547, line: 44, type: !548, isLocal: true, isDefinition: true)
!547 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !496, line: 43, elements: !497)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !514, file: !547, line: 49, type: !548, isLocal: true, isDefinition: true)
!551 = !DIGlobalVariableExpression(var: !552, expr: !DIExpression())
!552 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !514, file: !547, line: 36, type: !553, isLocal: true, isDefinition: true)
!553 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 128, elements: !560)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !518, line: 114, size: 128, elements: !555)
!555 = !{!556, !557, !558, !559}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !554, file: !518, line: 115, baseType: !517, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !554, file: !518, line: 141, baseType: !41, size: 8, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !554, file: !518, line: 149, baseType: !53, size: 32, offset: 64)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !554, file: !518, line: 156, baseType: !53, size: 32, offset: 96)
!560 = !{!561}
!561 = !DISubrange(count: 1)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !514, file: !547, line: 40, type: !553, isLocal: true, isDefinition: true)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !514, file: !547, line: 28, type: !566, isLocal: true, isDefinition: true)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !105, line: 40, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !105, line: 35, size: 64, elements: !568)
!568 = !{!569, !571}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !567, file: !105, line: 36, baseType: !570, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !567, file: !105, line: 37, baseType: !570, size: 32, offset: 32)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 32, elements: !560)
!573 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !574, line: 22, baseType: !575)
!574 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!575 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!576 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!577 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !580, file: !608, line: 50, type: !61, isLocal: true, isDefinition: true)
!580 = distinct !DICompileUnit(language: DW_LANG_C99, file: !581, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !516, retainedTypes: !582, globals: !605, splitDebugInlining: false, nameTableKind: None)
!581 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/settings")
!582 = !{!583, !282, !36, !62, !30, !53, !47, !585, !81, !61, !596}
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !584)
!584 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !587, line: 45, size: 64, elements: !588)
!587 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!588 = !{!589, !595}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !586, file: !587, line: 46, baseType: !590, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !105, line: 33, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !105, line: 29, size: 32, elements: !592)
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !591, file: !105, line: 30, baseType: !594, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !586, file: !587, line: 48, baseType: !53, size: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 32)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !587, line: 38, size: 64, elements: !598)
!598 = !{!599, !600}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !597, file: !587, line: 39, baseType: !590, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !597, file: !587, line: 41, baseType: !601, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !587, line: 35, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !61}
!605 = !{!606, !610, !618, !578, !620, !630}
!606 = !DIGlobalVariableExpression(var: !607, expr: !DIExpression())
!607 = distinct !DIGlobalVariable(name: "latency_lock", scope: !580, file: !608, line: 44, type: !609, isLocal: true, isDefinition: true)
!608 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !496, line: 43, elements: !497)
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !580, file: !608, line: 46, type: !612, isLocal: true, isDefinition: true)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !105, line: 40, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !105, line: 35, size: 64, elements: !614)
!614 = !{!615, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !613, file: !105, line: 36, baseType: !616, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !613, file: !105, line: 37, baseType: !616, size: 32, offset: 32)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "latency_subs", scope: !580, file: !608, line: 52, type: !612, isLocal: true, isDefinition: true)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !580, file: !608, line: 39, type: !622, isLocal: true, isDefinition: true)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, elements: !628)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !608, line: 35, size: 96, elements: !624)
!624 = !{!625, !626, !627}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !623, file: !608, line: 36, baseType: !517, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !623, file: !608, line: 37, baseType: !41, size: 8, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !623, file: !608, line: 38, baseType: !573, size: 32, offset: 64)
!628 = !{!629}
!629 = !DISubrange(count: 0)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !580, file: !608, line: 48, type: !61, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !634, file: !641, line: 47, type: !655, isLocal: true, isDefinition: true)
!634 = distinct !DICompileUnit(language: DW_LANG_C99, file: !635, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !636, retainedTypes: !637, globals: !638, splitDebugInlining: false, nameTableKind: None)
!635 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/settings")
!636 = !{!517}
!637 = !{!36, !62}
!638 = !{!639, !632, !651}
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "cpus_states", scope: !634, file: !641, line: 50, type: !642, isLocal: true, isDefinition: true)
!641 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 32, elements: !560)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !645)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !518, line: 114, size: 128, elements: !646)
!646 = !{!647, !648, !649, !650}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !645, file: !518, line: 115, baseType: !517, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !645, file: !518, line: 141, baseType: !41, size: 8, offset: 32)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !645, file: !518, line: 149, baseType: !53, size: 32, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !645, file: !518, line: 156, baseType: !53, size: 32, offset: 96)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !634, file: !641, line: 55, type: !653, isLocal: true, isDefinition: true)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 8, elements: !560)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !41)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, elements: !628)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "static_regions", scope: !658, file: !665, line: 62, type: !784, isLocal: true, isDefinition: true)
!658 = distinct !DICompileUnit(language: DW_LANG_C99, file: !659, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, retainedTypes: !660, globals: !661, splitDebugInlining: false, nameTableKind: None)
!659 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/settings")
!660 = !{!36, !62, !53, !30}
!661 = !{!662, !656}
!662 = !DIGlobalVariableExpression(var: !663, expr: !DIExpression())
!663 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !664, file: !665, line: 198, type: !771, isLocal: true, isDefinition: true)
!664 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !665, file: !665, line: 175, type: !666, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !658, retainedNodes: !768)
!665 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!666 = !DISubroutineType(types: !667)
!667 = !{null, !668}
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 32)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !411, line: 245, size: 1024, elements: !670)
!670 = !{!671, !729, !741, !742, !743, !744, !750, !763}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !669, file: !411, line: 247, baseType: !672, size: 384)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !411, line: 57, size: 384, elements: !673)
!673 = !{!674, !698, !705, !706, !707, !716, !717, !718}
!674 = !DIDerivedType(tag: DW_TAG_member, scope: !672, file: !411, line: 60, baseType: !675, size: 64)
!675 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !672, file: !411, line: 60, size: 64, elements: !676)
!676 = !{!677, !692}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !675, file: !411, line: 61, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !394, line: 49, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !394, line: 37, size: 64, elements: !680)
!680 = !{!681, !687}
!681 = !DIDerivedType(tag: DW_TAG_member, scope: !679, file: !394, line: 38, baseType: !682, size: 32)
!682 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !679, file: !394, line: 38, size: 32, elements: !683)
!683 = !{!684, !686}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !682, file: !394, line: 39, baseType: !685, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !682, file: !394, line: 40, baseType: !685, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, scope: !679, file: !394, line: 42, baseType: !688, size: 32, offset: 32)
!688 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !679, file: !394, line: 42, size: 32, elements: !689)
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !688, file: !394, line: 43, baseType: !685, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !688, file: !394, line: 44, baseType: !685, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !675, file: !411, line: 62, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !423, line: 49, size: 64, elements: !694)
!694 = !{!695}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !693, file: !423, line: 50, baseType: !696, size: 64)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, size: 64, elements: !428)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !672, file: !411, line: 68, baseType: !699, size: 32, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !389, line: 233, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !389, line: 231, size: 64, elements: !702)
!702 = !{!703}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !701, file: !389, line: 232, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !394, line: 48, baseType: !679)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !672, file: !411, line: 71, baseType: !41, size: 8, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !672, file: !411, line: 74, baseType: !41, size: 8, offset: 104)
!707 = !DIDerivedType(tag: DW_TAG_member, scope: !672, file: !411, line: 90, baseType: !708, size: 16, offset: 112)
!708 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !672, file: !411, line: 90, size: 16, elements: !709)
!709 = !{!710, !715}
!710 = !DIDerivedType(tag: DW_TAG_member, scope: !708, file: !411, line: 91, baseType: !711, size: 16)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !708, file: !411, line: 91, size: 16, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !711, file: !411, line: 96, baseType: !441, size: 8)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !711, file: !411, line: 97, baseType: !41, size: 8, offset: 8)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !708, file: !411, line: 100, baseType: !50, size: 16)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !672, file: !411, line: 107, baseType: !53, size: 32, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !672, file: !411, line: 127, baseType: !30, size: 32, offset: 160)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !672, file: !411, line: 131, baseType: !719, size: 192, offset: 192)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !389, line: 244, size: 192, elements: !720)
!720 = !{!721, !722, !728}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !719, file: !389, line: 245, baseType: !678, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !719, file: !389, line: 246, baseType: !723, size: 32, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !389, line: 242, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !727}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !719, file: !389, line: 249, baseType: !284, size: 64, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !669, file: !411, line: 250, baseType: !730, size: 288, offset: 384)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !460, line: 25, size: 288, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737, !738, !739, !740}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !730, file: !460, line: 26, baseType: !53, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !730, file: !460, line: 27, baseType: !53, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !730, file: !460, line: 28, baseType: !53, size: 32, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !730, file: !460, line: 29, baseType: !53, size: 32, offset: 96)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !730, file: !460, line: 30, baseType: !53, size: 32, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !730, file: !460, line: 31, baseType: !53, size: 32, offset: 160)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !730, file: !460, line: 32, baseType: !53, size: 32, offset: 192)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !730, file: !460, line: 33, baseType: !53, size: 32, offset: 224)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !730, file: !460, line: 34, baseType: !53, size: 32, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !669, file: !411, line: 253, baseType: !30, size: 32, offset: 672)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !669, file: !411, line: 256, baseType: !700, size: 64, offset: 704)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !669, file: !411, line: 294, baseType: !62, size: 32, offset: 768)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !669, file: !411, line: 300, baseType: !745, size: 96, offset: 800)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !411, line: 149, size: 96, elements: !746)
!746 = !{!747, !748, !749}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !745, file: !411, line: 153, baseType: !22, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !745, file: !411, line: 162, baseType: !36, size: 32, offset: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !745, file: !411, line: 168, baseType: !36, size: 32, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !669, file: !411, line: 325, baseType: !751, size: 32, offset: 896)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !385, line: 5073, size: 160, elements: !753)
!753 = !{!754, !760, !761}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !752, file: !385, line: 5074, baseType: !755, size: 96)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !486, line: 56, size: 96, elements: !756)
!756 = !{!757, !758, !759}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !755, file: !486, line: 57, baseType: !489, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !755, file: !486, line: 58, baseType: !30, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !755, file: !486, line: 59, baseType: !36, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !752, file: !385, line: 5075, baseType: !700, size: 64, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !752, file: !385, line: 5076, baseType: !762, offset: 160)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !496, line: 43, elements: !497)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !669, file: !411, line: 343, baseType: !764, size: 64, offset: 928)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !460, line: 60, size: 64, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !764, file: !460, line: 63, baseType: !53, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !764, file: !460, line: 66, baseType: !53, size: 32, offset: 32)
!768 = !{!769, !770}
!769 = !DILocalVariable(name: "thread", arg: 1, scope: !664, file: !665, line: 175, type: !668)
!770 = !DILocalVariable(name: "region_num", scope: !664, file: !665, line: 200, type: !41)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !772, elements: !628)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !773, line: 52, size: 96, elements: !774)
!773 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!774 = !{!775, !776, !777}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !772, file: !773, line: 53, baseType: !22, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !772, file: !773, line: 54, baseType: !36, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !772, file: !773, line: 55, baseType: !778, size: 32, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !779, line: 304, baseType: !780)
!779 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !779, line: 301, size: 32, elements: !781)
!781 = !{!782, !783}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !780, file: !779, line: 302, baseType: !50, size: 16)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !780, file: !779, line: 303, baseType: !50, size: 16, offset: 16)
!784 = !DICompositeType(tag: DW_TAG_array_type, baseType: !785, size: 96, elements: !560)
!785 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !772)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !788, file: !842, line: 39, type: !41, isLocal: true, isDefinition: true)
!788 = distinct !DICompileUnit(language: DW_LANG_C99, file: !789, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, retainedTypes: !790, globals: !833, splitDebugInlining: false, nameTableKind: None)
!789 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/settings")
!790 = !{!791, !30, !62, !819}
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !793, line: 1495, baseType: !794)
!793 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !793, line: 1474, size: 448, elements: !795)
!795 = !{!796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !809}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !794, file: !793, line: 1476, baseType: !226, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !794, file: !793, line: 1477, baseType: !227, size: 32, offset: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !794, file: !793, line: 1478, baseType: !227, size: 32, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !794, file: !793, line: 1479, baseType: !227, size: 32, offset: 96)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !794, file: !793, line: 1480, baseType: !227, size: 32, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !794, file: !793, line: 1481, baseType: !227, size: 32, offset: 160)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !794, file: !793, line: 1482, baseType: !227, size: 32, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !794, file: !793, line: 1483, baseType: !227, size: 32, offset: 224)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !794, file: !793, line: 1484, baseType: !227, size: 32, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !794, file: !793, line: 1485, baseType: !227, size: 32, offset: 288)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !794, file: !793, line: 1486, baseType: !227, size: 32, offset: 320)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !794, file: !793, line: 1487, baseType: !808, size: 32, offset: 352)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 32, elements: !560)
!809 = !DIDerivedType(tag: DW_TAG_member, scope: !794, file: !793, line: 1488, baseType: !810, size: 64, offset: 384)
!810 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !794, file: !793, line: 1488, size: 64, elements: !811)
!811 = !{!812, !814}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !810, file: !793, line: 1489, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !227, size: 64, elements: !428)
!814 = !DIDerivedType(tag: DW_TAG_member, scope: !810, file: !793, line: 1490, baseType: !815, size: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !810, file: !793, line: 1490, size: 64, elements: !816)
!816 = !{!817, !818}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !815, file: !793, line: 1491, baseType: !227, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !815, file: !793, line: 1492, baseType: !227, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !822, line: 27, size: 128, elements: !823)
!822 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!823 = !{!824, !825, !826}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !821, file: !822, line: 29, baseType: !53, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !821, file: !822, line: 31, baseType: !75, size: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !821, file: !822, line: 37, baseType: !827, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !779, line: 298, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !779, line: 289, size: 64, elements: !829)
!829 = !{!830, !831, !832}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !828, file: !779, line: 291, baseType: !41, size: 5, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !828, file: !779, line: 293, baseType: !41, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !828, file: !779, line: 295, baseType: !53, size: 32, offset: 32)
!833 = !{!786, !834}
!834 = !DIGlobalVariableExpression(var: !835, expr: !DIExpression())
!835 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !788, file: !836, line: 31, type: !837, isLocal: true, isDefinition: true)
!836 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !838, size: 160, elements: !560)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !836, line: 21, size: 160, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !838, file: !836, line: 22, baseType: !62, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !838, file: !836, line: 23, baseType: !821, size: 128, offset: 32)
!842 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!843 = !DIGlobalVariableExpression(var: !844, expr: !DIExpression())
!844 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !845, file: !852, line: 21, type: !200, isLocal: true, isDefinition: true)
!845 = distinct !DICompileUnit(language: DW_LANG_C99, file: !846, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !126, retainedTypes: !847, globals: !851, splitDebugInlining: false, nameTableKind: None)
!846 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/settings")
!847 = !{!848, !62, !30}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !850, line: 22, baseType: !62)
!850 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!851 = !{!843}
!852 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!853 = !DIGlobalVariableExpression(var: !854, expr: !DIExpression())
!854 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !855, file: !860, line: 13, type: !879, isLocal: true, isDefinition: true)
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !857, splitDebugInlining: false, nameTableKind: None)
!856 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/settings")
!857 = !{!858, !853}
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "mpu_config", scope: !855, file: !860, line: 37, type: !861, isLocal: false, isDefinition: true)
!860 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !822, line: 41, size: 64, elements: !863)
!863 = !{!864, !865}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !862, file: !822, line: 43, baseType: !53, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !862, file: !822, line: 45, baseType: !866, size: 32, offset: 32)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !822, line: 27, size: 128, elements: !869)
!869 = !{!870, !871, !872}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !868, file: !822, line: 29, baseType: !53, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !868, file: !822, line: 31, baseType: !75, size: 32, offset: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !868, file: !822, line: 37, baseType: !873, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !779, line: 298, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !779, line: 289, size: 64, elements: !875)
!875 = !{!876, !877, !878}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !874, file: !779, line: 291, baseType: !41, size: 5, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !874, file: !779, line: 293, baseType: !41, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !874, file: !779, line: 295, baseType: !53, size: 32, offset: 32)
!879 = !DICompositeType(tag: DW_TAG_array_type, baseType: !867, size: 256, elements: !428)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "__init_board_actinius_icarus_bee_init", scope: !882, file: !982, line: 39, type: !983, isLocal: true, isDefinition: true, align: 32)
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !884, retainedTypes: !896, globals: !981, splitDebugInlining: false, nameTableKind: None)
!883 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/actinius_icarus_bee/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/settings")
!884 = !{!885, !891}
!885 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !886, line: 506, baseType: !38, size: 32, elements: !887)
!886 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!887 = !{!888, !889, !890}
!888 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!889 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!890 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!891 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !886, line: 512, baseType: !38, size: 32, elements: !892)
!892 = !{!893, !894, !895}
!893 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!894 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!895 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!896 = !{!897, !970, !975, !936, !891, !885, !980, !30}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !886, line: 523, size: 288, elements: !900)
!900 = !{!901, !926, !932, !937, !941, !942, !943, !947, !966}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !899, file: !886, line: 524, baseType: !902, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = !DISubroutineType(types: !904)
!904 = !{!62, !905, !924, !925}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !907)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !908, line: 378, size: 192, elements: !909)
!908 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!909 = !{!910, !911, !912, !913, !919, !920}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !907, file: !908, line: 380, baseType: !75, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !907, file: !908, line: 382, baseType: !13, size: 32, offset: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !907, file: !908, line: 384, baseType: !13, size: 32, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !907, file: !908, line: 386, baseType: !914, size: 32, offset: 96)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !908, line: 351, size: 16, elements: !916)
!916 = !{!917, !918}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !915, file: !908, line: 359, baseType: !41, size: 8)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !915, file: !908, line: 364, baseType: !511, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !907, file: !908, line: 388, baseType: !30, size: 32, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !907, file: !908, line: 396, baseType: !921, size: 32, offset: 160)
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !908, line: 43, baseType: !583)
!924 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !886, line: 237, baseType: !41)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !886, line: 257, baseType: !53)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !899, file: !886, line: 530, baseType: !927, size: 32, offset: 32)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 32)
!928 = !DISubroutineType(types: !929)
!929 = !{!62, !905, !930}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !886, line: 229, baseType: !53)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !899, file: !886, line: 532, baseType: !933, size: 32, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 32)
!934 = !DISubroutineType(types: !935)
!935 = !{!62, !905, !936, !931}
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !886, line: 216, baseType: !53)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !899, file: !886, line: 535, baseType: !938, size: 32, offset: 96)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 32)
!939 = !DISubroutineType(types: !940)
!940 = !{!62, !905, !936}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !899, file: !886, line: 537, baseType: !938, size: 32, offset: 128)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !899, file: !886, line: 539, baseType: !938, size: 32, offset: 160)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !899, file: !886, line: 541, baseType: !944, size: 32, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = !DISubroutineType(types: !946)
!946 = !{!62, !905, !924, !885, !891}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !899, file: !886, line: 544, baseType: !948, size: 32, offset: 224)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 32)
!949 = !DISubroutineType(types: !950)
!950 = !{!62, !905, !951, !511}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !886, line: 478, size: 96, elements: !953)
!953 = !{!954, !960, !965}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !952, file: !886, line: 482, baseType: !955, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !105, line: 33, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !105, line: 29, size: 32, elements: !957)
!957 = !{!958}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !956, file: !105, line: 30, baseType: !959, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !952, file: !886, line: 485, baseType: !961, size: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !886, line: 464, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!963 = !DISubroutineType(types: !964)
!964 = !{null, !905, !951, !936}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !952, file: !886, line: 493, baseType: !936, size: 32, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !899, file: !886, line: 547, baseType: !967, size: 32, offset: 256)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = !DISubroutineType(types: !969)
!969 = !{!53, !905}
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !886, line: 428, size: 32, elements: !973)
!973 = !{!974}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !972, file: !886, line: 434, baseType: !936, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !886, line: 441, size: 32, elements: !978)
!978 = !{!979}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !977, file: !886, line: 447, baseType: !936, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!981 = !{!880}
!982 = !DIFile(filename: "zephyr/boards/arm/actinius_icarus_bee/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !267, line: 51, size: 64, elements: !985)
!985 = !{!986, !990}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !984, file: !267, line: 60, baseType: !987, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!988 = !DISubroutineType(types: !989)
!989 = !{!62, !905}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !984, file: !267, line: 65, baseType: !905, size: 32, offset: 32)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(name: "__device_dts_ord_48", scope: !993, file: !1197, line: 733, type: !1300, isLocal: false, isDefinition: true, align: 32)
!993 = distinct !DICompileUnit(language: DW_LANG_C99, file: !994, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !995, retainedTypes: !1113, globals: !1193, splitDebugInlining: false, nameTableKind: None)
!994 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus_bee_ns/settings")
!995 = !{!996, !1002, !127, !1007, !1012, !1016, !1020, !1024, !1030, !1034, !1078, !1085, !1104}
!996 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !997, line: 23, baseType: !38, size: 32, elements: !998)
!997 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!998 = !{!999, !1000, !1001}
!999 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!1000 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!1001 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!1002 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !997, line: 48, baseType: !38, size: 32, elements: !1003)
!1003 = !{!1004, !1005, !1006}
!1004 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!1005 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!1006 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!1007 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1008, line: 167, baseType: !38, size: 32, elements: !1009)
!1008 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1009 = !{!1010, !1011}
!1010 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!1011 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!1012 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1008, line: 107, baseType: !38, size: 32, elements: !1013)
!1013 = !{!1014, !1015}
!1014 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!1015 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!1016 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1008, line: 208, baseType: !38, size: 32, elements: !1017)
!1017 = !{!1018, !1019}
!1018 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!1019 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!1020 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1008, line: 261, baseType: !38, size: 32, elements: !1021)
!1021 = !{!1022, !1023}
!1022 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!1023 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!1024 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1008, line: 237, baseType: !38, size: 32, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029}
!1026 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!1027 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!1028 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!1029 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!1030 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1008, line: 152, baseType: !38, size: 32, elements: !1031)
!1031 = !{!1032, !1033}
