; ModuleID = 'build/actinius_icarus/simple/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.k_condvar = type { %struct._wait_q_t }
%struct.z_thread_stack_element = type { i8 }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/simple/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/simple")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/simple")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "mutex", scope: !27, file: !116, line: 18, type: !262, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !113, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/condition_variables/simple/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/simple")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108, !109, !110, !111}
!102 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !102)
!109 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !112)
!112 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!113 = !{!25, !114, !141, !152, !260}
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "condvar", scope: !27, file: !116, line: 19, type: !117, isLocal: false, isDefinition: true, align: 32)
!116 = !DIFile(filename: "zephyr/samples/kernel/condition_variables/simple/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_condvar", file: !118, line: 2828, size: 64, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !117, file: !118, line: 2829, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !124)
!124 = !{!125}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !123, file: !122, line: 232, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !129)
!129 = !{!130, !136}
!130 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 38, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 38, size: 32, elements: !132)
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !131, file: !127, line: 39, baseType: !134, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !131, file: !127, line: 40, baseType: !134, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, scope: !128, file: !127, line: 42, baseType: !137, size: 32, offset: 32)
!137 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !128, file: !127, line: 42, size: 32, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !137, file: !127, line: 43, baseType: !134, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !137, file: !127, line: 44, baseType: !134, size: 32)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "tstacks", scope: !27, file: !116, line: 14, type: !143, isLocal: false, isDefinition: true, align: 64)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 163840, elements: !149)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !145, line: 47, size: 8, elements: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !144, file: !145, line: 48, baseType: !148, size: 8)
!148 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!149 = !{!150, !151}
!150 = !DISubrange(count: 20)
!151 = !DISubrange(count: 1024)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "t", scope: !27, file: !116, line: 16, type: !154, isLocal: true, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !155, size: 25600, elements: !259)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !156, line: 245, size: 1280, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{!158, !207, !220, !221, !222, !226, !227, !235, !254}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !155, file: !156, line: 247, baseType: !159, size: 384)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !156, line: 57, size: 384, elements: !160)
!160 = !{!161, !175, !177, !180, !181, !194, !195, !196}
!161 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 60, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 60, size: 64, elements: !163)
!163 = !{!164, !166}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !162, file: !156, line: 61, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !162, file: !156, line: 62, baseType: !167, size: 64)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 49, size: 64, elements: !169)
!168 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!169 = !{!170}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !167, file: !168, line: 50, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !172, size: 64, elements: !173)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!173 = !{!174}
!174 = !DISubrange(count: 2)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !159, file: !156, line: 68, baseType: !176, size: 32, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !159, file: !156, line: 71, baseType: !178, size: 8, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !179)
!179 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !159, file: !156, line: 74, baseType: !178, size: 8, offset: 104)
!181 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !156, line: 90, baseType: !182, size: 16, offset: 112)
!182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !159, file: !156, line: 90, size: 16, elements: !183)
!183 = !{!184, !191}
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !182, file: !156, line: 91, baseType: !185, size: 16)
!185 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !182, file: !156, line: 91, size: 16, elements: !186)
!186 = !{!187, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !185, file: !156, line: 96, baseType: !188, size: 8)
!188 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !189)
!189 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !185, file: !156, line: 97, baseType: !178, size: 8, offset: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !182, file: !156, line: 100, baseType: !192, size: 16)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !193)
!193 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !159, file: !156, line: 107, baseType: !110, size: 32, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !159, file: !156, line: 127, baseType: !107, size: 32, offset: 160)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !159, file: !156, line: 131, baseType: !197, size: 192, offset: 192)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !198)
!198 = !{!199, !200, !206}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !197, file: !122, line: 245, baseType: !165, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !197, file: !122, line: 246, baseType: !201, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !202)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DISubroutineType(types: !204)
!204 = !{null, !205}
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !197, file: !122, line: 249, baseType: !105, size: 64, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !155, file: !156, line: 250, baseType: !208, size: 288, offset: 384)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !209, line: 25, size: 288, elements: !210)
!209 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = !{!211, !212, !213, !214, !215, !216, !217, !218, !219}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !208, file: !209, line: 26, baseType: !110, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !208, file: !209, line: 27, baseType: !110, size: 32, offset: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !208, file: !209, line: 28, baseType: !110, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !208, file: !209, line: 29, baseType: !110, size: 32, offset: 96)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !208, file: !209, line: 30, baseType: !110, size: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !208, file: !209, line: 31, baseType: !110, size: 32, offset: 160)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !208, file: !209, line: 32, baseType: !110, size: 32, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !208, file: !209, line: 33, baseType: !110, size: 32, offset: 224)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !208, file: !209, line: 34, baseType: !110, size: 32, offset: 256)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !155, file: !156, line: 253, baseType: !107, size: 32, offset: 672)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !155, file: !156, line: 256, baseType: !121, size: 64, offset: 704)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !155, file: !156, line: 279, baseType: !223, size: 256, offset: 768)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 256, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !155, file: !156, line: 294, baseType: !109, size: 32, offset: 1024)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !155, file: !156, line: 300, baseType: !228, size: 96, offset: 1056)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !156, line: 149, size: 96, elements: !229)
!229 = !{!230, !231, !234}
!230 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !228, file: !156, line: 153, baseType: !22, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !228, file: !156, line: 162, baseType: !232, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !233, line: 214, baseType: !32)
!233 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!234 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !228, file: !156, line: 168, baseType: !232, size: 32, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !155, file: !156, line: 325, baseType: !236, size: 32, offset: 1152)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 192, elements: !238)
!238 = !{!239, !248, !249}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !237, file: !118, line: 5074, baseType: !240, size: 96)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !241, line: 56, size: 96, elements: !242)
!241 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!242 = !{!243, !246, !247}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !240, file: !241, line: 57, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !241, line: 57, flags: DIFlagFwdDecl)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !240, file: !241, line: 58, baseType: !107, size: 32, offset: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !240, file: !241, line: 59, baseType: !232, size: 32, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !237, file: !118, line: 5075, baseType: !121, size: 64, offset: 96)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !237, file: !118, line: 5076, baseType: !250, size: 32, offset: 160)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !251, line: 43, size: 32, elements: !252)
!251 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!252 = !{!253}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !250, file: !251, line: 52, baseType: !22, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !155, file: !156, line: 343, baseType: !255, size: 64, offset: 1184)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !209, line: 60, size: 64, elements: !256)
!256 = !{!257, !258}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !255, file: !209, line: 63, baseType: !110, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !255, file: !209, line: 66, baseType: !110, size: 32, offset: 32)
!259 = !{!150}
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "done", scope: !27, file: !116, line: 21, type: !109, isLocal: true, isDefinition: true)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !118, line: 2720, size: 160, elements: !263)
!263 = !{!264, !265, !267, !268}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !262, file: !118, line: 2722, baseType: !121, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !262, file: !118, line: 2724, baseType: !266, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !262, file: !118, line: 2727, baseType: !110, size: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !262, file: !118, line: 2730, baseType: !109, size: 32, offset: 128)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !271, file: !288, line: 18, type: !289, isLocal: false, isDefinition: true)
!271 = distinct !DICompileUnit(language: DW_LANG_C99, file: !272, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !273, globals: !287, splitDebugInlining: false, nameTableKind: None)
!272 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/simple")
!273 = !{!22, !107, !24, !274, !276, !278, !232, !109, !281, !282, !283, !284, !285, !286, !192, !279}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 32)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!287 = !{!269}
!288 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!289 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !291, line: 16, size: 64, elements: !292)
!291 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !290, file: !291, line: 17, baseType: !279, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !290, file: !291, line: 18, baseType: !178, size: 8, offset: 32)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "_char_out", scope: !297, file: !301, line: 54, type: !302, isLocal: false, isDefinition: true)
!297 = distinct !DICompileUnit(language: DW_LANG_C99, file: !298, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !299, globals: !300, splitDebugInlining: false, nameTableKind: None)
!298 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/simple")
!299 = !{!107, !109}
!300 = !{!295}
!301 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 32)
!303 = !DISubroutineType(types: !304)
!304 = !{!109, !109}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !307, file: !364, line: 35, type: !381, isLocal: false, isDefinition: true)
!307 = distinct !DICompileUnit(language: DW_LANG_C99, file: !308, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !309, globals: !361, splitDebugInlining: false, nameTableKind: None)
!308 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/simple")
!309 = !{!107, !109, !310, !110, !321}
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !312, file: !311, line: 167, baseType: !320)
!311 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !311, file: !311, line: 134, type: !313, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !307, retainedNodes: !315)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !110}
!315 = !{!316, !317, !319}
!316 = !DILocalVariable(name: "time_us", arg: 1, scope: !312, file: !311, line: 134, type: !110)
!317 = !DILocalVariable(name: "delay_cycles", scope: !312, file: !311, line: 168, type: !318)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!319 = !DILocalVariable(name: "cycles", scope: !312, file: !311, line: 171, type: !110)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !323, line: 1928, baseType: !324)
!323 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 1909, size: 11360, elements: !325)
!325 = !{!326, !332, !333, !334, !335, !339, !340, !341, !342, !346, !347, !351, !352, !353, !354, !355, !359, !360}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !324, file: !323, line: 1910, baseType: !327, size: 8192)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 8192, elements: !330)
!328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!329 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !110)
!330 = !{!331}
!331 = !DISubrange(count: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !324, file: !323, line: 1911, baseType: !328, size: 32, offset: 8192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !324, file: !323, line: 1912, baseType: !328, size: 32, offset: 8224)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !324, file: !323, line: 1913, baseType: !328, size: 32, offset: 8256)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !324, file: !323, line: 1914, baseType: !336, size: 1984, offset: 8288)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 1984, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 62)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !324, file: !323, line: 1915, baseType: !329, size: 32, offset: 10272)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !324, file: !323, line: 1916, baseType: !328, size: 32, offset: 10304)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !324, file: !323, line: 1917, baseType: !329, size: 32, offset: 10336)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !324, file: !323, line: 1918, baseType: !343, size: 96, offset: 10368)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 96, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 3)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !324, file: !323, line: 1919, baseType: !329, size: 32, offset: 10464)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !324, file: !323, line: 1920, baseType: !348, size: 256, offset: 10496)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 256, elements: !349)
!349 = !{!350}
!350 = !DISubrange(count: 8)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !324, file: !323, line: 1921, baseType: !329, size: 32, offset: 10752)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !324, file: !323, line: 1922, baseType: !328, size: 32, offset: 10784)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !324, file: !323, line: 1923, baseType: !329, size: 32, offset: 10816)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !324, file: !323, line: 1924, baseType: !329, size: 32, offset: 10848)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !324, file: !323, line: 1925, baseType: !356, size: 416, offset: 10880)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 416, elements: !357)
!357 = !{!358}
!358 = !DISubrange(count: 13)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !324, file: !323, line: 1926, baseType: !329, size: 32, offset: 11296)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !324, file: !323, line: 1927, baseType: !329, size: 32, offset: 11328)
!361 = !{!305, !362, !377}
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !307, file: !364, line: 65, type: !365, isLocal: true, isDefinition: true, align: 32)
!364 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !367, line: 51, size: 64, elements: !368)
!367 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!368 = !{!369, !376}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !366, file: !367, line: 60, baseType: !370, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 32)
!371 = !DISubroutineType(types: !372)
!372 = !{!109, !373}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !375)
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !367, line: 48, flags: DIFlagFwdDecl)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !366, file: !367, line: 65, baseType: !373, size: 32, offset: 32)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !312, file: !311, line: 161, type: !379, isLocal: true, isDefinition: true, align: 128)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 48, elements: !344)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !291, line: 16, size: 64, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !382, file: !291, line: 17, baseType: !279, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !382, file: !291, line: 18, baseType: !178, size: 8, offset: 32)
!386 = !DIGlobalVariableExpression(var: !387, expr: !DIExpression())
!387 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !388, file: !422, line: 22, type: !454, isLocal: false, isDefinition: true)
!388 = distinct !DICompileUnit(language: DW_LANG_C99, file: !389, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !390, retainedTypes: !402, globals: !419, splitDebugInlining: false, nameTableKind: None)
!389 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/simple")
!390 = !{!391, !30}
!391 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !392, line: 27, baseType: !32, size: 32, elements: !393)
!392 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!393 = !{!394, !395, !396, !397, !398, !399, !400, !401}
!394 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!395 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!396 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!397 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!398 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!399 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!400 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!401 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!402 = !{!107, !103, !109, !24, !403, !285, !110, !111}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !405, line: 54, size: 96, elements: !406)
!405 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = !{!407, !414, !418}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !404, file: !405, line: 55, baseType: !408, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !409, line: 33, baseType: !410)
!409 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !409, line: 29, size: 32, elements: !411)
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !410, file: !409, line: 30, baseType: !413, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !404, file: !405, line: 60, baseType: !415, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 32)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !391}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !404, file: !405, line: 65, baseType: !415, size: 32, offset: 64)
!419 = !{!386, !420, !428, !433, !435, !444, !446}
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !388, file: !422, line: 27, type: !423, isLocal: true, isDefinition: true)
!422 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!423 = !DICompositeType(tag: DW_TAG_array_type, baseType: !424, size: 32, elements: !426)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !425, line: 22, baseType: !102)
!425 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!426 = !{!427}
!427 = !DISubrange(count: 1)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !388, file: !422, line: 44, type: !430, isLocal: true, isDefinition: true)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !251, line: 43, size: 32, elements: !431)
!431 = !{!432}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !430, file: !251, line: 52, baseType: !22, size: 32)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !388, file: !422, line: 49, type: !430, isLocal: true, isDefinition: true)
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !388, file: !422, line: 36, type: !437, isLocal: true, isDefinition: true)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 128, elements: !426)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !392, line: 114, size: 128, elements: !439)
!439 = !{!440, !441, !442, !443}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !438, file: !392, line: 115, baseType: !391, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !438, file: !392, line: 141, baseType: !178, size: 8, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !438, file: !392, line: 149, baseType: !110, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !438, file: !392, line: 156, baseType: !110, size: 32, offset: 96)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !388, file: !422, line: 40, type: !437, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !388, file: !422, line: 28, type: !448, isLocal: true, isDefinition: true)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !409, line: 40, baseType: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !409, line: 35, size: 64, elements: !450)
!450 = !{!451, !453}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !449, file: !409, line: 36, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !449, file: !409, line: 37, baseType: !452, size: 32, offset: 32)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !291, line: 16, size: 64, elements: !456)
!456 = !{!457, !458}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !455, file: !291, line: 17, baseType: !279, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !455, file: !291, line: 18, baseType: !178, size: 8, offset: 32)
!459 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!460 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !463, file: !492, line: 50, type: !479, isLocal: true, isDefinition: true)
!463 = distinct !DICompileUnit(language: DW_LANG_C99, file: !464, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !390, retainedTypes: !465, globals: !489, splitDebugInlining: false, nameTableKind: None)
!464 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/simple")
!465 = !{!466, !103, !232, !109, !107, !110, !111, !468, !285, !479, !480}
!466 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !467)
!467 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !470, line: 45, size: 64, elements: !471)
!470 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!471 = !{!472, !478}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !469, file: !470, line: 46, baseType: !473, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !409, line: 33, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !409, line: 29, size: 32, elements: !475)
!475 = !{!476}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !474, file: !409, line: 30, baseType: !477, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !469, file: !470, line: 48, baseType: !110, size: 32, offset: 32)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !109)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 32)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !470, line: 38, size: 64, elements: !482)
!482 = !{!483, !484}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !481, file: !470, line: 39, baseType: !473, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !481, file: !470, line: 41, baseType: !485, size: 32, offset: 32)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !470, line: 35, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 32)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !479}
!489 = !{!490, !496, !504, !461, !506, !516}
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "latency_lock", scope: !463, file: !492, line: 44, type: !493, isLocal: true, isDefinition: true)
!492 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !251, line: 43, size: 32, elements: !494)
!494 = !{!495}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !493, file: !251, line: 52, baseType: !22, size: 32)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !463, file: !492, line: 46, type: !498, isLocal: true, isDefinition: true)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !409, line: 40, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !409, line: 35, size: 64, elements: !500)
!500 = !{!501, !503}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !499, file: !409, line: 36, baseType: !502, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !499, file: !409, line: 37, baseType: !502, size: 32, offset: 32)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "latency_subs", scope: !463, file: !492, line: 52, type: !498, isLocal: true, isDefinition: true)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !463, file: !492, line: 39, type: !508, isLocal: true, isDefinition: true)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, elements: !514)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !492, line: 35, size: 96, elements: !510)
!510 = !{!511, !512, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !509, file: !492, line: 36, baseType: !391, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !509, file: !492, line: 37, baseType: !178, size: 8, offset: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !509, file: !492, line: 38, baseType: !424, size: 32, offset: 64)
!514 = !{!515}
!515 = !DISubrange(count: 0)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !463, file: !492, line: 48, type: !479, isLocal: true, isDefinition: true)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !520, file: !527, line: 47, type: !541, isLocal: true, isDefinition: true)
!520 = distinct !DICompileUnit(language: DW_LANG_C99, file: !521, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !522, retainedTypes: !523, globals: !524, splitDebugInlining: false, nameTableKind: None)
!521 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/simple")
!522 = !{!391}
!523 = !{!232, !109}
!524 = !{!525, !518, !537}
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "cpus_states", scope: !520, file: !527, line: 50, type: !528, isLocal: true, isDefinition: true)
!527 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 32, elements: !426)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !392, line: 114, size: 128, elements: !532)
!532 = !{!533, !534, !535, !536}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !531, file: !392, line: 115, baseType: !391, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !531, file: !392, line: 141, baseType: !178, size: 8, offset: 32)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !531, file: !392, line: 149, baseType: !110, size: 32, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !531, file: !392, line: 156, baseType: !110, size: 32, offset: 96)
!537 = !DIGlobalVariableExpression(var: !538, expr: !DIExpression())
!538 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !520, file: !527, line: 55, type: !539, isLocal: true, isDefinition: true)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 8, elements: !426)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !178)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, elements: !514)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !544, file: !551, line: 17, type: !677, isLocal: false, isDefinition: true)
!544 = distinct !DICompileUnit(language: DW_LANG_C99, file: !545, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !546, globals: !547, splitDebugInlining: false, nameTableKind: None)
!545 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/simple")
!546 = !{!232, !109, !110, !107}
!547 = !{!542, !548, !673}
!548 = !DIGlobalVariableExpression(var: !549, expr: !DIExpression())
!549 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !550, file: !551, line: 198, type: !660, isLocal: true, isDefinition: true)
!550 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !551, file: !551, line: 175, type: !552, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !544, retainedNodes: !657)
!551 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!552 = !DISubroutineType(types: !553)
!553 = !{null, !554}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 32)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !156, line: 245, size: 1280, elements: !556)
!556 = !{!557, !615, !627, !628, !629, !630, !631, !637, !652}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !555, file: !156, line: 247, baseType: !558, size: 384)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !156, line: 57, size: 384, elements: !559)
!559 = !{!560, !584, !591, !592, !593, !602, !603, !604}
!560 = !DIDerivedType(tag: DW_TAG_member, scope: !558, file: !156, line: 60, baseType: !561, size: 64)
!561 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !558, file: !156, line: 60, size: 64, elements: !562)
!562 = !{!563, !578}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !561, file: !156, line: 61, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !127, line: 49, baseType: !565)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !127, line: 37, size: 64, elements: !566)
!566 = !{!567, !573}
!567 = !DIDerivedType(tag: DW_TAG_member, scope: !565, file: !127, line: 38, baseType: !568, size: 32)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !127, line: 38, size: 32, elements: !569)
!569 = !{!570, !572}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !568, file: !127, line: 39, baseType: !571, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !568, file: !127, line: 40, baseType: !571, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, scope: !565, file: !127, line: 42, baseType: !574, size: 32, offset: 32)
!574 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !127, line: 42, size: 32, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !574, file: !127, line: 43, baseType: !571, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !574, file: !127, line: 44, baseType: !571, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !561, file: !156, line: 62, baseType: !579, size: 64)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !168, line: 49, size: 64, elements: !580)
!580 = !{!581}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !579, file: !168, line: 50, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 64, elements: !173)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !558, file: !156, line: 68, baseType: !585, size: 32, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !122, line: 233, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !122, line: 231, size: 64, elements: !588)
!588 = !{!589}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !587, file: !122, line: 232, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !127, line: 48, baseType: !565)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !558, file: !156, line: 71, baseType: !178, size: 8, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !558, file: !156, line: 74, baseType: !178, size: 8, offset: 104)
!593 = !DIDerivedType(tag: DW_TAG_member, scope: !558, file: !156, line: 90, baseType: !594, size: 16, offset: 112)
!594 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !558, file: !156, line: 90, size: 16, elements: !595)
!595 = !{!596, !601}
!596 = !DIDerivedType(tag: DW_TAG_member, scope: !594, file: !156, line: 91, baseType: !597, size: 16)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !594, file: !156, line: 91, size: 16, elements: !598)
!598 = !{!599, !600}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !597, file: !156, line: 96, baseType: !188, size: 8)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !597, file: !156, line: 97, baseType: !178, size: 8, offset: 8)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !594, file: !156, line: 100, baseType: !192, size: 16)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !558, file: !156, line: 107, baseType: !110, size: 32, offset: 128)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !558, file: !156, line: 127, baseType: !107, size: 32, offset: 160)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !558, file: !156, line: 131, baseType: !605, size: 192, offset: 192)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !122, line: 244, size: 192, elements: !606)
!606 = !{!607, !608, !614}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !605, file: !122, line: 245, baseType: !564, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !605, file: !122, line: 246, baseType: !609, size: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !122, line: 242, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 32)
!611 = !DISubroutineType(types: !612)
!612 = !{null, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !605, file: !122, line: 249, baseType: !105, size: 64, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !555, file: !156, line: 250, baseType: !616, size: 288, offset: 384)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !209, line: 25, size: 288, elements: !617)
!617 = !{!618, !619, !620, !621, !622, !623, !624, !625, !626}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !616, file: !209, line: 26, baseType: !110, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !616, file: !209, line: 27, baseType: !110, size: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !616, file: !209, line: 28, baseType: !110, size: 32, offset: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !616, file: !209, line: 29, baseType: !110, size: 32, offset: 96)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !616, file: !209, line: 30, baseType: !110, size: 32, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !616, file: !209, line: 31, baseType: !110, size: 32, offset: 160)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !616, file: !209, line: 32, baseType: !110, size: 32, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !616, file: !209, line: 33, baseType: !110, size: 32, offset: 224)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !616, file: !209, line: 34, baseType: !110, size: 32, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !555, file: !156, line: 253, baseType: !107, size: 32, offset: 672)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !555, file: !156, line: 256, baseType: !586, size: 64, offset: 704)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !555, file: !156, line: 279, baseType: !223, size: 256, offset: 768)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !555, file: !156, line: 294, baseType: !109, size: 32, offset: 1024)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !555, file: !156, line: 300, baseType: !632, size: 96, offset: 1056)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !156, line: 149, size: 96, elements: !633)
!633 = !{!634, !635, !636}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !632, file: !156, line: 153, baseType: !22, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !632, file: !156, line: 162, baseType: !232, size: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !632, file: !156, line: 168, baseType: !232, size: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !555, file: !156, line: 325, baseType: !638, size: 32, offset: 1152)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !118, line: 5073, size: 192, elements: !640)
!640 = !{!641, !647, !648}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !639, file: !118, line: 5074, baseType: !642, size: 96)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !241, line: 56, size: 96, elements: !643)
!643 = !{!644, !645, !646}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !642, file: !241, line: 57, baseType: !244, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !642, file: !241, line: 58, baseType: !107, size: 32, offset: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !642, file: !241, line: 59, baseType: !232, size: 32, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !639, file: !118, line: 5075, baseType: !586, size: 64, offset: 96)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !639, file: !118, line: 5076, baseType: !649, size: 32, offset: 160)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !251, line: 43, size: 32, elements: !650)
!650 = !{!651}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !649, file: !251, line: 52, baseType: !22, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !555, file: !156, line: 343, baseType: !653, size: 64, offset: 1184)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !209, line: 60, size: 64, elements: !654)
!654 = !{!655, !656}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !653, file: !209, line: 63, baseType: !110, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !653, file: !209, line: 66, baseType: !110, size: 32, offset: 32)
!657 = !{!658, !659}
!658 = !DILocalVariable(name: "thread", arg: 1, scope: !550, file: !551, line: 175, type: !554)
!659 = !DILocalVariable(name: "region_num", scope: !550, file: !551, line: 200, type: !178)
!660 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, elements: !514)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !662, line: 52, size: 96, elements: !663)
!662 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!663 = !{!664, !665, !666}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !661, file: !662, line: 53, baseType: !22, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !661, file: !662, line: 54, baseType: !232, size: 32, offset: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !661, file: !662, line: 55, baseType: !667, size: 32, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !668, line: 304, baseType: !669)
!668 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !668, line: 301, size: 32, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !669, file: !668, line: 302, baseType: !192, size: 16)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !669, file: !668, line: 303, baseType: !192, size: 16, offset: 16)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "static_regions", scope: !544, file: !551, line: 62, type: !675, isLocal: true, isDefinition: true)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 96, elements: !426)
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !291, line: 16, size: 64, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !678, file: !291, line: 17, baseType: !279, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !678, file: !291, line: 18, baseType: !178, size: 8, offset: 32)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !684, file: !738, line: 39, type: !178, isLocal: true, isDefinition: true)
!684 = distinct !DICompileUnit(language: DW_LANG_C99, file: !685, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !686, globals: !729, splitDebugInlining: false, nameTableKind: None)
!685 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/simple")
!686 = !{!687, !107, !109, !715}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !689, line: 1495, baseType: !690)
!689 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !689, line: 1474, size: 448, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !705}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !690, file: !689, line: 1476, baseType: !328, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !690, file: !689, line: 1477, baseType: !329, size: 32, offset: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !690, file: !689, line: 1478, baseType: !329, size: 32, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !690, file: !689, line: 1479, baseType: !329, size: 32, offset: 96)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !690, file: !689, line: 1480, baseType: !329, size: 32, offset: 128)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !690, file: !689, line: 1481, baseType: !329, size: 32, offset: 160)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !690, file: !689, line: 1482, baseType: !329, size: 32, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !690, file: !689, line: 1483, baseType: !329, size: 32, offset: 224)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !690, file: !689, line: 1484, baseType: !329, size: 32, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !690, file: !689, line: 1485, baseType: !329, size: 32, offset: 288)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !690, file: !689, line: 1486, baseType: !329, size: 32, offset: 320)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !690, file: !689, line: 1487, baseType: !704, size: 32, offset: 352)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 32, elements: !426)
!705 = !DIDerivedType(tag: DW_TAG_member, scope: !690, file: !689, line: 1488, baseType: !706, size: 64, offset: 384)
!706 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !690, file: !689, line: 1488, size: 64, elements: !707)
!707 = !{!708, !710}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !706, file: !689, line: 1489, baseType: !709, size: 64)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 64, elements: !173)
!710 = !DIDerivedType(tag: DW_TAG_member, scope: !706, file: !689, line: 1490, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !706, file: !689, line: 1490, size: 64, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !711, file: !689, line: 1491, baseType: !329, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !711, file: !689, line: 1492, baseType: !329, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !718, line: 27, size: 128, elements: !719)
!718 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!719 = !{!720, !721, !722}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !717, file: !718, line: 29, baseType: !110, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !717, file: !718, line: 31, baseType: !279, size: 32, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !717, file: !718, line: 37, baseType: !723, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !668, line: 298, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !668, line: 289, size: 64, elements: !725)
!725 = !{!726, !727, !728}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !724, file: !668, line: 291, baseType: !178, size: 5, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !724, file: !668, line: 293, baseType: !178, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !724, file: !668, line: 295, baseType: !110, size: 32, offset: 32)
!729 = !{!682, !730}
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !684, file: !732, line: 31, type: !733, isLocal: true, isDefinition: true)
!732 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !734, size: 160, elements: !426)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !732, line: 21, size: 160, elements: !735)
!735 = !{!736, !737}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !734, file: !732, line: 22, baseType: !109, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !734, file: !732, line: 23, baseType: !717, size: 128, offset: 32)
!738 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !741, file: !748, line: 21, type: !302, isLocal: true, isDefinition: true)
!741 = distinct !DICompileUnit(language: DW_LANG_C99, file: !742, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !743, globals: !747, splitDebugInlining: false, nameTableKind: None)
!742 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/simple")
!743 = !{!744, !109, !107}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !746, line: 22, baseType: !109)
!746 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!747 = !{!739}
!748 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !751, file: !756, line: 13, type: !775, isLocal: true, isDefinition: true)
!751 = distinct !DICompileUnit(language: DW_LANG_C99, file: !752, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !753, splitDebugInlining: false, nameTableKind: None)
!752 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/simple")
!753 = !{!754, !749}
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "mpu_config", scope: !751, file: !756, line: 37, type: !757, isLocal: false, isDefinition: true)
!756 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!757 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !718, line: 41, size: 64, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !758, file: !718, line: 43, baseType: !110, size: 32)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !758, file: !718, line: 45, baseType: !762, size: 32, offset: 32)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !718, line: 27, size: 128, elements: !765)
!765 = !{!766, !767, !768}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !764, file: !718, line: 29, baseType: !110, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !764, file: !718, line: 31, baseType: !279, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !764, file: !718, line: 37, baseType: !769, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !668, line: 298, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !668, line: 289, size: 64, elements: !771)
!771 = !{!772, !773, !774}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !770, file: !668, line: 291, baseType: !178, size: 5, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !770, file: !668, line: 293, baseType: !178, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !770, file: !668, line: 295, baseType: !110, size: 32, offset: 32)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 256, elements: !173)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "log_const_clock_control", scope: !778, file: !982, line: 18, type: !1218, isLocal: false, isDefinition: true)
!778 = distinct !DICompileUnit(language: DW_LANG_C99, file: !779, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !780, retainedTypes: !898, globals: !978, splitDebugInlining: false, nameTableKind: None)
!779 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/simple")
!780 = !{!781, !787, !30, !792, !797, !801, !805, !809, !815, !819, !863, !870, !889}
!781 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !782, line: 23, baseType: !32, size: 32, elements: !783)
!782 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!783 = !{!784, !785, !786}
!784 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!785 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!786 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!787 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !782, line: 48, baseType: !32, size: 32, elements: !788)
!788 = !{!789, !790, !791}
!789 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!790 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!791 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!792 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !793, line: 167, baseType: !32, size: 32, elements: !794)
!793 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!794 = !{!795, !796}
!795 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!796 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!797 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !793, line: 107, baseType: !32, size: 32, elements: !798)
!798 = !{!799, !800}
!799 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!800 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!801 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !793, line: 208, baseType: !32, size: 32, elements: !802)
!802 = !{!803, !804}
!803 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!804 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!805 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !793, line: 261, baseType: !32, size: 32, elements: !806)
!806 = !{!807, !808}
!807 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!808 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!809 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !793, line: 237, baseType: !32, size: 32, elements: !810)
!810 = !{!811, !812, !813, !814}
!811 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!812 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!813 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!814 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!815 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !793, line: 152, baseType: !32, size: 32, elements: !816)
!816 = !{!817, !818}
!817 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!818 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!819 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !323, line: 71, baseType: !109, size: 32, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862}
!821 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!822 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!823 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!824 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!825 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!826 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!827 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!828 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!829 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!830 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!831 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!832 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!833 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!834 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!835 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!836 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!837 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!838 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!839 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!840 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!841 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!842 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!843 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!844 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!845 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!846 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!847 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!848 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!849 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!850 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!851 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!852 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!853 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!854 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!855 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!856 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!857 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!858 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!859 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!860 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!861 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!862 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!863 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !864, line: 44, baseType: !32, size: 32, elements: !865)
!864 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!865 = !{!866, !867, !868, !869}
!866 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!867 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!868 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!869 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !871, line: 54, baseType: !32, size: 32, elements: !872)
!871 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!872 = !{!873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888}
!873 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!874 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!875 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!876 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!877 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!878 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!879 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!880 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!881 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!882 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!883 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!884 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!885 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!886 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!887 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!888 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!889 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !890, line: 53, baseType: !32, size: 32, elements: !891)
!890 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!891 = !{!892, !893, !894, !895, !896, !897}
!892 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!893 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!894 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!895 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!896 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!897 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!898 = !{!781, !107, !109, !899, !941, !942, !943, !944, !103, !110, !111, !945, !946, !286, !479, !947, !977, !232}
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !323, line: 923, baseType: !901)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 883, size: 10464, elements: !902)
!902 = !{!903, !904, !905, !906, !907, !911, !912, !913, !914, !915, !916, !917, !918, !922, !923, !924, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !901, file: !323, line: 884, baseType: !329, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !901, file: !323, line: 885, baseType: !329, size: 32, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !901, file: !323, line: 886, baseType: !329, size: 32, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !901, file: !323, line: 887, baseType: !329, size: 32, offset: 96)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !901, file: !323, line: 888, baseType: !908, size: 896, offset: 128)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 896, elements: !909)
!909 = !{!910}
!910 = !DISubrange(count: 28)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !901, file: !323, line: 889, baseType: !329, size: 32, offset: 1024)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !901, file: !323, line: 890, baseType: !329, size: 32, offset: 1056)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !901, file: !323, line: 891, baseType: !329, size: 32, offset: 1088)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !901, file: !323, line: 892, baseType: !329, size: 32, offset: 1120)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !901, file: !323, line: 893, baseType: !908, size: 896, offset: 1152)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !901, file: !323, line: 894, baseType: !329, size: 32, offset: 2048)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !901, file: !323, line: 895, baseType: !329, size: 32, offset: 2080)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !901, file: !323, line: 896, baseType: !919, size: 960, offset: 2112)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 960, elements: !920)
!920 = !{!921}
!921 = !DISubrange(count: 30)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !901, file: !323, line: 897, baseType: !329, size: 32, offset: 3072)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !901, file: !323, line: 898, baseType: !329, size: 32, offset: 3104)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !901, file: !323, line: 899, baseType: !925, size: 3008, offset: 3136)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 3008, elements: !926)
!926 = !{!927}
!927 = !DISubrange(count: 94)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !901, file: !323, line: 900, baseType: !329, size: 32, offset: 6144)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !901, file: !323, line: 901, baseType: !329, size: 32, offset: 6176)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !901, file: !323, line: 902, baseType: !329, size: 32, offset: 6208)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !901, file: !323, line: 903, baseType: !328, size: 32, offset: 6240)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !901, file: !323, line: 904, baseType: !336, size: 1984, offset: 6272)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !901, file: !323, line: 905, baseType: !328, size: 32, offset: 8256)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !901, file: !323, line: 907, baseType: !328, size: 32, offset: 8288)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !901, file: !323, line: 910, baseType: !328, size: 32, offset: 8320)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !901, file: !323, line: 911, baseType: !328, size: 32, offset: 8352)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !901, file: !323, line: 913, baseType: !328, size: 32, offset: 8384)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !901, file: !323, line: 917, baseType: !328, size: 32, offset: 8416)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !901, file: !323, line: 919, baseType: !336, size: 1984, offset: 8448)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !901, file: !323, line: 920, baseType: !329, size: 32, offset: 10432)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !793, line: 146, baseType: !797)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !793, line: 164, baseType: !815)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 32)
!945 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !689, line: 485, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !689, line: 468, size: 28704, elements: !950)
!950 = !{!951, !955, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !972, !976}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !949, file: !689, line: 470, baseType: !952, size: 512)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 512, elements: !953)
!953 = !{!954}
!954 = !DISubrange(count: 16)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !949, file: !689, line: 471, baseType: !956, size: 512, offset: 512)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 512, elements: !953)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !949, file: !689, line: 472, baseType: !952, size: 512, offset: 1024)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !949, file: !689, line: 473, baseType: !956, size: 512, offset: 1536)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !949, file: !689, line: 474, baseType: !952, size: 512, offset: 2048)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !949, file: !689, line: 475, baseType: !956, size: 512, offset: 2560)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !949, file: !689, line: 476, baseType: !952, size: 512, offset: 3072)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !949, file: !689, line: 477, baseType: !956, size: 512, offset: 3584)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !949, file: !689, line: 478, baseType: !952, size: 512, offset: 4096)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !949, file: !689, line: 479, baseType: !956, size: 512, offset: 4608)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !949, file: !689, line: 480, baseType: !952, size: 512, offset: 5120)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !949, file: !689, line: 481, baseType: !956, size: 512, offset: 5632)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !949, file: !689, line: 482, baseType: !968, size: 3968, offset: 6144)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !969, size: 3968, elements: !970)
!969 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !178)
!970 = !{!971}
!971 = !DISubrange(count: 496)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !949, file: !689, line: 483, baseType: !973, size: 18560, offset: 10112)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 18560, elements: !974)
!974 = !{!975}
!975 = !DISubrange(count: 580)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !949, file: !689, line: 484, baseType: !329, size: 32, offset: 28672)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !864, line: 56, baseType: !107)
!978 = !{!776, !979, !1031, !1072, !1080, !1097, !1108, !1110, !1127, !1129, !1139, !1142, !1158, !1196, !1210}
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(name: "on", scope: !981, file: !982, line: 549, type: !424, isLocal: true, isDefinition: true)
!981 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !982, file: !982, line: 547, type: !983, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !778, retainedNodes: !985)
!982 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!983 = !DISubroutineType(types: !984)
!984 = !{null, !787}
!985 = !{!986, !987, !990}
!986 = !DILocalVariable(name: "start_mode", arg: 1, scope: !981, file: !982, line: 547, type: !787)
!987 = !DILocalVariable(name: "err", scope: !988, file: !982, line: 553, type: !109)
!988 = distinct !DILexicalBlock(scope: !989, file: !982, line: 552, column: 31)
!989 = distinct !DILexicalBlock(scope: !981, file: !982, line: 552, column: 6)
!990 = !DILocalVariable(name: "mgr", scope: !988, file: !982, line: 554, type: !991)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !993, line: 154, size: 256, elements: !994)
!993 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!994 = !{!995, !1007, !1008, !1024, !1028, !1029, !1030}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !992, file: !993, line: 158, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !409, line: 40, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !409, line: 35, size: 64, elements: !998)
!998 = !{!999, !1006}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !997, file: !409, line: 36, baseType: !1000, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !409, line: 33, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !409, line: 29, size: 32, elements: !1003)
!1003 = !{!1004}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1002, file: !409, line: 30, baseType: !1005, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !997, file: !409, line: 37, baseType: !1000, size: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !992, file: !993, line: 163, baseType: !996, size: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !992, file: !993, line: 166, baseType: !1009, size: 32, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !993, line: 133, size: 96, elements: !1012)
!1012 = !{!1013, !1022, !1023}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1011, file: !993, line: 135, baseType: !1014, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !993, line: 129, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{null, !991, !1018}
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !993, line: 101, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 32)
!1020 = !DISubroutineType(types: !1021)
!1021 = !{null, !991, !109}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1011, file: !993, line: 138, baseType: !1014, size: 32, offset: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !1011, file: !993, line: 143, baseType: !1014, size: 32, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !992, file: !993, line: 169, baseType: !1025, size: 32, offset: 160)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !251, line: 43, size: 32, elements: !1026)
!1026 = !{!1027}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !1025, file: !251, line: 52, baseType: !22, size: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !992, file: !993, line: 172, baseType: !109, size: 32, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !992, file: !993, line: 175, baseType: !192, size: 16, offset: 224)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !992, file: !993, line: 178, baseType: !192, size: 16, offset: 240)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "cli", scope: !981, file: !982, line: 550, type: !1033, isLocal: true, isDefinition: true)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !993, line: 273, size: 128, elements: !1034)
!1034 = !{!1035, !1036}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1033, file: !993, line: 280, baseType: !1001, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !1033, file: !993, line: 283, baseType: !1037, size: 96, offset: 32)
