; ModuleID = 'build/96b_carbon_nrf51/benchmark/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.zbus_observer = type { i8, %struct.k_msgq*, void (%struct.zbus_channel*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type {}
%struct.zbus_channel = type { i16, i8*, i8*, i1 (i8*, i32)*, %struct.k_mutex*, %struct.zbus_observer** }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/benchmark/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/benchmark")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 38, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/benchmark")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1664, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 26)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 832, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_mutex_bm_channel", scope: !27, file: !122, line: 16, type: !144, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !109, globals: !119, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/benchmark/src/benchmark.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/benchmark")
!29 = !{!30, !101}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_fatal_error_reason", file: !102, line: 27, baseType: !32, size: 32, elements: !103)
!102 = !DIFile(filename: "zephyr/include/zephyr/fatal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!103 = !{!104, !105, !106, !107, !108}
!104 = !DIEnumerator(name: "K_ERR_CPU_EXCEPTION", value: 0)
!105 = !DIEnumerator(name: "K_ERR_SPURIOUS_IRQ", value: 1)
!106 = !DIEnumerator(name: "K_ERR_STACK_CHK_FAIL", value: 2)
!107 = !DIEnumerator(name: "K_ERR_KERNEL_OOPS", value: 3)
!108 = !DIEnumerator(name: "K_ERR_KERNEL_PANIC", value: 4)
!109 = !{!110, !111, !112, !116, !117}
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!111 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !113, line: 46, baseType: !114)
!113 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !115)
!115 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !118)
!118 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!119 = !{!25, !120, !292, !294, !296, !298, !300, !302, !304, !306, !308, !341, !345, !350, !352, !359, !364}
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "bm_channel", scope: !27, file: !122, line: 16, type: !123, isLocal: false, isDefinition: true, align: 32)
!122 = !DIFile(filename: "zephyr/samples/subsys/zbus/benchmark/src/benchmark.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !125, line: 29, size: 192, elements: !126)
!125 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!126 = !{!127, !131, !133, !134, !142, !261}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !124, file: !125, line: 35, baseType: !128, size: 16)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !130)
!130 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !124, file: !125, line: 40, baseType: !132, size: 32, offset: 32)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !124, file: !125, line: 45, baseType: !132, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !124, file: !125, line: 51, baseType: !135, size: 32, offset: 96)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!137 = !DISubroutineType(types: !138)
!138 = !{!139, !13, !140}
!139 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !141, line: 214, baseType: !32)
!141 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !124, file: !125, line: 56, baseType: !143, size: 32, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !145, line: 2720, size: 160, elements: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = !{!147, !168, !259, !260}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !144, file: !145, line: 2722, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !149, line: 233, baseType: !150)
!149 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !149, line: 231, size: 64, elements: !151)
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !150, file: !149, line: 232, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !154, line: 48, baseType: !155)
!154 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !154, line: 37, size: 64, elements: !156)
!156 = !{!157, !163}
!157 = !DIDerivedType(tag: DW_TAG_member, scope: !155, file: !154, line: 38, baseType: !158, size: 32)
!158 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !155, file: !154, line: 38, size: 32, elements: !159)
!159 = !{!160, !162}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !158, file: !154, line: 39, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !158, file: !154, line: 40, baseType: !161, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, scope: !155, file: !154, line: 42, baseType: !164, size: 32, offset: 32)
!164 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !155, file: !154, line: 42, size: 32, elements: !165)
!165 = !{!166, !167}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !164, file: !154, line: 43, baseType: !161, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !164, file: !154, line: 44, baseType: !161, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !144, file: !145, line: 2724, baseType: !169, size: 32, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !171, line: 245, size: 896, elements: !172)
!171 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !{!173, !220, !233, !234, !235, !236, !254}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !170, file: !171, line: 247, baseType: !174, size: 384)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !171, line: 57, size: 384, elements: !175)
!175 = !{!176, !190, !192, !195, !196, !207, !208, !209}
!176 = !DIDerivedType(tag: DW_TAG_member, scope: !174, file: !171, line: 60, baseType: !177, size: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !174, file: !171, line: 60, size: 64, elements: !178)
!178 = !{!179, !181}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !177, file: !171, line: 61, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !154, line: 49, baseType: !155)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !177, file: !171, line: 62, baseType: !182, size: 64)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !183, line: 49, size: 64, elements: !184)
!183 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!184 = !{!185}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !182, file: !183, line: 50, baseType: !186, size: 64)
!186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 64, elements: !188)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 32)
!188 = !{!189}
!189 = !DISubrange(count: 2)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !174, file: !171, line: 68, baseType: !191, size: 32, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !174, file: !171, line: 71, baseType: !193, size: 8, offset: 96)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !194)
!194 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !174, file: !171, line: 74, baseType: !193, size: 8, offset: 104)
!196 = !DIDerivedType(tag: DW_TAG_member, scope: !174, file: !171, line: 90, baseType: !197, size: 16, offset: 112)
!197 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !174, file: !171, line: 90, size: 16, elements: !198)
!198 = !{!199, !206}
!199 = !DIDerivedType(tag: DW_TAG_member, scope: !197, file: !171, line: 91, baseType: !200, size: 16)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !197, file: !171, line: 91, size: 16, elements: !201)
!201 = !{!202, !205}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !200, file: !171, line: 96, baseType: !203, size: 8)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !204)
!204 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !200, file: !171, line: 97, baseType: !193, size: 8, offset: 8)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !197, file: !171, line: 100, baseType: !129, size: 16)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !174, file: !171, line: 107, baseType: !116, size: 32, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !174, file: !171, line: 127, baseType: !110, size: 32, offset: 160)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !174, file: !171, line: 131, baseType: !210, size: 192, offset: 192)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !149, line: 244, size: 192, elements: !211)
!211 = !{!212, !213, !219}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !210, file: !149, line: 245, baseType: !180, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !210, file: !149, line: 246, baseType: !214, size: 32, offset: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !149, line: 242, baseType: !215)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 32)
!216 = !DISubroutineType(types: !217)
!217 = !{null, !218}
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !210, file: !149, line: 249, baseType: !114, size: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !170, file: !171, line: 250, baseType: !221, size: 288, offset: 384)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !222, line: 25, size: 288, elements: !223)
!222 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231, !232}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !221, file: !222, line: 26, baseType: !116, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !221, file: !222, line: 27, baseType: !116, size: 32, offset: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !221, file: !222, line: 28, baseType: !116, size: 32, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !221, file: !222, line: 29, baseType: !116, size: 32, offset: 96)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !221, file: !222, line: 30, baseType: !116, size: 32, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !221, file: !222, line: 31, baseType: !116, size: 32, offset: 160)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !221, file: !222, line: 32, baseType: !116, size: 32, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !221, file: !222, line: 33, baseType: !116, size: 32, offset: 224)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !221, file: !222, line: 34, baseType: !116, size: 32, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !170, file: !171, line: 253, baseType: !110, size: 32, offset: 672)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !170, file: !171, line: 256, baseType: !148, size: 64, offset: 704)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !170, file: !171, line: 294, baseType: !111, size: 32, offset: 768)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !170, file: !171, line: 325, baseType: !237, size: 32, offset: 800)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 32)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !145, line: 5073, size: 160, elements: !239)
!239 = !{!240, !249, !250}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !238, file: !145, line: 5074, baseType: !241, size: 96)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !242, line: 56, size: 96, elements: !243)
!242 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!243 = !{!244, !247, !248}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !241, file: !242, line: 57, baseType: !245, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !242, line: 57, flags: DIFlagFwdDecl)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !241, file: !242, line: 58, baseType: !110, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !241, file: !242, line: 59, baseType: !140, size: 32, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !238, file: !145, line: 5075, baseType: !148, size: 64, offset: 96)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !238, file: !145, line: 5076, baseType: !251, offset: 160)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !252, line: 43, elements: !253)
!252 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!253 = !{}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !170, file: !171, line: 343, baseType: !255, size: 64, offset: 832)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !222, line: 60, size: 64, elements: !256)
!256 = !{!257, !258}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !255, file: !222, line: 63, baseType: !116, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !255, file: !222, line: 66, baseType: !116, size: 32, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !144, file: !145, line: 2727, baseType: !116, size: 32, offset: 96)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !144, file: !145, line: 2730, baseType: !111, size: 32, offset: 128)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !124, file: !125, line: 67, baseType: !262, size: 32, offset: 160)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !266)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !125, line: 85, size: 96, elements: !267)
!267 = !{!268, !269, !286}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !266, file: !125, line: 91, baseType: !139, size: 8)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !266, file: !125, line: 93, baseType: !270, size: 32, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !145, line: 4204, size: 320, elements: !273)
!273 = !{!274, !275, !276, !277, !278, !281, !282, !283, !284, !285}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !272, file: !145, line: 4206, baseType: !148, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !272, file: !145, line: 4208, baseType: !251, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !272, file: !145, line: 4210, baseType: !140, size: 32, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !272, file: !145, line: 4212, baseType: !116, size: 32, offset: 96)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !272, file: !145, line: 4214, baseType: !279, size: 32, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !272, file: !145, line: 4216, baseType: !279, size: 32, offset: 160)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !272, file: !145, line: 4218, baseType: !279, size: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !272, file: !145, line: 4220, baseType: !279, size: 32, offset: 224)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !272, file: !145, line: 4222, baseType: !116, size: 32, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !272, file: !145, line: 4227, baseType: !193, size: 8, offset: 288)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !266, file: !125, line: 96, baseType: !287, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !291}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "s1", scope: !27, file: !122, line: 126, type: !266, isLocal: false, isDefinition: true, align: 32)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "s2", scope: !27, file: !122, line: 129, type: !266, isLocal: false, isDefinition: true, align: 32)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "s3", scope: !27, file: !122, line: 131, type: !266, isLocal: false, isDefinition: true, align: 32)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "s4", scope: !27, file: !122, line: 132, type: !266, isLocal: false, isDefinition: true, align: 32)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "s5", scope: !27, file: !122, line: 134, type: !266, isLocal: false, isDefinition: true, align: 32)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "s6", scope: !27, file: !122, line: 135, type: !266, isLocal: false, isDefinition: true, align: 32)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "s7", scope: !27, file: !122, line: 136, type: !266, isLocal: false, isDefinition: true, align: 32)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "s8", scope: !27, file: !122, line: 137, type: !266, isLocal: false, isDefinition: true, align: 32)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "_k_thread_data_producer_thread_id", scope: !27, file: !122, line: 216, type: !310, isLocal: false, isDefinition: true, align: 32)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !145, line: 620, size: 384, elements: !311)
!311 = !{!312, !313, !321, !322, !327, !328, !329, !330, !331, !332, !334, !338}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !310, file: !145, line: 621, baseType: !169, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !310, file: !145, line: 622, baseType: !314, size: 32, offset: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !316, line: 44, baseType: !317)
!316 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !318, line: 47, size: 8, elements: !319)
!318 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !317, file: !318, line: 48, baseType: !280, size: 8)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !310, file: !145, line: 623, baseType: !32, size: 32, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !310, file: !145, line: 624, baseType: !323, size: 32, offset: 96)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !316, line: 46, baseType: !324)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !110, !110, !110}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !310, file: !145, line: 625, baseType: !110, size: 32, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !310, file: !145, line: 626, baseType: !110, size: 32, offset: 160)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !310, file: !145, line: 627, baseType: !110, size: 32, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !310, file: !145, line: 628, baseType: !111, size: 32, offset: 224)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !310, file: !145, line: 629, baseType: !116, size: 32, offset: 256)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !310, file: !145, line: 630, baseType: !333, size: 32, offset: 288)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !111)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !310, file: !145, line: 631, baseType: !335, size: 32, offset: 320)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 32)
!336 = !DISubroutineType(types: !337)
!337 = !{null}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !310, file: !145, line: 632, baseType: !339, size: 32, offset: 352)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "producer_thread_id", scope: !27, file: !122, line: 216, type: !343, isLocal: false, isDefinition: true)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !171, line: 347, baseType: !169)
!345 = !DIGlobalVariableExpression(var: !346, expr: !DIExpression())
!346 = distinct !DIGlobalVariable(name: "_k_thread_stack_producer_thread_id", scope: !27, file: !122, line: 216, type: !347, isLocal: false, isDefinition: true, align: 64)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 8192, elements: !348)
!348 = !{!349}
!349 = !DISubrange(count: 1024)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "_k_thread_obj_producer_thread_id", scope: !27, file: !122, line: 216, type: !170, isLocal: false, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "_zbus_message_bm_channel", scope: !27, file: !122, line: 16, type: !354, isLocal: true, isDefinition: true)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "external_data_msg", file: !355, line: 10, size: 64, elements: !356)
!355 = !DIFile(filename: "zephyr/samples/subsys/zbus/benchmark/src/messages.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!356 = !{!357, !358}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "reference", scope: !354, file: !355, line: 11, baseType: !110, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !354, file: !355, line: 12, baseType: !140, size: 32, offset: 32)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "_zbus_observers_bm_channel", scope: !27, file: !122, line: 16, type: !361, isLocal: true, isDefinition: true)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 288, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 9)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !122, line: 44, type: !117, isLocal: true, isDefinition: true)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !368, file: !383, line: 18, type: !384, isLocal: false, isDefinition: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !370, globals: !382, splitDebugInlining: false, nameTableKind: None)
!369 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/benchmark")
!370 = !{!22, !110, !24, !371, !373, !375, !140, !111, !376, !377, !379, !380, !279, !381, !129, !339}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!382 = !{!366}
!383 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !385)
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !386, line: 16, size: 64, elements: !387)
!386 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !385, file: !386, line: 17, baseType: !339, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !385, file: !386, line: 18, baseType: !193, size: 8, offset: 32)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "_char_out", scope: !392, file: !397, line: 54, type: !398, isLocal: false, isDefinition: true)
!392 = distinct !DICompileUnit(language: DW_LANG_C99, file: !393, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !394, retainedTypes: !395, globals: !396, splitDebugInlining: false, nameTableKind: None)
!393 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/benchmark")
!394 = !{!30}
!395 = !{!110, !111}
!396 = !{!390}
!397 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = !DISubroutineType(types: !400)
!400 = !{!111, !111}
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !403, file: !437, line: 22, type: !467, isLocal: false, isDefinition: true)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !417, globals: !434, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/benchmark")
!405 = !{!406, !30}
!406 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !407, line: 27, baseType: !32, size: 32, elements: !408)
!407 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!408 = !{!409, !410, !411, !412, !413, !414, !415, !416}
!409 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!410 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!411 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!412 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!413 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!414 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!415 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!416 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!417 = !{!110, !112, !111, !24, !418, !279, !116, !117}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 32)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !420, line: 54, size: 96, elements: !421)
!420 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!421 = !{!422, !429, !433}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !419, file: !420, line: 55, baseType: !423, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !424, line: 33, baseType: !425)
!424 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !424, line: 29, size: 32, elements: !426)
!426 = !{!427}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !425, file: !424, line: 30, baseType: !428, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !419, file: !420, line: 60, baseType: !430, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 32)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !406}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !419, file: !420, line: 65, baseType: !430, size: 32, offset: 64)
!434 = !{!401, !435, !443, !446, !448, !457, !459}
!435 = !DIGlobalVariableExpression(var: !436, expr: !DIExpression())
!436 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !403, file: !437, line: 27, type: !438, isLocal: true, isDefinition: true)
!437 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !439, size: 32, elements: !441)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !440, line: 22, baseType: !378)
!440 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!441 = !{!442}
!442 = !DISubrange(count: 1)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !403, file: !437, line: 44, type: !445, isLocal: true, isDefinition: true)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !252, line: 43, elements: !253)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !403, file: !437, line: 49, type: !445, isLocal: true, isDefinition: true)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !403, file: !437, line: 36, type: !450, isLocal: true, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 128, elements: !441)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !407, line: 114, size: 128, elements: !452)
!452 = !{!453, !454, !455, !456}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !451, file: !407, line: 115, baseType: !406, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !451, file: !407, line: 141, baseType: !193, size: 8, offset: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !451, file: !407, line: 149, baseType: !116, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !451, file: !407, line: 156, baseType: !116, size: 32, offset: 96)
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !403, file: !437, line: 40, type: !450, isLocal: true, isDefinition: true)
!459 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression())
!460 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !403, file: !437, line: 28, type: !461, isLocal: true, isDefinition: true)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !424, line: 40, baseType: !462)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !424, line: 35, size: 64, elements: !463)
!463 = !{!464, !466}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !462, file: !424, line: 36, baseType: !465, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !462, file: !424, line: 37, baseType: !465, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !386, line: 16, size: 64, elements: !469)
!469 = !{!470, !471}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !468, file: !386, line: 17, baseType: !339, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !468, file: !386, line: 18, baseType: !193, size: 8, offset: 32)
!472 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!473 = !DIGlobalVariableExpression(var: !460, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !476, file: !504, line: 50, type: !333, isLocal: true, isDefinition: true)
!476 = distinct !DICompileUnit(language: DW_LANG_C99, file: !477, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !478, globals: !501, splitDebugInlining: false, nameTableKind: None)
!477 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/benchmark")
!478 = !{!479, !112, !140, !111, !110, !116, !117, !481, !279, !333, !492}
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !480)
!480 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !483, line: 45, size: 64, elements: !484)
!483 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!484 = !{!485, !491}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !482, file: !483, line: 46, baseType: !486, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !424, line: 33, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !424, line: 29, size: 32, elements: !488)
!488 = !{!489}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !487, file: !424, line: 30, baseType: !490, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !482, file: !483, line: 48, baseType: !116, size: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !483, line: 38, size: 64, elements: !494)
!494 = !{!495, !496}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !493, file: !483, line: 39, baseType: !486, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !493, file: !483, line: 41, baseType: !497, size: 32, offset: 32)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !483, line: 35, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 32)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !333}
!501 = !{!502, !506, !514, !474, !516, !526}
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "latency_lock", scope: !476, file: !504, line: 44, type: !505, isLocal: true, isDefinition: true)
!504 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !252, line: 43, elements: !253)
!506 = !DIGlobalVariableExpression(var: !507, expr: !DIExpression())
!507 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !476, file: !504, line: 46, type: !508, isLocal: true, isDefinition: true)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !424, line: 40, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !424, line: 35, size: 64, elements: !510)
!510 = !{!511, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !509, file: !424, line: 36, baseType: !512, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !509, file: !424, line: 37, baseType: !512, size: 32, offset: 32)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "latency_subs", scope: !476, file: !504, line: 52, type: !508, isLocal: true, isDefinition: true)
!516 = !DIGlobalVariableExpression(var: !517, expr: !DIExpression())
!517 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !476, file: !504, line: 39, type: !518, isLocal: true, isDefinition: true)
!518 = !DICompositeType(tag: DW_TAG_array_type, baseType: !519, elements: !524)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !504, line: 35, size: 96, elements: !520)
!520 = !{!521, !522, !523}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !519, file: !504, line: 36, baseType: !406, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !519, file: !504, line: 37, baseType: !193, size: 8, offset: 32)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !519, file: !504, line: 38, baseType: !439, size: 32, offset: 64)
!524 = !{!525}
!525 = !DISubrange(count: 0)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !476, file: !504, line: 48, type: !333, isLocal: true, isDefinition: true)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !530, file: !537, line: 47, type: !551, isLocal: true, isDefinition: true)
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !531, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !532, retainedTypes: !533, globals: !534, splitDebugInlining: false, nameTableKind: None)
!531 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/benchmark")
!532 = !{!406}
!533 = !{!140, !111}
!534 = !{!535, !528, !547}
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "cpus_states", scope: !530, file: !537, line: 50, type: !538, isLocal: true, isDefinition: true)
!537 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 32, elements: !441)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !407, line: 114, size: 128, elements: !542)
!542 = !{!543, !544, !545, !546}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !541, file: !407, line: 115, baseType: !406, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !541, file: !407, line: 141, baseType: !193, size: 8, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !541, file: !407, line: 149, baseType: !116, size: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !541, file: !407, line: 156, baseType: !116, size: 32, offset: 96)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !530, file: !537, line: 55, type: !549, isLocal: true, isDefinition: true)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 8, elements: !441)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, elements: !524)
!552 = !DIGlobalVariableExpression(var: !553, expr: !DIExpression())
!553 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !554, file: !561, line: 21, type: !398, isLocal: true, isDefinition: true)
!554 = distinct !DICompileUnit(language: DW_LANG_C99, file: !555, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !394, retainedTypes: !556, globals: !560, splitDebugInlining: false, nameTableKind: None)
!555 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/benchmark")
!556 = !{!557, !111, !110}
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !559, line: 22, baseType: !111)
!559 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!560 = !{!552}
!561 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !564, file: !661, line: 31, type: !677, isLocal: false, isDefinition: true)
!564 = distinct !DICompileUnit(language: DW_LANG_C99, file: !565, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !394, retainedTypes: !566, globals: !658, splitDebugInlining: false, nameTableKind: None)
!565 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/benchmark")
!566 = !{!567, !193, !110, !111, !631, !632, !647, !116}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !569, line: 247, baseType: !570)
!569 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf51.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !569, line: 216, size: 20576, elements: !571)
!571 = !{!572, !578, !579, !580, !584, !585, !589, !590, !591, !595, !596, !598, !599, !603, !604, !608, !609, !611, !612, !613, !614, !618, !619, !620, !621, !625, !626, !630}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !570, file: !569, line: 217, baseType: !573, size: 960)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 960, elements: !576)
!574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !116)
!576 = !{!577}
!577 = !DISubrange(count: 30)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !570, file: !569, line: 218, baseType: !575, size: 32, offset: 960)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !570, file: !569, line: 219, baseType: !575, size: 32, offset: 992)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !570, file: !569, line: 220, baseType: !581, size: 1088, offset: 1024)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 1088, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 34)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !570, file: !569, line: 221, baseType: !575, size: 32, offset: 2112)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !570, file: !569, line: 222, baseType: !586, size: 4032, offset: 2144)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 4032, elements: !587)
!587 = !{!588}
!588 = !DISubrange(count: 126)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !570, file: !569, line: 223, baseType: !575, size: 32, offset: 6176)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !570, file: !569, line: 224, baseType: !575, size: 32, offset: 6208)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !570, file: !569, line: 225, baseType: !592, size: 1952, offset: 6240)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 1952, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 61)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !570, file: !569, line: 226, baseType: !575, size: 32, offset: 8192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !570, file: !569, line: 227, baseType: !597, size: 288, offset: 8224)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 288, elements: !362)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !570, file: !569, line: 228, baseType: !574, size: 32, offset: 8512)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !570, file: !569, line: 229, baseType: !600, size: 1696, offset: 8544)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 1696, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 53)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !570, file: !569, line: 230, baseType: !575, size: 32, offset: 10240)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !570, file: !569, line: 231, baseType: !605, size: 96, offset: 10272)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 96, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 3)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !570, file: !569, line: 232, baseType: !575, size: 32, offset: 10368)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !570, file: !569, line: 233, baseType: !610, size: 64, offset: 10400)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 64, elements: !188)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !570, file: !569, line: 234, baseType: !575, size: 32, offset: 10464)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !570, file: !569, line: 236, baseType: !574, size: 32, offset: 10496)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !570, file: !569, line: 237, baseType: !575, size: 32, offset: 10528)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !570, file: !569, line: 238, baseType: !615, size: 224, offset: 10560)
!615 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 224, elements: !616)
!616 = !{!617}
!617 = !DISubrange(count: 7)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "RESET", scope: !570, file: !569, line: 239, baseType: !575, size: 32, offset: 10784)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !570, file: !569, line: 241, baseType: !605, size: 96, offset: 10816)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !570, file: !569, line: 242, baseType: !575, size: 32, offset: 10912)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !570, file: !569, line: 243, baseType: !622, size: 256, offset: 10944)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 256, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 8)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !570, file: !569, line: 244, baseType: !575, size: 32, offset: 11200)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !570, file: !569, line: 245, baseType: !627, size: 9312, offset: 11232)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 9312, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 291)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCFORCE", scope: !570, file: !569, line: 246, baseType: !575, size: 32, offset: 20544)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !634, line: 352, baseType: !635)
!634 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm0.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !634, line: 341, size: 320, elements: !636)
!636 = !{!637, !638, !639, !640, !641, !642, !643, !644, !646}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !635, file: !634, line: 343, baseType: !574, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !635, file: !634, line: 344, baseType: !575, size: 32, offset: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !635, file: !634, line: 345, baseType: !116, size: 32, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !635, file: !634, line: 346, baseType: !575, size: 32, offset: 96)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !635, file: !634, line: 347, baseType: !575, size: 32, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !635, file: !634, line: 348, baseType: !575, size: 32, offset: 160)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !635, file: !634, line: 349, baseType: !116, size: 32, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !635, file: !634, line: 350, baseType: !645, size: 64, offset: 224)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 64, elements: !188)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !635, file: !634, line: 351, baseType: !575, size: 32, offset: 288)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !649, file: !648, line: 167, baseType: !657)
!648 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!649 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !648, file: !648, line: 134, type: !650, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !564, retainedNodes: !652)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !116}
!652 = !{!653, !654, !656}
!653 = !DILocalVariable(name: "time_us", arg: 1, scope: !649, file: !648, line: 134, type: !116)
!654 = !DILocalVariable(name: "delay_cycles", scope: !649, file: !648, line: 168, type: !655)
!655 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!656 = !DILocalVariable(name: "cycles", scope: !649, file: !648, line: 171, type: !116)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 32)
!658 = !{!562, !659, !674}
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf51_init", scope: !564, file: !661, line: 71, type: !662, isLocal: true, isDefinition: true, align: 32)
!661 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf51/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !664, line: 51, size: 64, elements: !665)
!664 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!665 = !{!666, !673}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !663, file: !664, line: 60, baseType: !667, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!668 = !DISubroutineType(types: !669)
!669 = !{!111, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !672)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !664, line: 48, flags: DIFlagFwdDecl)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !663, file: !664, line: 65, baseType: !670, size: 32, offset: 32)
!674 = !DIGlobalVariableExpression(var: !675, expr: !DIExpression())
!675 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !649, file: !648, line: 161, type: !676, isLocal: true, isDefinition: true, align: 128)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 48, elements: !606)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !386, line: 16, size: 64, elements: !679)
!679 = !{!680, !681}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !678, file: !386, line: 17, baseType: !339, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !678, file: !386, line: 18, baseType: !193, size: 8, offset: 32)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "log_const_zbus", scope: !684, file: !688, line: 10, type: !689, isLocal: false, isDefinition: true)
!684 = distinct !DICompileUnit(language: DW_LANG_C99, file: !685, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !394, retainedTypes: !686, globals: !687, splitDebugInlining: false, nameTableKind: None)
!685 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/benchmark")
!686 = !{!112, !110, !111}
!687 = !{!682}
!688 = !DIFile(filename: "zephyr/subsys/zbus/zbus.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !386, line: 16, size: 64, elements: !691)
!691 = !{!692, !693}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !690, file: !386, line: 17, baseType: !339, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !690, file: !386, line: 18, baseType: !193, size: 8, offset: 32)
!694 = !DIGlobalVariableExpression(var: !695, expr: !DIExpression())
!695 = distinct !DIGlobalVariable(name: "log_const_clock_control", scope: !696, file: !893, line: 18, type: !1122, isLocal: false, isDefinition: true)
!696 = distinct !DICompileUnit(language: DW_LANG_C99, file: !697, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !698, retainedTypes: !813, globals: !889, splitDebugInlining: false, nameTableKind: None)
!697 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_carbon_nrf51/benchmark")
!698 = !{!699, !705, !30, !710, !715, !720, !726, !732, !741, !745, !778, !785, !804}
!699 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !700, line: 23, baseType: !32, size: 32, elements: !701)
!700 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!701 = !{!702, !703, !704}
!702 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!703 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!704 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!705 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !700, line: 48, baseType: !32, size: 32, elements: !706)
!706 = !{!707, !708, !709}
!707 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!708 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!709 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!710 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !711, line: 167, baseType: !32, size: 32, elements: !712)
!711 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!712 = !{!713, !714}
!713 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!714 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!715 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !711, line: 107, baseType: !32, size: 32, elements: !716)
!716 = !{!717, !718, !719}
!717 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!718 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!719 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!720 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !711, line: 208, baseType: !32, size: 32, elements: !721)
!721 = !{!722, !723, !724, !725}
!722 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!723 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!724 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!725 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!726 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !711, line: 261, baseType: !32, size: 32, elements: !727)
!727 = !{!728, !729, !730, !731}
!728 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!729 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!730 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!731 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!732 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !711, line: 237, baseType: !32, size: 32, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740}
!734 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!735 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!736 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!737 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!738 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!739 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!740 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!741 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !711, line: 152, baseType: !32, size: 32, elements: !742)
!742 = !{!743, !744}
!743 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!744 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!745 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !569, line: 71, baseType: !111, size: 32, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777}
!747 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!748 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!749 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!750 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!751 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!752 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!753 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!754 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!755 = !DIEnumerator(name: "UART0_IRQn", value: 2)
!756 = !DIEnumerator(name: "SPI0_TWI0_IRQn", value: 3)
!757 = !DIEnumerator(name: "SPI1_TWI1_IRQn", value: 4)
!758 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!759 = !DIEnumerator(name: "ADC_IRQn", value: 7)
!760 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!761 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!762 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!763 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!764 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!765 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!766 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!767 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!768 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!769 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!770 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!771 = !DIEnumerator(name: "LPCOMP_IRQn", value: 19)
!772 = !DIEnumerator(name: "SWI0_IRQn", value: 20)
!773 = !DIEnumerator(name: "SWI1_IRQn", value: 21)
!774 = !DIEnumerator(name: "SWI2_IRQn", value: 22)
!775 = !DIEnumerator(name: "SWI3_IRQn", value: 23)
!776 = !DIEnumerator(name: "SWI4_IRQn", value: 24)
!777 = !DIEnumerator(name: "SWI5_IRQn", value: 25)
!778 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !779, line: 44, baseType: !32, size: 32, elements: !780)
!779 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!780 = !{!781, !782, !783, !784}
!781 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!782 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!783 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!784 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!785 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !786, line: 54, baseType: !32, size: 32, elements: !787)
!786 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!787 = !{!788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803}
!788 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!789 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!790 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!791 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!792 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!793 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!794 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!795 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!796 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!797 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!798 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!799 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!800 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!801 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!802 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!803 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!804 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !805, line: 53, baseType: !32, size: 32, elements: !806)
!805 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!806 = !{!807, !808, !809, !810, !811, !812}
!807 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!808 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!809 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!810 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!811 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!812 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!813 = !{!699, !110, !111, !814, !862, !863, !864, !865, !112, !116, !117, !139, !631, !381, !333, !866, !888, !140}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !569, line: 291, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !569, line: 260, size: 10912, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824, !825, !829, !830, !831, !832, !833, !834, !838, !839, !840, !844, !845, !846, !847, !848, !849, !850, !854, !855, !856, !857, !861}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !816, file: !569, line: 261, baseType: !575, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !816, file: !569, line: 262, baseType: !575, size: 32, offset: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !816, file: !569, line: 263, baseType: !575, size: 32, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !816, file: !569, line: 264, baseType: !575, size: 32, offset: 96)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !816, file: !569, line: 265, baseType: !575, size: 32, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !816, file: !569, line: 266, baseType: !575, size: 32, offset: 160)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !816, file: !569, line: 267, baseType: !575, size: 32, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !816, file: !569, line: 268, baseType: !826, size: 1824, offset: 224)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 1824, elements: !827)
!827 = !{!828}
!828 = !DISubrange(count: 57)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !816, file: !569, line: 269, baseType: !575, size: 32, offset: 2048)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !816, file: !569, line: 270, baseType: !575, size: 32, offset: 2080)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !816, file: !569, line: 271, baseType: !574, size: 32, offset: 2112)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !816, file: !569, line: 272, baseType: !575, size: 32, offset: 2144)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !816, file: !569, line: 273, baseType: !575, size: 32, offset: 2176)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !816, file: !569, line: 274, baseType: !835, size: 3968, offset: 2208)
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 3968, elements: !836)
!836 = !{!837}
!837 = !DISubrange(count: 124)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !816, file: !569, line: 275, baseType: !575, size: 32, offset: 6176)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !816, file: !569, line: 276, baseType: !575, size: 32, offset: 6208)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !816, file: !569, line: 277, baseType: !841, size: 2016, offset: 6240)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 2016, elements: !842)
!842 = !{!843}
!843 = !DISubrange(count: 63)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !816, file: !569, line: 278, baseType: !574, size: 32, offset: 8256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !816, file: !569, line: 279, baseType: !574, size: 32, offset: 8288)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !816, file: !569, line: 280, baseType: !574, size: 32, offset: 8320)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !816, file: !569, line: 281, baseType: !574, size: 32, offset: 8352)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !816, file: !569, line: 282, baseType: !574, size: 32, offset: 8384)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !816, file: !569, line: 283, baseType: !574, size: 32, offset: 8416)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !816, file: !569, line: 285, baseType: !851, size: 1984, offset: 8448)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 1984, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 62)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !816, file: !569, line: 286, baseType: !575, size: 32, offset: 10432)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !816, file: !569, line: 287, baseType: !615, size: 224, offset: 10464)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !816, file: !569, line: 288, baseType: !575, size: 32, offset: 10688)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !816, file: !569, line: 289, baseType: !858, size: 160, offset: 10720)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 160, elements: !859)
!859 = !{!860}
!860 = !DISubrange(count: 5)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "XTALFREQ", scope: !816, file: !569, line: 290, baseType: !575, size: 32, offset: 10880)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !711, line: 146, baseType: !715)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !711, line: 164, baseType: !741)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !634, line: 326, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !634, line: 314, size: 6400, elements: !869)
!869 = !{!870, !872, !876, !877, !878, !879, !880, !881, !882, !886}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !868, file: !634, line: 316, baseType: !871, size: 32)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 32, elements: !441)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !868, file: !634, line: 317, baseType: !873, size: 992, offset: 32)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 992, elements: !874)
!874 = !{!875}
!875 = !DISubrange(count: 31)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !868, file: !634, line: 318, baseType: !871, size: 32, offset: 1024)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !868, file: !634, line: 319, baseType: !873, size: 992, offset: 1056)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !868, file: !634, line: 320, baseType: !871, size: 32, offset: 2048)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !868, file: !634, line: 321, baseType: !873, size: 992, offset: 2080)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !868, file: !634, line: 322, baseType: !871, size: 32, offset: 3072)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !868, file: !634, line: 323, baseType: !873, size: 992, offset: 3104)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !868, file: !634, line: 324, baseType: !883, size: 2048, offset: 4096)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 2048, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !868, file: !634, line: 325, baseType: !887, size: 256, offset: 6144)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !575, size: 256, elements: !623)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !779, line: 56, baseType: !110)
!889 = !{!694, !890, !940, !981, !987, !1004, !1015, !1017, !1034, !1036, !1046, !1049, !1062, !1100, !1114}
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "on", scope: !892, file: !893, line: 549, type: !439, isLocal: true, isDefinition: true)
!892 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !893, file: !893, line: 547, type: !894, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !696, retainedNodes: !896)
!893 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!894 = !DISubroutineType(types: !895)
!895 = !{null, !705}
!896 = !{!897, !898, !901}
!897 = !DILocalVariable(name: "start_mode", arg: 1, scope: !892, file: !893, line: 547, type: !705)
!898 = !DILocalVariable(name: "err", scope: !899, file: !893, line: 553, type: !111)
!899 = distinct !DILexicalBlock(scope: !900, file: !893, line: 552, column: 31)
!900 = distinct !DILexicalBlock(scope: !892, file: !893, line: 552, column: 6)
!901 = !DILocalVariable(name: "mgr", scope: !899, file: !893, line: 554, type: !902)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !904, line: 154, size: 224, elements: !905)
!904 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!905 = !{!906, !918, !919, !935, !937, !938, !939}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !903, file: !904, line: 158, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !424, line: 40, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !424, line: 35, size: 64, elements: !909)
!909 = !{!910, !917}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !908, file: !424, line: 36, baseType: !911, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !424, line: 33, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !424, line: 29, size: 32, elements: !914)
!914 = !{!915}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !913, file: !424, line: 30, baseType: !916, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 32)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !908, file: !424, line: 37, baseType: !911, size: 32, offset: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !903, file: !904, line: 163, baseType: !907, size: 64, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !903, file: !904, line: 166, baseType: !920, size: 32, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !904, line: 133, size: 96, elements: !923)
!923 = !{!924, !933, !934}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !922, file: !904, line: 135, baseType: !925, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !904, line: 129, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DISubroutineType(types: !928)
!928 = !{null, !902, !929}
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !904, line: 101, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!931 = !DISubroutineType(types: !932)
!932 = !{null, !902, !111}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !922, file: !904, line: 138, baseType: !925, size: 32, offset: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !922, file: !904, line: 143, baseType: !925, size: 32, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !903, file: !904, line: 169, baseType: !936, offset: 160)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !252, line: 43, elements: !253)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !903, file: !904, line: 172, baseType: !111, size: 32, offset: 160)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !903, file: !904, line: 175, baseType: !129, size: 16, offset: 192)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !903, file: !904, line: 178, baseType: !129, size: 16, offset: 208)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "cli", scope: !892, file: !893, line: 550, type: !942, isLocal: true, isDefinition: true)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !904, line: 273, size: 128, elements: !943)
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !942, file: !904, line: 280, baseType: !912, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !942, file: !904, line: 283, baseType: !946, size: 96, offset: 32)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !947, line: 138, size: 96, elements: !948)
!947 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!948 = !{!949, !978, !979}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !946, file: !947, line: 149, baseType: !950, size: 32)
!950 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !947, line: 139, size: 32, elements: !951)
!951 = !{!952, !973}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !950, file: !947, line: 145, baseType: !953, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 32)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !145, line: 5397, size: 128, elements: !955)
!955 = !{!956, !971, !972}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !954, file: !145, line: 5399, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !154, line: 48, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !154, line: 37, size: 64, elements: !959)
!959 = !{!960, !966}
!960 = !DIDerivedType(tag: DW_TAG_member, scope: !958, file: !154, line: 38, baseType: !961, size: 32)
!961 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !958, file: !154, line: 38, size: 32, elements: !962)
!962 = !{!963, !965}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !961, file: !154, line: 39, baseType: !964, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !961, file: !154, line: 40, baseType: !964, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, scope: !958, file: !154, line: 42, baseType: !967, size: 32, offset: 32)
!967 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !958, file: !154, line: 42, size: 32, elements: !968)
!968 = !{!969, !970}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !967, file: !154, line: 43, baseType: !964, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !967, file: !154, line: 44, baseType: !964, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !954, file: !145, line: 5405, baseType: !32, size: 32, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !954, file: !145, line: 5408, baseType: !111, size: 32, offset: 96)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !950, file: !947, line: 148, baseType: !974, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !947, line: 98, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!976 = !DISubroutineType(types: !977)
!977 = !{null, null}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !946, file: !947, line: 165, baseType: !575, size: 32, offset: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !946, file: !947, line: 174, baseType: !980, size: 32, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !111)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_23", scope: !696, file: !893, line: 733, type: !983, isLocal: false, isDefinition: true, align: 16)
!983 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 80, elements: !859)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !986, line: 43, baseType: !479)
!986 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(name: "__device_dts_ord_23", scope: !696, file: !893, line: 733, type: !989, isLocal: false, isDefinition: true, align: 32)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !990)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !986, line: 378, size: 192, elements: !991)
!991 = !{!992, !993, !994, !995, !1001, !1002}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !990, file: !986, line: 380, baseType: !339, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !990, file: !986, line: 382, baseType: !13, size: 32, offset: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !990, file: !986, line: 384, baseType: !13, size: 32, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !990, file: !986, line: 386, baseType: !996, size: 32, offset: 96)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 32)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !986, line: 351, size: 16, elements: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !997, file: !986, line: 359, baseType: !193, size: 8)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !997, file: !986, line: 364, baseType: !139, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !990, file: !986, line: 388, baseType: !110, size: 32, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !990, file: !986, line: 396, baseType: !1003, size: 32, offset: 160)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 32)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_23", scope: !696, file: !893, line: 733, type: !1006, isLocal: true, isDefinition: true, align: 32)
!1006 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1007)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !664, line: 51, size: 64, elements: !1008)
!1008 = !{!1009, !1014}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1007, file: !664, line: 60, baseType: !1010, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 32)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!111, !1013}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1007, file: !664, line: 65, baseType: !1013, size: 32, offset: 32)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !696, file: !893, line: 79, type: !439, isLocal: true, isDefinition: true)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "data", scope: !696, file: !893, line: 702, type: !1019, isLocal: true, isDefinition: true)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !893, line: 69, size: 640, elements: !1020)
!1020 = !{!1021, !1023}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !1019, file: !893, line: 70, baseType: !1022, size: 448)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 448, elements: !188)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !1019, file: !893, line: 71, baseType: !1024, size: 192, offset: 448)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1025, size: 192, elements: !188)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !893, line: 52, size: 96, elements: !1026)
!1026 = !{!1027, !1032, !1033}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !1025, file: !893, line: 53, baseType: !1028, size: 32)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !779, line: 72, baseType: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 32)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{null, !1013, !888, !110}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !1025, file: !893, line: 54, baseType: !110, size: 32, offset: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1025, file: !893, line: 55, baseType: !116, size: 32, offset: 64)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_23", scope: !696, file: !893, line: 733, type: !997, isLocal: true, isDefinition: true, align: 8)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "d", scope: !1038, file: !893, line: 476, type: !1044, isLocal: true, isDefinition: true)
!1038 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !893, file: !893, line: 474, type: !894, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !696, retainedNodes: !1039)
!1039 = !{!1040, !1041, !1042, !1043}
!1040 = !DILocalVariable(name: "mode", arg: 1, scope: !1038, file: !893, line: 474, type: !705)
!1041 = !DILocalVariable(name: "type", scope: !1038, file: !893, line: 486, type: !862)
!1042 = !DILocalVariable(name: "isr_mode", scope: !1038, file: !893, line: 500, type: !139)
!1043 = !DILocalVariable(name: "key", scope: !1038, file: !893, line: 501, type: !111)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_domain_t", file: !711, line: 177, baseType: !710)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(name: "target_type", scope: !1038, file: !893, line: 477, type: !1048, isLocal: true, isDefinition: true)
!1048 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !862)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(name: "config", scope: !696, file: !893, line: 704, type: !1051, isLocal: true, isDefinition: true)
!1051 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1052)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_config", file: !893, line: 74, size: 192, elements: !1053)
!1053 = !{!1054}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !1052, file: !893, line: 76, baseType: !1055, size: 192)
!1055 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1056, size: 192, elements: !188)
