; ModuleID = 'build/adafruit_feather_nrf52840/drivers/spi_flash/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_spinlock_key }
%struct.z_spinlock_key = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_spinlock_key }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/spi_flash/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/spi_flash")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/spi_flash")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/spi_flash")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !111, file: !154, line: 27, type: !183, isLocal: true, isDefinition: true)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !125, globals: !151, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/spi_flash")
!113 = !{!114, !30}
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !115, line: 27, baseType: !32, size: 32, elements: !116)
!115 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!118 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!119 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!120 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!121 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!122 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!123 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!124 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!125 = !{!102, !126, !103, !24, !130, !146, !148, !149}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !127, line: 46, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !129)
!129 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !132, line: 54, size: 96, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !141, !145}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !131, file: !132, line: 55, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !137)
!136 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !138)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !136, line: 30, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !131, file: !132, line: 60, baseType: !142, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !114}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !131, file: !132, line: 65, baseType: !142, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !150)
!150 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!151 = !{!109, !152, !158, !160, !173, !175}
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !111, file: !154, line: 44, type: !155, isLocal: true, isDefinition: true)
!154 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{}
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !111, file: !154, line: 49, type: !155, isLocal: true, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !111, file: !154, line: 36, type: !162, isLocal: true, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !163, size: 128, elements: !171)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !115, line: 114, size: 128, elements: !164)
!164 = !{!165, !166, !169, !170}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !163, file: !115, line: 115, baseType: !114, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !163, file: !115, line: 141, baseType: !167, size: 8, offset: 32)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !168)
!168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !163, file: !115, line: 149, baseType: !148, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !163, file: !115, line: 156, baseType: !148, size: 32, offset: 96)
!171 = !{!172}
!172 = !DISubrange(count: 1)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !111, file: !154, line: 40, type: !162, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !111, file: !154, line: 28, type: !177, isLocal: true, isDefinition: true)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !178)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !179)
!179 = !{!180, !182}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !178, file: !136, line: 36, baseType: !181, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !178, file: !136, line: 37, baseType: !181, size: 32, offset: 32)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 32, elements: !171)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !185, line: 22, baseType: !186)
!185 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!186 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!187 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!188 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !191, file: !222, line: 50, type: !209, isLocal: true, isDefinition: true)
!191 = distinct !DICompileUnit(language: DW_LANG_C99, file: !192, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !193, globals: !219, splitDebugInlining: false, nameTableKind: None)
!192 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/spi_flash")
!193 = !{!194, !126, !196, !103, !102, !148, !149, !198, !146, !209, !210}
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !195)
!195 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !197, line: 214, baseType: !32)
!197 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !200, line: 45, size: 64, elements: !201)
!200 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !{!202, !208}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !199, file: !200, line: 46, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !205)
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !204, file: !136, line: 30, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !199, file: !200, line: 48, baseType: !148, size: 32, offset: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !200, line: 38, size: 64, elements: !212)
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !211, file: !200, line: 39, baseType: !203, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !211, file: !200, line: 41, baseType: !215, size: 32, offset: 32)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !200, line: 35, baseType: !216)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !209}
!219 = !{!220, !224, !232, !189, !234, !244}
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "latency_lock", scope: !191, file: !222, line: 44, type: !223, isLocal: true, isDefinition: true)
!222 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, elements: !157)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !191, file: !222, line: 46, type: !226, isLocal: true, isDefinition: true)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !227)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !228)
!228 = !{!229, !231}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !227, file: !136, line: 36, baseType: !230, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !227, file: !136, line: 37, baseType: !230, size: 32, offset: 32)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "latency_subs", scope: !191, file: !222, line: 52, type: !226, isLocal: true, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !191, file: !222, line: 39, type: !236, isLocal: true, isDefinition: true)
!236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, elements: !242)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !222, line: 35, size: 96, elements: !238)
!238 = !{!239, !240, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !237, file: !222, line: 36, baseType: !114, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !237, file: !222, line: 37, baseType: !167, size: 8, offset: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !237, file: !222, line: 38, baseType: !184, size: 32, offset: 64)
!242 = !{!243}
!243 = !DISubrange(count: 0)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !191, file: !222, line: 48, type: !209, isLocal: true, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !248, file: !255, line: 47, type: !269, isLocal: true, isDefinition: true)
!248 = distinct !DICompileUnit(language: DW_LANG_C99, file: !249, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !250, retainedTypes: !251, globals: !252, splitDebugInlining: false, nameTableKind: None)
!249 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/spi_flash")
!250 = !{!114}
!251 = !{!196, !103}
!252 = !{!253, !246, !265}
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "cpus_states", scope: !248, file: !255, line: 50, type: !256, isLocal: true, isDefinition: true)
!255 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !257, size: 32, elements: !171)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !259)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !115, line: 114, size: 128, elements: !260)
!260 = !{!261, !262, !263, !264}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !259, file: !115, line: 115, baseType: !114, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !259, file: !115, line: 141, baseType: !167, size: 8, offset: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !259, file: !115, line: 149, baseType: !148, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !259, file: !115, line: 156, baseType: !148, size: 32, offset: 96)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !248, file: !255, line: 55, type: !267, isLocal: true, isDefinition: true)
!267 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 8, elements: !171)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !258, elements: !242)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "static_regions", scope: !272, file: !279, line: 62, type: !412, isLocal: true, isDefinition: true)
!272 = distinct !DICompileUnit(language: DW_LANG_C99, file: !273, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !274, globals: !275, splitDebugInlining: false, nameTableKind: None)
!273 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/spi_flash")
!274 = !{!196, !103, !148, !102}
!275 = !{!276, !270}
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !278, file: !279, line: 198, type: !400, isLocal: true, isDefinition: true)
!278 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !279, file: !279, line: 175, type: !280, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !272, retainedNodes: !397)
!279 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!280 = !DISubroutineType(types: !281)
!281 = !{null, !282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !284, line: 245, size: 1024, elements: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !{!286, !353, !366, !367, !368, !369, !375, !392}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !283, file: !284, line: 247, baseType: !287, size: 384)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !284, line: 57, size: 384, elements: !288)
!288 = !{!289, !317, !325, !326, !327, !340, !341, !342}
!289 = !DIDerivedType(tag: DW_TAG_member, scope: !287, file: !284, line: 60, baseType: !290, size: 64)
!290 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !287, file: !284, line: 60, size: 64, elements: !291)
!291 = !{!292, !308}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !290, file: !284, line: 61, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !294, line: 49, baseType: !295)
!294 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !294, line: 37, size: 64, elements: !296)
!296 = !{!297, !303}
!297 = !DIDerivedType(tag: DW_TAG_member, scope: !295, file: !294, line: 38, baseType: !298, size: 32)
!298 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !294, line: 38, size: 32, elements: !299)
!299 = !{!300, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !298, file: !294, line: 39, baseType: !301, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !298, file: !294, line: 40, baseType: !301, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, scope: !295, file: !294, line: 42, baseType: !304, size: 32, offset: 32)
!304 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !295, file: !294, line: 42, size: 32, elements: !305)
!305 = !{!306, !307}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !304, file: !294, line: 43, baseType: !301, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !304, file: !294, line: 44, baseType: !301, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !290, file: !284, line: 62, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !310, line: 49, size: 64, elements: !311)
!310 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !309, file: !310, line: 50, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 64, elements: !315)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!315 = !{!316}
!316 = !DISubrange(count: 2)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !287, file: !284, line: 68, baseType: !318, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !320, line: 233, baseType: !321)
!320 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !320, line: 231, size: 64, elements: !322)
!322 = !{!323}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !321, file: !320, line: 232, baseType: !324, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !294, line: 48, baseType: !295)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !287, file: !284, line: 71, baseType: !167, size: 8, offset: 96)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !287, file: !284, line: 74, baseType: !167, size: 8, offset: 104)
!327 = !DIDerivedType(tag: DW_TAG_member, scope: !287, file: !284, line: 90, baseType: !328, size: 16, offset: 112)
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !287, file: !284, line: 90, size: 16, elements: !329)
!329 = !{!330, !337}
!330 = !DIDerivedType(tag: DW_TAG_member, scope: !328, file: !284, line: 91, baseType: !331, size: 16)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !284, line: 91, size: 16, elements: !332)
!332 = !{!333, !336}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !331, file: !284, line: 96, baseType: !334, size: 8)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !335)
!335 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !331, file: !284, line: 97, baseType: !167, size: 8, offset: 8)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !328, file: !284, line: 100, baseType: !338, size: 16)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !339)
!339 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !287, file: !284, line: 107, baseType: !148, size: 32, offset: 128)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !287, file: !284, line: 127, baseType: !102, size: 32, offset: 160)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !287, file: !284, line: 131, baseType: !343, size: 192, offset: 192)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !320, line: 244, size: 192, elements: !344)
!344 = !{!345, !346, !352}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !343, file: !320, line: 245, baseType: !293, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !343, file: !320, line: 246, baseType: !347, size: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !320, line: 242, baseType: !348)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 32)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !351}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !343, file: !320, line: 249, baseType: !128, size: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !283, file: !284, line: 250, baseType: !354, size: 288, offset: 384)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !355, line: 25, size: 288, elements: !356)
!355 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!356 = !{!357, !358, !359, !360, !361, !362, !363, !364, !365}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !354, file: !355, line: 26, baseType: !148, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !354, file: !355, line: 27, baseType: !148, size: 32, offset: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !354, file: !355, line: 28, baseType: !148, size: 32, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !354, file: !355, line: 29, baseType: !148, size: 32, offset: 96)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !354, file: !355, line: 30, baseType: !148, size: 32, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !354, file: !355, line: 31, baseType: !148, size: 32, offset: 160)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !354, file: !355, line: 32, baseType: !148, size: 32, offset: 192)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !354, file: !355, line: 33, baseType: !148, size: 32, offset: 224)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !354, file: !355, line: 34, baseType: !148, size: 32, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !283, file: !284, line: 253, baseType: !102, size: 32, offset: 672)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !283, file: !284, line: 256, baseType: !319, size: 64, offset: 704)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !283, file: !284, line: 294, baseType: !103, size: 32, offset: 768)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !283, file: !284, line: 300, baseType: !370, size: 96, offset: 800)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !284, line: 149, size: 96, elements: !371)
!371 = !{!372, !373, !374}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !370, file: !284, line: 153, baseType: !22, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !370, file: !284, line: 162, baseType: !196, size: 32, offset: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !370, file: !284, line: 168, baseType: !196, size: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !283, file: !284, line: 325, baseType: !376, size: 32, offset: 896)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !378, line: 5073, size: 160, elements: !379)
!378 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!379 = !{!380, !389, !390}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !377, file: !378, line: 5074, baseType: !381, size: 96)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !382, line: 56, size: 96, elements: !383)
!382 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!383 = !{!384, !387, !388}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !381, file: !382, line: 57, baseType: !385, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !382, line: 57, flags: DIFlagFwdDecl)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !381, file: !382, line: 58, baseType: !102, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !381, file: !382, line: 59, baseType: !196, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !377, file: !378, line: 5075, baseType: !319, size: 64, offset: 96)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !377, file: !378, line: 5076, baseType: !391, offset: 160)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, elements: !157)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !283, file: !284, line: 343, baseType: !393, size: 64, offset: 928)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !355, line: 60, size: 64, elements: !394)
!394 = !{!395, !396}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !393, file: !355, line: 63, baseType: !148, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !393, file: !355, line: 66, baseType: !148, size: 32, offset: 32)
!397 = !{!398, !399}
!398 = !DILocalVariable(name: "thread", arg: 1, scope: !278, file: !279, line: 175, type: !282)
!399 = !DILocalVariable(name: "region_num", scope: !278, file: !279, line: 200, type: !167)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, elements: !242)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !402, line: 52, size: 96, elements: !403)
!402 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = !{!404, !405, !406}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !401, file: !402, line: 53, baseType: !22, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !401, file: !402, line: 54, baseType: !196, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !401, file: !402, line: 55, baseType: !407, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !408, line: 151, baseType: !409)
!408 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !408, line: 149, size: 32, elements: !410)
!410 = !{!411}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !409, file: !408, line: 150, baseType: !148, size: 32)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 96, elements: !171)
!413 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !416, file: !452, line: 39, type: !167, isLocal: true, isDefinition: true)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !418, globals: !451, splitDebugInlining: false, nameTableKind: None)
!417 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/spi_flash")
!418 = !{!419, !102, !103, !437, !167}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !421, line: 1226, baseType: !422)
!421 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 1213, size: 352, elements: !423)
!423 = !{!424, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !422, file: !421, line: 1215, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !148)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !422, file: !421, line: 1216, baseType: !426, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !422, file: !421, line: 1217, baseType: !426, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !422, file: !421, line: 1218, baseType: !426, size: 32, offset: 96)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !422, file: !421, line: 1219, baseType: !426, size: 32, offset: 128)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !422, file: !421, line: 1220, baseType: !426, size: 32, offset: 160)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !422, file: !421, line: 1221, baseType: !426, size: 32, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !422, file: !421, line: 1222, baseType: !426, size: 32, offset: 224)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !422, file: !421, line: 1223, baseType: !426, size: 32, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !422, file: !421, line: 1224, baseType: !426, size: 32, offset: 288)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !422, file: !421, line: 1225, baseType: !426, size: 32, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !440, line: 27, size: 96, elements: !441)
!440 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!441 = !{!442, !443, !446}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !439, file: !440, line: 29, baseType: !148, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !439, file: !440, line: 31, baseType: !444, size: 32, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !439, file: !440, line: 37, baseType: !447, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !408, line: 146, baseType: !448)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !408, line: 141, size: 32, elements: !449)
!449 = !{!450}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !448, file: !408, line: 143, baseType: !148, size: 32)
!451 = !{!414}
!452 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !455, file: !462, line: 21, type: !106, isLocal: true, isDefinition: true)
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !457, globals: !461, splitDebugInlining: false, nameTableKind: None)
!456 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/spi_flash")
!457 = !{!458, !103, !102}
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !460, line: 22, baseType: !103)
!460 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!461 = !{!453}
!462 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !465, file: !470, line: 13, type: !487, isLocal: true, isDefinition: true)
!465 = distinct !DICompileUnit(language: DW_LANG_C99, file: !466, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !467, splitDebugInlining: false, nameTableKind: None)
!466 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/spi_flash")
!467 = !{!468, !463}
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "mpu_config", scope: !465, file: !470, line: 37, type: !471, isLocal: false, isDefinition: true)
!470 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!471 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !440, line: 41, size: 64, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !472, file: !440, line: 43, baseType: !148, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !472, file: !440, line: 45, baseType: !476, size: 32, offset: 32)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !440, line: 27, size: 96, elements: !479)
!479 = !{!480, !481, !482}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !478, file: !440, line: 29, baseType: !148, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !478, file: !440, line: 31, baseType: !444, size: 32, offset: 32)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !478, file: !440, line: 37, baseType: !483, size: 32, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !408, line: 146, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !408, line: 141, size: 32, elements: !485)
!485 = !{!486}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !484, file: !408, line: 143, baseType: !148, size: 32)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !477, size: 192, elements: !315)
!488 = !DIGlobalVariableExpression(var: !489, expr: !DIExpression())
!489 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !490, file: !660, line: 93, type: !661, isLocal: true, isDefinition: true, align: 32)
!490 = distinct !DICompileUnit(language: DW_LANG_C99, file: !491, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !492, globals: !655, splitDebugInlining: false, nameTableKind: None)
!491 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/spi_flash")
!492 = !{!493, !167, !102, !103, !573, !148, !574, !610, !621}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !495, line: 1071, baseType: !496)
!495 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !495, line: 1035, size: 19584, elements: !497)
!497 = !{!498, !502, !503, !504, !508, !509, !511, !512, !513, !514, !515, !516, !520, !521, !522, !526, !527, !531, !532, !536, !537, !541, !542, !543, !544, !545, !546, !547, !551, !552, !553, !554, !558, !559, !563}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !496, file: !495, line: 1036, baseType: !499, size: 960)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 960, elements: !500)
!500 = !{!501}
!501 = !DISubrange(count: 30)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !496, file: !495, line: 1037, baseType: !426, size: 32, offset: 960)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !496, file: !495, line: 1038, baseType: !426, size: 32, offset: 992)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !496, file: !495, line: 1039, baseType: !505, size: 1088, offset: 1024)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 1088, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 34)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !496, file: !495, line: 1040, baseType: !426, size: 32, offset: 2112)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !496, file: !495, line: 1041, baseType: !510, size: 64, offset: 2144)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 64, elements: !315)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !496, file: !495, line: 1042, baseType: !426, size: 32, offset: 2208)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !496, file: !495, line: 1043, baseType: !426, size: 32, offset: 2240)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !496, file: !495, line: 1044, baseType: !426, size: 32, offset: 2272)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !496, file: !495, line: 1045, baseType: !426, size: 32, offset: 2304)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !496, file: !495, line: 1046, baseType: !426, size: 32, offset: 2336)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !496, file: !495, line: 1047, baseType: !517, size: 3808, offset: 2368)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 3808, elements: !518)
!518 = !{!519}
!519 = !DISubrange(count: 119)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !496, file: !495, line: 1048, baseType: !426, size: 32, offset: 6176)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !496, file: !495, line: 1049, baseType: !426, size: 32, offset: 6208)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !496, file: !495, line: 1050, baseType: !523, size: 1952, offset: 6240)
!523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 1952, elements: !524)
!524 = !{!525}
!525 = !DISubrange(count: 61)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !496, file: !495, line: 1051, baseType: !426, size: 32, offset: 8192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !496, file: !495, line: 1052, baseType: !528, size: 288, offset: 8224)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 288, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 9)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !496, file: !495, line: 1053, baseType: !425, size: 32, offset: 8512)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !496, file: !495, line: 1054, baseType: !533, size: 96, offset: 8544)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 96, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 3)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !496, file: !495, line: 1055, baseType: !425, size: 32, offset: 8640)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !496, file: !495, line: 1056, baseType: !538, size: 1568, offset: 8672)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 1568, elements: !539)
!539 = !{!540}
!540 = !DISubrange(count: 49)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !496, file: !495, line: 1057, baseType: !426, size: 32, offset: 10240)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !496, file: !495, line: 1058, baseType: !533, size: 96, offset: 10272)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !496, file: !495, line: 1059, baseType: !426, size: 32, offset: 10368)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !496, file: !495, line: 1060, baseType: !510, size: 64, offset: 10400)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !496, file: !495, line: 1061, baseType: !426, size: 32, offset: 10464)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !496, file: !495, line: 1062, baseType: !426, size: 32, offset: 10496)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !496, file: !495, line: 1063, baseType: !548, size: 672, offset: 10528)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 672, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 21)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !496, file: !495, line: 1064, baseType: !426, size: 32, offset: 11200)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !496, file: !495, line: 1065, baseType: !425, size: 32, offset: 11232)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !496, file: !495, line: 1066, baseType: !426, size: 32, offset: 11264)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !496, file: !495, line: 1067, baseType: !555, size: 1504, offset: 11296)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 1504, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 47)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !496, file: !495, line: 1068, baseType: !425, size: 32, offset: 12800)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !496, file: !495, line: 1069, baseType: !560, size: 5600, offset: 12832)
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 5600, elements: !561)
!561 = !{!562}
!562 = !DISubrange(count: 175)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !496, file: !495, line: 1070, baseType: !564, size: 1152, offset: 18432)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 1152, elements: !529)
!565 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !495, line: 278, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !495, line: 272, size: 128, elements: !568)
!568 = !{!569, !570, !571, !572}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !567, file: !495, line: 273, baseType: !426, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !567, file: !495, line: 274, baseType: !426, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !567, file: !495, line: 275, baseType: !426, size: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !567, file: !495, line: 277, baseType: !425, size: 32, offset: 96)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !421, line: 468, baseType: !576)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 445, size: 1120, elements: !577)
!577 = !{!578, !579, !580, !581, !582, !583, !584, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !603, !607, !609}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !576, file: !421, line: 447, baseType: !425, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !576, file: !421, line: 448, baseType: !426, size: 32, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !576, file: !421, line: 449, baseType: !426, size: 32, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !576, file: !421, line: 450, baseType: !426, size: 32, offset: 96)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !576, file: !421, line: 451, baseType: !426, size: 32, offset: 128)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !576, file: !421, line: 452, baseType: !426, size: 32, offset: 160)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !576, file: !421, line: 453, baseType: !585, size: 96, offset: 192)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 96, elements: !587)
!586 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !167)
!587 = !{!588}
!588 = !DISubrange(count: 12)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !576, file: !421, line: 454, baseType: !426, size: 32, offset: 288)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !576, file: !421, line: 455, baseType: !426, size: 32, offset: 320)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !576, file: !421, line: 456, baseType: !426, size: 32, offset: 352)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !576, file: !421, line: 457, baseType: !426, size: 32, offset: 384)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !576, file: !421, line: 458, baseType: !426, size: 32, offset: 416)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !576, file: !421, line: 459, baseType: !426, size: 32, offset: 448)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !576, file: !421, line: 460, baseType: !426, size: 32, offset: 480)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !576, file: !421, line: 461, baseType: !510, size: 64, offset: 512)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !576, file: !421, line: 462, baseType: !425, size: 32, offset: 576)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !576, file: !421, line: 463, baseType: !425, size: 32, offset: 608)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !576, file: !421, line: 464, baseType: !600, size: 128, offset: 640)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 128, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 4)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !576, file: !421, line: 465, baseType: !604, size: 160, offset: 768)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 160, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 5)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !576, file: !421, line: 466, baseType: !608, size: 160, offset: 928)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 160, elements: !605)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !576, file: !421, line: 467, baseType: !426, size: 32, offset: 1088)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !612, file: !611, line: 167, baseType: !620)
!611 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!612 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !611, file: !611, line: 134, type: !613, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !490, retainedNodes: !615)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !148}
!615 = !{!616, !617, !619}
!616 = !DILocalVariable(name: "time_us", arg: 1, scope: !612, file: !611, line: 134, type: !148)
!617 = !DILocalVariable(name: "delay_cycles", scope: !612, file: !611, line: 168, type: !618)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!619 = !DILocalVariable(name: "cycles", scope: !612, file: !611, line: 171, type: !148)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !495, line: 2399, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !495, line: 2373, size: 10880, elements: !624)
!624 = !{!625, !629, !630, !631, !632, !636, !637, !642, !643, !644, !645, !646, !647, !651, !652, !653, !654}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !623, file: !495, line: 2374, baseType: !626, size: 8192)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 8192, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 256)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !623, file: !495, line: 2375, baseType: !425, size: 32, offset: 8192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !623, file: !495, line: 2376, baseType: !425, size: 32, offset: 8224)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !623, file: !495, line: 2377, baseType: !425, size: 32, offset: 8256)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !623, file: !495, line: 2378, baseType: !633, size: 1984, offset: 8288)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 1984, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 62)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !623, file: !495, line: 2379, baseType: !426, size: 32, offset: 10272)
!637 = !DIDerivedType(tag: DW_TAG_member, scope: !623, file: !495, line: 2381, baseType: !638, size: 32, offset: 10304)
!638 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !623, file: !495, line: 2381, size: 32, elements: !639)
!639 = !{!640, !641}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !638, file: !495, line: 2382, baseType: !426, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !638, file: !495, line: 2383, baseType: !426, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !623, file: !495, line: 2386, baseType: !426, size: 32, offset: 10336)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !623, file: !495, line: 2387, baseType: !426, size: 32, offset: 10368)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !623, file: !495, line: 2389, baseType: !426, size: 32, offset: 10400)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !623, file: !495, line: 2391, baseType: !426, size: 32, offset: 10432)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !623, file: !495, line: 2393, baseType: !426, size: 32, offset: 10464)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !623, file: !495, line: 2394, baseType: !648, size: 256, offset: 10496)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 256, elements: !649)
!649 = !{!650}
!650 = !DISubrange(count: 8)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !623, file: !495, line: 2395, baseType: !426, size: 32, offset: 10752)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !623, file: !495, line: 2396, baseType: !425, size: 32, offset: 10784)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !623, file: !495, line: 2397, baseType: !426, size: 32, offset: 10816)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !623, file: !495, line: 2398, baseType: !426, size: 32, offset: 10848)
!655 = !{!488, !656}
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !612, file: !611, line: 161, type: !658, isLocal: true, isDefinition: true, align: 128)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 48, elements: !534)
!659 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !338)
!660 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!661 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !662)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !663, line: 51, size: 64, elements: !664)
!663 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!664 = !{!665, !672}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !662, file: !663, line: 60, baseType: !666, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 32)
!667 = !DISubroutineType(types: !668)
!668 = !{!103, !669}
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !671)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !663, line: 48, flags: DIFlagFwdDecl)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !662, file: !663, line: 65, baseType: !669, size: 32, offset: 32)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "__device_dts_ord_38", scope: !675, file: !911, line: 733, type: !1015, isLocal: false, isDefinition: true, align: 32)
!675 = distinct !DICompileUnit(language: DW_LANG_C99, file: !676, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !677, retainedTypes: !820, globals: !907, splitDebugInlining: false, nameTableKind: None)
!676 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_nrf52840/drivers/spi_flash")
!677 = !{!678, !684, !30, !689, !694, !701, !709, !717, !726, !730, !785, !792, !811}
!678 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !679, line: 23, baseType: !32, size: 32, elements: !680)
!679 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!680 = !{!681, !682, !683}
!681 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!682 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!683 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !679, line: 48, baseType: !32, size: 32, elements: !685)
!685 = !{!686, !687, !688}
!686 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!687 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!688 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!689 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !690, line: 167, baseType: !32, size: 32, elements: !691)
!690 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!691 = !{!692, !693}
!692 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!693 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!694 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !690, line: 107, baseType: !32, size: 32, elements: !695)
!695 = !{!696, !697, !698, !699, !700}
!696 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!697 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!698 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!699 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!700 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!701 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !690, line: 208, baseType: !32, size: 32, elements: !702)
!702 = !{!703, !704, !705, !706, !707, !708}
!703 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!704 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!705 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!706 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!707 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!708 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!709 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !690, line: 261, baseType: !32, size: 32, elements: !710)
!710 = !{!711, !712, !713, !714, !715, !716}
!711 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!712 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!713 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!714 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!715 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!716 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!717 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !690, line: 237, baseType: !32, size: 32, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724, !725}
!719 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!720 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!721 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!722 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!723 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!724 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!725 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!726 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !690, line: 152, baseType: !32, size: 32, elements: !727)
!727 = !{!728, !729}
!728 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!729 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!730 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !495, line: 71, baseType: !103, size: 32, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784}
!732 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!733 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!734 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!735 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!736 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!737 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!738 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!739 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!740 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!741 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!742 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!743 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!744 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!745 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!746 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!747 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!748 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!749 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!750 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!751 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!752 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!753 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!754 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!755 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!756 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!757 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!758 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!759 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!760 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!761 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!762 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!763 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!764 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!765 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!766 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!767 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!768 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!769 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!770 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!771 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!772 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!773 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!774 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!775 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!776 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!777 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!778 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!779 = !DIEnumerator(name: "USBD_IRQn", value: 39)
!780 = !DIEnumerator(name: "UARTE1_IRQn", value: 40)
!781 = !DIEnumerator(name: "QSPI_IRQn", value: 41)
!782 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 42)
!783 = !DIEnumerator(name: "PWM3_IRQn", value: 45)
!784 = !DIEnumerator(name: "SPIM3_IRQn", value: 47)
!785 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !786, line: 44, baseType: !32, size: 32, elements: !787)
!786 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!787 = !{!788, !789, !790, !791}
!788 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!789 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!790 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!791 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!792 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !793, line: 54, baseType: !32, size: 32, elements: !794)
!793 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810}
!795 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!796 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!797 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!798 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!799 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!800 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!801 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!802 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!803 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!804 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!805 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!806 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!807 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!808 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!809 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!810 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!811 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !812, line: 53, baseType: !32, size: 32, elements: !813)
!812 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!813 = !{!814, !815, !816, !817, !818, !819}
!814 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!815 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!816 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!817 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!818 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!819 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!820 = !{!678, !102, !103, !821, !870, !871, !872, !873, !126, !148, !149, !874, !573, !875, !209, !876, !906, !196}
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !495, line: 1022, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !495, line: 979, size: 11712, elements: !824)
!824 = !{!825, !826, !827, !828, !829, !830, !831, !832, !836, !837, !838, !839, !840, !841, !842, !843, !844, !848, !849, !850, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !823, file: !495, line: 980, baseType: !426, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !823, file: !495, line: 981, baseType: !426, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !823, file: !495, line: 982, baseType: !426, size: 32, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !823, file: !495, line: 983, baseType: !426, size: 32, offset: 96)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !823, file: !495, line: 984, baseType: !426, size: 32, offset: 128)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !823, file: !495, line: 985, baseType: !426, size: 32, offset: 160)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !823, file: !495, line: 986, baseType: !426, size: 32, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !823, file: !495, line: 987, baseType: !833, size: 1824, offset: 224)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 1824, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 57)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !823, file: !495, line: 988, baseType: !426, size: 32, offset: 2048)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !823, file: !495, line: 989, baseType: !426, size: 32, offset: 2080)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !823, file: !495, line: 990, baseType: !425, size: 32, offset: 2112)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !823, file: !495, line: 991, baseType: !426, size: 32, offset: 2144)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !823, file: !495, line: 992, baseType: !426, size: 32, offset: 2176)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !823, file: !495, line: 993, baseType: !604, size: 160, offset: 2208)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTARTED", scope: !823, file: !495, line: 994, baseType: !426, size: 32, offset: 2368)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTOPPED", scope: !823, file: !495, line: 996, baseType: !426, size: 32, offset: 2400)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !823, file: !495, line: 998, baseType: !845, size: 3744, offset: 2432)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 3744, elements: !846)
!846 = !{!847}
!847 = !DISubrange(count: 117)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !823, file: !495, line: 999, baseType: !426, size: 32, offset: 6176)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !823, file: !495, line: 1000, baseType: !426, size: 32, offset: 6208)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !823, file: !495, line: 1001, baseType: !851, size: 2016, offset: 6240)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 2016, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 63)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !823, file: !495, line: 1002, baseType: !425, size: 32, offset: 8256)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !823, file: !495, line: 1004, baseType: !425, size: 32, offset: 8288)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !823, file: !495, line: 1005, baseType: !425, size: 32, offset: 8320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !823, file: !495, line: 1006, baseType: !425, size: 32, offset: 8352)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !823, file: !495, line: 1008, baseType: !425, size: 32, offset: 8384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !823, file: !495, line: 1009, baseType: !425, size: 32, offset: 8416)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !823, file: !495, line: 1011, baseType: !633, size: 1984, offset: 8448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !823, file: !495, line: 1012, baseType: !426, size: 32, offset: 10432)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !823, file: !495, line: 1013, baseType: !533, size: 96, offset: 10464)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "HFXODEBOUNCE", scope: !823, file: !495, line: 1014, baseType: !426, size: 32, offset: 10560)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !823, file: !495, line: 1016, baseType: !533, size: 96, offset: 10592)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !823, file: !495, line: 1017, baseType: !426, size: 32, offset: 10688)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !823, file: !495, line: 1018, baseType: !648, size: 256, offset: 10720)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !823, file: !495, line: 1019, baseType: !426, size: 32, offset: 10976)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !823, file: !495, line: 1020, baseType: !548, size: 672, offset: 11008)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "LFRCMODE", scope: !823, file: !495, line: 1021, baseType: !426, size: 32, offset: 11680)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !690, line: 146, baseType: !694)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !690, line: 164, baseType: !726)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!874 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !421, line: 426, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 411, size: 28704, elements: !879)
!879 = !{!880, !882, !886, !887, !888, !889, !890, !891, !892, !893, !897, !901, !905}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !878, file: !421, line: 413, baseType: !881, size: 256)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 256, elements: !649)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !878, file: !421, line: 414, baseType: !883, size: 768, offset: 256)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 768, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 24)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !878, file: !421, line: 415, baseType: !881, size: 256, offset: 1024)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !878, file: !421, line: 416, baseType: !883, size: 768, offset: 1280)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !878, file: !421, line: 417, baseType: !881, size: 256, offset: 2048)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !878, file: !421, line: 418, baseType: !883, size: 768, offset: 2304)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !878, file: !421, line: 419, baseType: !881, size: 256, offset: 3072)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !878, file: !421, line: 420, baseType: !883, size: 768, offset: 3328)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !878, file: !421, line: 421, baseType: !881, size: 256, offset: 4096)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !878, file: !421, line: 422, baseType: !894, size: 1792, offset: 4352)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 1792, elements: !895)
!895 = !{!896}
!896 = !DISubrange(count: 56)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !878, file: !421, line: 423, baseType: !898, size: 1920, offset: 6144)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 1920, elements: !899)
!899 = !{!900}
!900 = !DISubrange(count: 240)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !878, file: !421, line: 424, baseType: !902, size: 20608, offset: 8064)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 20608, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 644)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !878, file: !421, line: 425, baseType: !426, size: 32, offset: 28672)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !786, line: 56, baseType: !102)
!907 = !{!908, !958, !999, !673, !1005, !1031, !1033, !1050, !1052, !1062, !1065, !1080, !1118, !1132}
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "on", scope: !910, file: !911, line: 549, type: !184, isLocal: true, isDefinition: true)
!910 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !911, file: !911, line: 547, type: !912, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !675, retainedNodes: !914)
!911 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!912 = !DISubroutineType(types: !913)
!913 = !{null, !684}
!914 = !{!915, !916, !919}
!915 = !DILocalVariable(name: "start_mode", arg: 1, scope: !910, file: !911, line: 547, type: !684)
!916 = !DILocalVariable(name: "err", scope: !917, file: !911, line: 553, type: !103)
!917 = distinct !DILexicalBlock(scope: !918, file: !911, line: 552, column: 31)
!918 = distinct !DILexicalBlock(scope: !910, file: !911, line: 552, column: 6)
!919 = !DILocalVariable(name: "mgr", scope: !917, file: !911, line: 554, type: !920)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 32)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !922, line: 154, size: 224, elements: !923)
!922 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!923 = !{!924, !936, !937, !953, !955, !956, !957}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !921, file: !922, line: 158, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !927)
!927 = !{!928, !935}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !926, file: !136, line: 36, baseType: !929, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !932)
!932 = !{!933}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !931, file: !136, line: 30, baseType: !934, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !926, file: !136, line: 37, baseType: !929, size: 32, offset: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !921, file: !922, line: 163, baseType: !925, size: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !921, file: !922, line: 166, baseType: !938, size: 32, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !940)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !922, line: 133, size: 96, elements: !941)
!941 = !{!942, !951, !952}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !940, file: !922, line: 135, baseType: !943, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !922, line: 129, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = !DISubroutineType(types: !946)
!946 = !{null, !920, !947}
!947 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !922, line: 101, baseType: !948)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 32)
!949 = !DISubroutineType(types: !950)
!950 = !{null, !920, !103}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !940, file: !922, line: 138, baseType: !943, size: 32, offset: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !940, file: !922, line: 143, baseType: !943, size: 32, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !921, file: !922, line: 169, baseType: !954, offset: 160)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, elements: !157)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !921, file: !922, line: 172, baseType: !103, size: 32, offset: 160)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !921, file: !922, line: 175, baseType: !338, size: 16, offset: 192)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !921, file: !922, line: 178, baseType: !338, size: 16, offset: 208)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "cli", scope: !910, file: !911, line: 550, type: !960, isLocal: true, isDefinition: true)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !922, line: 273, size: 128, elements: !961)
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !960, file: !922, line: 280, baseType: !930, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !960, file: !922, line: 283, baseType: !964, size: 96, offset: 32)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !965, line: 138, size: 96, elements: !966)
!965 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!966 = !{!967, !996, !997}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !964, file: !965, line: 149, baseType: !968, size: 32)
!968 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !965, line: 139, size: 32, elements: !969)
!969 = !{!970, !991}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !968, file: !965, line: 145, baseType: !971, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 32)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !378, line: 5397, size: 128, elements: !973)
!973 = !{!974, !989, !990}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !972, file: !378, line: 5399, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !294, line: 48, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !294, line: 37, size: 64, elements: !977)
!977 = !{!978, !984}
!978 = !DIDerivedType(tag: DW_TAG_member, scope: !976, file: !294, line: 38, baseType: !979, size: 32)
!979 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !976, file: !294, line: 38, size: 32, elements: !980)
!980 = !{!981, !983}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !979, file: !294, line: 39, baseType: !982, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !979, file: !294, line: 40, baseType: !982, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_member, scope: !976, file: !294, line: 42, baseType: !985, size: 32, offset: 32)
!985 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !976, file: !294, line: 42, size: 32, elements: !986)
!986 = !{!987, !988}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !985, file: !294, line: 43, baseType: !982, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !985, file: !294, line: 44, baseType: !982, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !972, file: !378, line: 5405, baseType: !32, size: 32, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !972, file: !378, line: 5408, baseType: !103, size: 32, offset: 96)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !968, file: !965, line: 148, baseType: !992, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !965, line: 98, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!994 = !DISubroutineType(types: !995)
!995 = !{null, null}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !964, file: !965, line: 165, baseType: !426, size: 32, offset: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !964, file: !965, line: 174, baseType: !998, size: 32, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_38", scope: !675, file: !911, line: 733, type: !1001, isLocal: false, isDefinition: true, align: 16)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1002, size: 80, elements: !605)
!1002 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !1004, line: 43, baseType: !194)
!1004 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_38", scope: !675, file: !911, line: 733, type: !1007, isLocal: true, isDefinition: true, align: 32)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !663, line: 51, size: 64, elements: !1009)
!1009 = !{!1010, !1030}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1008, file: !663, line: 60, baseType: !1011, size: 32)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 32)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!103, !1014}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 32)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !1004, line: 378, size: 192, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1027, !1028}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1016, file: !1004, line: 380, baseType: !444, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1016, file: !1004, line: 382, baseType: !13, size: 32, offset: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1016, file: !1004, line: 384, baseType: !13, size: 32, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1016, file: !1004, line: 386, baseType: !1022, size: 32, offset: 96)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 32)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !1004, line: 351, size: 16, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1023, file: !1004, line: 359, baseType: !167, size: 8)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1023, file: !1004, line: 364, baseType: !874, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1016, file: !1004, line: 388, baseType: !102, size: 32, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1016, file: !1004, line: 396, baseType: !1029, size: 32, offset: 160)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1008, file: !663, line: 65, baseType: !1014, size: 32, offset: 32)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !675, file: !911, line: 79, type: !184, isLocal: true, isDefinition: true)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(name: "data", scope: !675, file: !911, line: 702, type: !1035, isLocal: true, isDefinition: true)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !911, line: 69, size: 640, elements: !1036)
!1036 = !{!1037, !1039}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !1035, file: !911, line: 70, baseType: !1038, size: 448)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !921, size: 448, elements: !315)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !1035, file: !911, line: 71, baseType: !1040, size: 192, offset: 448)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1041, size: 192, elements: !315)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !911, line: 52, size: 96, elements: !1042)
!1042 = !{!1043, !1048, !1049}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !1041, file: !911, line: 53, baseType: !1044, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !786, line: 72, baseType: !1045)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 32)
