; ModuleID = 'build/adafruit_feather_m0_basic_proto/subsys/zbus/hello_world/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_mutex = type { %struct._wait_q_t, %struct.k_thread*, i32, i32 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %struct._wait_q_t, i32, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %struct._wait_q_t, %struct._wait_q_t*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %struct._wait_q_t, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.z_heap_bucket] }
%struct.z_heap_bucket = type { i32 }
%struct.k_spinlock = type {}
%struct._thread_arch = type { i32, i32 }
%struct.version_msg = type { i8, i8, i16 }
%struct.zbus_observer = type { i8*, i8, %struct.k_msgq*, void (%struct.zbus_channel*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/hello_world/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/hello_world")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/hello_world")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_zbus_mutex_version_chan", scope: !27, file: !114, line: 25, type: !141, isLocal: true, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !111, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/zbus/hello_world/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/hello_world")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !106, !107, !108, !109}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !103, line: 46, baseType: !104)
!103 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !105)
!105 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !110)
!110 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!111 = !{!25, !112, !289, !291, !293, !295, !297, !299, !301, !303, !334, !338, !343, !348, !350, !352, !359, !364, !371, !376, !378}
!112 = !DIGlobalVariableExpression(var: !113, expr: !DIExpression())
!113 = distinct !DIGlobalVariable(name: "version_chan", scope: !27, file: !114, line: 25, type: !115, isLocal: false, isDefinition: true, align: 32)
!114 = !DIFile(filename: "zephyr/samples/subsys/zbus/hello_world/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !116)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_channel", file: !117, line: 29, size: 224, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/zbus/zbus.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !124, !128, !130, !131, !139, !258}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !116, file: !117, line: 32, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "message_size", scope: !116, file: !117, line: 35, baseType: !125, size: 16, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !127)
!127 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !116, file: !117, line: 40, baseType: !129, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !106)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !116, file: !117, line: 45, baseType: !129, size: 32, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "validator", scope: !116, file: !117, line: 51, baseType: !132, size: 32, offset: 128)
!132 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !13, !137}
!136 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !138, line: 214, baseType: !32)
!138 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mutex", scope: !116, file: !117, line: 56, baseType: !140, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_mutex", file: !142, line: 2720, size: 160, elements: !143)
!142 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !{!144, !165, !256, !257}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !141, file: !142, line: 2722, baseType: !145, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !146, line: 233, baseType: !147)
!146 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !146, line: 231, size: 64, elements: !148)
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !147, file: !146, line: 232, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !151, line: 48, baseType: !152)
!151 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !151, line: 37, size: 64, elements: !153)
!153 = !{!154, !160}
!154 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !151, line: 38, baseType: !155, size: 32)
!155 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !151, line: 38, size: 32, elements: !156)
!156 = !{!157, !159}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !155, file: !151, line: 39, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !155, file: !151, line: 40, baseType: !158, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !151, line: 42, baseType: !161, size: 32, offset: 32)
!161 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !152, file: !151, line: 42, size: 32, elements: !162)
!162 = !{!163, !164}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !161, file: !151, line: 43, baseType: !158, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !161, file: !151, line: 44, baseType: !158, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !141, file: !142, line: 2724, baseType: !166, size: 32, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !168, line: 245, size: 896, elements: !169)
!168 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!169 = !{!170, !217, !230, !231, !232, !233, !251}
!170 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !167, file: !168, line: 247, baseType: !171, size: 384)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !168, line: 57, size: 384, elements: !172)
!172 = !{!173, !187, !189, !192, !193, !204, !205, !206}
!173 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !168, line: 60, baseType: !174, size: 64)
!174 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !168, line: 60, size: 64, elements: !175)
!175 = !{!176, !178}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !174, file: !168, line: 61, baseType: !177, size: 64)
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !151, line: 49, baseType: !152)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !174, file: !168, line: 62, baseType: !179, size: 64)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !180, line: 49, size: 64, elements: !181)
!180 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = !{!182}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !179, file: !180, line: 50, baseType: !183, size: 64)
!183 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, elements: !185)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!185 = !{!186}
!186 = !DISubrange(count: 2)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !171, file: !168, line: 68, baseType: !188, size: 32, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !171, file: !168, line: 71, baseType: !190, size: 8, offset: 96)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !191)
!191 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !171, file: !168, line: 74, baseType: !190, size: 8, offset: 104)
!193 = !DIDerivedType(tag: DW_TAG_member, scope: !171, file: !168, line: 90, baseType: !194, size: 16, offset: 112)
!194 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !171, file: !168, line: 90, size: 16, elements: !195)
!195 = !{!196, !203}
!196 = !DIDerivedType(tag: DW_TAG_member, scope: !194, file: !168, line: 91, baseType: !197, size: 16)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !194, file: !168, line: 91, size: 16, elements: !198)
!198 = !{!199, !202}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !197, file: !168, line: 96, baseType: !200, size: 8)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !201)
!201 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !197, file: !168, line: 97, baseType: !190, size: 8, offset: 8)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !194, file: !168, line: 100, baseType: !126, size: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !171, file: !168, line: 107, baseType: !108, size: 32, offset: 128)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !171, file: !168, line: 127, baseType: !106, size: 32, offset: 160)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !171, file: !168, line: 131, baseType: !207, size: 192, offset: 192)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !146, line: 244, size: 192, elements: !208)
!208 = !{!209, !210, !216}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !207, file: !146, line: 245, baseType: !177, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !207, file: !146, line: 246, baseType: !211, size: 32, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !146, line: 242, baseType: !212)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = !DISubroutineType(types: !214)
!214 = !{null, !215}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !207, file: !146, line: 249, baseType: !104, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !167, file: !168, line: 250, baseType: !218, size: 288, offset: 384)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !219, line: 25, size: 288, elements: !220)
!219 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!220 = !{!221, !222, !223, !224, !225, !226, !227, !228, !229}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !218, file: !219, line: 26, baseType: !108, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !218, file: !219, line: 27, baseType: !108, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !218, file: !219, line: 28, baseType: !108, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !218, file: !219, line: 29, baseType: !108, size: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !218, file: !219, line: 30, baseType: !108, size: 32, offset: 128)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !218, file: !219, line: 31, baseType: !108, size: 32, offset: 160)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !218, file: !219, line: 32, baseType: !108, size: 32, offset: 192)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !218, file: !219, line: 33, baseType: !108, size: 32, offset: 224)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !218, file: !219, line: 34, baseType: !108, size: 32, offset: 256)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !167, file: !168, line: 253, baseType: !106, size: 32, offset: 672)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !167, file: !168, line: 256, baseType: !145, size: 64, offset: 704)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !167, file: !168, line: 294, baseType: !107, size: 32, offset: 768)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !167, file: !168, line: 325, baseType: !234, size: 32, offset: 800)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !142, line: 5073, size: 160, elements: !236)
!236 = !{!237, !246, !247}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !235, file: !142, line: 5074, baseType: !238, size: 96)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !239, line: 56, size: 96, elements: !240)
!239 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!240 = !{!241, !244, !245}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !238, file: !239, line: 57, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !239, line: 57, flags: DIFlagFwdDecl)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !238, file: !239, line: 58, baseType: !106, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !238, file: !239, line: 59, baseType: !137, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !235, file: !142, line: 5075, baseType: !145, size: 64, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !235, file: !142, line: 5076, baseType: !248, offset: 160)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!249 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!250 = !{}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !167, file: !168, line: 343, baseType: !252, size: 64, offset: 832)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !219, line: 60, size: 64, elements: !253)
!253 = !{!254, !255}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !252, file: !219, line: 63, baseType: !108, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !252, file: !219, line: 66, baseType: !108, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "lock_count", scope: !141, file: !142, line: 2727, baseType: !108, size: 32, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "owner_orig_prio", scope: !141, file: !142, line: 2730, baseType: !107, size: 32, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "observers", scope: !116, file: !117, line: 67, baseType: !259, size: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !263)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "zbus_observer", file: !117, line: 85, size: 128, elements: !264)
!264 = !{!265, !266, !267, !283}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !263, file: !117, line: 88, baseType: !120, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !263, file: !117, line: 91, baseType: !136, size: 8, offset: 32)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !263, file: !117, line: 93, baseType: !268, size: 32, offset: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !142, line: 4204, size: 320, elements: !271)
!271 = !{!272, !273, !274, !275, !276, !278, !279, !280, !281, !282}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !270, file: !142, line: 4206, baseType: !145, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !270, file: !142, line: 4208, baseType: !248, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !270, file: !142, line: 4210, baseType: !137, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !270, file: !142, line: 4212, baseType: !108, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !270, file: !142, line: 4214, baseType: !277, size: 32, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !270, file: !142, line: 4216, baseType: !277, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !270, file: !142, line: 4218, baseType: !277, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !270, file: !142, line: 4220, baseType: !277, size: 32, offset: 224)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !270, file: !142, line: 4222, baseType: !108, size: 32, offset: 256)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !270, file: !142, line: 4227, baseType: !190, size: 8, offset: 288)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !263, file: !117, line: 96, baseType: !284, size: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !288}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!289 = !DIGlobalVariableExpression(var: !290, expr: !DIExpression())
!290 = distinct !DIGlobalVariable(name: "_zbus_mutex_acc_data_chan", scope: !27, file: !114, line: 35, type: !141, isLocal: true, isDefinition: true, align: 32)
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "acc_data_chan", scope: !27, file: !114, line: 35, type: !115, isLocal: false, isDefinition: true, align: 32)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "_zbus_mutex_simple_chan", scope: !27, file: !114, line: 57, type: !141, isLocal: true, isDefinition: true, align: 32)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "simple_chan", scope: !27, file: !114, line: 57, type: !115, isLocal: false, isDefinition: true, align: 32)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "foo_lis", scope: !27, file: !114, line: 73, type: !263, isLocal: false, isDefinition: true, align: 32)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "_zbus_observer_queue_bar_sub", scope: !27, file: !114, line: 75, type: !270, isLocal: false, isDefinition: true, align: 32)
!301 = !DIGlobalVariableExpression(var: !302, expr: !DIExpression())
!302 = distinct !DIGlobalVariable(name: "bar_sub", scope: !27, file: !114, line: 75, type: !263, isLocal: false, isDefinition: true, align: 32)
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "_k_thread_data_subscriber_task_id", scope: !27, file: !114, line: 92, type: !305, isLocal: false, isDefinition: true, align: 32)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !142, line: 620, size: 384, elements: !306)
!306 = !{!307, !308, !316, !317, !322, !323, !324, !325, !326, !327, !329, !333}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !305, file: !142, line: 621, baseType: !166, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !305, file: !142, line: 622, baseType: !309, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !311, line: 44, baseType: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !313, line: 47, size: 8, elements: !314)
!313 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !312, file: !313, line: 48, baseType: !123, size: 8)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !305, file: !142, line: 623, baseType: !32, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !305, file: !142, line: 624, baseType: !318, size: 32, offset: 96)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !311, line: 46, baseType: !319)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !106, !106, !106}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !305, file: !142, line: 625, baseType: !106, size: 32, offset: 128)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !305, file: !142, line: 626, baseType: !106, size: 32, offset: 160)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !305, file: !142, line: 627, baseType: !106, size: 32, offset: 192)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !305, file: !142, line: 628, baseType: !107, size: 32, offset: 224)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !305, file: !142, line: 629, baseType: !108, size: 32, offset: 256)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !305, file: !142, line: 630, baseType: !328, size: 32, offset: 288)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !305, file: !142, line: 631, baseType: !330, size: 32, offset: 320)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!331 = !DISubroutineType(types: !332)
!332 = !{null}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !305, file: !142, line: 632, baseType: !121, size: 32, offset: 352)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "subscriber_task_id", scope: !27, file: !114, line: 92, type: !336, isLocal: false, isDefinition: true)
!336 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !337)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !168, line: 347, baseType: !166)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "_k_fifo_buf__zbus_observer_queue_bar_sub", scope: !27, file: !114, line: 75, type: !340, isLocal: true, isDefinition: true, align: 32)
!340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !123, size: 128, elements: !341)
!341 = !{!342}
!342 = !DISubrange(count: 16)
!343 = !DIGlobalVariableExpression(var: !344, expr: !DIExpression())
!344 = distinct !DIGlobalVariable(name: "_k_thread_stack_subscriber_task_id", scope: !27, file: !114, line: 92, type: !345, isLocal: false, isDefinition: true, align: 64)
!345 = !DICompositeType(tag: DW_TAG_array_type, baseType: !312, size: 4096, elements: !346)
!346 = !{!347}
!347 = !DISubrange(count: 512)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "_k_thread_obj_subscriber_task_id", scope: !27, file: !114, line: 92, type: !167, isLocal: false, isDefinition: true)
!350 = !DIGlobalVariableExpression(var: !351, expr: !DIExpression())
!351 = distinct !DIGlobalVariable(name: "count", scope: !27, file: !114, line: 95, type: !107, isLocal: true, isDefinition: true)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "_zbus_message_version_chan", scope: !27, file: !114, line: 25, type: !354, isLocal: true, isDefinition: true)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "version_msg", file: !114, line: 13, size: 32, elements: !355)
!355 = !{!356, !357, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "major", scope: !354, file: !114, line: 14, baseType: !190, size: 8)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "minor", scope: !354, file: !114, line: 15, baseType: !190, size: 8, offset: 8)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "build", scope: !354, file: !114, line: 16, baseType: !126, size: 16, offset: 16)
!359 = !DIGlobalVariableExpression(var: !360, expr: !DIExpression())
!360 = distinct !DIGlobalVariable(name: "_zbus_observers_version_chan", scope: !27, file: !114, line: 25, type: !361, isLocal: true, isDefinition: true)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 32, elements: !362)
!362 = !{!363}
!363 = !DISubrange(count: 1)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "_zbus_message_acc_data_chan", scope: !27, file: !114, line: 35, type: !366, isLocal: true, isDefinition: true)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "acc_msg", file: !114, line: 19, size: 96, elements: !367)
!367 = !{!368, !369, !370}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !366, file: !114, line: 20, baseType: !107, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !366, file: !114, line: 21, baseType: !107, size: 32, offset: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !366, file: !114, line: 22, baseType: !107, size: 32, offset: 64)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "_zbus_observers_acc_data_chan", scope: !27, file: !114, line: 35, type: !373, isLocal: true, isDefinition: true)
!373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 96, elements: !374)
!374 = !{!375}
!375 = !DISubrange(count: 3)
!376 = !DIGlobalVariableExpression(var: !377, expr: !DIExpression())
!377 = distinct !DIGlobalVariable(name: "_zbus_message_simple_chan", scope: !27, file: !114, line: 57, type: !107, isLocal: true, isDefinition: true)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "_zbus_observers_simple_chan", scope: !27, file: !114, line: 57, type: !361, isLocal: true, isDefinition: true)
!380 = !DIGlobalVariableExpression(var: !381, expr: !DIExpression())
!381 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !382, file: !397, line: 18, type: !398, isLocal: false, isDefinition: true)
!382 = distinct !DICompileUnit(language: DW_LANG_C99, file: !383, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !384, globals: !396, splitDebugInlining: false, nameTableKind: None)
!383 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/hello_world")
!384 = !{!22, !106, !24, !385, !387, !389, !137, !107, !390, !391, !393, !394, !277, !395, !126, !121}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!388 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!392 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!396 = !{!380}
!397 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!398 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !400, line: 16, size: 64, elements: !401)
!400 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!401 = !{!402, !403}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !399, file: !400, line: 17, baseType: !121, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !399, file: !400, line: 18, baseType: !190, size: 8, offset: 32)
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "_char_out", scope: !406, file: !410, line: 54, type: !411, isLocal: false, isDefinition: true)
!406 = distinct !DICompileUnit(language: DW_LANG_C99, file: !407, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !408, globals: !409, splitDebugInlining: false, nameTableKind: None)
!407 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/hello_world")
!408 = !{!106, !107}
!409 = !{!404}
!410 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = !DISubroutineType(types: !413)
!413 = !{!107, !107}
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !416, file: !1144, line: 202, type: !1145, isLocal: true, isDefinition: true, align: 32)
!416 = distinct !DICompileUnit(language: DW_LANG_C99, file: !417, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !418, globals: !1143, splitDebugInlining: false, nameTableKind: None)
!417 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_basic_proto/subsys/zbus/hello_world")
!418 = !{!106, !107, !419, !539, !878, !879, !946}
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !421, line: 335, baseType: !422)
!421 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 320, size: 288, elements: !423)
!423 = !{!424, !435, !441, !455, !466, !477, !479, !490, !491, !502, !503, !518, !519, !529}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !422, file: !421, line: 321, baseType: !425, size: 16)
!425 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !426)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !421, line: 50, baseType: !427)
!427 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !421, line: 43, size: 16, elements: !428)
!428 = !{!429, !434}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !427, file: !421, line: 48, baseType: !430, size: 16)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !427, file: !421, line: 44, size: 16, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !430, file: !421, line: 45, baseType: !126, size: 7, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !430, file: !421, line: 47, baseType: !126, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !427, file: !421, line: 49, baseType: !126, size: 16)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !422, file: !421, line: 322, baseType: !436, size: 16, offset: 16)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 16, elements: !185)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !438, line: 52, baseType: !439)
!438 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!439 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !190)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !422, file: !421, line: 323, baseType: !442, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !443)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !421, line: 107, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !421, line: 94, size: 32, elements: !445)
!445 = !{!446, !454}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !444, file: !421, line: 105, baseType: !447, size: 32)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !444, file: !421, line: 95, size: 32, elements: !448)
!448 = !{!449, !450, !451, !452, !453}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !447, file: !421, line: 97, baseType: !108, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !447, file: !421, line: 99, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !447, file: !421, line: 100, baseType: !108, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !447, file: !421, line: 102, baseType: !108, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !447, file: !421, line: 103, baseType: !108, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !444, file: !421, line: 106, baseType: !108, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !422, file: !421, line: 324, baseType: !456, size: 32, offset: 64)
!456 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !421, line: 155, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !421, line: 148, size: 32, elements: !459)
!459 = !{!460, !465}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !458, file: !421, line: 153, baseType: !461, size: 32)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !458, file: !421, line: 149, size: 32, elements: !462)
!462 = !{!463, !464}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !461, file: !421, line: 150, baseType: !108, size: 16, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !461, file: !421, line: 151, baseType: !108, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !458, file: !421, line: 154, baseType: !108, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !422, file: !421, line: 325, baseType: !467, size: 8, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !468)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !421, line: 194, baseType: !469)
!469 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !421, line: 187, size: 8, elements: !470)
!470 = !{!471, !476}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !469, file: !421, line: 192, baseType: !472, size: 8)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !469, file: !421, line: 188, size: 8, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !472, file: !421, line: 189, baseType: !190, size: 1, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !472, file: !421, line: 190, baseType: !190, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !469, file: !421, line: 193, baseType: !190, size: 8)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !422, file: !421, line: 326, baseType: !478, size: 24, offset: 104)
!478 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 24, elements: !374)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !422, file: !421, line: 327, baseType: !480, size: 8, offset: 128)
!480 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !421, line: 215, baseType: !482)
!482 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !421, line: 208, size: 8, elements: !483)
!483 = !{!484, !489}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !482, file: !421, line: 213, baseType: !485, size: 8)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !482, file: !421, line: 209, size: 8, elements: !486)
!486 = !{!487, !488}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !485, file: !421, line: 210, baseType: !190, size: 1, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !485, file: !421, line: 211, baseType: !190, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !482, file: !421, line: 214, baseType: !190, size: 8)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !422, file: !421, line: 328, baseType: !478, size: 24, offset: 136)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !422, file: !421, line: 329, baseType: !492, size: 8, offset: 160)
!492 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !421, line: 236, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !421, line: 229, size: 8, elements: !495)
!495 = !{!496, !501}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !494, file: !421, line: 234, baseType: !497, size: 8)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !494, file: !421, line: 230, size: 8, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !497, file: !421, line: 231, baseType: !439, size: 1, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !497, file: !421, line: 232, baseType: !439, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !494, file: !421, line: 235, baseType: !190, size: 8)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !422, file: !421, line: 330, baseType: !478, size: 24, offset: 168)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !422, file: !421, line: 331, baseType: !504, size: 16, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !505)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !421, line: 262, baseType: !506)
!506 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !421, line: 250, size: 16, elements: !507)
!507 = !{!508, !517}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !506, file: !421, line: 260, baseType: !509, size: 16)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !506, file: !421, line: 251, size: 16, elements: !510)
!510 = !{!511, !512, !513, !514, !515, !516}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !509, file: !421, line: 252, baseType: !126, size: 1, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !509, file: !421, line: 253, baseType: !126, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !509, file: !421, line: 254, baseType: !126, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !509, file: !421, line: 255, baseType: !126, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !509, file: !421, line: 256, baseType: !126, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !509, file: !421, line: 258, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !506, file: !421, line: 261, baseType: !126, size: 16)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !422, file: !421, line: 332, baseType: !436, size: 16, offset: 208)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !422, file: !421, line: 333, baseType: !520, size: 32, offset: 224)
!520 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !421, line: 290, baseType: !522)
!522 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !421, line: 284, size: 32, elements: !523)
!523 = !{!524, !528}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !522, file: !421, line: 288, baseType: !525, size: 32)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !522, file: !421, line: 285, size: 32, elements: !526)
!526 = !{!527}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !525, file: !421, line: 286, baseType: !108, size: 22, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !522, file: !421, line: 289, baseType: !108, size: 32)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !422, file: !421, line: 334, baseType: !530, size: 16, offset: 256)
!530 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !531)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !421, line: 308, baseType: !532)
!532 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !421, line: 303, size: 16, elements: !533)
!533 = !{!534, !538}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !532, file: !421, line: 306, baseType: !535, size: 16)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !532, file: !421, line: 304, size: 16, elements: !536)
!536 = !{!537}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !535, file: !421, line: 305, baseType: !126, size: 16, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !532, file: !421, line: 307, baseType: !126, size: 16)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !541, line: 928, baseType: !542)
!541 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !541, line: 899, size: 672, elements: !543)
!543 = !{!544, !568, !592, !618, !643, !659, !660, !678, !679, !696, !707, !708, !723, !743, !744, !756, !768, !778, !779, !796, !800, !811, !812, !824, !836, !837, !848, !864}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !542, file: !541, line: 900, baseType: !545, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !541, line: 64, baseType: !547)
!547 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 43, size: 32, elements: !548)
!548 = !{!549, !567}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !547, file: !541, line: 62, baseType: !550, size: 32)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !547, file: !541, line: 44, size: 32, elements: !551)
!551 = !{!552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !550, file: !541, line: 45, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !550, file: !541, line: 46, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !550, file: !541, line: 47, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !550, file: !541, line: 48, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !550, file: !541, line: 49, baseType: !108, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !550, file: !541, line: 50, baseType: !108, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !550, file: !541, line: 51, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !550, file: !541, line: 52, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !550, file: !541, line: 53, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !550, file: !541, line: 54, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !550, file: !541, line: 55, baseType: !108, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !550, file: !541, line: 56, baseType: !108, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !550, file: !541, line: 58, baseType: !108, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !550, file: !541, line: 59, baseType: !108, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !550, file: !541, line: 60, baseType: !108, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !547, file: !541, line: 63, baseType: !108, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !542, file: !541, line: 901, baseType: !569, size: 32, offset: 32)
!569 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !570)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !541, line: 125, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 104, size: 32, elements: !572)
!572 = !{!573, !591}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !571, file: !541, line: 123, baseType: !574, size: 32)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !571, file: !541, line: 105, size: 32, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !574, file: !541, line: 106, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !574, file: !541, line: 107, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !574, file: !541, line: 108, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !574, file: !541, line: 109, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !574, file: !541, line: 110, baseType: !108, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !574, file: !541, line: 111, baseType: !108, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !574, file: !541, line: 112, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !574, file: !541, line: 113, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !574, file: !541, line: 114, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !574, file: !541, line: 115, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !574, file: !541, line: 116, baseType: !108, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !574, file: !541, line: 117, baseType: !108, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !574, file: !541, line: 119, baseType: !108, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !574, file: !541, line: 120, baseType: !108, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !574, file: !541, line: 121, baseType: !108, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !571, file: !541, line: 124, baseType: !108, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !542, file: !541, line: 902, baseType: !593, size: 32, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !594)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !541, line: 186, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 165, size: 32, elements: !596)
!596 = !{!597, !617}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !595, file: !541, line: 184, baseType: !598, size: 32)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !595, file: !541, line: 166, size: 32, elements: !599)
!599 = !{!600, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !598, file: !541, line: 167, baseType: !601, size: 1, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !108)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !598, file: !541, line: 168, baseType: !601, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !598, file: !541, line: 169, baseType: !601, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !598, file: !541, line: 170, baseType: !601, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !598, file: !541, line: 171, baseType: !601, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !598, file: !541, line: 172, baseType: !601, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !598, file: !541, line: 173, baseType: !601, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !598, file: !541, line: 174, baseType: !601, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !598, file: !541, line: 175, baseType: !601, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !598, file: !541, line: 176, baseType: !601, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !598, file: !541, line: 177, baseType: !601, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !598, file: !541, line: 178, baseType: !601, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !598, file: !541, line: 180, baseType: !601, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !598, file: !541, line: 181, baseType: !601, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !598, file: !541, line: 182, baseType: !601, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !595, file: !541, line: 185, baseType: !108, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !542, file: !541, line: 903, baseType: !619, size: 32, offset: 96)
!619 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !621)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !541, line: 247, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 226, size: 32, elements: !623)
!623 = !{!624, !642}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !622, file: !541, line: 245, baseType: !625, size: 32)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !622, file: !541, line: 227, size: 32, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !625, file: !541, line: 228, baseType: !108, size: 1, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !625, file: !541, line: 229, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !625, file: !541, line: 230, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !625, file: !541, line: 231, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !625, file: !541, line: 232, baseType: !108, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !625, file: !541, line: 233, baseType: !108, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !625, file: !541, line: 234, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !625, file: !541, line: 235, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !625, file: !541, line: 236, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !625, file: !541, line: 237, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !625, file: !541, line: 238, baseType: !108, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !625, file: !541, line: 239, baseType: !108, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !625, file: !541, line: 241, baseType: !108, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !625, file: !541, line: 242, baseType: !108, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !625, file: !541, line: 243, baseType: !108, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !622, file: !541, line: 246, baseType: !108, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !542, file: !541, line: 904, baseType: !644, size: 16, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !541, line: 300, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 287, size: 16, elements: !647)
!647 = !{!648, !658}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !646, file: !541, line: 298, baseType: !649, size: 16)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !646, file: !541, line: 288, size: 16, elements: !650)
!650 = !{!651, !652, !653, !654, !655, !656, !657}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !649, file: !541, line: 290, baseType: !126, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !649, file: !541, line: 291, baseType: !126, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !649, file: !541, line: 293, baseType: !126, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !649, file: !541, line: 294, baseType: !126, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !649, file: !541, line: 295, baseType: !126, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !649, file: !541, line: 296, baseType: !126, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !649, file: !541, line: 297, baseType: !126, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !646, file: !541, line: 299, baseType: !126, size: 16)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !542, file: !541, line: 905, baseType: !436, size: 16, offset: 144)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !542, file: !541, line: 906, baseType: !661, size: 16, offset: 160)
!661 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !541, line: 352, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 336, size: 16, elements: !664)
!664 = !{!665, !677}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !663, file: !541, line: 350, baseType: !666, size: 16)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !663, file: !541, line: 337, size: 16, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !673, !674, !675, !676}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !666, file: !541, line: 339, baseType: !126, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !666, file: !541, line: 340, baseType: !126, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !666, file: !541, line: 341, baseType: !126, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !666, file: !541, line: 342, baseType: !126, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !666, file: !541, line: 343, baseType: !126, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !666, file: !541, line: 344, baseType: !126, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !666, file: !541, line: 345, baseType: !126, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !666, file: !541, line: 346, baseType: !126, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !666, file: !541, line: 348, baseType: !126, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !663, file: !541, line: 351, baseType: !126, size: 16)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !542, file: !541, line: 907, baseType: !436, size: 16, offset: 176)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !542, file: !541, line: 908, baseType: !680, size: 32, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !541, line: 398, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 381, size: 32, elements: !683)
!683 = !{!684, !695}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !682, file: !541, line: 396, baseType: !685, size: 32)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !682, file: !541, line: 382, size: 32, elements: !686)
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !685, file: !541, line: 384, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !685, file: !541, line: 385, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !685, file: !541, line: 386, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !685, file: !541, line: 388, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !685, file: !541, line: 389, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !685, file: !541, line: 390, baseType: !108, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !685, file: !541, line: 392, baseType: !108, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !685, file: !541, line: 394, baseType: !108, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !682, file: !541, line: 397, baseType: !108, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !542, file: !541, line: 909, baseType: !697, size: 8, offset: 224)
!697 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !541, line: 433, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 426, size: 8, elements: !700)
!700 = !{!701, !706}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !699, file: !541, line: 431, baseType: !702, size: 8)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !699, file: !541, line: 427, size: 8, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !702, file: !541, line: 428, baseType: !190, size: 5, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !702, file: !541, line: 430, baseType: !190, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !699, file: !541, line: 432, baseType: !190, size: 8)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !542, file: !541, line: 910, baseType: !478, size: 24, offset: 232)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !542, file: !541, line: 911, baseType: !709, size: 32, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !541, line: 462, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 448, size: 32, elements: !712)
!712 = !{!713, !722}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !711, file: !541, line: 460, baseType: !714, size: 32)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !711, file: !541, line: 449, size: 32, elements: !715)
!715 = !{!716, !717, !718, !719, !720, !721}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !714, file: !541, line: 451, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !714, file: !541, line: 453, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !714, file: !541, line: 454, baseType: !108, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !714, file: !541, line: 455, baseType: !108, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !714, file: !541, line: 457, baseType: !108, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !714, file: !541, line: 459, baseType: !108, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !711, file: !541, line: 461, baseType: !108, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !542, file: !541, line: 912, baseType: !724, size: 16, offset: 288)
!724 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !725)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !541, line: 520, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 503, size: 16, elements: !727)
!727 = !{!728, !742}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !726, file: !541, line: 518, baseType: !729, size: 16)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !726, file: !541, line: 504, size: 16, elements: !730)
!730 = !{!731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !729, file: !541, line: 506, baseType: !126, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !729, file: !541, line: 507, baseType: !126, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !729, file: !541, line: 508, baseType: !126, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !729, file: !541, line: 509, baseType: !126, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !729, file: !541, line: 510, baseType: !126, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !729, file: !541, line: 511, baseType: !126, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !729, file: !541, line: 512, baseType: !126, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !729, file: !541, line: 513, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !729, file: !541, line: 514, baseType: !126, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !729, file: !541, line: 515, baseType: !126, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !729, file: !541, line: 516, baseType: !126, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !726, file: !541, line: 519, baseType: !126, size: 16)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !542, file: !541, line: 913, baseType: !436, size: 16, offset: 304)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !542, file: !541, line: 914, baseType: !745, size: 32, offset: 320)
!745 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !746)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !541, line: 559, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 552, size: 32, elements: !748)
!748 = !{!749, !755}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !747, file: !541, line: 557, baseType: !750, size: 32)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !747, file: !541, line: 553, size: 32, elements: !751)
!751 = !{!752, !753, !754}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !750, file: !541, line: 554, baseType: !108, size: 10, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !750, file: !541, line: 555, baseType: !108, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !750, file: !541, line: 556, baseType: !108, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !747, file: !541, line: 558, baseType: !108, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !542, file: !541, line: 915, baseType: !757, size: 32, offset: 352)
!757 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !541, line: 585, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 578, size: 32, elements: !760)
!760 = !{!761, !767}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !759, file: !541, line: 583, baseType: !762, size: 32)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !759, file: !541, line: 579, size: 32, elements: !763)
!763 = !{!764, !765, !766}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !762, file: !541, line: 580, baseType: !108, size: 16, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !762, file: !541, line: 581, baseType: !108, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !762, file: !541, line: 582, baseType: !108, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !759, file: !541, line: 584, baseType: !108, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !542, file: !541, line: 916, baseType: !769, size: 8, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !541, line: 610, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 604, size: 8, elements: !772)
!772 = !{!773, !777}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !771, file: !541, line: 608, baseType: !774, size: 8)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !771, file: !541, line: 605, size: 8, elements: !775)
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !774, file: !541, line: 607, baseType: !190, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !771, file: !541, line: 609, baseType: !190, size: 8)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !542, file: !541, line: 917, baseType: !478, size: 24, offset: 392)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !542, file: !541, line: 918, baseType: !780, size: 32, offset: 416)
!780 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !541, line: 639, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 622, size: 32, elements: !783)
!783 = !{!784, !795}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !782, file: !541, line: 637, baseType: !785, size: 32)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !782, file: !541, line: 623, size: 32, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !785, file: !541, line: 625, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !785, file: !541, line: 626, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !785, file: !541, line: 627, baseType: !108, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !785, file: !541, line: 629, baseType: !108, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !785, file: !541, line: 631, baseType: !108, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !785, file: !541, line: 632, baseType: !108, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !785, file: !541, line: 634, baseType: !108, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !785, file: !541, line: 635, baseType: !108, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !782, file: !541, line: 638, baseType: !108, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !542, file: !541, line: 919, baseType: !797, size: 32, offset: 448)
!797 = !DICompositeType(tag: DW_TAG_array_type, baseType: !437, size: 32, elements: !798)
!798 = !{!799}
!799 = !DISubrange(count: 4)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !542, file: !541, line: 920, baseType: !801, size: 16, offset: 480)
!801 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !541, line: 715, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 706, size: 16, elements: !804)
!804 = !{!805, !810}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !803, file: !541, line: 713, baseType: !806, size: 16)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !803, file: !541, line: 707, size: 16, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !806, file: !541, line: 709, baseType: !126, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !806, file: !541, line: 711, baseType: !126, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !803, file: !541, line: 714, baseType: !126, size: 16)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !542, file: !541, line: 921, baseType: !436, size: 16, offset: 496)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !542, file: !541, line: 922, baseType: !813, size: 32, offset: 512)
!813 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !814)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !541, line: 739, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 729, size: 32, elements: !816)
!816 = !{!817, !823}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !815, file: !541, line: 737, baseType: !818, size: 32)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !815, file: !541, line: 730, size: 32, elements: !819)
!819 = !{!820, !821, !822}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !818, file: !541, line: 732, baseType: !108, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !818, file: !541, line: 733, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !818, file: !541, line: 735, baseType: !108, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !815, file: !541, line: 738, baseType: !108, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !542, file: !541, line: 923, baseType: !825, size: 8, offset: 544)
!825 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !826)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !541, line: 765, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 756, size: 8, elements: !828)
!828 = !{!829, !835}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !827, file: !541, line: 763, baseType: !830, size: 8)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !827, file: !541, line: 757, size: 8, elements: !831)
!831 = !{!832, !833, !834}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !830, file: !541, line: 759, baseType: !190, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !830, file: !541, line: 761, baseType: !190, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !830, file: !541, line: 762, baseType: !190, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !827, file: !541, line: 764, baseType: !190, size: 8)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !542, file: !541, line: 924, baseType: !478, size: 24, offset: 552)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !542, file: !541, line: 925, baseType: !838, size: 32, offset: 576)
!838 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !541, line: 789, baseType: !840)
!840 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 781, size: 32, elements: !841)
!841 = !{!842, !847}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !840, file: !541, line: 787, baseType: !843, size: 32)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !840, file: !541, line: 782, size: 32, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !843, file: !541, line: 783, baseType: !108, size: 12, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !843, file: !541, line: 785, baseType: !108, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !840, file: !541, line: 788, baseType: !108, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !542, file: !541, line: 926, baseType: !849, size: 32, offset: 608)
!849 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !541, line: 820, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 805, size: 32, elements: !852)
!852 = !{!853, !863}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !851, file: !541, line: 818, baseType: !854, size: 32)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !851, file: !541, line: 806, size: 32, elements: !855)
!855 = !{!856, !857, !858, !859, !860, !861, !862}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !854, file: !541, line: 807, baseType: !108, size: 2, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !854, file: !541, line: 808, baseType: !108, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !854, file: !541, line: 809, baseType: !108, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !854, file: !541, line: 810, baseType: !108, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !854, file: !541, line: 812, baseType: !108, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !854, file: !541, line: 814, baseType: !108, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !854, file: !541, line: 816, baseType: !108, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !851, file: !541, line: 819, baseType: !108, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !542, file: !541, line: 927, baseType: !865, size: 8, offset: 640)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !541, line: 881, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !541, line: 872, size: 8, elements: !869)
!869 = !{!870, !877}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !868, file: !541, line: 879, baseType: !871, size: 8)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !868, file: !541, line: 873, size: 8, elements: !872)
!872 = !{!873, !874, !875, !876}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !871, file: !541, line: 874, baseType: !190, size: 1, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !871, file: !541, line: 875, baseType: !190, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !871, file: !541, line: 876, baseType: !190, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !871, file: !541, line: 877, baseType: !190, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !868, file: !541, line: 880, baseType: !190, size: 8)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !881, line: 290, baseType: !882)
!881 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !881, line: 284, size: 96, elements: !883)
!883 = !{!884, !894, !905, !918, !935}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !882, file: !881, line: 285, baseType: !885, size: 8)
!885 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRL_Type", file: !881, line: 49, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !881, line: 43, size: 8, elements: !888)
!888 = !{!889, !893}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !887, file: !881, line: 47, baseType: !890, size: 8)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !887, file: !881, line: 44, size: 8, elements: !891)
!891 = !{!892}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !890, file: !881, line: 45, baseType: !190, size: 1, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !887, file: !881, line: 48, baseType: !190, size: 8)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !882, file: !881, line: 286, baseType: !895, size: 8, offset: 8)
!895 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_STATUS_Type", file: !881, line: 67, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !881, line: 61, size: 8, elements: !899)
!899 = !{!900, !904}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !898, file: !881, line: 65, baseType: !901, size: 8)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !898, file: !881, line: 62, size: 8, elements: !902)
!902 = !{!903}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !901, file: !881, line: 64, baseType: !190, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !898, file: !881, line: 66, baseType: !190, size: 8)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "CLKCTRL", scope: !882, file: !881, line: 287, baseType: !906, size: 16, offset: 16)
!906 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CLKCTRL_Type", file: !881, line: 89, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !881, line: 79, size: 16, elements: !909)
!909 = !{!910, !917}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !908, file: !881, line: 87, baseType: !911, size: 16)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !908, file: !881, line: 80, size: 16, elements: !912)
!912 = !{!913, !914, !915, !916}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !911, file: !881, line: 81, baseType: !126, size: 6, flags: DIFlagBitField, extraData: i64 0)
