; ModuleID = 'build/actinius_icarus_bee/subsys/console/echo/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.tty_serial = type { %struct.device*, %struct.k_sem, i8*, i32, i16, i16, i32, %struct.k_sem, i8*, i32, i16, i16, i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_bee/subsys/console/echo/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_bee/subsys/console/echo")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_bee/subsys/console/echo")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "prompt", scope: !27, file: !105, line: 9, type: !106, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/console/echo/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_bee/subsys/console/echo")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/samples/subsys/console/echo/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 400, elements: !109)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!109 = !{!110}
!110 = !DISubrange(count: 50)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "_char_out", scope: !113, file: !116, line: 54, type: !117, isLocal: false, isDefinition: true)
!113 = distinct !DICompileUnit(language: DW_LANG_C99, file: !114, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !115, splitDebugInlining: false, nameTableKind: None)
!114 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_bee/subsys/console/echo")
!115 = !{!111}
!116 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DISubroutineType(types: !119)
!119 = !{!103, !103}
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !122, file: !184, line: 65, type: !185, isLocal: true, isDefinition: true, align: 32)
!122 = distinct !DICompileUnit(language: DW_LANG_C99, file: !123, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !124, globals: !177, splitDebugInlining: false, nameTableKind: None)
!123 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_bee/subsys/console/echo")
!124 = !{!102, !103, !125, !130, !137}
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !127, file: !126, line: 167, baseType: !136)
!126 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!127 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !126, file: !126, line: 134, type: !128, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !122, retainedNodes: !131)
!128 = !DISubroutineType(types: !129)
!129 = !{null, !130}
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!131 = !{!132, !133, !135}
!132 = !DILocalVariable(name: "time_us", arg: 1, scope: !127, file: !126, line: 134, type: !130)
!133 = !DILocalVariable(name: "delay_cycles", scope: !127, file: !126, line: 168, type: !134)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!135 = !DILocalVariable(name: "cycles", scope: !127, file: !126, line: 171, type: !130)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !139, line: 1928, baseType: !140)
!139 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 1909, size: 11360, elements: !141)
!141 = !{!142, !148, !149, !150, !151, !155, !156, !157, !158, !162, !163, !167, !168, !169, !170, !171, !175, !176}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !140, file: !139, line: 1910, baseType: !143, size: 8192)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 8192, elements: !146)
!144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !130)
!146 = !{!147}
!147 = !DISubrange(count: 256)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !140, file: !139, line: 1911, baseType: !144, size: 32, offset: 8192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !140, file: !139, line: 1912, baseType: !144, size: 32, offset: 8224)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !140, file: !139, line: 1913, baseType: !144, size: 32, offset: 8256)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !140, file: !139, line: 1914, baseType: !152, size: 1984, offset: 8288)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 1984, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 62)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !140, file: !139, line: 1915, baseType: !145, size: 32, offset: 10272)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !140, file: !139, line: 1916, baseType: !144, size: 32, offset: 10304)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !140, file: !139, line: 1917, baseType: !145, size: 32, offset: 10336)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !140, file: !139, line: 1918, baseType: !159, size: 96, offset: 10368)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 96, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 3)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !140, file: !139, line: 1919, baseType: !145, size: 32, offset: 10464)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !140, file: !139, line: 1920, baseType: !164, size: 256, offset: 10496)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 256, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 8)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !140, file: !139, line: 1921, baseType: !145, size: 32, offset: 10752)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !140, file: !139, line: 1922, baseType: !144, size: 32, offset: 10784)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !140, file: !139, line: 1923, baseType: !145, size: 32, offset: 10816)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !140, file: !139, line: 1924, baseType: !145, size: 32, offset: 10848)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !140, file: !139, line: 1925, baseType: !172, size: 416, offset: 10880)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 416, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 13)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !140, file: !139, line: 1926, baseType: !145, size: 32, offset: 11296)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !140, file: !139, line: 1927, baseType: !145, size: 32, offset: 11328)
!177 = !{!120, !178}
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !127, file: !126, line: 161, type: !180, isLocal: true, isDefinition: true, align: 128)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 48, elements: !160)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !183)
!183 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!184 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !188)
!187 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!188 = !{!189, !196}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !186, file: !187, line: 60, baseType: !190, size: 32)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DISubroutineType(types: !192)
!192 = !{!103, !193}
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !187, line: 48, flags: DIFlagFwdDecl)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !186, file: !187, line: 65, baseType: !193, size: 32, offset: 32)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "console_serial", scope: !199, file: !300, line: 13, type: !309, isLocal: true, isDefinition: true)
!199 = distinct !DICompileUnit(language: DW_LANG_C99, file: !200, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !201, globals: !297, splitDebugInlining: false, nameTableKind: None)
!200 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/console/getchar.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_bee/subsys/console/echo")
!201 = !{!202, !102, !103}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !204)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !205, line: 336, size: 608, elements: !206)
!205 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!206 = !{!207, !237, !241, !245, !258, !263, !269, !275, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !204, file: !205, line: 365, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DISubroutineType(types: !210)
!210 = !{!103, !211, !236}
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !214, line: 378, size: 192, elements: !215)
!214 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = !{!216, !218, !219, !220, !229, !230}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !213, file: !214, line: 380, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !213, file: !214, line: 382, baseType: !13, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !213, file: !214, line: 384, baseType: !13, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !213, file: !214, line: 386, baseType: !221, size: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !214, line: 351, size: 16, elements: !223)
!223 = !{!224, !227}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !222, file: !214, line: 359, baseType: !225, size: 8)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !226)
!226 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !222, file: !214, line: 364, baseType: !228, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!228 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !213, file: !214, line: 388, baseType: !102, size: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !213, file: !214, line: 396, baseType: !231, size: 32, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !214, line: 43, baseType: !234)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !235)
!235 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !204, file: !205, line: 366, baseType: !238, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !211, !226}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !204, file: !205, line: 374, baseType: !242, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DISubroutineType(types: !244)
!244 = !{!103, !211}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !204, file: !205, line: 377, baseType: !246, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DISubroutineType(types: !248)
!248 = !{!103, !211, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !251)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !205, line: 122, size: 64, elements: !252)
!252 = !{!253, !254, !255, !256, !257}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !251, file: !205, line: 123, baseType: !130, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !251, file: !205, line: 124, baseType: !225, size: 8, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !251, file: !205, line: 125, baseType: !225, size: 8, offset: 40)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !251, file: !205, line: 126, baseType: !225, size: 8, offset: 48)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !251, file: !205, line: 127, baseType: !225, size: 8, offset: 56)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !204, file: !205, line: 379, baseType: !259, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DISubroutineType(types: !261)
!261 = !{!103, !211, !262}
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !204, file: !205, line: 384, baseType: !264, size: 32, offset: 160)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DISubroutineType(types: !266)
!266 = !{!103, !211, !267, !103}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !225)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !204, file: !205, line: 393, baseType: !270, size: 32, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 32)
!271 = !DISubroutineType(types: !272)
!272 = !{!103, !211, !273, !274}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !204, file: !205, line: 402, baseType: !276, size: 32, offset: 224)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DISubroutineType(types: !278)
!278 = !{null, !211}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !204, file: !205, line: 405, baseType: !276, size: 32, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !204, file: !205, line: 408, baseType: !242, size: 32, offset: 288)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !204, file: !205, line: 411, baseType: !276, size: 32, offset: 320)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !204, file: !205, line: 414, baseType: !276, size: 32, offset: 352)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !204, file: !205, line: 417, baseType: !242, size: 32, offset: 384)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !204, file: !205, line: 420, baseType: !242, size: 32, offset: 416)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !204, file: !205, line: 423, baseType: !276, size: 32, offset: 448)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !204, file: !205, line: 426, baseType: !276, size: 32, offset: 480)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !204, file: !205, line: 429, baseType: !242, size: 32, offset: 512)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !204, file: !205, line: 432, baseType: !242, size: 32, offset: 544)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !204, file: !205, line: 435, baseType: !290, size: 32, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 32)
!291 = !DISubroutineType(types: !292)
!292 = !{null, !211, !293, !102}
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !205, line: 142, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !211, !102}
!297 = !{!197, !298, !304}
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "console_rxbuf", scope: !199, file: !300, line: 15, type: !301, isLocal: true, isDefinition: true)
!300 = !DIFile(filename: "zephyr/subsys/console/getchar.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 512, elements: !302)
!302 = !{!303}
!303 = !DISubrange(count: 64)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "console_txbuf", scope: !199, file: !300, line: 16, type: !306, isLocal: true, isDefinition: true)
!306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !225, size: 4096, elements: !307)
!307 = !{!308}
!308 = !DISubrange(count: 512)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tty_serial", file: !310, line: 18, size: 544, elements: !311)
!310 = !DIFile(filename: "zephyr/include/zephyr/console/tty.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!311 = !{!312, !313, !340, !341, !342, !343, !344, !346, !347, !348, !349, !350, !351}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "uart_dev", scope: !309, file: !310, line: 19, baseType: !211, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "rx_sem", scope: !309, file: !310, line: 21, baseType: !314, size: 128, offset: 32)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !315, line: 2909, size: 128, elements: !316)
!315 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!316 = !{!317, !338, !339}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !314, file: !315, line: 2910, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !319, line: 233, baseType: !320)
!319 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !319, line: 231, size: 64, elements: !321)
!321 = !{!322}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !320, file: !319, line: 232, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !324, line: 48, baseType: !325)
!324 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !324, line: 37, size: 64, elements: !326)
!326 = !{!327, !333}
!327 = !DIDerivedType(tag: DW_TAG_member, scope: !325, file: !324, line: 38, baseType: !328, size: 32)
!328 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !325, file: !324, line: 38, size: 32, elements: !329)
!329 = !{!330, !332}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !328, file: !324, line: 39, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !328, file: !324, line: 40, baseType: !331, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, scope: !325, file: !324, line: 42, baseType: !334, size: 32, offset: 32)
!334 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !325, file: !324, line: 42, size: 32, elements: !335)
!335 = !{!336, !337}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !334, file: !324, line: 43, baseType: !331, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !334, file: !324, line: 44, baseType: !331, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !314, file: !315, line: 2911, baseType: !32, size: 32, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !314, file: !315, line: 2912, baseType: !32, size: 32, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "rx_ringbuf", scope: !309, file: !310, line: 22, baseType: !273, size: 32, offset: 160)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "rx_ringbuf_sz", scope: !309, file: !310, line: 23, baseType: !130, size: 32, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "rx_get", scope: !309, file: !310, line: 24, baseType: !182, size: 16, offset: 224)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "rx_put", scope: !309, file: !310, line: 24, baseType: !182, size: 16, offset: 240)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rx_timeout", scope: !309, file: !310, line: 25, baseType: !345, size: 32, offset: 256)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tx_sem", scope: !309, file: !310, line: 27, baseType: !314, size: 128, offset: 288)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ringbuf", scope: !309, file: !310, line: 28, baseType: !273, size: 32, offset: 416)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ringbuf_sz", scope: !309, file: !310, line: 29, baseType: !130, size: 32, offset: 448)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "tx_get", scope: !309, file: !310, line: 30, baseType: !182, size: 16, offset: 480)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tx_put", scope: !309, file: !310, line: 30, baseType: !182, size: 16, offset: 496)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tx_timeout", scope: !309, file: !310, line: 31, baseType: !345, size: 32, offset: 512)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !354, file: !395, line: 27, type: !422, isLocal: true, isDefinition: true)
!354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !355, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !356, retainedTypes: !368, globals: !392, splitDebugInlining: false, nameTableKind: None)
!355 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_bee/subsys/console/echo")
!356 = !{!357, !30}
!357 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !358, line: 27, baseType: !32, size: 32, elements: !359)
!358 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!359 = !{!360, !361, !362, !363, !364, !365, !366, !367}
!360 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!361 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!362 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!363 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!364 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!365 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!366 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!367 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!368 = !{!102, !369, !103, !24, !373, !389, !130, !390}
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !370, line: 46, baseType: !371)
!370 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !372)
!372 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !375, line: 54, size: 96, elements: !376)
!375 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!376 = !{!377, !384, !388}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !374, file: !375, line: 55, baseType: !378, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !379, line: 33, baseType: !380)
!379 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !379, line: 29, size: 32, elements: !381)
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !380, file: !379, line: 30, baseType: !383, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !374, file: !375, line: 60, baseType: !385, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !357}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !374, file: !375, line: 65, baseType: !385, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !391)
!391 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!392 = !{!352, !393, !399, !401, !412, !414}
!393 = !DIGlobalVariableExpression(var: !394, expr: !DIExpression())
!394 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !354, file: !395, line: 44, type: !396, isLocal: true, isDefinition: true)
!395 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !397, line: 43, elements: !398)
!397 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!398 = !{}
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !354, file: !395, line: 49, type: !396, isLocal: true, isDefinition: true)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !354, file: !395, line: 36, type: !403, isLocal: true, isDefinition: true)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 128, elements: !410)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !358, line: 114, size: 128, elements: !405)
!405 = !{!406, !407, !408, !409}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !404, file: !358, line: 115, baseType: !357, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !404, file: !358, line: 141, baseType: !225, size: 8, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !404, file: !358, line: 149, baseType: !130, size: 32, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !404, file: !358, line: 156, baseType: !130, size: 32, offset: 96)
!410 = !{!411}
!411 = !DISubrange(count: 1)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !354, file: !395, line: 40, type: !403, isLocal: true, isDefinition: true)
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !354, file: !395, line: 28, type: !416, isLocal: true, isDefinition: true)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !379, line: 40, baseType: !417)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !379, line: 35, size: 64, elements: !418)
!418 = !{!419, !421}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !417, file: !379, line: 36, baseType: !420, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !417, file: !379, line: 37, baseType: !420, size: 32, offset: 32)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 32, elements: !410)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !424, line: 22, baseType: !425)
!424 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!425 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!426 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!427 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !430, file: !458, line: 50, type: !345, isLocal: true, isDefinition: true)
!430 = distinct !DICompileUnit(language: DW_LANG_C99, file: !431, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !356, retainedTypes: !432, globals: !455, splitDebugInlining: false, nameTableKind: None)
!431 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_bee/subsys/console/echo")
!432 = !{!234, !369, !433, !103, !102, !130, !390, !435, !389, !345, !446}
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !434, line: 214, baseType: !32)
!434 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 32)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !437, line: 45, size: 64, elements: !438)
!437 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!438 = !{!439, !445}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !436, file: !437, line: 46, baseType: !440, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !379, line: 33, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !379, line: 29, size: 32, elements: !442)
!442 = !{!443}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !441, file: !379, line: 30, baseType: !444, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !436, file: !437, line: 48, baseType: !130, size: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 32)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !437, line: 38, size: 64, elements: !448)
!448 = !{!449, !450}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !447, file: !437, line: 39, baseType: !440, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !447, file: !437, line: 41, baseType: !451, size: 32, offset: 32)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !437, line: 35, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 32)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !345}
!455 = !{!456, !460, !468, !428, !470, !480}
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "latency_lock", scope: !430, file: !458, line: 44, type: !459, isLocal: true, isDefinition: true)
!458 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !397, line: 43, elements: !398)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !430, file: !458, line: 46, type: !462, isLocal: true, isDefinition: true)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !379, line: 40, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !379, line: 35, size: 64, elements: !464)
!464 = !{!465, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !463, file: !379, line: 36, baseType: !466, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !463, file: !379, line: 37, baseType: !466, size: 32, offset: 32)
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "latency_subs", scope: !430, file: !458, line: 52, type: !462, isLocal: true, isDefinition: true)
!470 = !DIGlobalVariableExpression(var: !471, expr: !DIExpression())
!471 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !430, file: !458, line: 39, type: !472, isLocal: true, isDefinition: true)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, elements: !478)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !458, line: 35, size: 96, elements: !474)
!474 = !{!475, !476, !477}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !473, file: !458, line: 36, baseType: !357, size: 32)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !473, file: !458, line: 37, baseType: !225, size: 8, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !473, file: !458, line: 38, baseType: !423, size: 32, offset: 64)
!478 = !{!479}
!479 = !DISubrange(count: 0)
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !430, file: !458, line: 48, type: !345, isLocal: true, isDefinition: true)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !484, file: !491, line: 47, type: !504, isLocal: true, isDefinition: true)
!484 = distinct !DICompileUnit(language: DW_LANG_C99, file: !485, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !486, retainedTypes: !487, globals: !488, splitDebugInlining: false, nameTableKind: None)
!485 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_bee/subsys/console/echo")
!486 = !{!357}
!487 = !{!433, !103}
!488 = !{!489, !482, !501}
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "cpus_states", scope: !484, file: !491, line: 50, type: !492, isLocal: true, isDefinition: true)
!491 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 32, elements: !410)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 32)
!494 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !358, line: 114, size: 128, elements: !496)
!496 = !{!497, !498, !499, !500}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !495, file: !358, line: 115, baseType: !357, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !495, file: !358, line: 141, baseType: !225, size: 8, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !495, file: !358, line: 149, baseType: !130, size: 32, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !495, file: !358, line: 156, baseType: !130, size: 32, offset: 96)
!501 = !DIGlobalVariableExpression(var: !502, expr: !DIExpression())
!502 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !484, file: !491, line: 55, type: !503, isLocal: true, isDefinition: true)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !268, size: 8, elements: !410)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !494, elements: !478)
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "static_regions", scope: !507, file: !514, line: 62, type: !643, isLocal: true, isDefinition: true)
!507 = distinct !DICompileUnit(language: DW_LANG_C99, file: !508, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !509, globals: !510, splitDebugInlining: false, nameTableKind: None)
!508 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_bee/subsys/console/echo")
!509 = !{!433, !103, !130, !102}
!510 = !{!511, !505}
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !513, file: !514, line: 198, type: !630, isLocal: true, isDefinition: true)
!513 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !514, file: !514, line: 175, type: !515, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !507, retainedNodes: !627)
!514 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!515 = !DISubroutineType(types: !516)
!516 = !{null, !517}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 32)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !519, line: 245, size: 1024, elements: !520)
!519 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!520 = !{!521, !584, !597, !598, !599, !600, !606, !622}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !518, file: !519, line: 247, baseType: !522, size: 384)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !519, line: 57, size: 384, elements: !523)
!523 = !{!524, !551, !558, !559, !560, !571, !572, !573}
!524 = !DIDerivedType(tag: DW_TAG_member, scope: !522, file: !519, line: 60, baseType: !525, size: 64)
!525 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !522, file: !519, line: 60, size: 64, elements: !526)
!526 = !{!527, !542}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !525, file: !519, line: 61, baseType: !528, size: 64)
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !324, line: 49, baseType: !529)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !324, line: 37, size: 64, elements: !530)
!530 = !{!531, !537}
!531 = !DIDerivedType(tag: DW_TAG_member, scope: !529, file: !324, line: 38, baseType: !532, size: 32)
!532 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !529, file: !324, line: 38, size: 32, elements: !533)
!533 = !{!534, !536}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !532, file: !324, line: 39, baseType: !535, size: 32)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !532, file: !324, line: 40, baseType: !535, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, scope: !529, file: !324, line: 42, baseType: !538, size: 32, offset: 32)
!538 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !529, file: !324, line: 42, size: 32, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !538, file: !324, line: 43, baseType: !535, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !538, file: !324, line: 44, baseType: !535, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !525, file: !519, line: 62, baseType: !543, size: 64)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !544, line: 49, size: 64, elements: !545)
!544 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!545 = !{!546}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !543, file: !544, line: 50, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !548, size: 64, elements: !549)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!549 = !{!550}
!550 = !DISubrange(count: 2)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !522, file: !519, line: 68, baseType: !552, size: 32, offset: 64)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !319, line: 233, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !319, line: 231, size: 64, elements: !555)
!555 = !{!556}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !554, file: !319, line: 232, baseType: !557, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !324, line: 48, baseType: !529)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !522, file: !519, line: 71, baseType: !225, size: 8, offset: 96)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !522, file: !519, line: 74, baseType: !225, size: 8, offset: 104)
!560 = !DIDerivedType(tag: DW_TAG_member, scope: !522, file: !519, line: 90, baseType: !561, size: 16, offset: 112)
!561 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !522, file: !519, line: 90, size: 16, elements: !562)
!562 = !{!563, !570}
!563 = !DIDerivedType(tag: DW_TAG_member, scope: !561, file: !519, line: 91, baseType: !564, size: 16)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !561, file: !519, line: 91, size: 16, elements: !565)
!565 = !{!566, !569}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !564, file: !519, line: 96, baseType: !567, size: 8)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !568)
!568 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !564, file: !519, line: 97, baseType: !225, size: 8, offset: 8)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !561, file: !519, line: 100, baseType: !182, size: 16)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !522, file: !519, line: 107, baseType: !130, size: 32, offset: 128)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !522, file: !519, line: 127, baseType: !102, size: 32, offset: 160)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !522, file: !519, line: 131, baseType: !574, size: 192, offset: 192)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !319, line: 244, size: 192, elements: !575)
!575 = !{!576, !577, !583}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !574, file: !319, line: 245, baseType: !528, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !574, file: !319, line: 246, baseType: !578, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !319, line: 242, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 32)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !582}
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !574, file: !319, line: 249, baseType: !371, size: 64, offset: 128)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !518, file: !519, line: 250, baseType: !585, size: 288, offset: 384)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !586, line: 25, size: 288, elements: !587)
!586 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !596}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !585, file: !586, line: 26, baseType: !130, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !585, file: !586, line: 27, baseType: !130, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !585, file: !586, line: 28, baseType: !130, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !585, file: !586, line: 29, baseType: !130, size: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !585, file: !586, line: 30, baseType: !130, size: 32, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !585, file: !586, line: 31, baseType: !130, size: 32, offset: 160)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !585, file: !586, line: 32, baseType: !130, size: 32, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !585, file: !586, line: 33, baseType: !130, size: 32, offset: 224)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !585, file: !586, line: 34, baseType: !130, size: 32, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !518, file: !519, line: 253, baseType: !102, size: 32, offset: 672)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !518, file: !519, line: 256, baseType: !553, size: 64, offset: 704)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !518, file: !519, line: 294, baseType: !103, size: 32, offset: 768)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !518, file: !519, line: 300, baseType: !601, size: 96, offset: 800)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !519, line: 149, size: 96, elements: !602)
!602 = !{!603, !604, !605}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !601, file: !519, line: 153, baseType: !22, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !601, file: !519, line: 162, baseType: !433, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !601, file: !519, line: 168, baseType: !433, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !518, file: !519, line: 325, baseType: !607, size: 32, offset: 896)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !315, line: 5073, size: 160, elements: !609)
!609 = !{!610, !619, !620}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !608, file: !315, line: 5074, baseType: !611, size: 96)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !612, line: 56, size: 96, elements: !613)
!612 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!613 = !{!614, !617, !618}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !611, file: !612, line: 57, baseType: !615, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 32)
!616 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !612, line: 57, flags: DIFlagFwdDecl)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !611, file: !612, line: 58, baseType: !102, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !611, file: !612, line: 59, baseType: !433, size: 32, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !608, file: !315, line: 5075, baseType: !553, size: 64, offset: 96)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !608, file: !315, line: 5076, baseType: !621, offset: 160)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !397, line: 43, elements: !398)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !518, file: !519, line: 343, baseType: !623, size: 64, offset: 928)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !586, line: 60, size: 64, elements: !624)
!624 = !{!625, !626}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !623, file: !586, line: 63, baseType: !130, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !623, file: !586, line: 66, baseType: !130, size: 32, offset: 32)
!627 = !{!628, !629}
!628 = !DILocalVariable(name: "thread", arg: 1, scope: !513, file: !514, line: 175, type: !517)
!629 = !DILocalVariable(name: "region_num", scope: !513, file: !514, line: 200, type: !225)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, elements: !478)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !632, line: 52, size: 96, elements: !633)
!632 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!633 = !{!634, !635, !636}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !631, file: !632, line: 53, baseType: !22, size: 32)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !631, file: !632, line: 54, baseType: !433, size: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !631, file: !632, line: 55, baseType: !637, size: 32, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !638, line: 304, baseType: !639)
!638 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !638, line: 301, size: 32, elements: !640)
!640 = !{!641, !642}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !639, file: !638, line: 302, baseType: !182, size: 16)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !639, file: !638, line: 303, baseType: !182, size: 16, offset: 16)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 96, elements: !410)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !647, file: !701, line: 39, type: !225, isLocal: true, isDefinition: true)
!647 = distinct !DICompileUnit(language: DW_LANG_C99, file: !648, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !649, globals: !692, splitDebugInlining: false, nameTableKind: None)
!648 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_bee/subsys/console/echo")
!649 = !{!650, !102, !103, !678}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !652, line: 1495, baseType: !653)
!652 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !652, line: 1474, size: 448, elements: !654)
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !668}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !653, file: !652, line: 1476, baseType: !144, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !653, file: !652, line: 1477, baseType: !145, size: 32, offset: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !653, file: !652, line: 1478, baseType: !145, size: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !653, file: !652, line: 1479, baseType: !145, size: 32, offset: 96)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !653, file: !652, line: 1480, baseType: !145, size: 32, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !653, file: !652, line: 1481, baseType: !145, size: 32, offset: 160)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !653, file: !652, line: 1482, baseType: !145, size: 32, offset: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !653, file: !652, line: 1483, baseType: !145, size: 32, offset: 224)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !653, file: !652, line: 1484, baseType: !145, size: 32, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !653, file: !652, line: 1485, baseType: !145, size: 32, offset: 288)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !653, file: !652, line: 1486, baseType: !145, size: 32, offset: 320)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !653, file: !652, line: 1487, baseType: !667, size: 32, offset: 352)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 32, elements: !410)
!668 = !DIDerivedType(tag: DW_TAG_member, scope: !653, file: !652, line: 1488, baseType: !669, size: 64, offset: 384)
!669 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !653, file: !652, line: 1488, size: 64, elements: !670)
!670 = !{!671, !673}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !669, file: !652, line: 1489, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 64, elements: !549)
!673 = !DIDerivedType(tag: DW_TAG_member, scope: !669, file: !652, line: 1490, baseType: !674, size: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !669, file: !652, line: 1490, size: 64, elements: !675)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !674, file: !652, line: 1491, baseType: !145, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !674, file: !652, line: 1492, baseType: !145, size: 32, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !681, line: 27, size: 128, elements: !682)
!681 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!682 = !{!683, !684, !685}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !680, file: !681, line: 29, baseType: !130, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !680, file: !681, line: 31, baseType: !217, size: 32, offset: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !680, file: !681, line: 37, baseType: !686, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !638, line: 298, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !638, line: 289, size: 64, elements: !688)
!688 = !{!689, !690, !691}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !687, file: !638, line: 291, baseType: !225, size: 5, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !687, file: !638, line: 293, baseType: !225, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !687, file: !638, line: 295, baseType: !130, size: 32, offset: 32)
!692 = !{!645, !693}
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !647, file: !695, line: 31, type: !696, isLocal: true, isDefinition: true)
!695 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !697, size: 160, elements: !410)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !695, line: 21, size: 160, elements: !698)
!698 = !{!699, !700}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !697, file: !695, line: 22, baseType: !103, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !697, file: !695, line: 23, baseType: !680, size: 128, offset: 32)
!701 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!702 = !DIGlobalVariableExpression(var: !703, expr: !DIExpression())
!703 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !704, file: !711, line: 21, type: !117, isLocal: true, isDefinition: true)
!704 = distinct !DICompileUnit(language: DW_LANG_C99, file: !705, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !706, globals: !710, splitDebugInlining: false, nameTableKind: None)
!705 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_bee/subsys/console/echo")
!706 = !{!707, !103, !102}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 32)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !709, line: 22, baseType: !103)
!709 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!710 = !{!702}
!711 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !714, file: !719, line: 13, type: !738, isLocal: true, isDefinition: true)
!714 = distinct !DICompileUnit(language: DW_LANG_C99, file: !715, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !716, splitDebugInlining: false, nameTableKind: None)
!715 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_bee/subsys/console/echo")
!716 = !{!717, !712}
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "mpu_config", scope: !714, file: !719, line: 37, type: !720, isLocal: false, isDefinition: true)
!719 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!720 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !721)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !681, line: 41, size: 64, elements: !722)
!722 = !{!723, !724}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !721, file: !681, line: 43, baseType: !130, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !721, file: !681, line: 45, baseType: !725, size: 32, offset: 32)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !681, line: 27, size: 128, elements: !728)
!728 = !{!729, !730, !731}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !727, file: !681, line: 29, baseType: !130, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !727, file: !681, line: 31, baseType: !217, size: 32, offset: 32)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !727, file: !681, line: 37, baseType: !732, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !638, line: 298, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !638, line: 289, size: 64, elements: !734)
!734 = !{!735, !736, !737}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !733, file: !638, line: 291, baseType: !225, size: 5, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !733, file: !638, line: 293, baseType: !225, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !733, file: !638, line: 295, baseType: !130, size: 32, offset: 32)
!738 = !DICompositeType(tag: DW_TAG_array_type, baseType: !726, size: 256, elements: !549)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "__device_dts_ord_54", scope: !741, file: !944, line: 733, type: !1047, isLocal: false, isDefinition: true, align: 32)
!741 = distinct !DICompileUnit(language: DW_LANG_C99, file: !742, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !743, retainedTypes: !861, globals: !940, splitDebugInlining: false, nameTableKind: None)
!742 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_bee/subsys/console/echo")
!743 = !{!744, !750, !30, !755, !760, !764, !768, !772, !778, !782, !826, !833, !852}
!744 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !745, line: 23, baseType: !32, size: 32, elements: !746)
!745 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!746 = !{!747, !748, !749}
!747 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!748 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!749 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!750 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !745, line: 48, baseType: !32, size: 32, elements: !751)
!751 = !{!752, !753, !754}
!752 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!753 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!754 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!755 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !756, line: 167, baseType: !32, size: 32, elements: !757)
!756 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!757 = !{!758, !759}
!758 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!759 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!760 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !756, line: 107, baseType: !32, size: 32, elements: !761)
!761 = !{!762, !763}
!762 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!763 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!764 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !756, line: 208, baseType: !32, size: 32, elements: !765)
!765 = !{!766, !767}
!766 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!767 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!768 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !756, line: 261, baseType: !32, size: 32, elements: !769)
!769 = !{!770, !771}
!770 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!771 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!772 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !756, line: 237, baseType: !32, size: 32, elements: !773)
!773 = !{!774, !775, !776, !777}
!774 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!775 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!776 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!777 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!778 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !756, line: 152, baseType: !32, size: 32, elements: !779)
!779 = !{!780, !781}
!780 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!781 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!782 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !139, line: 71, baseType: !103, size: 32, elements: !783)
!783 = !{!784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825}
!784 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!785 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!786 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!787 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!788 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!789 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!790 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!791 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!792 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!793 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!794 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!795 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!796 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!797 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!798 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!799 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!800 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!801 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!802 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!803 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!804 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!805 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!806 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!807 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!808 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!809 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!810 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!811 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!812 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!813 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!814 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!815 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!816 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!817 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!818 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!819 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!820 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!821 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!822 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!823 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!824 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!825 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!826 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !827, line: 44, baseType: !32, size: 32, elements: !828)
!827 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!828 = !{!829, !830, !831, !832}
!829 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!830 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!831 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!832 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!833 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !834, line: 54, baseType: !32, size: 32, elements: !835)
!834 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!835 = !{!836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851}
!836 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!837 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!838 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!839 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!840 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!841 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!842 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!843 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!844 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!845 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!846 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!847 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!848 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!849 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!850 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!851 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!852 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !853, line: 53, baseType: !32, size: 32, elements: !854)
!853 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!854 = !{!855, !856, !857, !858, !859, !860}
!855 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!856 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!857 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!858 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!859 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!860 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!861 = !{!744, !102, !103, !862, !904, !905, !906, !907, !369, !130, !390, !228, !908, !273, !345, !909, !939, !433}
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !139, line: 923, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !139, line: 883, size: 10464, elements: !865)
!865 = !{!866, !867, !868, !869, !870, !874, !875, !876, !877, !878, !879, !880, !881, !885, !886, !887, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !864, file: !139, line: 884, baseType: !145, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !864, file: !139, line: 885, baseType: !145, size: 32, offset: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !864, file: !139, line: 886, baseType: !145, size: 32, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !864, file: !139, line: 887, baseType: !145, size: 32, offset: 96)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !864, file: !139, line: 888, baseType: !871, size: 896, offset: 128)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 896, elements: !872)
!872 = !{!873}
!873 = !DISubrange(count: 28)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !864, file: !139, line: 889, baseType: !145, size: 32, offset: 1024)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !864, file: !139, line: 890, baseType: !145, size: 32, offset: 1056)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !864, file: !139, line: 891, baseType: !145, size: 32, offset: 1088)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !864, file: !139, line: 892, baseType: !145, size: 32, offset: 1120)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !864, file: !139, line: 893, baseType: !871, size: 896, offset: 1152)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !864, file: !139, line: 894, baseType: !145, size: 32, offset: 2048)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !864, file: !139, line: 895, baseType: !145, size: 32, offset: 2080)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !864, file: !139, line: 896, baseType: !882, size: 960, offset: 2112)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 960, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 30)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !864, file: !139, line: 897, baseType: !145, size: 32, offset: 3072)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !864, file: !139, line: 898, baseType: !145, size: 32, offset: 3104)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !864, file: !139, line: 899, baseType: !888, size: 3008, offset: 3136)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !144, size: 3008, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 94)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !864, file: !139, line: 900, baseType: !145, size: 32, offset: 6144)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !864, file: !139, line: 901, baseType: !145, size: 32, offset: 6176)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !864, file: !139, line: 902, baseType: !145, size: 32, offset: 6208)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !864, file: !139, line: 903, baseType: !144, size: 32, offset: 6240)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !864, file: !139, line: 904, baseType: !152, size: 1984, offset: 6272)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !864, file: !139, line: 905, baseType: !144, size: 32, offset: 8256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !864, file: !139, line: 907, baseType: !144, size: 32, offset: 8288)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !864, file: !139, line: 910, baseType: !144, size: 32, offset: 8320)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !864, file: !139, line: 911, baseType: !144, size: 32, offset: 8352)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !864, file: !139, line: 913, baseType: !144, size: 32, offset: 8384)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !864, file: !139, line: 917, baseType: !144, size: 32, offset: 8416)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !864, file: !139, line: 919, baseType: !152, size: 1984, offset: 8448)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !864, file: !139, line: 920, baseType: !145, size: 32, offset: 10432)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !756, line: 146, baseType: !760)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !756, line: 164, baseType: !778)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !652, line: 485, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !652, line: 468, size: 28704, elements: !912)
!912 = !{!913, !917, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !934, !938}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !911, file: !652, line: 470, baseType: !914, size: 512)
!914 = !DICompositeType(tag: DW_TAG_array_type, baseType: !145, size: 512, elements: !915)
!915 = !{!916}
!916 = !DISubrange(count: 16)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !911, file: !652, line: 471, baseType: !918, size: 512, offset: 512)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 512, elements: !915)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !911, file: !652, line: 472, baseType: !914, size: 512, offset: 1024)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !911, file: !652, line: 473, baseType: !918, size: 512, offset: 1536)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !911, file: !652, line: 474, baseType: !914, size: 512, offset: 2048)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !911, file: !652, line: 475, baseType: !918, size: 512, offset: 2560)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !911, file: !652, line: 476, baseType: !914, size: 512, offset: 3072)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !911, file: !652, line: 477, baseType: !918, size: 512, offset: 3584)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !911, file: !652, line: 478, baseType: !914, size: 512, offset: 4096)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !911, file: !652, line: 479, baseType: !918, size: 512, offset: 4608)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !911, file: !652, line: 480, baseType: !914, size: 512, offset: 5120)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !911, file: !652, line: 481, baseType: !918, size: 512, offset: 5632)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !911, file: !652, line: 482, baseType: !930, size: 3968, offset: 6144)
!930 = !DICompositeType(tag: DW_TAG_array_type, baseType: !931, size: 3968, elements: !932)
!931 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !225)
!932 = !{!933}
!933 = !DISubrange(count: 496)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !911, file: !652, line: 483, baseType: !935, size: 18560, offset: 10112)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 18560, elements: !936)
!936 = !{!937}
!937 = !DISubrange(count: 580)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !911, file: !652, line: 484, baseType: !145, size: 32, offset: 28672)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !827, line: 56, baseType: !102)
!940 = !{!941, !991, !1032, !739, !1037, !1062, !1064, !1081, !1083, !1093, !1096, !1111, !1149, !1163}
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(name: "on", scope: !943, file: !944, line: 549, type: !423, isLocal: true, isDefinition: true)
!943 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !944, file: !944, line: 547, type: !945, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !741, retainedNodes: !947)
!944 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!945 = !DISubroutineType(types: !946)
!946 = !{null, !750}
!947 = !{!948, !949, !952}
!948 = !DILocalVariable(name: "start_mode", arg: 1, scope: !943, file: !944, line: 547, type: !750)
!949 = !DILocalVariable(name: "err", scope: !950, file: !944, line: 553, type: !103)
!950 = distinct !DILexicalBlock(scope: !951, file: !944, line: 552, column: 31)
!951 = distinct !DILexicalBlock(scope: !943, file: !944, line: 552, column: 6)
!952 = !DILocalVariable(name: "mgr", scope: !950, file: !944, line: 554, type: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 32)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !955, line: 154, size: 224, elements: !956)
!955 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!956 = !{!957, !969, !970, !986, !988, !989, !990}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !954, file: !955, line: 158, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !379, line: 40, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !379, line: 35, size: 64, elements: !960)
!960 = !{!961, !968}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !959, file: !379, line: 36, baseType: !962, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !379, line: 33, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !379, line: 29, size: 32, elements: !965)
!965 = !{!966}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !964, file: !379, line: 30, baseType: !967, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !959, file: !379, line: 37, baseType: !962, size: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !954, file: !955, line: 163, baseType: !958, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !954, file: !955, line: 166, baseType: !971, size: 32, offset: 128)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !955, line: 133, size: 96, elements: !974)
!974 = !{!975, !984, !985}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !973, file: !955, line: 135, baseType: !976, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !955, line: 129, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 32)
!978 = !DISubroutineType(types: !979)
!979 = !{null, !953, !980}
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !955, line: 101, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 32)
!982 = !DISubroutineType(types: !983)
!983 = !{null, !953, !103}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !973, file: !955, line: 138, baseType: !976, size: 32, offset: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !973, file: !955, line: 143, baseType: !976, size: 32, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !954, file: !955, line: 169, baseType: !987, offset: 160)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !397, line: 43, elements: !398)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !954, file: !955, line: 172, baseType: !103, size: 32, offset: 160)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !954, file: !955, line: 175, baseType: !182, size: 16, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !954, file: !955, line: 178, baseType: !182, size: 16, offset: 208)
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(name: "cli", scope: !943, file: !944, line: 550, type: !993, isLocal: true, isDefinition: true)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !955, line: 273, size: 128, elements: !994)
!994 = !{!995, !996}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !993, file: !955, line: 280, baseType: !963, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !993, file: !955, line: 283, baseType: !997, size: 96, offset: 32)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !998, line: 138, size: 96, elements: !999)
!998 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!999 = !{!1000, !1029, !1030}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !997, file: !998, line: 149, baseType: !1001, size: 32)
!1001 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !998, line: 139, size: 32, elements: !1002)
!1002 = !{!1003, !1024}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !1001, file: !998, line: 145, baseType: !1004, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 32)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !315, line: 5397, size: 128, elements: !1006)
!1006 = !{!1007, !1022, !1023}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !1005, file: !315, line: 5399, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !324, line: 48, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !324, line: 37, size: 64, elements: !1010)
!1010 = !{!1011, !1017}
!1011 = !DIDerivedType(tag: DW_TAG_member, scope: !1009, file: !324, line: 38, baseType: !1012, size: 32)
!1012 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1009, file: !324, line: 38, size: 32, elements: !1013)
!1013 = !{!1014, !1016}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1012, file: !324, line: 39, baseType: !1015, size: 32)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1012, file: !324, line: 40, baseType: !1015, size: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, scope: !1009, file: !324, line: 42, baseType: !1018, size: 32, offset: 32)
!1018 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1009, file: !324, line: 42, size: 32, elements: !1019)
!1019 = !{!1020, !1021}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1018, file: !324, line: 43, baseType: !1015, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1018, file: !324, line: 44, baseType: !1015, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !1005, file: !315, line: 5405, baseType: !32, size: 32, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1005, file: !315, line: 5408, baseType: !103, size: 32, offset: 96)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1001, file: !998, line: 148, baseType: !1025, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !998, line: 98, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 32)
!1027 = !DISubroutineType(types: !1028)
!1028 = !{null, null}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !997, file: !998, line: 165, baseType: !145, size: 32, offset: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !997, file: !998, line: 174, baseType: !1031, size: 32, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !741, file: !944, line: 733, type: !1034, isLocal: false, isDefinition: true, align: 16)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !232, size: 80, elements: !1035)
!1035 = !{!1036}
!1036 = !DISubrange(count: 5)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_54", scope: !741, file: !944, line: 733, type: !1039, isLocal: true, isDefinition: true, align: 32)
!1039 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !187, line: 51, size: 64, elements: !1041)
!1041 = !{!1042, !1061}
