; ModuleID = 'build/96b_nitrogen/pytest/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.ztest_suite_stats = type { i32, i32, i32 }
%struct.ztest_suite_node = type { i8*, i8* ()*, void (i8*)*, void (i8*)*, void (i8*)*, i1 (i8*)*, %struct.ztest_suite_stats* }
%struct.ztest_unit_test_stats = type { i32, i32, i32, i32, i32 }
%struct.ztest_unit_test = type { i8*, i8*, void (i8*)*, i32, %struct.ztest_unit_test_stats* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct.k_spinlock = type { i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_spinlock }
%struct.arm_mpu_region = type { i32, i8*, %struct.k_spinlock }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_thread_stack_element = type { i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, [32 x i8], i32, %struct.ztest_suite_stats, %struct.k_heap*, %struct._thread_arch }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/pytest/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/pytest")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 51, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/pytest")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2496, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 39)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1248, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "z_ztest_suite_node_stats_test_pytest", scope: !27, file: !111, line: 8, type: !149, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !108, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/testsuite/pytest/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/pytest")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_ZTEST_SUITE_NODE", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_ZTEST_SUITE_STATS", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_ZTEST_UNIT_TEST", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_ZTEST_TEST_RULE", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 67)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 68)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 69)
!104 = !DIEnumerator(name: "K_OBJ_LAST", value: 70)
!105 = !{!106, !107}
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !{!109, !155, !25, !173}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "z_ztest_test_node_test_pytest", scope: !27, file: !111, line: 8, type: !112, isLocal: true, isDefinition: true, align: 32)
!111 = !DIFile(filename: "zephyr/samples/subsys/testsuite/pytest/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_node", file: !114, line: 177, size: 224, elements: !115)
!114 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/include/zephyr/ztest_test_new.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!115 = !{!116, !121, !127, !133, !136, !139, !146}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !113, file: !114, line: 179, baseType: !117, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!120 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !113, file: !114, line: 182, baseType: !122, size: 32, offset: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_setup_t", file: !114, line: 141, baseType: !124)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DISubroutineType(types: !126)
!126 = !{!106}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !113, file: !114, line: 185, baseType: !128, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !129)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_before_t", file: !114, line: 148, baseType: !130)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DISubroutineType(types: !132)
!132 = !{null, !106}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !113, file: !114, line: 188, baseType: !134, size: 32, offset: 96)
!134 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !135)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_after_t", file: !114, line: 155, baseType: !130)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "teardown", scope: !113, file: !114, line: 191, baseType: !137, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_teardown_t", file: !114, line: 162, baseType: !130)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !113, file: !114, line: 194, baseType: !140, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "ztest_suite_predicate_t", file: !114, line: 171, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{!145, !13}
!145 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !113, file: !114, line: 197, baseType: !147, size: 32, offset: 192)
!147 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !148)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_stats", file: !114, line: 114, size: 96, elements: !150)
!150 = !{!151, !153, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !149, file: !114, line: 116, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !149, file: !114, line: 118, baseType: !152, size: 32, offset: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !149, file: !114, line: 120, baseType: !152, size: 32, offset: 64)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "z_ztest_unit_test__test_pytest__test_pytest", scope: !27, file: !111, line: 10, type: !157, isLocal: true, isDefinition: true, align: 32)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_unit_test", file: !114, line: 97, size: 160, elements: !158)
!158 = !{!159, !160, !161, !162, !163}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "test_suite_name", scope: !157, file: !114, line: 98, baseType: !118, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !157, file: !114, line: 99, baseType: !118, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !157, file: !114, line: 100, baseType: !130, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "thread_options", scope: !157, file: !114, line: 101, baseType: !152, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !157, file: !114, line: 104, baseType: !164, size: 32, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !165)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_unit_test_stats", file: !114, line: 123, size: 160, elements: !167)
!167 = !{!168, !169, !170, !171, !172}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !166, file: !114, line: 125, baseType: !152, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !166, file: !114, line: 127, baseType: !152, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !166, file: !114, line: 129, baseType: !152, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "pass_count", scope: !166, file: !114, line: 131, baseType: !152, size: 32, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "duration_worst_ms", scope: !166, file: !114, line: 133, baseType: !152, size: 32, offset: 128)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "z_ztest_unit_test_stats_test_pytest_test_pytest", scope: !27, file: !111, line: 10, type: !166, isLocal: false, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !177, file: !200, line: 18, type: !201, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !179, globals: !199, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/pytest")
!179 = !{!22, !106, !24, !180, !182, !184, !185, !107, !187, !188, !190, !192, !193, !194, !197, !118}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !186, line: 214, baseType: !32)
!186 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!189 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 32)
!191 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !196)
!196 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !198)
!198 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!199 = !{!175}
!200 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !204)
!203 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!204 = !{!205, !206}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !202, file: !203, line: 17, baseType: !118, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !202, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "_char_out", scope: !209, file: !212, line: 54, type: !213, isLocal: false, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !211, splitDebugInlining: false, nameTableKind: None)
!210 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/pytest")
!211 = !{!207}
!212 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DISubroutineType(types: !215)
!215 = !{!107, !107}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !218, file: !257, line: 22, type: !290, isLocal: false, isDefinition: true)
!218 = distinct !DICompileUnit(language: DW_LANG_C99, file: !219, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !220, retainedTypes: !232, globals: !254, splitDebugInlining: false, nameTableKind: None)
!219 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/pytest")
!220 = !{!221, !30}
!221 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !222, line: 27, baseType: !32, size: 32, elements: !223)
!222 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!223 = !{!224, !225, !226, !227, !228, !229, !230, !231}
!224 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!225 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!226 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!227 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!228 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!229 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!230 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!231 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!232 = !{!106, !233, !107, !24, !236, !193, !152, !252}
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !234, line: 46, baseType: !235)
!234 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !191)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !238, line: 54, size: 96, elements: !239)
!238 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!239 = !{!240, !247, !251}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !237, file: !238, line: 55, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !242, line: 33, baseType: !243)
!242 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !242, line: 29, size: 32, elements: !244)
!244 = !{!245}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !243, file: !242, line: 30, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !237, file: !238, line: 60, baseType: !248, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !221}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !237, file: !238, line: 65, baseType: !248, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !253)
!253 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!254 = !{!216, !255, !263, !269, !271, !280, !282}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !218, file: !257, line: 27, type: !258, isLocal: true, isDefinition: true)
!257 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!258 = !DICompositeType(tag: DW_TAG_array_type, baseType: !259, size: 32, elements: !261)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !260, line: 22, baseType: !189)
!260 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!261 = !{!262}
!262 = !DISubrange(count: 1)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !218, file: !257, line: 44, type: !265, isLocal: true, isDefinition: true)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !266, line: 43, size: 32, elements: !267)
!266 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!267 = !{!268}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !265, file: !266, line: 52, baseType: !22, size: 32)
!269 = !DIGlobalVariableExpression(var: !270, expr: !DIExpression())
!270 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !218, file: !257, line: 49, type: !265, isLocal: true, isDefinition: true)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !218, file: !257, line: 36, type: !273, isLocal: true, isDefinition: true)
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 128, elements: !261)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !222, line: 114, size: 128, elements: !275)
!275 = !{!276, !277, !278, !279}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !274, file: !222, line: 115, baseType: !221, size: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !274, file: !222, line: 141, baseType: !195, size: 8, offset: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !274, file: !222, line: 149, baseType: !152, size: 32, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !274, file: !222, line: 156, baseType: !152, size: 32, offset: 96)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !218, file: !257, line: 40, type: !273, isLocal: true, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !218, file: !257, line: 28, type: !284, isLocal: true, isDefinition: true)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !242, line: 40, baseType: !285)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !242, line: 35, size: 64, elements: !286)
!286 = !{!287, !289}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !285, file: !242, line: 36, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !285, file: !242, line: 37, baseType: !288, size: 32, offset: 32)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !291, file: !203, line: 17, baseType: !118, size: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !291, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!295 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!296 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !299, file: !328, line: 50, type: !315, isLocal: true, isDefinition: true)
!299 = distinct !DICompileUnit(language: DW_LANG_C99, file: !300, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !220, retainedTypes: !301, globals: !325, splitDebugInlining: false, nameTableKind: None)
!300 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/pytest")
!301 = !{!302, !233, !185, !107, !106, !152, !252, !304, !193, !315, !316}
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !303)
!303 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !306, line: 45, size: 64, elements: !307)
!306 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = !{!308, !314}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !305, file: !306, line: 46, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !242, line: 33, baseType: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !242, line: 29, size: 32, elements: !311)
!311 = !{!312}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !310, file: !242, line: 30, baseType: !313, size: 32)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !305, file: !306, line: 48, baseType: !152, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 32)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !306, line: 38, size: 64, elements: !318)
!318 = !{!319, !320}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !317, file: !306, line: 39, baseType: !309, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !317, file: !306, line: 41, baseType: !321, size: 32, offset: 32)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !306, line: 35, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !315}
!325 = !{!326, !332, !340, !297, !342, !352}
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "latency_lock", scope: !299, file: !328, line: 44, type: !329, isLocal: true, isDefinition: true)
!328 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !266, line: 43, size: 32, elements: !330)
!330 = !{!331}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !329, file: !266, line: 52, baseType: !22, size: 32)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !299, file: !328, line: 46, type: !334, isLocal: true, isDefinition: true)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !242, line: 40, baseType: !335)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !242, line: 35, size: 64, elements: !336)
!336 = !{!337, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !335, file: !242, line: 36, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !335, file: !242, line: 37, baseType: !338, size: 32, offset: 32)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "latency_subs", scope: !299, file: !328, line: 52, type: !334, isLocal: true, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !299, file: !328, line: 39, type: !344, isLocal: true, isDefinition: true)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, elements: !350)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 35, size: 96, elements: !346)
!346 = !{!347, !348, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !345, file: !328, line: 36, baseType: !221, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !345, file: !328, line: 37, baseType: !195, size: 8, offset: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !345, file: !328, line: 38, baseType: !259, size: 32, offset: 64)
!350 = !{!351}
!351 = !DISubrange(count: 0)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !299, file: !328, line: 48, type: !315, isLocal: true, isDefinition: true)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !356, file: !363, line: 47, type: !377, isLocal: true, isDefinition: true)
!356 = distinct !DICompileUnit(language: DW_LANG_C99, file: !357, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !358, retainedTypes: !359, globals: !360, splitDebugInlining: false, nameTableKind: None)
!357 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/pytest")
!358 = !{!221}
!359 = !{!185, !107}
!360 = !{!361, !354, !373}
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "cpus_states", scope: !356, file: !363, line: 50, type: !364, isLocal: true, isDefinition: true)
!363 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 32, elements: !261)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !222, line: 114, size: 128, elements: !368)
!368 = !{!369, !370, !371, !372}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !367, file: !222, line: 115, baseType: !221, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !367, file: !222, line: 141, baseType: !195, size: 8, offset: 32)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !367, file: !222, line: 149, baseType: !152, size: 32, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !367, file: !222, line: 156, baseType: !152, size: 32, offset: 96)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !356, file: !363, line: 55, type: !375, isLocal: true, isDefinition: true)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !376, size: 8, elements: !261)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !366, elements: !350)
!378 = !DIGlobalVariableExpression(var: !379, expr: !DIExpression())
!379 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !380, file: !387, line: 17, type: !530, isLocal: false, isDefinition: true)
!380 = distinct !DICompileUnit(language: DW_LANG_C99, file: !381, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !382, globals: !383, splitDebugInlining: false, nameTableKind: None)
!381 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/pytest")
!382 = !{!185, !107, !152, !106}
!383 = !{!378, !384, !526}
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !386, file: !387, line: 198, type: !514, isLocal: true, isDefinition: true)
!386 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !387, file: !387, line: 175, type: !388, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !380, retainedNodes: !509)
!387 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!388 = !DISubroutineType(types: !389)
!389 = !{null, !390}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !392, line: 245, size: 1280, elements: !393)
!392 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!393 = !{!394, !459, !472, !473, !474, !478, !479, !485, !504}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !391, file: !392, line: 247, baseType: !395, size: 384)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !392, line: 57, size: 384, elements: !396)
!396 = !{!397, !425, !433, !434, !435, !446, !447, !448}
!397 = !DIDerivedType(tag: DW_TAG_member, scope: !395, file: !392, line: 60, baseType: !398, size: 64)
!398 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !395, file: !392, line: 60, size: 64, elements: !399)
!399 = !{!400, !416}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !398, file: !392, line: 61, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !402, line: 49, baseType: !403)
!402 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !402, line: 37, size: 64, elements: !404)
!404 = !{!405, !411}
!405 = !DIDerivedType(tag: DW_TAG_member, scope: !403, file: !402, line: 38, baseType: !406, size: 32)
!406 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !403, file: !402, line: 38, size: 32, elements: !407)
!407 = !{!408, !410}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !406, file: !402, line: 39, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !406, file: !402, line: 40, baseType: !409, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, scope: !403, file: !402, line: 42, baseType: !412, size: 32, offset: 32)
!412 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !403, file: !402, line: 42, size: 32, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !412, file: !402, line: 43, baseType: !409, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !412, file: !402, line: 44, baseType: !409, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !398, file: !392, line: 62, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !418, line: 49, size: 64, elements: !419)
!418 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!419 = !{!420}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !417, file: !418, line: 50, baseType: !421, size: 64)
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 64, elements: !423)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 32)
!423 = !{!424}
!424 = !DISubrange(count: 2)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !395, file: !392, line: 68, baseType: !426, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !428, line: 233, baseType: !429)
!428 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !428, line: 231, size: 64, elements: !430)
!430 = !{!431}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !429, file: !428, line: 232, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !402, line: 48, baseType: !403)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !395, file: !392, line: 71, baseType: !195, size: 8, offset: 96)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !395, file: !392, line: 74, baseType: !195, size: 8, offset: 104)
!435 = !DIDerivedType(tag: DW_TAG_member, scope: !395, file: !392, line: 90, baseType: !436, size: 16, offset: 112)
!436 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !395, file: !392, line: 90, size: 16, elements: !437)
!437 = !{!438, !445}
!438 = !DIDerivedType(tag: DW_TAG_member, scope: !436, file: !392, line: 91, baseType: !439, size: 16)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !436, file: !392, line: 91, size: 16, elements: !440)
!440 = !{!441, !444}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !439, file: !392, line: 96, baseType: !442, size: 8)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !443)
!443 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !439, file: !392, line: 97, baseType: !195, size: 8, offset: 8)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !436, file: !392, line: 100, baseType: !197, size: 16)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !395, file: !392, line: 107, baseType: !152, size: 32, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !395, file: !392, line: 127, baseType: !106, size: 32, offset: 160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !395, file: !392, line: 131, baseType: !449, size: 192, offset: 192)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !428, line: 244, size: 192, elements: !450)
!450 = !{!451, !452, !458}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !449, file: !428, line: 245, baseType: !401, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !449, file: !428, line: 246, baseType: !453, size: 32, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !428, line: 242, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 32)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !457}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !449, file: !428, line: 249, baseType: !235, size: 64, offset: 128)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !391, file: !392, line: 250, baseType: !460, size: 288, offset: 384)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !461, line: 25, size: 288, elements: !462)
!461 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470, !471}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !460, file: !461, line: 26, baseType: !152, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !460, file: !461, line: 27, baseType: !152, size: 32, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !460, file: !461, line: 28, baseType: !152, size: 32, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !460, file: !461, line: 29, baseType: !152, size: 32, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !460, file: !461, line: 30, baseType: !152, size: 32, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !460, file: !461, line: 31, baseType: !152, size: 32, offset: 160)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !460, file: !461, line: 32, baseType: !152, size: 32, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !460, file: !461, line: 33, baseType: !152, size: 32, offset: 224)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !460, file: !461, line: 34, baseType: !152, size: 32, offset: 256)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !391, file: !392, line: 253, baseType: !106, size: 32, offset: 672)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !391, file: !392, line: 256, baseType: !427, size: 64, offset: 704)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !391, file: !392, line: 279, baseType: !475, size: 256, offset: 768)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 256, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !391, file: !392, line: 294, baseType: !107, size: 32, offset: 1024)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !391, file: !392, line: 300, baseType: !480, size: 96, offset: 1056)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !392, line: 149, size: 96, elements: !481)
!481 = !{!482, !483, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !480, file: !392, line: 153, baseType: !22, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !480, file: !392, line: 162, baseType: !185, size: 32, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !480, file: !392, line: 168, baseType: !185, size: 32, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !391, file: !392, line: 325, baseType: !486, size: 32, offset: 1152)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 32)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !488, line: 5073, size: 192, elements: !489)
!488 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!489 = !{!490, !499, !500}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !487, file: !488, line: 5074, baseType: !491, size: 96)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !492, line: 56, size: 96, elements: !493)
!492 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!493 = !{!494, !497, !498}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !491, file: !492, line: 57, baseType: !495, size: 32)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 32)
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !492, line: 57, flags: DIFlagFwdDecl)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !491, file: !492, line: 58, baseType: !106, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !491, file: !492, line: 59, baseType: !185, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !487, file: !488, line: 5075, baseType: !427, size: 64, offset: 96)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !487, file: !488, line: 5076, baseType: !501, size: 32, offset: 160)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !266, line: 43, size: 32, elements: !502)
!502 = !{!503}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !501, file: !266, line: 52, baseType: !22, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !391, file: !392, line: 343, baseType: !505, size: 64, offset: 1184)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !461, line: 60, size: 64, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !505, file: !461, line: 63, baseType: !152, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !505, file: !461, line: 66, baseType: !152, size: 32, offset: 32)
!509 = !{!510, !511, !512, !513}
!510 = !DILocalVariable(name: "thread", arg: 1, scope: !386, file: !387, line: 175, type: !390)
!511 = !DILocalVariable(name: "region_num", scope: !386, file: !387, line: 200, type: !195)
!512 = !DILocalVariable(name: "guard_start", scope: !386, file: !387, line: 265, type: !22)
!513 = !DILocalVariable(name: "guard_size", scope: !386, file: !387, line: 266, type: !185)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 96, elements: !261)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !516, line: 52, size: 96, elements: !517)
!516 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!517 = !{!518, !519, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !515, file: !516, line: 53, baseType: !22, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !515, file: !516, line: 54, baseType: !185, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !515, file: !516, line: 55, baseType: !521, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !522, line: 151, baseType: !523)
!522 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 149, size: 32, elements: !524)
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !523, file: !522, line: 150, baseType: !152, size: 32)
!526 = !DIGlobalVariableExpression(var: !527, expr: !DIExpression())
!527 = distinct !DIGlobalVariable(name: "static_regions", scope: !380, file: !387, line: 62, type: !528, isLocal: true, isDefinition: true)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 96, elements: !261)
!529 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !515)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !531, file: !203, line: 17, baseType: !118, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !531, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!535 = !DIGlobalVariableExpression(var: !536, expr: !DIExpression())
!536 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !537, file: !571, line: 39, type: !195, isLocal: true, isDefinition: true)
!537 = distinct !DICompileUnit(language: DW_LANG_C99, file: !538, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !539, globals: !570, splitDebugInlining: false, nameTableKind: None)
!538 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/pytest")
!539 = !{!540, !106, !107, !558, !195}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !542, line: 1226, baseType: !543)
!542 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !542, line: 1213, size: 352, elements: !544)
!544 = !{!545, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !543, file: !542, line: 1215, baseType: !546, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !547)
!547 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !152)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !543, file: !542, line: 1216, baseType: !547, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !543, file: !542, line: 1217, baseType: !547, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !543, file: !542, line: 1218, baseType: !547, size: 32, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !543, file: !542, line: 1219, baseType: !547, size: 32, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !543, file: !542, line: 1220, baseType: !547, size: 32, offset: 160)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !543, file: !542, line: 1221, baseType: !547, size: 32, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !543, file: !542, line: 1222, baseType: !547, size: 32, offset: 224)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !543, file: !542, line: 1223, baseType: !547, size: 32, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !543, file: !542, line: 1224, baseType: !547, size: 32, offset: 288)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !543, file: !542, line: 1225, baseType: !547, size: 32, offset: 320)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !560)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !561, line: 27, size: 96, elements: !562)
!561 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!562 = !{!563, !564, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !560, file: !561, line: 29, baseType: !152, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !560, file: !561, line: 31, baseType: !118, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !560, file: !561, line: 37, baseType: !566, size: 32, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !522, line: 146, baseType: !567)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !522, line: 141, size: 32, elements: !568)
!568 = !{!569}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !567, file: !522, line: 143, baseType: !152, size: 32)
!570 = !{!535}
!571 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !574, file: !581, line: 21, type: !213, isLocal: true, isDefinition: true)
!574 = distinct !DICompileUnit(language: DW_LANG_C99, file: !575, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !576, globals: !580, splitDebugInlining: false, nameTableKind: None)
!575 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/pytest")
!576 = !{!577, !107, !106}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !579, line: 22, baseType: !107)
!579 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!580 = !{!572}
!581 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !584, file: !589, line: 13, type: !606, isLocal: true, isDefinition: true)
!584 = distinct !DICompileUnit(language: DW_LANG_C99, file: !585, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !586, splitDebugInlining: false, nameTableKind: None)
!585 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/pytest")
!586 = !{!587, !582}
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "mpu_config", scope: !584, file: !589, line: 37, type: !590, isLocal: false, isDefinition: true)
!589 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!590 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !561, line: 41, size: 64, elements: !592)
!592 = !{!593, !594}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !591, file: !561, line: 43, baseType: !152, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !591, file: !561, line: 45, baseType: !595, size: 32, offset: 32)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !561, line: 27, size: 96, elements: !598)
!598 = !{!599, !600, !601}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !597, file: !561, line: 29, baseType: !152, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !597, file: !561, line: 31, baseType: !118, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !597, file: !561, line: 37, baseType: !602, size: 32, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !522, line: 146, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !522, line: 141, size: 32, elements: !604)
!604 = !{!605}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !603, file: !522, line: 143, baseType: !152, size: 32)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !596, size: 192, elements: !423)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !609, file: !767, line: 48, type: !784, isLocal: false, isDefinition: true)
!609 = distinct !DICompileUnit(language: DW_LANG_C99, file: !610, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !611, globals: !764, splitDebugInlining: false, nameTableKind: None)
!610 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/pytest")
!611 = !{!612, !195, !106, !107, !686, !152, !687, !723, !734}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !614, line: 882, baseType: !615)
!614 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !614, line: 850, size: 19456, elements: !616)
!616 = !{!617, !621, !622, !623, !627, !628, !630, !631, !632, !636, !637, !638, !642, !643, !647, !648, !652, !653, !657, !658, !659, !660, !661, !662, !666, !667, !671, !672, !676}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !615, file: !614, line: 851, baseType: !618, size: 960)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 960, elements: !619)
!619 = !{!620}
!620 = !DISubrange(count: 30)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !615, file: !614, line: 852, baseType: !547, size: 32, offset: 960)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !615, file: !614, line: 853, baseType: !547, size: 32, offset: 992)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !615, file: !614, line: 854, baseType: !624, size: 1088, offset: 1024)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 1088, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 34)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !615, file: !614, line: 855, baseType: !547, size: 32, offset: 2112)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !615, file: !614, line: 856, baseType: !629, size: 64, offset: 2144)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 64, elements: !423)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !615, file: !614, line: 857, baseType: !547, size: 32, offset: 2208)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !615, file: !614, line: 858, baseType: !547, size: 32, offset: 2240)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !615, file: !614, line: 859, baseType: !633, size: 3904, offset: 2272)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 3904, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 122)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !615, file: !614, line: 860, baseType: !547, size: 32, offset: 6176)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !615, file: !614, line: 861, baseType: !547, size: 32, offset: 6208)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !615, file: !614, line: 862, baseType: !639, size: 1952, offset: 6240)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 1952, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 61)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !615, file: !614, line: 863, baseType: !547, size: 32, offset: 8192)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !615, file: !614, line: 864, baseType: !644, size: 288, offset: 8224)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 288, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 9)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !615, file: !614, line: 865, baseType: !546, size: 32, offset: 8512)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !615, file: !614, line: 866, baseType: !649, size: 1696, offset: 8544)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 1696, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 53)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !615, file: !614, line: 867, baseType: !547, size: 32, offset: 10240)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !615, file: !614, line: 868, baseType: !654, size: 96, offset: 10272)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 96, elements: !655)
!655 = !{!656}
!656 = !DISubrange(count: 3)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !615, file: !614, line: 869, baseType: !547, size: 32, offset: 10368)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !615, file: !614, line: 870, baseType: !629, size: 64, offset: 10400)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !615, file: !614, line: 871, baseType: !547, size: 32, offset: 10464)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !615, file: !614, line: 872, baseType: !547, size: 32, offset: 10496)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !615, file: !614, line: 873, baseType: !547, size: 32, offset: 10528)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !615, file: !614, line: 875, baseType: !663, size: 352, offset: 10560)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 352, elements: !664)
!664 = !{!665}
!665 = !DISubrange(count: 11)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !615, file: !614, line: 876, baseType: !547, size: 32, offset: 10912)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !615, file: !614, line: 878, baseType: !668, size: 256, offset: 10944)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 256, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 8)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !615, file: !614, line: 879, baseType: !547, size: 32, offset: 11200)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !615, file: !614, line: 880, baseType: !673, size: 7200, offset: 11232)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 7200, elements: !674)
!674 = !{!675}
!675 = !DISubrange(count: 225)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !615, file: !614, line: 881, baseType: !677, size: 1024, offset: 18432)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 1024, elements: !669)
!678 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !614, line: 258, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !614, line: 252, size: 128, elements: !681)
!681 = !{!682, !683, !684, !685}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !680, file: !614, line: 253, baseType: !547, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !680, file: !614, line: 254, baseType: !547, size: 32, offset: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !680, file: !614, line: 255, baseType: !547, size: 32, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !680, file: !614, line: 257, baseType: !546, size: 32, offset: 96)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !542, line: 468, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !542, line: 445, size: 1120, elements: !690)
!690 = !{!691, !692, !693, !694, !695, !696, !697, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !716, !720, !722}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !689, file: !542, line: 447, baseType: !546, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !689, file: !542, line: 448, baseType: !547, size: 32, offset: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !689, file: !542, line: 449, baseType: !547, size: 32, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !689, file: !542, line: 450, baseType: !547, size: 32, offset: 96)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !689, file: !542, line: 451, baseType: !547, size: 32, offset: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !689, file: !542, line: 452, baseType: !547, size: 32, offset: 160)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !689, file: !542, line: 453, baseType: !698, size: 96, offset: 192)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 96, elements: !700)
!699 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !195)
!700 = !{!701}
!701 = !DISubrange(count: 12)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !689, file: !542, line: 454, baseType: !547, size: 32, offset: 288)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !689, file: !542, line: 455, baseType: !547, size: 32, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !689, file: !542, line: 456, baseType: !547, size: 32, offset: 352)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !689, file: !542, line: 457, baseType: !547, size: 32, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !689, file: !542, line: 458, baseType: !547, size: 32, offset: 416)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !689, file: !542, line: 459, baseType: !547, size: 32, offset: 448)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !689, file: !542, line: 460, baseType: !547, size: 32, offset: 480)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !689, file: !542, line: 461, baseType: !629, size: 64, offset: 512)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !689, file: !542, line: 462, baseType: !546, size: 32, offset: 576)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !689, file: !542, line: 463, baseType: !546, size: 32, offset: 608)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !689, file: !542, line: 464, baseType: !713, size: 128, offset: 640)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 128, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 4)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !689, file: !542, line: 465, baseType: !717, size: 160, offset: 768)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 160, elements: !718)
!718 = !{!719}
!719 = !DISubrange(count: 5)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !689, file: !542, line: 466, baseType: !721, size: 160, offset: 928)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !152, size: 160, elements: !718)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !689, file: !542, line: 467, baseType: !547, size: 32, offset: 1088)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !725, file: !724, line: 167, baseType: !733)
!724 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!725 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !724, file: !724, line: 134, type: !726, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !609, retainedNodes: !728)
!726 = !DISubroutineType(types: !727)
!727 = !{null, !152}
!728 = !{!729, !730, !732}
!729 = !DILocalVariable(name: "time_us", arg: 1, scope: !725, file: !724, line: 134, type: !152)
!730 = !DILocalVariable(name: "delay_cycles", scope: !725, file: !724, line: 168, type: !731)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !723)
!732 = !DILocalVariable(name: "cycles", scope: !725, file: !724, line: 171, type: !152)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !614, line: 2140, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !614, line: 2119, size: 10880, elements: !737)
!737 = !{!738, !742, !743, !747, !748, !753, !754, !755, !756, !760, !761, !762, !763}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !736, file: !614, line: 2120, baseType: !739, size: 8192)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 8192, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !736, file: !614, line: 2121, baseType: !546, size: 32, offset: 8192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !736, file: !614, line: 2122, baseType: !744, size: 2048, offset: 8224)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 2048, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !736, file: !614, line: 2123, baseType: !547, size: 32, offset: 10272)
!748 = !DIDerivedType(tag: DW_TAG_member, scope: !736, file: !614, line: 2125, baseType: !749, size: 32, offset: 10304)
!749 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !736, file: !614, line: 2125, size: 32, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !749, file: !614, line: 2126, baseType: !547, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !749, file: !614, line: 2127, baseType: !547, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !736, file: !614, line: 2130, baseType: !547, size: 32, offset: 10336)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !736, file: !614, line: 2131, baseType: !547, size: 32, offset: 10368)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !736, file: !614, line: 2133, baseType: !547, size: 32, offset: 10400)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !736, file: !614, line: 2135, baseType: !757, size: 320, offset: 10432)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 320, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 10)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !736, file: !614, line: 2136, baseType: !547, size: 32, offset: 10752)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !736, file: !614, line: 2137, baseType: !546, size: 32, offset: 10784)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !736, file: !614, line: 2138, baseType: !547, size: 32, offset: 10816)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !736, file: !614, line: 2139, baseType: !547, size: 32, offset: 10848)
!764 = !{!607, !765, !780}
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !609, file: !767, line: 93, type: !768, isLocal: true, isDefinition: true, align: 32)
!767 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !770, line: 51, size: 64, elements: !771)
!770 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!771 = !{!772, !779}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !769, file: !770, line: 60, baseType: !773, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = !DISubroutineType(types: !775)
!775 = !{!107, !776}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !778)
!778 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !770, line: 48, flags: DIFlagFwdDecl)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !769, file: !770, line: 65, baseType: !776, size: 32, offset: 32)
!780 = !DIGlobalVariableExpression(var: !781, expr: !DIExpression())
!781 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !725, file: !724, line: 161, type: !782, isLocal: true, isDefinition: true, align: 128)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 48, elements: !655)
!783 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!784 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !203, line: 16, size: 64, elements: !786)
!786 = !{!787, !788}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !785, file: !203, line: 17, baseType: !118, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !785, file: !203, line: 18, baseType: !195, size: 8, offset: 32)
!789 = !DIGlobalVariableExpression(var: !790, expr: !DIExpression())
!790 = distinct !DIGlobalVariable(name: "phase", scope: !791, file: !795, line: 61, type: !794, isLocal: false, isDefinition: true)
!791 = distinct !DICompileUnit(language: DW_LANG_C99, file: !792, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !793, retainedTypes: !820, globals: !826, splitDebugInlining: false, nameTableKind: None)
!792 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/testsuite/ztest/src/ztest_new.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/pytest")
!793 = !{!794, !803, !811, !30, !816}
!794 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_phase", file: !795, line: 40, baseType: !32, size: 32, elements: !796)
!795 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/src/ztest_new.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!796 = !{!797, !798, !799, !800, !801, !802}
!797 = !DIEnumerator(name: "TEST_PHASE_SETUP", value: 0)
!798 = !DIEnumerator(name: "TEST_PHASE_BEFORE", value: 1)
!799 = !DIEnumerator(name: "TEST_PHASE_TEST", value: 2)
!800 = !DIEnumerator(name: "TEST_PHASE_AFTER", value: 3)
!801 = !DIEnumerator(name: "TEST_PHASE_TEARDOWN", value: 4)
!802 = !DIEnumerator(name: "TEST_PHASE_FRAMEWORK", value: 5)
!803 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_result", file: !795, line: 226, baseType: !32, size: 32, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !810}
!805 = !DIEnumerator(name: "ZTEST_RESULT_PENDING", value: 0)
!806 = !DIEnumerator(name: "ZTEST_RESULT_PASS", value: 1)
!807 = !DIEnumerator(name: "ZTEST_RESULT_FAIL", value: 2)
!808 = !DIEnumerator(name: "ZTEST_RESULT_SKIP", value: 3)
!809 = !DIEnumerator(name: "ZTEST_RESULT_SUITE_SKIP", value: 4)
!810 = !DIEnumerator(name: "ZTEST_RESULT_SUITE_FAIL", value: 5)
!811 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_status", file: !795, line: 52, baseType: !32, size: 32, elements: !812)
!812 = !{!813, !814, !815}
!813 = !DIEnumerator(name: "ZTEST_STATUS_OK", value: 0)
!814 = !DIEnumerator(name: "ZTEST_STATUS_HAS_FAILURE", value: 1)
!815 = !DIEnumerator(name: "ZTEST_STATUS_CRITICAL_ERROR", value: 2)
!816 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ztest_expected_result", file: !114, line: 36, baseType: !32, size: 32, elements: !817)
!817 = !{!818, !819}
!818 = !DIEnumerator(name: "ZTEST_EXPECTED_RESULT_FAIL", value: 0)
!819 = !DIEnumerator(name: "ZTEST_EXPECTED_RESULT_SKIP", value: 1)
!820 = !{!106, !107, !185, !821, !233, !152, !252}
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !822, line: 46, baseType: !823)
!822 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DISubroutineType(types: !825)
!825 = !{null, !106, !106, !106}
!826 = !{!789, !827, !829, !831, !840, !842, !946, !949}
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "test_result", scope: !791, file: !795, line: 234, type: !803, isLocal: true, isDefinition: true)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "current_test_failed_assumption", scope: !791, file: !795, line: 294, type: !145, isLocal: true, isDefinition: true)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "ztest_thread_stack", scope: !791, file: !795, line: 430, type: !833, isLocal: false, isDefinition: true, align: 512)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !834, size: 8704, elements: !838)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !835, line: 47, size: 8, elements: !836)
!835 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!836 = !{!837}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !834, file: !835, line: 48, baseType: !120, size: 8)
!838 = !{!839}
!839 = !DISubrange(count: 1088)
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "test_status", scope: !791, file: !795, line: 63, type: !811, isLocal: true, isDefinition: true)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "ztest_thread", scope: !791, file: !795, line: 17, type: !844, isLocal: true, isDefinition: true)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !392, line: 245, size: 1280, elements: !845)
!845 = !{!846, !904, !916, !917, !918, !919, !920, !926, !941}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !844, file: !392, line: 247, baseType: !847, size: 384)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !392, line: 57, size: 384, elements: !848)
!848 = !{!849, !873, !880, !881, !882, !891, !892, !893}
!849 = !DIDerivedType(tag: DW_TAG_member, scope: !847, file: !392, line: 60, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !847, file: !392, line: 60, size: 64, elements: !851)
!851 = !{!852, !867}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !850, file: !392, line: 61, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !402, line: 49, baseType: !854)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !402, line: 37, size: 64, elements: !855)
!855 = !{!856, !862}
!856 = !DIDerivedType(tag: DW_TAG_member, scope: !854, file: !402, line: 38, baseType: !857, size: 32)
!857 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !854, file: !402, line: 38, size: 32, elements: !858)
!858 = !{!859, !861}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !857, file: !402, line: 39, baseType: !860, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !857, file: !402, line: 40, baseType: !860, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, scope: !854, file: !402, line: 42, baseType: !863, size: 32, offset: 32)
!863 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !854, file: !402, line: 42, size: 32, elements: !864)
!864 = !{!865, !866}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !863, file: !402, line: 43, baseType: !860, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !863, file: !402, line: 44, baseType: !860, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !850, file: !392, line: 62, baseType: !868, size: 64)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !418, line: 49, size: 64, elements: !869)
!869 = !{!870}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !868, file: !418, line: 50, baseType: !871, size: 64)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !872, size: 64, elements: !423)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !847, file: !392, line: 68, baseType: !874, size: 32, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 32)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !428, line: 233, baseType: !876)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !428, line: 231, size: 64, elements: !877)
!877 = !{!878}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !876, file: !428, line: 232, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !402, line: 48, baseType: !854)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !847, file: !392, line: 71, baseType: !195, size: 8, offset: 96)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !847, file: !392, line: 74, baseType: !195, size: 8, offset: 104)
!882 = !DIDerivedType(tag: DW_TAG_member, scope: !847, file: !392, line: 90, baseType: !883, size: 16, offset: 112)
!883 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !847, file: !392, line: 90, size: 16, elements: !884)
!884 = !{!885, !890}
!885 = !DIDerivedType(tag: DW_TAG_member, scope: !883, file: !392, line: 91, baseType: !886, size: 16)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !392, line: 91, size: 16, elements: !887)
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !886, file: !392, line: 96, baseType: !442, size: 8)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !886, file: !392, line: 97, baseType: !195, size: 8, offset: 8)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !883, file: !392, line: 100, baseType: !197, size: 16)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !847, file: !392, line: 107, baseType: !152, size: 32, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !847, file: !392, line: 127, baseType: !106, size: 32, offset: 160)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !847, file: !392, line: 131, baseType: !894, size: 192, offset: 192)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !428, line: 244, size: 192, elements: !895)
!895 = !{!896, !897, !903}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !894, file: !428, line: 245, baseType: !853, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !894, file: !428, line: 246, baseType: !898, size: 32, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !428, line: 242, baseType: !899)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 32)
!900 = !DISubroutineType(types: !901)
!901 = !{null, !902}
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !894, file: !428, line: 249, baseType: !235, size: 64, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !844, file: !392, line: 250, baseType: !905, size: 288, offset: 384)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !461, line: 25, size: 288, elements: !906)
!906 = !{!907, !908, !909, !910, !911, !912, !913, !914, !915}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !905, file: !461, line: 26, baseType: !152, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !905, file: !461, line: 27, baseType: !152, size: 32, offset: 32)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !905, file: !461, line: 28, baseType: !152, size: 32, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !905, file: !461, line: 29, baseType: !152, size: 32, offset: 96)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !905, file: !461, line: 30, baseType: !152, size: 32, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !905, file: !461, line: 31, baseType: !152, size: 32, offset: 160)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !905, file: !461, line: 32, baseType: !152, size: 32, offset: 192)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !905, file: !461, line: 33, baseType: !152, size: 32, offset: 224)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !905, file: !461, line: 34, baseType: !152, size: 32, offset: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !844, file: !392, line: 253, baseType: !106, size: 32, offset: 672)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !844, file: !392, line: 256, baseType: !875, size: 64, offset: 704)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !844, file: !392, line: 279, baseType: !475, size: 256, offset: 768)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !844, file: !392, line: 294, baseType: !107, size: 32, offset: 1024)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !844, file: !392, line: 300, baseType: !921, size: 96, offset: 1056)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !392, line: 149, size: 96, elements: !922)
!922 = !{!923, !924, !925}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !921, file: !392, line: 153, baseType: !22, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !921, file: !392, line: 162, baseType: !185, size: 32, offset: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !921, file: !392, line: 168, baseType: !185, size: 32, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !844, file: !392, line: 325, baseType: !927, size: 32, offset: 1152)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 32)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !488, line: 5073, size: 192, elements: !929)
!929 = !{!930, !936, !937}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !928, file: !488, line: 5074, baseType: !931, size: 96)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !492, line: 56, size: 96, elements: !932)
!932 = !{!933, !934, !935}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !931, file: !492, line: 57, baseType: !495, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !931, file: !492, line: 58, baseType: !106, size: 32, offset: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !931, file: !492, line: 59, baseType: !185, size: 32, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !928, file: !488, line: 5075, baseType: !875, size: 64, offset: 96)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !928, file: !488, line: 5076, baseType: !938, size: 32, offset: 160)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !266, line: 43, size: 32, elements: !939)
!939 = !{!940}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !938, file: !266, line: 52, baseType: !22, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !844, file: !392, line: 343, baseType: !942, size: 64, offset: 1184)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !461, line: 60, size: 64, elements: !943)
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !942, file: !461, line: 63, baseType: !152, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !942, file: !461, line: 66, baseType: !152, size: 32, offset: 32)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "tc_start_time", scope: !791, file: !948, line: 95, type: !152, isLocal: true, isDefinition: true)
!948 = !DIFile(filename: "zephyr/subsys/testsuite/include/zephyr/tc_util.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "tc_spend_time", scope: !791, file: !948, line: 96, type: !152, isLocal: true, isDefinition: true)
!951 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(name: "ztest_api", scope: !954, file: !957, line: 70, type: !958, isLocal: false, isDefinition: true)
!954 = distinct !DICompileUnit(language: DW_LANG_C99, file: !955, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !105, globals: !956, splitDebugInlining: false, nameTableKind: None)
!955 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/testsuite/ztest/src/ztest_defaults.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/pytest")
!956 = !{!952}
!957 = !DIFile(filename: "zephyr/subsys/testsuite/ztest/src/ztest_defaults.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!958 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_arch_api", file: !114, line: 499, size: 96, elements: !960)
!960 = !{!961, !962, !983}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "run_all", scope: !959, file: !114, line: 500, baseType: !16, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "should_suite_run", scope: !959, file: !114, line: 501, baseType: !963, size: 32, offset: 32)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 32)
!964 = !DISubroutineType(types: !965)
!965 = !{!145, !13, !966}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 32)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_node", file: !114, line: 177, size: 224, elements: !968)
!968 = !{!969, !970, !971, !972, !973, !974, !975}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !967, file: !114, line: 179, baseType: !117, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !967, file: !114, line: 182, baseType: !122, size: 32, offset: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "before", scope: !967, file: !114, line: 185, baseType: !128, size: 32, offset: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "after", scope: !967, file: !114, line: 188, baseType: !134, size: 32, offset: 96)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "teardown", scope: !967, file: !114, line: 191, baseType: !137, size: 32, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "predicate", scope: !967, file: !114, line: 194, baseType: !140, size: 32, offset: 160)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "stats", scope: !967, file: !114, line: 197, baseType: !976, size: 32, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !977)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 32)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ztest_suite_stats", file: !114, line: 114, size: 96, elements: !979)
!979 = !{!980, !981, !982}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "run_count", scope: !978, file: !114, line: 116, baseType: !152, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "skip_count", scope: !978, file: !114, line: 118, baseType: !152, size: 32, offset: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "fail_count", scope: !978, file: !114, line: 120, baseType: !152, size: 32, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "should_test_run", scope: !959, file: !114, line: 502, baseType: !984, size: 32, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DISubroutineType(types: !986)
!986 = !{!145, !118, !118}
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(name: "log_const_clock_control", scope: !989, file: !1212, line: 18, type: !1450, isLocal: false, isDefinition: true)
!989 = distinct !DICompileUnit(language: DW_LANG_C99, file: !990, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !991, retainedTypes: !1124, globals: !1208, splitDebugInlining: false, nameTableKind: None)
!990 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/pytest")
!991 = !{!992, !998, !30, !1003, !1008, !1015, !1021, !1027, !1036, !1040, !1089, !1096, !1115}
!992 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !993, line: 23, baseType: !32, size: 32, elements: !994)
!993 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!994 = !{!995, !996, !997}
!995 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!996 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!997 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!998 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !993, line: 48, baseType: !32, size: 32, elements: !999)
!999 = !{!1000, !1001, !1002}
!1000 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!1001 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!1002 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!1003 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1004, line: 167, baseType: !32, size: 32, elements: !1005)
!1004 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1005 = !{!1006, !1007}
!1006 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!1007 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!1008 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1004, line: 107, baseType: !32, size: 32, elements: !1009)
!1009 = !{!1010, !1011, !1012, !1013, !1014}
!1010 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!1011 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!1012 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!1013 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!1014 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!1015 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1004, line: 208, baseType: !32, size: 32, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020}
!1017 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!1018 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!1019 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!1020 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!1021 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1004, line: 261, baseType: !32, size: 32, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026}
!1023 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!1024 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!1025 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!1026 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!1027 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1004, line: 237, baseType: !32, size: 32, elements: !1028)
