; ModuleID = 'build/96b_meerkat96/dictionary/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.3, i8*, i32 }
%union.anon.3 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer.15 = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon.3 }
%struct.mpsc_pbuf_buffer_config.16 = type { i32*, i32, void (%struct.mpsc_pbuf_buffer.15*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }
%union.log_msg_generic = type { %struct.log_msg }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/dictionary/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/dictionary")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/dictionary")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_hello_world", scope: !27, file: !166, line: 14, type: !168, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !107, globals: !163, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/logging/dictionary/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/dictionary")
!29 = !{!30, !37}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !38, line: 27, baseType: !32, size: 32, elements: !39)
!38 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!39 = !{!40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!40 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!41 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!42 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!43 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!44 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!45 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!46 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!47 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!48 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!49 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!50 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!51 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!52 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!53 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!54 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!55 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!56 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!106 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!107 = !{!108, !109, !123, !124, !117, !125, !135, !154, !157, !158, !159, !161}
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/sys/cbprintf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !122}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !110, file: !111, line: 80, baseType: !114, size: 32)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !115)
!115 = !{!116, !119, !120, !121}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !114, file: !111, line: 47, baseType: !117, size: 8)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !118)
!118 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !114, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !114, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !114, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !110, file: !111, line: 82, baseType: !108, size: 32)
!123 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !127)
!127 = !{!128, !146, !150}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !126, file: !31, line: 89, baseType: !129, size: 96)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !130)
!130 = !{!131, !143, !144}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !129, file: !31, line: 67, baseType: !132, size: 32)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !133)
!133 = !{!134, !136, !137, !138, !139, !140, !141, !142}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !132, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !132, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !132, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !132, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !132, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !132, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !132, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !129, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !129, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !135)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !126, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 32, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 4)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !126, file: !31, line: 94, baseType: !151, offset: 128)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: -1)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!163 = !{!25, !164, !174}
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !166, line: 14, type: !167, isLocal: true, isDefinition: true)
!166 = !DIFile(filename: "zephyr/samples/subsys/logging/dictionary/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !169)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !170, line: 16, size: 64, elements: !171)
!170 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!171 = !{!172, !173}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !169, file: !170, line: 17, baseType: !154, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !169, file: !170, line: 18, baseType: !117, size: 8, offset: 32)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "hexdump_msg", scope: !27, file: !166, line: 16, type: !154, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !178, file: !231, line: 18, type: !233, isLocal: false, isDefinition: true)
!178 = distinct !DICompileUnit(language: DW_LANG_C99, file: !179, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !180, retainedTypes: !181, globals: !228, splitDebugInlining: false, nameTableKind: None)
!179 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/dictionary")
!180 = !{!30}
!181 = !{!22, !108, !24, !182, !184, !186, !187, !123, !157, !189, !159, !191, !192, !193, !194, !196, !124, !117, !207, !135, !154}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!185 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !188, line: 214, baseType: !32)
!188 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !195)
!195 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 32)
!197 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !198)
!198 = !{!199, !206}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !197, file: !111, line: 80, baseType: !200, size: 32)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !201)
!201 = !{!202, !203, !204, !205}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !200, file: !111, line: 47, baseType: !117, size: 8)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !200, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !200, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !200, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !197, file: !111, line: 82, baseType: !108, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 32)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !209)
!209 = !{!210, !226, !227}
!210 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !208, file: !31, line: 89, baseType: !211, size: 96)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !212)
!212 = !{!213, !224, !225}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !211, file: !31, line: 67, baseType: !214, size: 32)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !215)
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !214, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !214, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !214, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !214, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !214, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !214, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !214, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !214, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !211, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !211, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !208, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !208, file: !31, line: 94, baseType: !151, offset: 128)
!228 = !{!176, !229}
!229 = !DIGlobalVariableExpression(var: !230, expr: !DIExpression())
!230 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !178, file: !231, line: 18, type: !232, isLocal: true, isDefinition: true)
!231 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !234)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !170, line: 16, size: 64, elements: !235)
!235 = !{!236, !237}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !234, file: !170, line: 17, baseType: !154, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !234, file: !170, line: 18, baseType: !117, size: 8, offset: 32)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "_char_out", scope: !240, file: !245, line: 54, type: !246, isLocal: false, isDefinition: true)
!240 = distinct !DICompileUnit(language: DW_LANG_C99, file: !241, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !242, retainedTypes: !243, globals: !244, splitDebugInlining: false, nameTableKind: None)
!241 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/dictionary")
!242 = !{!37}
!243 = !{!108, !123}
!244 = !{!238}
!245 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DISubroutineType(types: !248)
!248 = !{!123, !123}
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !251, file: !665, line: 258, type: !666, isLocal: true, isDefinition: true, align: 32)
!251 = distinct !DICompileUnit(language: DW_LANG_C99, file: !252, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !253, retainedTypes: !536, globals: !664, splitDebugInlining: false, nameTableKind: None)
!252 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/dictionary")
!253 = !{!254, !286, !296, !345, !351, !472, !507}
!254 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !255, line: 54, baseType: !32, size: 32, elements: !256)
!255 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!256 = !{!257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285}
!257 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!258 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!259 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!260 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!261 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!262 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!263 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!264 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!265 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!266 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!267 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!268 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!269 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!270 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!271 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!272 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!273 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!274 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!275 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!276 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!277 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!278 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!279 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!280 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!281 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!282 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!283 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!284 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!285 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!286 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !255, line: 224, baseType: !32, size: 32, elements: !287)
!287 = !{!288, !289, !290, !291, !292, !293, !294, !295}
!288 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!289 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!290 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!291 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!292 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!293 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!294 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!295 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!296 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !255, line: 275, baseType: !32, size: 32, elements: !297)
!297 = !{!298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344}
!298 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!299 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!300 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!301 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!302 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!303 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!304 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!305 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!306 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!307 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!308 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!309 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!310 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!311 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!312 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!313 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!314 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!315 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!316 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!317 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!318 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!319 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!320 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!321 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!322 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!323 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!324 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!325 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!326 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!327 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!328 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!329 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!330 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!331 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!332 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!333 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!334 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!335 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!336 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!337 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!338 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!339 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!340 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!341 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!342 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!343 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!344 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!345 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !255, line: 327, baseType: !32, size: 32, elements: !346)
!346 = !{!347, !348, !349, !350}
!347 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!348 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!349 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!350 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!351 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !352, line: 76, baseType: !32, size: 32, elements: !353)
!352 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!353 = !{!354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471}
!354 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!355 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!356 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!357 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!358 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!359 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!360 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!361 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!362 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!363 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!364 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!365 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!366 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!367 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!368 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!369 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!370 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!371 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!372 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!373 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!374 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!375 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!376 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!377 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!378 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!379 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!380 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!381 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!382 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!383 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!384 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!385 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!386 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!387 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!388 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!389 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!390 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!391 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!392 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!393 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!394 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!395 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!396 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!397 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!398 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!399 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!400 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!401 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!402 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!403 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!404 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!405 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!406 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!407 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!408 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!409 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!410 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!411 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!412 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!413 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!414 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!415 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!416 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!417 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!418 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!419 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!420 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!421 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!422 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!423 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!424 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!425 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!426 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!427 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!428 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!429 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!430 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!431 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!432 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!433 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!434 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!435 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!436 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!437 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!438 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!439 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!440 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!441 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!442 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!443 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!444 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!445 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!446 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!447 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!448 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!449 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!450 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!451 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!452 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!453 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!454 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!455 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!456 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!457 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!458 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!459 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!460 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!461 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!462 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!463 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!464 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!465 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!466 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!467 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!468 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!469 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!470 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!471 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!472 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !255, line: 237, baseType: !32, size: 32, elements: !473)
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506}
!474 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!475 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!476 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!477 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!478 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!479 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!480 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!481 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!482 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!483 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!484 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!485 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!486 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!487 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!488 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!489 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!490 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!491 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!492 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!493 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!494 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!495 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!496 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!497 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!498 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!499 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!500 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!501 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!502 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!503 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!504 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!505 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!506 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!507 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !352, line: 44, baseType: !32, size: 32, elements: !508)
!508 = !{!509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535}
!509 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!510 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!511 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!512 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!513 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!514 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!515 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!516 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!517 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!518 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!519 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!520 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!521 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!522 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!523 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!524 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!525 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!526 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!527 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!528 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!529 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!530 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!531 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!532 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!533 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!534 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!535 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!536 = !{!537, !609, !652, !663, !135}
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !539, line: 4575, baseType: !540)
!539 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 4532, size: 390144, elements: !541)
!541 = !{!542, !544, !545, !546, !547, !551, !561, !565, !575, !579}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !540, file: !539, line: 4533, baseType: !543, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !135)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !540, file: !539, line: 4534, baseType: !543, size: 32, offset: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !540, file: !539, line: 4535, baseType: !543, size: 32, offset: 64)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !540, file: !539, line: 4536, baseType: !543, size: 32, offset: 96)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !540, file: !539, line: 4537, baseType: !548, size: 16256, offset: 128)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 16256, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 2032)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !540, file: !539, line: 4543, baseType: !552, size: 4224, offset: 16384)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 4224, elements: !559)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !540, file: !539, line: 4538, size: 128, elements: !554)
!554 = !{!555, !556, !557, !558}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !553, file: !539, line: 4539, baseType: !543, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_SET", scope: !553, file: !539, line: 4540, baseType: !543, size: 32, offset: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_CLR", scope: !553, file: !539, line: 4541, baseType: !543, size: 32, offset: 64)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_TOG", scope: !553, file: !539, line: 4542, baseType: !543, size: 32, offset: 96)
!559 = !{!560}
!560 = !DISubrange(count: 33)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !540, file: !539, line: 4544, baseType: !562, size: 110464, offset: 20608)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 110464, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 13808)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !540, file: !539, line: 4550, baseType: !566, size: 24448, offset: 131072)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 24448, elements: !573)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !540, file: !539, line: 4545, size: 128, elements: !568)
!568 = !{!569, !570, !571, !572}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !567, file: !539, line: 4546, baseType: !543, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_SET", scope: !567, file: !539, line: 4547, baseType: !543, size: 32, offset: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_CLR", scope: !567, file: !539, line: 4548, baseType: !543, size: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_TOG", scope: !567, file: !539, line: 4549, baseType: !543, size: 32, offset: 96)
!573 = !{!574}
!574 = !DISubrange(count: 191)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !540, file: !539, line: 4551, baseType: !576, size: 106624, offset: 155520)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 106624, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 13328)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !540, file: !539, line: 4574, baseType: !580, size: 128000, offset: 262144)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 128000, elements: !607)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !540, file: !539, line: 4552, size: 1024, elements: !582)
!582 = !{!583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !603, !604, !605, !606}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT", scope: !581, file: !539, line: 4553, baseType: !543, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_SET", scope: !581, file: !539, line: 4554, baseType: !543, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_CLR", scope: !581, file: !539, line: 4555, baseType: !543, size: 32, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_TOG", scope: !581, file: !539, line: 4556, baseType: !543, size: 32, offset: 96)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "MISC", scope: !581, file: !539, line: 4557, baseType: !543, size: 32, offset: 128)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_SET", scope: !581, file: !539, line: 4558, baseType: !543, size: 32, offset: 160)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_CLR", scope: !581, file: !539, line: 4559, baseType: !543, size: 32, offset: 192)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_TOG", scope: !581, file: !539, line: 4560, baseType: !543, size: 32, offset: 224)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "POST", scope: !581, file: !539, line: 4561, baseType: !543, size: 32, offset: 256)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_SET", scope: !581, file: !539, line: 4562, baseType: !543, size: 32, offset: 288)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_CLR", scope: !581, file: !539, line: 4563, baseType: !543, size: 32, offset: 320)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_TOG", scope: !581, file: !539, line: 4564, baseType: !543, size: 32, offset: 352)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "PRE", scope: !581, file: !539, line: 4565, baseType: !543, size: 32, offset: 384)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_SET", scope: !581, file: !539, line: 4566, baseType: !543, size: 32, offset: 416)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_CLR", scope: !581, file: !539, line: 4567, baseType: !543, size: 32, offset: 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_TOG", scope: !581, file: !539, line: 4568, baseType: !543, size: 32, offset: 480)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !581, file: !539, line: 4569, baseType: !600, size: 384, offset: 512)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 384, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 48)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL", scope: !581, file: !539, line: 4570, baseType: !543, size: 32, offset: 896)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_SET", scope: !581, file: !539, line: 4571, baseType: !543, size: 32, offset: 928)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_CLR", scope: !581, file: !539, line: 4572, baseType: !543, size: 32, offset: 960)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !581, file: !539, line: 4573, baseType: !543, size: 32, offset: 992)
!607 = !{!608}
!608 = !DISubrange(count: 125)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDC_Type", file: !539, line: 38320, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 38303, size: 23040, elements: !612)
!612 = !{!613, !615, !619, !620, !621, !622, !626, !630, !634, !638, !642}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "VIR", scope: !611, file: !539, line: 38304, baseType: !614, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !611, file: !539, line: 38305, baseType: !616, size: 256, offset: 32)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 256, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "STAT", scope: !611, file: !539, line: 38306, baseType: !543, size: 32, offset: 288)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "INTCTRL", scope: !611, file: !539, line: 38307, baseType: !543, size: 32, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "INTSTAT", scope: !611, file: !539, line: 38308, baseType: !543, size: 32, offset: 352)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !611, file: !539, line: 38309, baseType: !623, size: 3712, offset: 384)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 3712, elements: !624)
!624 = !{!625}
!625 = !DISubrange(count: 464)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "MDA", scope: !611, file: !539, line: 38310, baseType: !627, size: 864, offset: 4096)
!627 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 864, elements: !628)
!628 = !{!629}
!629 = !DISubrange(count: 27)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !611, file: !539, line: 38311, baseType: !631, size: 3232, offset: 4960)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 3232, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 404)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "PDAP", scope: !611, file: !539, line: 38312, baseType: !635, size: 3776, offset: 8192)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 3776, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 118)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_3", scope: !611, file: !539, line: 38313, baseType: !639, size: 4416, offset: 11968)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 4416, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 552)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "MR", scope: !611, file: !539, line: 38319, baseType: !643, size: 6656, offset: 16384)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 6656, elements: !650)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !611, file: !539, line: 38314, size: 128, elements: !645)
!645 = !{!646, !647, !648, !649}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "MRSA", scope: !644, file: !539, line: 38315, baseType: !543, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "MREA", scope: !644, file: !539, line: 38316, baseType: !543, size: 32, offset: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "MRC", scope: !644, file: !539, line: 38317, baseType: !543, size: 32, offset: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "MRVS", scope: !644, file: !539, line: 38318, baseType: !543, size: 32, offset: 96)
!650 = !{!651}
!651 = !DISubrange(count: 52)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "WDOG_Type", file: !539, line: 43319, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !539, line: 43313, size: 80, elements: !655)
!655 = !{!656, !658, !659, !661, !662}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "WCR", scope: !654, file: !539, line: 43314, baseType: !657, size: 16)
!657 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !194)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "WSR", scope: !654, file: !539, line: 43315, baseType: !657, size: 16, offset: 16)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "WRSR", scope: !654, file: !539, line: 43316, baseType: !660, size: 16, offset: 32)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !657)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "WICR", scope: !654, file: !539, line: 43317, baseType: !657, size: 16, offset: 48)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "WMCR", scope: !654, file: !539, line: 43318, baseType: !657, size: 16, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!664 = !{!249}
!665 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!666 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !668, line: 51, size: 64, elements: !669)
!668 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!669 = !{!670, !677}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !667, file: !668, line: 60, baseType: !671, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = !DISubroutineType(types: !673)
!673 = !{!123, !674}
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !676)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !668, line: 48, flags: DIFlagFwdDecl)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !667, file: !668, line: 65, baseType: !674, size: 32, offset: 32)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "log_const_log", scope: !680, file: !759, line: 25, type: !988, isLocal: false, isDefinition: true)
!680 = distinct !DICompileUnit(language: DW_LANG_C99, file: !681, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !682, retainedTypes: !688, globals: !756, splitDebugInlining: false, nameTableKind: None)
!681 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/dictionary")
!682 = !{!683, !30, !37}
!683 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !684, line: 33, baseType: !32, size: 32, elements: !685)
!684 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!685 = !{!686, !687}
!686 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!687 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!688 = !{!187, !123, !108, !689, !124, !158, !117, !700, !135, !721, !22, !24, !748, !751, !752, !754}
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 32)
!690 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "cbprintf_package_hdr", file: !111, line: 78, size: 32, elements: !691)
!691 = !{!692, !699}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !690, file: !111, line: 80, baseType: !693, size: 32)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cbprintf_package_desc", file: !111, line: 45, size: 32, elements: !694)
!694 = !{!695, !696, !697, !698}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !693, file: !111, line: 47, baseType: !117, size: 8)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "str_cnt", scope: !693, file: !111, line: 50, baseType: !117, size: 8, offset: 8)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "ro_str_cnt", scope: !693, file: !111, line: 53, baseType: !117, size: 8, offset: 16)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rw_str_cnt", scope: !693, file: !111, line: 56, baseType: !117, size: 8, offset: 24)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !690, file: !111, line: 82, baseType: !108, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 32)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !702)
!702 = !{!703, !719, !720}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !701, file: !31, line: 89, baseType: !704, size: 96)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !705)
!705 = !{!706, !717, !718}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !704, file: !31, line: 67, baseType: !707, size: 32)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !708)
!708 = !{!709, !710, !711, !712, !713, !714, !715, !716}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !707, file: !31, line: 52, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !707, file: !31, line: 52, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !707, file: !31, line: 52, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !707, file: !31, line: 53, baseType: !135, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !707, file: !31, line: 54, baseType: !135, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !707, file: !31, line: 55, baseType: !135, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !707, file: !31, line: 56, baseType: !135, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !707, file: !31, line: 57, baseType: !135, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !704, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !704, file: !31, line: 76, baseType: !145, size: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !701, file: !31, line: 93, baseType: !147, size: 32, offset: 96)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !701, file: !31, line: 94, baseType: !151, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 32)
!722 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !723)
!723 = !{!724, !741, !747}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !722, file: !31, line: 112, baseType: !725, size: 32)
!725 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !726, line: 49, size: 32, elements: !727)
!726 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_packet.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!727 = !{!728, !734, !740}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !725, file: !726, line: 50, baseType: !729, size: 32)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !726, line: 37, size: 32, elements: !730)
!730 = !{!731, !732, !733}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !729, file: !726, line: 38, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !729, file: !726, line: 38, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !729, file: !726, line: 39, baseType: !135, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !725, file: !726, line: 51, baseType: !735, size: 32)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !726, line: 43, size: 32, elements: !736)
!736 = !{!737, !738, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !735, file: !726, line: 44, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !735, file: !726, line: 44, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !735, file: !726, line: 45, baseType: !135, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !725, file: !726, line: 52, baseType: !135, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !722, file: !31, line: 113, baseType: !742, size: 32)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !743)
!743 = !{!744, !745, !746}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !742, file: !31, line: 108, baseType: !135, size: 1, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !742, file: !31, line: 108, baseType: !135, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !742, file: !31, line: 108, baseType: !135, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !722, file: !31, line: 114, baseType: !701, size: 128)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !749, line: 46, baseType: !750)
!749 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !160)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !162)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !722)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !701)
!756 = !{!678, !757, !786, !793, !796, !798, !802, !804, !806, !808, !810, !812, !818, !851, !854, !863, !949, !976, !983, !985, !993, !1003, !1008, !1023, !1027}
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "log_process_thread_sem", scope: !680, file: !759, line: 93, type: !760, isLocal: false, isDefinition: true, align: 32)
!759 = !DIFile(filename: "zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !761, line: 2909, size: 128, elements: !762)
!761 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!762 = !{!763, !784, !785}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !760, file: !761, line: 2910, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !765, line: 233, baseType: !766)
!765 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !765, line: 231, size: 64, elements: !767)
!767 = !{!768}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !766, file: !765, line: 232, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !770, line: 48, baseType: !771)
!770 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !770, line: 37, size: 64, elements: !772)
!772 = !{!773, !779}
!773 = !DIDerivedType(tag: DW_TAG_member, scope: !771, file: !770, line: 38, baseType: !774, size: 32)
!774 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !771, file: !770, line: 38, size: 32, elements: !775)
!775 = !{!776, !778}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !774, file: !770, line: 39, baseType: !777, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !774, file: !770, line: 40, baseType: !777, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, scope: !771, file: !770, line: 42, baseType: !780, size: 32, offset: 32)
!780 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !771, file: !770, line: 42, size: 32, elements: !781)
!781 = !{!782, !783}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !780, file: !770, line: 43, baseType: !777, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !780, file: !770, line: 44, baseType: !777, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !760, file: !761, line: 2911, baseType: !32, size: 32, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !760, file: !761, line: 2912, baseType: !32, size: 32, offset: 96)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "__init_enable_logger", scope: !680, file: !759, line: 910, type: !788, isLocal: true, isDefinition: true, align: 32)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !668, line: 51, size: 64, elements: !790)
!790 = !{!791, !792}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !789, file: !668, line: 60, baseType: !671, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !789, file: !668, line: 65, baseType: !674, size: 32, offset: 32)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "panic_mode", scope: !680, file: !759, line: 96, type: !795, isLocal: true, isDefinition: true)
!795 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "backend_attached", scope: !680, file: !759, line: 97, type: !795, isLocal: true, isDefinition: true)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "buffered_cnt", scope: !680, file: !759, line: 98, type: !800, isLocal: true, isDefinition: true)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !801, line: 22, baseType: !190)
!801 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "dropped_cnt", scope: !680, file: !759, line: 99, type: !800, isLocal: true, isDefinition: true)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "timestamp_freq", scope: !680, file: !759, line: 105, type: !135, isLocal: true, isDefinition: true)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "prev_timestamp", scope: !680, file: !759, line: 107, type: !145, isLocal: true, isDefinition: true)
!808 = !DIGlobalVariableExpression(var: !809, expr: !DIExpression())
!809 = distinct !DIGlobalVariable(name: "unordered_cnt", scope: !680, file: !759, line: 108, type: !800, isLocal: true, isDefinition: true)
!810 = !DIGlobalVariableExpression(var: !811, expr: !DIExpression())
!811 = distinct !DIGlobalVariable(name: "last_failure_report", scope: !680, file: !759, line: 109, type: !751, isLocal: true, isDefinition: true)
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "log_msg_ptr", scope: !680, file: !759, line: 111, type: !814, isLocal: true, isDefinition: true, align: 32)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_ptr", file: !815, line: 29, size: 32, elements: !816)
!815 = !DIFile(filename: "zephyr/include/zephyr/logging/log_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!816 = !{!817}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !814, file: !815, line: 30, baseType: !721, size: 32)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "log_buffer", scope: !680, file: !759, line: 112, type: !820, isLocal: true, isDefinition: true, align: 32)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !821, line: 87, size: 448, elements: !822)
!821 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_pbuf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!822 = !{!823, !824, !825, !826, !827, !828, !832, !841, !846, !848, !849, !850}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !820, file: !821, line: 89, baseType: !135, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !820, file: !821, line: 92, baseType: !135, size: 32, offset: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !820, file: !821, line: 95, baseType: !135, size: 32, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !820, file: !821, line: 98, baseType: !135, size: 32, offset: 96)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !820, file: !821, line: 101, baseType: !135, size: 32, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !820, file: !821, line: 104, baseType: !829, offset: 160)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !830, line: 43, elements: !831)
!830 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!831 = !{}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !820, file: !821, line: 110, baseType: !833, size: 32, offset: 160)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !821, line: 83, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!835 = !DISubroutineType(types: !836)
!836 = !{null, !837, !839}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !820)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !725)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !820, file: !821, line: 113, baseType: !842, size: 32, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !821, line: 75, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DISubroutineType(types: !845)
!845 = !{!135, !839}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !820, file: !821, line: 116, baseType: !847, size: 32, offset: 224)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !820, file: !821, line: 119, baseType: !135, size: 32, offset: 256)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !820, file: !821, line: 122, baseType: !135, size: 32, offset: 288)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !820, file: !821, line: 124, baseType: !760, size: 128, offset: 320)
!851 = !DIGlobalVariableExpression(var: !852, expr: !DIExpression())
!852 = distinct !DIGlobalVariable(name: "curr_log_buffer", scope: !680, file: !759, line: 113, type: !853, isLocal: true, isDefinition: true)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "logging_stack", scope: !680, file: !759, line: 884, type: !856, isLocal: false, isDefinition: true, align: 64)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !857, size: 6144, elements: !861)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !858, line: 47, size: 8, elements: !859)
!858 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!859 = !{!860}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !857, file: !858, line: 48, baseType: !156, size: 8)
!861 = !{!862}
!862 = !DISubrange(count: 768)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "logging_thread", scope: !680, file: !759, line: 885, type: !865, isLocal: false, isDefinition: true)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !866, line: 245, size: 896, elements: !867)
!866 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!867 = !{!868, !913, !926, !927, !928, !929, !944}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !865, file: !866, line: 247, baseType: !869, size: 384)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !866, line: 57, size: 384, elements: !870)
!870 = !{!871, !885, !887, !888, !889, !900, !901, !902}
!871 = !DIDerivedType(tag: DW_TAG_member, scope: !869, file: !866, line: 60, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !869, file: !866, line: 60, size: 64, elements: !873)
!873 = !{!874, !876}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !872, file: !866, line: 61, baseType: !875, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !770, line: 49, baseType: !771)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !872, file: !866, line: 62, baseType: !877, size: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !878, line: 49, size: 64, elements: !879)
!878 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!879 = !{!880}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !877, file: !878, line: 50, baseType: !881, size: 64)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !882, size: 64, elements: !883)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 32)
!883 = !{!884}
!884 = !DISubrange(count: 2)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !869, file: !866, line: 68, baseType: !886, size: 32, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !869, file: !866, line: 71, baseType: !117, size: 8, offset: 96)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !869, file: !866, line: 74, baseType: !117, size: 8, offset: 104)
!889 = !DIDerivedType(tag: DW_TAG_member, scope: !869, file: !866, line: 90, baseType: !890, size: 16, offset: 112)
!890 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !869, file: !866, line: 90, size: 16, elements: !891)
!891 = !{!892, !899}
!892 = !DIDerivedType(tag: DW_TAG_member, scope: !890, file: !866, line: 91, baseType: !893, size: 16)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !890, file: !866, line: 91, size: 16, elements: !894)
!894 = !{!895, !898}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !893, file: !866, line: 96, baseType: !896, size: 8)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !897)
!897 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !893, file: !866, line: 97, baseType: !117, size: 8, offset: 8)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !890, file: !866, line: 100, baseType: !194, size: 16)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !869, file: !866, line: 107, baseType: !135, size: 32, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !869, file: !866, line: 127, baseType: !108, size: 32, offset: 160)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !869, file: !866, line: 131, baseType: !903, size: 192, offset: 192)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !765, line: 244, size: 192, elements: !904)
!904 = !{!905, !906, !912}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !903, file: !765, line: 245, baseType: !875, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !903, file: !765, line: 246, baseType: !907, size: 32, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !765, line: 242, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !911}
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !903, file: !765, line: 249, baseType: !750, size: 64, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !865, file: !866, line: 250, baseType: !914, size: 288, offset: 384)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !915, line: 25, size: 288, elements: !916)
!915 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!916 = !{!917, !918, !919, !920, !921, !922, !923, !924, !925}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !914, file: !915, line: 26, baseType: !135, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !914, file: !915, line: 27, baseType: !135, size: 32, offset: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !914, file: !915, line: 28, baseType: !135, size: 32, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !914, file: !915, line: 29, baseType: !135, size: 32, offset: 96)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !914, file: !915, line: 30, baseType: !135, size: 32, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !914, file: !915, line: 31, baseType: !135, size: 32, offset: 160)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !914, file: !915, line: 32, baseType: !135, size: 32, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !914, file: !915, line: 33, baseType: !135, size: 32, offset: 224)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !914, file: !915, line: 34, baseType: !135, size: 32, offset: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !865, file: !866, line: 253, baseType: !108, size: 32, offset: 672)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !865, file: !866, line: 256, baseType: !764, size: 64, offset: 704)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !865, file: !866, line: 294, baseType: !123, size: 32, offset: 768)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !865, file: !866, line: 325, baseType: !930, size: 32, offset: 800)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !761, line: 5073, size: 160, elements: !932)
!932 = !{!933, !942, !943}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !931, file: !761, line: 5074, baseType: !934, size: 96)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !935, line: 56, size: 96, elements: !936)
!935 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!936 = !{!937, !940, !941}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !934, file: !935, line: 57, baseType: !938, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 32)
!939 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !935, line: 57, flags: DIFlagFwdDecl)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !934, file: !935, line: 58, baseType: !108, size: 32, offset: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !934, file: !935, line: 59, baseType: !187, size: 32, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !931, file: !761, line: 5075, baseType: !764, size: 64, offset: 96)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !931, file: !761, line: 5076, baseType: !829, offset: 160)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !865, file: !866, line: 343, baseType: !945, size: 64, offset: 832)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !915, line: 60, size: 64, elements: !946)
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !945, file: !915, line: 63, baseType: !135, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !945, file: !915, line: 66, baseType: !135, size: 32, offset: 32)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(name: "format_table", scope: !680, file: !759, line: 72, type: !951, isLocal: true, isDefinition: true)
!951 = !DICompositeType(tag: DW_TAG_array_type, baseType: !952, size: 128, elements: !148)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_format_func_t", file: !954, line: 105, baseType: !955)
!954 = !DIFile(filename: "zephyr/include/zephyr/logging/log_output.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !958, !700, !135}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !954, line: 89, size: 128, elements: !961)
!961 = !{!962, !967, !974, !975}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !960, file: !954, line: 90, baseType: !963, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_output_func_t", file: !954, line: 79, baseType: !964)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = !DISubroutineType(types: !966)
!966 = !{!123, !193, !187, !108}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !960, file: !954, line: 91, baseType: !968, size: 32, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !954, line: 82, size: 96, elements: !970)
!970 = !{!971, !972, !973}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !969, file: !954, line: 83, baseType: !800, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !969, file: !954, line: 84, baseType: !108, size: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !969, file: !954, line: 85, baseType: !154, size: 32, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !960, file: !954, line: 92, baseType: !193, size: 32, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !960, file: !954, line: 93, baseType: !187, size: 32, offset: 96)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "timestamp_func", scope: !680, file: !759, line: 104, type: !978, isLocal: true, isDefinition: true)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_get_t", file: !979, line: 33, baseType: !980)
!979 = !DIFile(filename: "zephyr/include/zephyr/logging/log_ctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 32)
!981 = !DISubroutineType(types: !982)
!982 = !{!145}
!983 = !DIGlobalVariableExpression(var: !984, expr: !DIExpression())
!984 = distinct !DIGlobalVariable(name: "initialized", scope: !680, file: !759, line: 95, type: !800, isLocal: true, isDefinition: true)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !680, file: !759, line: 25, type: !987, isLocal: true, isDefinition: true)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !170, line: 16, size: 64, elements: !990)
!990 = !{!991, !992}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !989, file: !170, line: 17, baseType: !154, size: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !989, file: !170, line: 18, baseType: !117, size: 8, offset: 32)
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(name: "mpsc_config", scope: !680, file: !759, line: 121, type: !995, isLocal: true, isDefinition: true)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !821, line: 128, size: 160, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !996, file: !821, line: 130, baseType: !847, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !996, file: !821, line: 133, baseType: !135, size: 32, offset: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !996, file: !821, line: 136, baseType: !833, size: 32, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !996, file: !821, line: 137, baseType: !842, size: 32, offset: 96)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !996, file: !821, line: 140, baseType: !135, size: 32, offset: 128)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(name: "buf32", scope: !680, file: !759, line: 116, type: !1005, isLocal: true, isDefinition: true, align: 64)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !135, size: 8192, elements: !1006)
!1006 = !{!1007}
!1007 = !DISubrange(count: 256)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "process_lock", scope: !1010, file: !759, line: 157, type: !829, isLocal: true, isDefinition: true)
!1010 = distinct !DISubprogram(name: "z_log_msg_post_finalize", scope: !759, file: !759, line: 152, type: !1011, scopeLine: 153, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !680, retainedNodes: !1013)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{null}
!1013 = !{!1014, !1016}
!1014 = !DILocalVariable(name: "cnt", scope: !1010, file: !759, line: 154, type: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_val_t", file: !801, line: 23, baseType: !800)
!1016 = !DILocalVariable(name: "key", scope: !1017, file: !759, line: 158, type: !1019)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !759, line: 156, column: 18)
!1018 = distinct !DILexicalBlock(scope: !1010, file: !759, line: 156, column: 6)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_spinlock_key_t", file: !830, line: 106, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_spinlock_key", file: !830, line: 32, size: 32, elements: !1021)
!1021 = !{!1022}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1020, file: !830, line: 33, baseType: !123, size: 32)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(name: "proc_tid", scope: !680, file: !759, line: 100, type: !1025, isLocal: true, isDefinition: true)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !866, line: 347, baseType: !1026)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(name: "log_process_thread_timer", scope: !680, file: !759, line: 101, type: !1029, isLocal: true, isDefinition: true)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_timer", file: !761, line: 1318, size: 448, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1038, !1039, !1044, !1045}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !1029, file: !761, line: 1324, baseType: !903, size: 192)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !1029, file: !761, line: 1327, baseType: !764, size: 64, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "expiry_fn", scope: !1029, file: !761, line: 1330, baseType: !1034, size: 32, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 32)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{null, !1037}
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "stop_fn", scope: !1029, file: !761, line: 1333, baseType: !1034, size: 32, offset: 288)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "period", scope: !1029, file: !761, line: 1336, baseType: !1040, size: 64, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_timeout_t", file: !749, line: 67, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !749, line: 65, size: 64, elements: !1042)
!1042 = !{!1043}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ticks", scope: !1041, file: !749, line: 66, baseType: !748, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !1029, file: !761, line: 1339, baseType: !135, size: 32, offset: 384)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !1029, file: !761, line: 1342, baseType: !108, size: 32, offset: 416)
!1046 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1047 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(name: "log_const_log_mgmt", scope: !1050, file: !1059, line: 14, type: !1292, isLocal: false, isDefinition: true)
!1050 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1051, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1052, retainedTypes: !1053, globals: !1056, splitDebugInlining: false, nameTableKind: None)
!1051 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/dictionary")
!1052 = !{!683, !37}
!1053 = !{!108, !123, !1054, !193, !154, !22}
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!1056 = !{!1048, !1057, !1085, !1269, !1271, !1283, !1285, !1290}
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(name: "sname_cache", scope: !1050, file: !1059, line: 44, type: !1060, isLocal: true, isDefinition: true)
!1059 = !DIFile(filename: "zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache", file: !1061, line: 30, size: 256, elements: !1062)
!1061 = !DIFile(filename: "zephyr/subsys/logging/log_cache.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1062 = !{!1063, !1076, !1077, !1082, !1083, !1084}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !1060, file: !1061, line: 31, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !1065, line: 40, baseType: !1066)
!1065 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !1065, line: 35, size: 64, elements: !1067)
!1067 = !{!1068, !1075}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1066, file: !1065, line: 36, baseType: !1069, size: 32)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 32)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !1065, line: 33, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !1065, line: 29, size: 32, elements: !1072)
!1072 = !{!1073}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1071, file: !1065, line: 30, baseType: !1074, size: 32)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1066, file: !1065, line: 37, baseType: !1069, size: 32, offset: 32)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !1060, file: !1061, line: 32, baseType: !1064, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !1060, file: !1061, line: 33, baseType: !1078, size: 32, offset: 128)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_cache_cmp_func_t", file: !1061, line: 21, baseType: !1079)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 32)
!1080 = !DISubroutineType(types: !1081)
!1081 = !{!795, !22, !22}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !1060, file: !1061, line: 34, baseType: !135, size: 32, offset: 160)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "miss", scope: !1060, file: !1061, line: 35, baseType: !135, size: 32, offset: 192)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !1060, file: !1061, line: 36, baseType: !187, size: 32, offset: 224)
!1085 = !DIGlobalVariableExpression(var: !1086, expr: !DIExpression())
!1086 = distinct !DIGlobalVariable(name: "invalid_domain", scope: !1087, file: !1059, line: 261, type: !154, isLocal: true, isDefinition: true)
!1087 = distinct !DISubprogram(name: "link_domain_name_get", scope: !1059, file: !1059, line: 256, type: !1088, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !1050, retainedNodes: !1090)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!154, !117}
!1090 = !{!1091, !1092, !1093, !1094, !1095, !1098, !1268}
!1091 = !DILocalVariable(name: "domain_id", arg: 1, scope: !1087, file: !1059, line: 256, type: !117)
!1092 = !DILocalVariable(name: "cached", scope: !1087, file: !1059, line: 258, type: !193)
!1093 = !DILocalVariable(name: "cache_size", scope: !1087, file: !1059, line: 259, type: !187)
!1094 = !DILocalVariable(name: "id", scope: !1087, file: !1059, line: 260, type: !22)
!1095 = !DILocalVariable(name: "rel_domain_id", scope: !1096, file: !1059, line: 265, type: !117)
!1096 = distinct !DILexicalBlock(scope: !1097, file: !1059, line: 264, column: 49)
!1097 = distinct !DILexicalBlock(scope: !1087, file: !1059, line: 264, column: 6)
!1098 = !DILocalVariable(name: "link", scope: !1096, file: !1059, line: 266, type: !1099)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 32)
!1100 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link", file: !1102, line: 61, size: 192, elements: !1103)
