; ModuleID = 'build/arduino_due/kernel/metairq_dispatch/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type { [2 x i32], i32, i32, [0 x %struct.k_spinlock] }
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct._static_thread_data = type { %struct.k_thread*, %struct.z_thread_stack_element*, i32, void (i8*, i8*, i8*)*, i8*, i8*, i8*, i32, i32, i32, void ()*, i8* }
%struct.k_sem = type { %union.anon, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/kernel/metairq_dispatch/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/kernel/metairq_dispatch")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/kernel/metairq_dispatch")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !120, line: 10, type: !346, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !117, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/metairq_dispatch/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/kernel/metairq_dispatch")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !104, !105, !106, !107, !111, !113, !114, !116}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!106 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !108, line: 46, baseType: !109)
!108 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !110)
!110 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !112, line: 214, baseType: !32)
!112 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !115)
!115 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !105)
!117 = !{!25, !118, !271, !275, !282, !315, !320, !324, !326}
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "_k_thread_data_metairq_thread", scope: !27, file: !120, line: 28, type: !121, isLocal: false, isDefinition: true, align: 32)
!120 = !DIFile(filename: "zephyr/samples/kernel/metairq_dispatch/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_static_thread_data", file: !122, line: 620, size: 384, elements: !123)
!122 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!123 = !{!124, !244, !252, !253, !258, !259, !260, !261, !262, !263, !264, !268}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "init_thread", scope: !121, file: !122, line: 621, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !127, line: 245, size: 1024, elements: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !{!129, !198, !211, !212, !213, !214, !220, !239}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !126, file: !127, line: 247, baseType: !130, size: 384)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !127, line: 57, size: 384, elements: !131)
!131 = !{!132, !160, !168, !171, !172, !185, !186, !187}
!132 = !DIDerivedType(tag: DW_TAG_member, scope: !130, file: !127, line: 60, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !127, line: 60, size: 64, elements: !134)
!134 = !{!135, !151}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !133, file: !127, line: 61, baseType: !136, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !137, line: 49, baseType: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !137, line: 37, size: 64, elements: !139)
!139 = !{!140, !146}
!140 = !DIDerivedType(tag: DW_TAG_member, scope: !138, file: !137, line: 38, baseType: !141, size: 32)
!141 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !138, file: !137, line: 38, size: 32, elements: !142)
!142 = !{!143, !145}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !141, file: !137, line: 39, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !141, file: !137, line: 40, baseType: !144, size: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, scope: !138, file: !137, line: 42, baseType: !147, size: 32, offset: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !138, file: !137, line: 42, size: 32, elements: !148)
!148 = !{!149, !150}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !147, file: !137, line: 43, baseType: !144, size: 32)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !147, file: !137, line: 44, baseType: !144, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !133, file: !127, line: 62, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !153, line: 49, size: 64, elements: !154)
!153 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!154 = !{!155}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !152, file: !153, line: 50, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 64, elements: !158)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!158 = !{!159}
!159 = !DISubrange(count: 2)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !130, file: !127, line: 68, baseType: !161, size: 32, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !163, line: 233, baseType: !164)
!163 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !163, line: 231, size: 64, elements: !165)
!165 = !{!166}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !164, file: !163, line: 232, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !137, line: 48, baseType: !138)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !130, file: !127, line: 71, baseType: !169, size: 8, offset: 96)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !170)
!170 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !130, file: !127, line: 74, baseType: !169, size: 8, offset: 104)
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !130, file: !127, line: 90, baseType: !173, size: 16, offset: 112)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !130, file: !127, line: 90, size: 16, elements: !174)
!174 = !{!175, !182}
!175 = !DIDerivedType(tag: DW_TAG_member, scope: !173, file: !127, line: 91, baseType: !176, size: 16)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !173, file: !127, line: 91, size: 16, elements: !177)
!177 = !{!178, !181}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !176, file: !127, line: 96, baseType: !179, size: 8)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !180)
!180 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !176, file: !127, line: 97, baseType: !169, size: 8, offset: 8)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !173, file: !127, line: 100, baseType: !183, size: 16)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !184)
!184 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !130, file: !127, line: 107, baseType: !113, size: 32, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !130, file: !127, line: 127, baseType: !104, size: 32, offset: 160)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !130, file: !127, line: 131, baseType: !188, size: 192, offset: 192)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !163, line: 244, size: 192, elements: !189)
!189 = !{!190, !191, !197}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !188, file: !163, line: 245, baseType: !136, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !188, file: !163, line: 246, baseType: !192, size: 32, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !163, line: 242, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!194 = !DISubroutineType(types: !195)
!195 = !{null, !196}
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !188, file: !163, line: 249, baseType: !109, size: 64, offset: 128)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !126, file: !127, line: 250, baseType: !199, size: 288, offset: 384)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !200, line: 25, size: 288, elements: !201)
!200 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !{!202, !203, !204, !205, !206, !207, !208, !209, !210}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !199, file: !200, line: 26, baseType: !113, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !199, file: !200, line: 27, baseType: !113, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !199, file: !200, line: 28, baseType: !113, size: 32, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !199, file: !200, line: 29, baseType: !113, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !199, file: !200, line: 30, baseType: !113, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !199, file: !200, line: 31, baseType: !113, size: 32, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !199, file: !200, line: 32, baseType: !113, size: 32, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !199, file: !200, line: 33, baseType: !113, size: 32, offset: 224)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !199, file: !200, line: 34, baseType: !113, size: 32, offset: 256)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !126, file: !127, line: 253, baseType: !104, size: 32, offset: 672)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !126, file: !127, line: 256, baseType: !162, size: 64, offset: 704)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !126, file: !127, line: 294, baseType: !105, size: 32, offset: 768)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !126, file: !127, line: 300, baseType: !215, size: 96, offset: 800)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !127, line: 149, size: 96, elements: !216)
!216 = !{!217, !218, !219}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !215, file: !127, line: 153, baseType: !22, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !215, file: !127, line: 162, baseType: !111, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !215, file: !127, line: 168, baseType: !111, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !126, file: !127, line: 325, baseType: !221, size: 32, offset: 896)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !122, line: 5073, size: 192, elements: !223)
!223 = !{!224, !233, !234}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !222, file: !122, line: 5074, baseType: !225, size: 96)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !226, line: 56, size: 96, elements: !227)
!226 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!227 = !{!228, !231, !232}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !225, file: !226, line: 57, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !226, line: 57, flags: DIFlagFwdDecl)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !225, file: !226, line: 58, baseType: !104, size: 32, offset: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !225, file: !226, line: 59, baseType: !111, size: 32, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !222, file: !122, line: 5075, baseType: !162, size: 64, offset: 96)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !222, file: !122, line: 5076, baseType: !235, size: 32, offset: 160)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !236, line: 43, size: 32, elements: !237)
!236 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !235, file: !236, line: 52, baseType: !22, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !126, file: !127, line: 343, baseType: !240, size: 64, offset: 928)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !200, line: 60, size: 64, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !240, file: !200, line: 63, baseType: !113, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !240, file: !200, line: 66, baseType: !113, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack", scope: !121, file: !122, line: 622, baseType: !245, size: 32, offset: 32)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_stack_t", file: !247, line: 44, baseType: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !249, line: 47, size: 8, elements: !250)
!249 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!250 = !{!251}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !248, file: !249, line: 48, baseType: !103, size: 8)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "init_stack_size", scope: !121, file: !122, line: 623, baseType: !32, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "init_entry", scope: !121, file: !122, line: 624, baseType: !254, size: 32, offset: 96)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !247, line: 46, baseType: !255)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 32)
!256 = !DISubroutineType(types: !257)
!257 = !{null, !104, !104, !104}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "init_p1", scope: !121, file: !122, line: 625, baseType: !104, size: 32, offset: 128)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "init_p2", scope: !121, file: !122, line: 626, baseType: !104, size: 32, offset: 160)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "init_p3", scope: !121, file: !122, line: 627, baseType: !104, size: 32, offset: 192)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "init_prio", scope: !121, file: !122, line: 628, baseType: !105, size: 32, offset: 224)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "init_options", scope: !121, file: !122, line: 629, baseType: !113, size: 32, offset: 256)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "init_delay", scope: !121, file: !122, line: 630, baseType: !116, size: 32, offset: 288)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "init_abort", scope: !121, file: !122, line: 631, baseType: !265, size: 32, offset: 320)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!266 = !DISubroutineType(types: !267)
!267 = !{null}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "init_name", scope: !121, file: !122, line: 632, baseType: !269, size: 32, offset: 352)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!271 = !DIGlobalVariableExpression(var: !272, expr: !DIExpression())
!272 = distinct !DIGlobalVariable(name: "metairq_thread", scope: !27, file: !120, line: 28, type: !273, isLocal: false, isDefinition: true)
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !127, line: 347, baseType: !125)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "report_cookie", scope: !27, file: !120, line: 46, type: !277, isLocal: false, isDefinition: true, align: 32)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !122, line: 2909, size: 128, elements: !278)
!278 = !{!279, !280, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !277, file: !122, line: 2910, baseType: !162, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !277, file: !122, line: 2911, baseType: !32, size: 32, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !277, file: !122, line: 2912, baseType: !32, size: 32, offset: 96)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "threads", scope: !27, file: !120, line: 22, type: !284, isLocal: true, isDefinition: true)
!284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !285, size: 15872, elements: !313)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "thread_rec", file: !120, line: 18, size: 3968, elements: !286)
!286 = !{!287, !288, !301}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !285, file: !120, line: 19, baseType: !126, size: 1024)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "msgq", scope: !285, file: !120, line: 20, baseType: !289, size: 352, offset: 1024)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !122, line: 4204, size: 352, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !289, file: !122, line: 4206, baseType: !162, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !289, file: !122, line: 4208, baseType: !235, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !289, file: !122, line: 4210, baseType: !111, size: 32, offset: 96)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !289, file: !122, line: 4212, baseType: !113, size: 32, offset: 128)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !289, file: !122, line: 4214, baseType: !102, size: 32, offset: 160)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !289, file: !122, line: 4216, baseType: !102, size: 32, offset: 192)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !289, file: !122, line: 4218, baseType: !102, size: 32, offset: 224)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !289, file: !122, line: 4220, baseType: !102, size: 32, offset: 256)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !289, file: !122, line: 4222, baseType: !113, size: 32, offset: 288)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !289, file: !122, line: 4227, baseType: !169, size: 8, offset: 320)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "msgq_buf", scope: !285, file: !120, line: 21, baseType: !302, size: 2560, offset: 1376)
!302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !303, size: 2560, elements: !311)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "msg", file: !304, line: 44, size: 160, elements: !305)
!304 = !DIFile(filename: "zephyr/samples/kernel/metairq_dispatch/src/msgdev.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!305 = !{!306, !307, !308, !309, !310}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !303, file: !304, line: 46, baseType: !113, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !303, file: !304, line: 49, baseType: !113, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "target", scope: !303, file: !304, line: 52, baseType: !113, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "proc_cyc", scope: !303, file: !304, line: 55, baseType: !113, size: 32, offset: 96)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "metairq_latency", scope: !303, file: !304, line: 58, baseType: !113, size: 32, offset: 128)
!311 = !{!312}
!312 = !DISubrange(count: 16)
!313 = !{!314}
!314 = !DISubrange(count: 4)
!315 = !DIGlobalVariableExpression(var: !316, expr: !DIExpression())
!316 = distinct !DIGlobalVariable(name: "thread_stacks", scope: !27, file: !120, line: 24, type: !317, isLocal: false, isDefinition: true, align: 512)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 67584, elements: !318)
!318 = !{!314, !319}
!319 = !DISubrange(count: 2112)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "_k_thread_stack_metairq_thread", scope: !27, file: !120, line: 28, type: !322, isLocal: false, isDefinition: true, align: 512)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 16896, elements: !323)
!323 = !{!319}
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "_k_thread_obj_metairq_thread", scope: !27, file: !120, line: 28, type: !126, isLocal: false, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "stats", scope: !27, file: !120, line: 41, type: !328, isLocal: false, isDefinition: true)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !120, line: 34, size: 4000, elements: !329)
!329 = !{!330, !333, !337}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "num_mirq", scope: !328, file: !120, line: 35, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !332, line: 22, baseType: !106)
!332 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!333 = !DIDerivedType(tag: DW_TAG_member, name: "mirq_latencies", scope: !328, file: !120, line: 36, baseType: !334, size: 1280, offset: 32)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 1280, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 40)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "threads", scope: !328, file: !120, line: 40, baseType: !338, size: 2688, offset: 1312)
!338 = !DICompositeType(tag: DW_TAG_array_type, baseType: !339, size: 2688, elements: !313)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !328, file: !120, line: 37, size: 672, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "nevt", scope: !339, file: !120, line: 38, baseType: !113, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "latencies", scope: !339, file: !120, line: 39, baseType: !343, size: 640, offset: 32)
!343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !113, size: 640, elements: !344)
!344 = !{!345}
!345 = !DISubrange(count: 20)
!346 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !347)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !348, line: 16, size: 64, elements: !349)
!348 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !347, file: !348, line: 17, baseType: !269, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !347, file: !348, line: 18, baseType: !169, size: 8, offset: 32)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "hw_msgs", scope: !354, file: !360, line: 27, type: !398, isLocal: false, isDefinition: true, align: 32)
!354 = distinct !DICompileUnit(language: DW_LANG_C99, file: !355, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !356, globals: !357, splitDebugInlining: false, nameTableKind: None)
!355 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/kernel/metairq_dispatch/src/msgdev.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/kernel/metairq_dispatch")
!356 = !{!107, !104, !105, !113, !114}
!357 = !{!352, !358, !385, !387, !389, !392}
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "timeout", scope: !354, file: !360, line: 17, type: !361, isLocal: true, isDefinition: true)
!360 = !DIFile(filename: "zephyr/samples/kernel/metairq_dispatch/src/msgdev.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !163, line: 244, size: 192, elements: !362)
!362 = !{!363, !378, !384}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !361, file: !163, line: 245, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !137, line: 49, baseType: !365)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !137, line: 37, size: 64, elements: !366)
!366 = !{!367, !373}
!367 = !DIDerivedType(tag: DW_TAG_member, scope: !365, file: !137, line: 38, baseType: !368, size: 32)
!368 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !365, file: !137, line: 38, size: 32, elements: !369)
!369 = !{!370, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !368, file: !137, line: 39, baseType: !371, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !368, file: !137, line: 40, baseType: !371, size: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, scope: !365, file: !137, line: 42, baseType: !374, size: 32, offset: 32)
!374 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !365, file: !137, line: 42, size: 32, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !374, file: !137, line: 43, baseType: !371, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !374, file: !137, line: 44, baseType: !371, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !361, file: !163, line: 246, baseType: !379, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !163, line: 242, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !361, file: !163, line: 249, baseType: !109, size: 64, offset: 128)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "max_duty_cyc", scope: !354, file: !360, line: 23, type: !113, isLocal: false, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "msg_seq", scope: !354, file: !360, line: 25, type: !113, isLocal: false, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "_k_fifo_buf_hw_msgs", scope: !354, file: !360, line: 27, type: !391, isLocal: true, isDefinition: true, align: 32)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 320, elements: !335)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "state", scope: !394, file: !360, line: 38, type: !114, isLocal: true, isDefinition: true)
!394 = distinct !DISubprogram(name: "rand32", scope: !360, file: !360, line: 36, type: !395, scopeLine: 37, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !354, retainedNodes: !397)
!395 = !DISubroutineType(types: !396)
!396 = !{!113}
!397 = !{}
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !122, line: 4204, size: 352, elements: !399)
!399 = !{!400, !406, !410, !411, !412, !413, !414, !415, !416, !417}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !398, file: !122, line: 4206, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !163, line: 233, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !163, line: 231, size: 64, elements: !403)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !402, file: !163, line: 232, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !137, line: 48, baseType: !365)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !398, file: !122, line: 4208, baseType: !407, size: 32, offset: 64)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !236, line: 43, size: 32, elements: !408)
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !407, file: !236, line: 52, baseType: !22, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !398, file: !122, line: 4210, baseType: !111, size: 32, offset: 96)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !398, file: !122, line: 4212, baseType: !113, size: 32, offset: 128)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !398, file: !122, line: 4214, baseType: !102, size: 32, offset: 160)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !398, file: !122, line: 4216, baseType: !102, size: 32, offset: 192)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !398, file: !122, line: 4218, baseType: !102, size: 32, offset: 224)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !398, file: !122, line: 4220, baseType: !102, size: 32, offset: 256)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !398, file: !122, line: 4222, baseType: !113, size: 32, offset: 288)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !398, file: !122, line: 4227, baseType: !169, size: 8, offset: 320)
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !420, file: !434, line: 18, type: !435, isLocal: false, isDefinition: true)
!420 = distinct !DICompileUnit(language: DW_LANG_C99, file: !421, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !422, globals: !433, splitDebugInlining: false, nameTableKind: None)
!421 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/kernel/metairq_dispatch")
!422 = !{!22, !104, !24, !423, !425, !427, !111, !105, !428, !429, !430, !431, !102, !432, !183, !269}
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 32)
!424 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 32)
!426 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 32)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 32)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!433 = !{!418}
!434 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!435 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !436)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !348, line: 16, size: 64, elements: !437)
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !436, file: !348, line: 17, baseType: !269, size: 32)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !436, file: !348, line: 18, baseType: !169, size: 8, offset: 32)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "_char_out", scope: !442, file: !446, line: 54, type: !447, isLocal: false, isDefinition: true)
!442 = distinct !DICompileUnit(language: DW_LANG_C99, file: !443, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !444, globals: !445, splitDebugInlining: false, nameTableKind: None)
!443 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/kernel/metairq_dispatch")
!444 = !{!104, !105}
!445 = !{!440}
!446 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!448 = !DISubroutineType(types: !449)
!449 = !{!105, !105}
!450 = !DIGlobalVariableExpression(var: !451, expr: !DIExpression())
!451 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !452, file: !517, line: 235, type: !518, isLocal: true, isDefinition: true, align: 32)
!452 = distinct !DICompileUnit(language: DW_LANG_C99, file: !453, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !454, globals: !516, splitDebugInlining: false, nameTableKind: None)
!453 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/kernel/metairq_dispatch")
!454 = !{!104, !105, !455, !466}
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !457, line: 46, baseType: !458)
!457 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !457, line: 41, size: 128, elements: !459)
!459 = !{!460, !462, !463, !465}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !458, file: !457, line: 42, baseType: !461, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !113)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !458, file: !457, line: 43, baseType: !461, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !458, file: !457, line: 44, baseType: !464, size: 32, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !461)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !458, file: !457, line: 45, baseType: !464, size: 32, offset: 96)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !468, line: 75, baseType: !469)
!468 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !468, line: 41, size: 2176, elements: !470)
!470 = !{!471, !472, !473, !474, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !494, !498, !499, !500, !501, !502, !503, !504, !505, !509, !510, !511, !512, !513, !514, !515}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !469, file: !468, line: 42, baseType: !461, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !469, file: !468, line: 43, baseType: !461, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !469, file: !468, line: 44, baseType: !464, size: 32, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !469, file: !468, line: 45, baseType: !475, size: 32, offset: 96)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 32, elements: !476)
!476 = !{!477}
!477 = !DISubrange(count: 1)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !469, file: !468, line: 46, baseType: !461, size: 32, offset: 128)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !469, file: !468, line: 47, baseType: !461, size: 32, offset: 160)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !469, file: !468, line: 48, baseType: !464, size: 32, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !469, file: !468, line: 49, baseType: !461, size: 32, offset: 224)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !469, file: !468, line: 50, baseType: !461, size: 32, offset: 256)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !469, file: !468, line: 51, baseType: !464, size: 32, offset: 288)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !469, file: !468, line: 52, baseType: !461, size: 32, offset: 320)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !469, file: !468, line: 53, baseType: !475, size: 32, offset: 352)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !469, file: !468, line: 54, baseType: !461, size: 32, offset: 384)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !469, file: !468, line: 55, baseType: !475, size: 32, offset: 416)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !469, file: !468, line: 56, baseType: !461, size: 32, offset: 448)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !469, file: !468, line: 57, baseType: !475, size: 32, offset: 480)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !469, file: !468, line: 58, baseType: !491, size: 96, offset: 512)
!491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !461, size: 96, elements: !492)
!492 = !{!493}
!493 = !DISubrange(count: 3)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !469, file: !468, line: 59, baseType: !495, size: 160, offset: 608)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 160, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 5)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !469, file: !468, line: 60, baseType: !461, size: 32, offset: 768)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !469, file: !468, line: 61, baseType: !461, size: 32, offset: 800)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !469, file: !468, line: 62, baseType: !464, size: 32, offset: 832)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !469, file: !468, line: 63, baseType: !464, size: 32, offset: 864)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !469, file: !468, line: 64, baseType: !461, size: 32, offset: 896)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !469, file: !468, line: 65, baseType: !461, size: 32, offset: 928)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !469, file: !468, line: 66, baseType: !461, size: 32, offset: 960)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !469, file: !468, line: 67, baseType: !506, size: 832, offset: 992)
!506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !464, size: 832, elements: !507)
!507 = !{!508}
!508 = !DISubrange(count: 26)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !469, file: !468, line: 68, baseType: !461, size: 32, offset: 1824)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !469, file: !468, line: 69, baseType: !464, size: 32, offset: 1856)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !469, file: !468, line: 70, baseType: !495, size: 160, offset: 1888)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !469, file: !468, line: 71, baseType: !461, size: 32, offset: 2048)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !469, file: !468, line: 72, baseType: !461, size: 32, offset: 2080)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !469, file: !468, line: 73, baseType: !464, size: 32, offset: 2112)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !469, file: !468, line: 74, baseType: !461, size: 32, offset: 2144)
!516 = !{!450}
!517 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !519)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !520, line: 51, size: 64, elements: !521)
!520 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!521 = !{!522, !548}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !519, file: !520, line: 60, baseType: !523, size: 32)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 32)
!524 = !DISubroutineType(types: !525)
!525 = !{!105, !526}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !529, line: 378, size: 192, elements: !530)
!529 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!530 = !{!531, !532, !533, !534, !541, !542}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !528, file: !529, line: 380, baseType: !269, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !528, file: !529, line: 382, baseType: !13, size: 32, offset: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !528, file: !529, line: 384, baseType: !13, size: 32, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !528, file: !529, line: 386, baseType: !535, size: 32, offset: 96)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !529, line: 351, size: 16, elements: !537)
!537 = !{!538, !539}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !536, file: !529, line: 359, baseType: !169, size: 8)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !536, file: !529, line: 364, baseType: !540, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!540 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !528, file: !529, line: 388, baseType: !104, size: 32, offset: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !528, file: !529, line: 396, baseType: !543, size: 32, offset: 160)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !545)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !529, line: 43, baseType: !546)
!546 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !547)
!547 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !519, file: !520, line: 65, baseType: !526, size: 32, offset: 32)
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !551, file: !558, line: 17, type: !684, isLocal: false, isDefinition: true)
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !552, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !553, globals: !554, splitDebugInlining: false, nameTableKind: None)
!552 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/kernel/metairq_dispatch")
!553 = !{!111, !105, !113, !104}
!554 = !{!549, !555, !680}
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !557, file: !558, line: 198, type: !668, isLocal: true, isDefinition: true)
!557 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !558, file: !558, line: 175, type: !559, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !551, retainedNodes: !663)
!558 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!559 = !DISubroutineType(types: !560)
!560 = !{null, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 32)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !127, line: 245, size: 1024, elements: !563)
!563 = !{!564, !622, !634, !635, !636, !637, !643, !658}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !562, file: !127, line: 247, baseType: !565, size: 384)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !127, line: 57, size: 384, elements: !566)
!566 = !{!567, !591, !598, !599, !600, !609, !610, !611}
!567 = !DIDerivedType(tag: DW_TAG_member, scope: !565, file: !127, line: 60, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !127, line: 60, size: 64, elements: !569)
!569 = !{!570, !585}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !568, file: !127, line: 61, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !137, line: 49, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !137, line: 37, size: 64, elements: !573)
!573 = !{!574, !580}
!574 = !DIDerivedType(tag: DW_TAG_member, scope: !572, file: !137, line: 38, baseType: !575, size: 32)
!575 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !572, file: !137, line: 38, size: 32, elements: !576)
!576 = !{!577, !579}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !575, file: !137, line: 39, baseType: !578, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !575, file: !137, line: 40, baseType: !578, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, scope: !572, file: !137, line: 42, baseType: !581, size: 32, offset: 32)
!581 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !572, file: !137, line: 42, size: 32, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !581, file: !137, line: 43, baseType: !578, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !581, file: !137, line: 44, baseType: !578, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !568, file: !127, line: 62, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !153, line: 49, size: 64, elements: !587)
!587 = !{!588}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !586, file: !153, line: 50, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !590, size: 64, elements: !158)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !565, file: !127, line: 68, baseType: !592, size: 32, offset: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !163, line: 233, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !163, line: 231, size: 64, elements: !595)
!595 = !{!596}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !594, file: !163, line: 232, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !137, line: 48, baseType: !572)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !565, file: !127, line: 71, baseType: !169, size: 8, offset: 96)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !565, file: !127, line: 74, baseType: !169, size: 8, offset: 104)
!600 = !DIDerivedType(tag: DW_TAG_member, scope: !565, file: !127, line: 90, baseType: !601, size: 16, offset: 112)
!601 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !565, file: !127, line: 90, size: 16, elements: !602)
!602 = !{!603, !608}
!603 = !DIDerivedType(tag: DW_TAG_member, scope: !601, file: !127, line: 91, baseType: !604, size: 16)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !601, file: !127, line: 91, size: 16, elements: !605)
!605 = !{!606, !607}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !604, file: !127, line: 96, baseType: !179, size: 8)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !604, file: !127, line: 97, baseType: !169, size: 8, offset: 8)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !601, file: !127, line: 100, baseType: !183, size: 16)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !565, file: !127, line: 107, baseType: !113, size: 32, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !565, file: !127, line: 127, baseType: !104, size: 32, offset: 160)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !565, file: !127, line: 131, baseType: !612, size: 192, offset: 192)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !163, line: 244, size: 192, elements: !613)
!613 = !{!614, !615, !621}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !612, file: !163, line: 245, baseType: !571, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !612, file: !163, line: 246, baseType: !616, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !163, line: 242, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DISubroutineType(types: !619)
!619 = !{null, !620}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !612, file: !163, line: 249, baseType: !109, size: 64, offset: 128)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !562, file: !127, line: 250, baseType: !623, size: 288, offset: 384)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !200, line: 25, size: 288, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632, !633}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !623, file: !200, line: 26, baseType: !113, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !623, file: !200, line: 27, baseType: !113, size: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !623, file: !200, line: 28, baseType: !113, size: 32, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !623, file: !200, line: 29, baseType: !113, size: 32, offset: 96)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !623, file: !200, line: 30, baseType: !113, size: 32, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !623, file: !200, line: 31, baseType: !113, size: 32, offset: 160)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !623, file: !200, line: 32, baseType: !113, size: 32, offset: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !623, file: !200, line: 33, baseType: !113, size: 32, offset: 224)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !623, file: !200, line: 34, baseType: !113, size: 32, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !562, file: !127, line: 253, baseType: !104, size: 32, offset: 672)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !562, file: !127, line: 256, baseType: !593, size: 64, offset: 704)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !562, file: !127, line: 294, baseType: !105, size: 32, offset: 768)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !562, file: !127, line: 300, baseType: !638, size: 96, offset: 800)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !127, line: 149, size: 96, elements: !639)
!639 = !{!640, !641, !642}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !638, file: !127, line: 153, baseType: !22, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !638, file: !127, line: 162, baseType: !111, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !638, file: !127, line: 168, baseType: !111, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !562, file: !127, line: 325, baseType: !644, size: 32, offset: 896)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !122, line: 5073, size: 192, elements: !646)
!646 = !{!647, !653, !654}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !645, file: !122, line: 5074, baseType: !648, size: 96)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !226, line: 56, size: 96, elements: !649)
!649 = !{!650, !651, !652}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !648, file: !226, line: 57, baseType: !229, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !648, file: !226, line: 58, baseType: !104, size: 32, offset: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !648, file: !226, line: 59, baseType: !111, size: 32, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !645, file: !122, line: 5075, baseType: !593, size: 64, offset: 96)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !645, file: !122, line: 5076, baseType: !655, size: 32, offset: 160)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !236, line: 43, size: 32, elements: !656)
!656 = !{!657}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !655, file: !236, line: 52, baseType: !22, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !562, file: !127, line: 343, baseType: !659, size: 64, offset: 928)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !200, line: 60, size: 64, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !659, file: !200, line: 63, baseType: !113, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !659, file: !200, line: 66, baseType: !113, size: 32, offset: 32)
!663 = !{!664, !665, !666, !667}
!664 = !DILocalVariable(name: "thread", arg: 1, scope: !557, file: !558, line: 175, type: !561)
!665 = !DILocalVariable(name: "region_num", scope: !557, file: !558, line: 200, type: !169)
!666 = !DILocalVariable(name: "guard_start", scope: !557, file: !558, line: 265, type: !22)
!667 = !DILocalVariable(name: "guard_size", scope: !557, file: !558, line: 266, type: !111)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !669, size: 96, elements: !476)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !670, line: 52, size: 96, elements: !671)
!670 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!671 = !{!672, !673, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !669, file: !670, line: 53, baseType: !22, size: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !669, file: !670, line: 54, baseType: !111, size: 32, offset: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !669, file: !670, line: 55, baseType: !675, size: 32, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !676, line: 151, baseType: !677)
!676 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !676, line: 149, size: 32, elements: !678)
!678 = !{!679}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !677, file: !676, line: 150, baseType: !113, size: 32)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "static_regions", scope: !551, file: !558, line: 62, type: !682, isLocal: true, isDefinition: true)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !683, size: 96, elements: !476)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !669)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !348, line: 16, size: 64, elements: !686)
!686 = !{!687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !685, file: !348, line: 17, baseType: !269, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !685, file: !348, line: 18, baseType: !169, size: 8, offset: 32)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !691, file: !723, line: 39, type: !169, isLocal: true, isDefinition: true)
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !692, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !693, globals: !722, splitDebugInlining: false, nameTableKind: None)
!692 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/kernel/metairq_dispatch")
!693 = !{!694, !104, !105, !710, !169}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !696, line: 1168, baseType: !697)
!696 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !696, line: 1155, size: 352, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !697, file: !696, line: 1157, baseType: !464, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !697, file: !696, line: 1158, baseType: !461, size: 32, offset: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !697, file: !696, line: 1159, baseType: !461, size: 32, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !697, file: !696, line: 1160, baseType: !461, size: 32, offset: 96)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !697, file: !696, line: 1161, baseType: !461, size: 32, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !697, file: !696, line: 1162, baseType: !461, size: 32, offset: 160)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !697, file: !696, line: 1163, baseType: !461, size: 32, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !697, file: !696, line: 1164, baseType: !461, size: 32, offset: 224)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !697, file: !696, line: 1165, baseType: !461, size: 32, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !697, file: !696, line: 1166, baseType: !461, size: 32, offset: 288)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !697, file: !696, line: 1167, baseType: !461, size: 32, offset: 320)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !713, line: 27, size: 96, elements: !714)
!713 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!714 = !{!715, !716, !717}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !712, file: !713, line: 29, baseType: !113, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !712, file: !713, line: 31, baseType: !269, size: 32, offset: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !712, file: !713, line: 37, baseType: !718, size: 32, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !676, line: 146, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !676, line: 141, size: 32, elements: !720)
!720 = !{!721}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !719, file: !676, line: 143, baseType: !113, size: 32)
!722 = !{!689}
!723 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !726, file: !733, line: 21, type: !447, isLocal: true, isDefinition: true)
!726 = distinct !DICompileUnit(language: DW_LANG_C99, file: !727, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !728, globals: !732, splitDebugInlining: false, nameTableKind: None)
!727 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/kernel/metairq_dispatch")
!728 = !{!729, !105, !104}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !731, line: 22, baseType: !105)
!731 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!732 = !{!724}
!733 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !736, file: !741, line: 13, type: !758, isLocal: true, isDefinition: true)
!736 = distinct !DICompileUnit(language: DW_LANG_C99, file: !737, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !738, splitDebugInlining: false, nameTableKind: None)
!737 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/kernel/metairq_dispatch")
!738 = !{!739, !734}
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "mpu_config", scope: !736, file: !741, line: 37, type: !742, isLocal: false, isDefinition: true)
!741 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!742 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !713, line: 41, size: 64, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !743, file: !713, line: 43, baseType: !113, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !743, file: !713, line: 45, baseType: !747, size: 32, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !749)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !713, line: 27, size: 96, elements: !750)
!750 = !{!751, !752, !753}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !749, file: !713, line: 29, baseType: !113, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !749, file: !713, line: 31, baseType: !269, size: 32, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !749, file: !713, line: 37, baseType: !754, size: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !676, line: 146, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !676, line: 141, size: 32, elements: !756)
!756 = !{!757}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !755, file: !676, line: 143, baseType: !113, size: 32)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 192, elements: !158)
!759 = !DIGlobalVariableExpression(var: !760, expr: !DIExpression())
!760 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !761, file: !818, line: 603, type: !820, isLocal: true, isDefinition: true, align: 32)
!761 = distinct !DICompileUnit(language: DW_LANG_C99, file: !762, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !763, globals: !815, splitDebugInlining: false, nameTableKind: None)
!762 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/kernel/metairq_dispatch")
!763 = !{!104, !105, !764}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !767, line: 336, size: 160, elements: !768)
!767 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!768 = !{!769, !789, !793, !797, !810}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !766, file: !767, line: 365, baseType: !770, size: 32)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 32)
!771 = !DISubroutineType(types: !772)
!772 = !{!105, !773, !788}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !529, line: 378, size: 192, elements: !776)
!776 = !{!777, !778, !779, !780, !786, !787}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !775, file: !529, line: 380, baseType: !269, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !775, file: !529, line: 382, baseType: !13, size: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !775, file: !529, line: 384, baseType: !13, size: 32, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !775, file: !529, line: 386, baseType: !781, size: 32, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !529, line: 351, size: 16, elements: !783)
!783 = !{!784, !785}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !782, file: !529, line: 359, baseType: !169, size: 8)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !782, file: !529, line: 364, baseType: !540, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !775, file: !529, line: 388, baseType: !104, size: 32, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !775, file: !529, line: 396, baseType: !543, size: 32, offset: 160)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !766, file: !767, line: 366, baseType: !790, size: 32, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !773, !170}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !766, file: !767, line: 374, baseType: !794, size: 32, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = !DISubroutineType(types: !796)
!796 = !{!105, !773}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !766, file: !767, line: 377, baseType: !798, size: 32, offset: 96)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!799 = !DISubroutineType(types: !800)
!800 = !{!105, !773, !801}
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !767, line: 122, size: 64, elements: !804)
!804 = !{!805, !806, !807, !808, !809}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !803, file: !767, line: 123, baseType: !113, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !803, file: !767, line: 124, baseType: !169, size: 8, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !803, file: !767, line: 125, baseType: !169, size: 8, offset: 40)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !803, file: !767, line: 126, baseType: !169, size: 8, offset: 48)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !803, file: !767, line: 127, baseType: !169, size: 8, offset: 56)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !766, file: !767, line: 379, baseType: !811, size: 32, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 32)
!812 = !DISubroutineType(types: !813)
!813 = !{!105, !773, !814}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!815 = !{!759, !816}
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !761, file: !818, line: 38, type: !819, isLocal: true, isDefinition: true)
!818 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!819 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !520, line: 51, size: 64, elements: !822)
!822 = !{!823, !824}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !821, file: !520, line: 60, baseType: !794, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !821, file: !520, line: 65, baseType: !773, size: 32, offset: 32)
!825 = !DIGlobalVariableExpression(var: !826, expr: !DIExpression())
!826 = distinct !DIGlobalVariable(name: "log_const_wdt_sam", scope: !827, file: !888, line: 28, type: !934, isLocal: false, isDefinition: true)
!827 = distinct !DICompileUnit(language: DW_LANG_C99, file: !828, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !829, globals: !885, splitDebugInlining: false, nameTableKind: None)
!828 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/kernel/metairq_dispatch")
!829 = !{!830, !113}
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !833, line: 134, size: 128, elements: !834)
!833 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!834 = !{!835, !855, !860, !880}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !832, file: !833, line: 135, baseType: !836, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !833, line: 113, baseType: !837)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!838 = !DISubroutineType(types: !839)
!839 = !{!105, !840, !169}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !842)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !529, line: 378, size: 192, elements: !843)
!843 = !{!844, !845, !846, !847, !853, !854}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !842, file: !529, line: 380, baseType: !269, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !842, file: !529, line: 382, baseType: !13, size: 32, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !842, file: !529, line: 384, baseType: !13, size: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !842, file: !529, line: 386, baseType: !848, size: 32, offset: 96)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !529, line: 351, size: 16, elements: !850)
!850 = !{!851, !852}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !849, file: !529, line: 359, baseType: !169, size: 8)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !849, file: !529, line: 364, baseType: !540, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !842, file: !529, line: 388, baseType: !104, size: 32, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !842, file: !529, line: 396, baseType: !543, size: 32, offset: 160)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !832, file: !833, line: 136, baseType: !856, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_disable", file: !833, line: 119, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!858 = !DISubroutineType(types: !859)
!859 = !{!105, !840}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "install_timeout", scope: !832, file: !833, line: 137, baseType: !861, size: 32, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_install_timeout", file: !833, line: 125, baseType: !862)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 32)
!863 = !DISubroutineType(types: !864)
!864 = !{!105, !840, !865}
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_timeout_cfg", file: !833, line: 88, size: 128, elements: !868)
!868 = !{!869, !874, !879}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !867, file: !833, line: 90, baseType: !870, size: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_window", file: !833, line: 72, size: 64, elements: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !870, file: !833, line: 74, baseType: !113, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !870, file: !833, line: 76, baseType: !113, size: 32, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !867, file: !833, line: 92, baseType: !875, size: 32, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_callback_t", file: !833, line: 85, baseType: !876)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 32)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !840, !105}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !867, file: !833, line: 104, baseType: !169, size: 8, offset: 96)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "feed", scope: !832, file: !833, line: 138, baseType: !881, size: 32, offset: 96)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_feed", file: !833, line: 132, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 32)
!883 = !DISubroutineType(types: !884)
!884 = !{!105, !840, !105}
!885 = !{!825, !886, !890, !892, !899, !901, !915, !917, !925}
!886 = !DIGlobalVariableExpression(var: !887, expr: !DIExpression())
!887 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !827, file: !888, line: 256, type: !889, isLocal: false, isDefinition: true, align: 16)
!888 = !DIFile(filename: "zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 80, elements: !496)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "__device_dts_ord_26", scope: !827, file: !888, line: 256, type: !841, isLocal: false, isDefinition: true, align: 32)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_26", scope: !827, file: !888, line: 256, type: !894, isLocal: true, isDefinition: true, align: 32)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !520, line: 51, size: 64, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !895, file: !520, line: 60, baseType: !857, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !895, file: !520, line: 65, baseType: !840, size: 32, offset: 32)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_26", scope: !827, file: !888, line: 256, type: !849, isLocal: true, isDefinition: true, align: 8)
!901 = !DIGlobalVariableExpression(var: !902, expr: !DIExpression())
!902 = distinct !DIGlobalVariable(name: "wdt_sam_cfg", scope: !827, file: !888, line: 234, type: !903, isLocal: true, isDefinition: true)
!903 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !904)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_cfg", file: !888, line: 34, size: 32, elements: !905)
!905 = !{!906}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !904, file: !888, line: 35, baseType: !907, size: 32)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 32)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "Wdt", file: !909, line: 45, baseType: !910)
!909 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/wdt.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !909, line: 41, size: 96, elements: !911)
!911 = !{!912, !913, !914}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_CR", scope: !910, file: !909, line: 42, baseType: !461, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_MR", scope: !910, file: !909, line: 43, baseType: !461, size: 32, offset: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_SR", scope: !910, file: !909, line: 44, baseType: !464, size: 32, offset: 64)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "wdt_sam_api", scope: !827, file: !888, line: 227, type: !831, isLocal: true, isDefinition: true)
!917 = !DIGlobalVariableExpression(var: !918, expr: !DIExpression())
!918 = distinct !DIGlobalVariable(name: "wdt_sam_data", scope: !827, file: !888, line: 45, type: !919, isLocal: true, isDefinition: true)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_data", file: !888, line: 38, size: 96, elements: !920)
!920 = !{!921, !922, !923, !924}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !919, file: !888, line: 39, baseType: !875, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !919, file: !888, line: 40, baseType: !113, size: 32, offset: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_valid", scope: !919, file: !888, line: 41, baseType: !540, size: 8, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "mode_set", scope: !919, file: !888, line: 42, baseType: !540, size: 8, offset: 72)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(name: "__isr_wdt_sam_isr_irq_0", scope: !927, file: !888, line: 240, type: !928, isLocal: true, isDefinition: true, align: 32)
!927 = distinct !DISubprogram(name: "wdt_sam_irq_config", scope: !888, file: !888, line: 238, type: !266, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !827, retainedNodes: !397)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !929)
!929 = !{!930, !931, !932, !933}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !928, file: !10, line: 55, baseType: !116, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !928, file: !10, line: 57, baseType: !116, size: 32, offset: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !928, file: !10, line: 59, baseType: !104, size: 32, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !928, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!934 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !348, line: 16, size: 64, elements: !936)
!936 = !{!937, !938}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !935, file: !348, line: 17, baseType: !269, size: 32)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !935, file: !348, line: 18, baseType: !169, size: 8, offset: 32)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !941, file: !946, line: 7, type: !947, isLocal: false, isDefinition: true, align: 16)
!941 = distinct !DICompileUnit(language: DW_LANG_C99, file: !942, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !943, splitDebugInlining: false, nameTableKind: None)
!942 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/kernel/metairq_dispatch/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/kernel/metairq_dispatch")
!943 = !{!939, !944}
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !941, file: !946, line: 12, type: !947, isLocal: false, isDefinition: true, align: 16)
!946 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/kernel/metairq_dispatch")
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !544, size: 48, elements: !492)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(name: "uart0_sam_config", scope: !950, file: !1038, line: 494, type: !1085, isLocal: true, isDefinition: true)
!950 = distinct !DICompileUnit(language: DW_LANG_C99, file: !951, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !952, retainedTypes: !985, globals: !1035, splitDebugInlining: false, nameTableKind: None)
!951 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/kernel/metairq_dispatch")
!952 = !{!953, !960, !966, !973, !978}
!953 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_rx_stop_reason", file: !767, line: 47, baseType: !32, size: 32, elements: !954)
!954 = !{!955, !956, !957, !958, !959}
!955 = !DIEnumerator(name: "UART_ERROR_OVERRUN", value: 1)
!956 = !DIEnumerator(name: "UART_ERROR_PARITY", value: 2)
!957 = !DIEnumerator(name: "UART_ERROR_FRAMING", value: 4)
!958 = !DIEnumerator(name: "UART_BREAK", value: 8)
!959 = !DIEnumerator(name: "UART_ERROR_COLLISION", value: 16)
!960 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_stop_bits", file: !767, line: 84, baseType: !32, size: 32, elements: !961)
!961 = !{!962, !963, !964, !965}
!962 = !DIEnumerator(name: "UART_CFG_STOP_BITS_0_5", value: 0)
!963 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1", value: 1)
!964 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1_5", value: 2)
!965 = !DIEnumerator(name: "UART_CFG_STOP_BITS_2", value: 3)
!966 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_data_bits", file: !767, line: 92, baseType: !32, size: 32, elements: !967)
!967 = !{!968, !969, !970, !971, !972}
!968 = !DIEnumerator(name: "UART_CFG_DATA_BITS_5", value: 0)
!969 = !DIEnumerator(name: "UART_CFG_DATA_BITS_6", value: 1)
!970 = !DIEnumerator(name: "UART_CFG_DATA_BITS_7", value: 2)
!971 = !DIEnumerator(name: "UART_CFG_DATA_BITS_8", value: 3)
!972 = !DIEnumerator(name: "UART_CFG_DATA_BITS_9", value: 4)
!973 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_flow_control", file: !767, line: 107, baseType: !32, size: 32, elements: !974)
!974 = !{!975, !976, !977}
!975 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_NONE", value: 0)
!976 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RTS_CTS", value: 1)
!977 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_DTR_DSR", value: 2)
!978 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_parity", file: !767, line: 75, baseType: !32, size: 32, elements: !979)
!979 = !{!980, !981, !982, !983, !984}
!980 = !DIEnumerator(name: "UART_CFG_PARITY_NONE", value: 0)
!981 = !DIEnumerator(name: "UART_CFG_PARITY_ODD", value: 1)
!982 = !DIEnumerator(name: "UART_CFG_PARITY_EVEN", value: 2)
!983 = !DIEnumerator(name: "UART_CFG_PARITY_MARK", value: 3)
!984 = !DIEnumerator(name: "UART_CFG_PARITY_SPACE", value: 4)
!985 = !{!986, !104, !170, !113}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !767, line: 336, size: 160, elements: !989)
!989 = !{!990, !1009, !1013, !1017, !1030}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !988, file: !767, line: 365, baseType: !991, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = !DISubroutineType(types: !993)
!993 = !{!105, !994, !788}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !529, line: 378, size: 192, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1007, !1008}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !996, file: !529, line: 380, baseType: !269, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !996, file: !529, line: 382, baseType: !13, size: 32, offset: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !996, file: !529, line: 384, baseType: !13, size: 32, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !996, file: !529, line: 386, baseType: !1002, size: 32, offset: 96)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 32)
