; ModuleID = 'build/96b_meerkat96/ipm_mcux/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pinctrl_soc_pinmux = type { i32, i32, i32, i8 }
%struct.imx_gpio_config = type { %union.anon.1, %struct.GPIO_Type*, %struct.pinctrl_soc_pinmux*, i8 }
%union.anon.1 = type { i32 }
%struct.GPIO_Type = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.gpio_driver_api = type { i32 (%struct.device*, i8, i32)*, i32 (%struct.device*, i32*)*, i32 (%struct.device*, i32, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i32)*, i32 (%struct.device*, i8, i32, i32)*, i32 (%struct.device*, %struct.gpio_callback*, i1)*, i32 (%struct.device*)* }
%struct.gpio_callback = type { %struct._snode, void (%struct.device*, %struct.gpio_callback*, i32)*, i32 }
%struct._snode = type { %struct._snode* }
%struct.imx_gpio_data = type { %union.anon.1, %struct._slist }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.imx_mu_config = type { %struct.MU_Type*, void (%struct.device*)* }
%struct.MU_Type = type { [4 x i32], [4 x i32], i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/ipm_mcux/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/ipm_mcux")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/ipm_mcux")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "gcounter", scope: !27, file: !170, line: 12, type: !103, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !169, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/ipm/ipm_mcux/src/main_master.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/ipm_mcux")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !104, !103, !105}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipm_driver_api", file: !108, line: 98, size: 160, elements: !109)
!108 = !DIFile(filename: "zephyr/include/zephyr/drivers/ipm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!109 = !{!110, !143, !154, !159, !164}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !107, file: !108, line: 99, baseType: !111, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_send_t", file: !108, line: 54, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 32)
!113 = !DISubroutineType(types: !114)
!114 = !{!103, !115, !103, !142, !13, !103}
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !119)
!118 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!119 = !{!120, !124, !125, !126, !135, !136}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !117, file: !118, line: 380, baseType: !121, size: 32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!123 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !117, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !117, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !117, file: !118, line: 386, baseType: !127, size: 32, offset: 96)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !129)
!129 = !{!130, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !128, file: !118, line: 359, baseType: !131, size: 8)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !132)
!132 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !128, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!134 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !117, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !117, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 32)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !118, line: 43, baseType: !140)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !141)
!141 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "register_callback", scope: !107, file: !108, line: 100, baseType: !144, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_register_callback_t", file: !108, line: 78, baseType: !145)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!146 = !DISubroutineType(types: !147)
!147 = !{null, !115, !148, !104}
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_callback_t", file: !108, line: 45, baseType: !149)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!150 = !DISubroutineType(types: !151)
!151 = !{null, !115, !104, !142, !152}
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: null)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "max_data_size_get", scope: !107, file: !108, line: 101, baseType: !155, size: 32, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_data_size_get_t", file: !108, line: 62, baseType: !156)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DISubroutineType(types: !158)
!158 = !{!103, !115}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "max_id_val_get", scope: !107, file: !108, line: 102, baseType: !160, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_id_val_get_t", file: !108, line: 70, baseType: !161)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!162 = !DISubroutineType(types: !163)
!163 = !{!142, !115}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "set_enabled", scope: !107, file: !108, line: 103, baseType: !165, size: 32, offset: 128)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_set_enabled_t", file: !108, line: 88, baseType: !166)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 32)
!167 = !DISubroutineType(types: !168)
!168 = !{!103, !115, !103}
!169 = !{!25}
!170 = !DIFile(filename: "zephyr/samples/drivers/ipm/ipm_mcux/src/main_master.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "_char_out", scope: !173, file: !177, line: 54, type: !178, isLocal: false, isDefinition: true)
!173 = distinct !DICompileUnit(language: DW_LANG_C99, file: !174, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !175, globals: !176, splitDebugInlining: false, nameTableKind: None)
!174 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/ipm_mcux")
!175 = !{!104, !103}
!176 = !{!171}
!177 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 32)
!179 = !DISubroutineType(types: !180)
!180 = !{!103, !103}
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !183, file: !599, line: 258, type: !600, isLocal: true, isDefinition: true, align: 32)
!183 = distinct !DICompileUnit(language: DW_LANG_C99, file: !184, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !185, retainedTypes: !468, globals: !598, splitDebugInlining: false, nameTableKind: None)
!184 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/ipm_mcux")
!185 = !{!186, !218, !228, !277, !283, !404, !439}
!186 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !187, line: 54, baseType: !32, size: 32, elements: !188)
!187 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217}
!189 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!190 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!191 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!192 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!193 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!194 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!195 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!196 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!197 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!198 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!199 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!200 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!201 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!202 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!203 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!204 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!205 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!206 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!207 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!208 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!209 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!210 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!211 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!212 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!213 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!214 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!215 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!216 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!217 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!218 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !187, line: 224, baseType: !32, size: 32, elements: !219)
!219 = !{!220, !221, !222, !223, !224, !225, !226, !227}
!220 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!221 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!222 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!223 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!224 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!225 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!226 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!227 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!228 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !187, line: 275, baseType: !32, size: 32, elements: !229)
!229 = !{!230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276}
!230 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!231 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!232 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!233 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!234 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!235 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!236 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!237 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!238 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!239 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!240 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!241 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!242 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!243 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!244 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!245 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!246 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!247 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!248 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!249 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!250 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!251 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!252 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!253 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!254 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!255 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!256 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!257 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!258 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!259 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!260 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!261 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!262 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!263 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!264 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!265 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!266 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!267 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!268 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!269 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!270 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!271 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!272 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!273 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!274 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!275 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!276 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!277 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !187, line: 327, baseType: !32, size: 32, elements: !278)
!278 = !{!279, !280, !281, !282}
!279 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!280 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!281 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!282 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !284, line: 76, baseType: !32, size: 32, elements: !285)
!284 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403}
!286 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!287 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!288 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!289 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!290 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!291 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!292 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!293 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!294 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!295 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!296 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!297 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!298 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!299 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!300 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!301 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!302 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!303 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!304 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!305 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!306 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!307 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!308 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!309 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!310 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!311 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!312 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!313 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!314 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!315 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!316 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!317 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!318 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!319 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!320 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!321 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!322 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!323 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!324 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!325 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!326 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!327 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!328 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!329 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!330 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!331 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!332 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!333 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!334 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!335 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!336 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!337 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!338 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!339 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!340 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!341 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!342 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!343 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!344 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!345 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!346 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!347 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!348 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!349 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!350 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!351 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!352 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!353 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!354 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!355 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!356 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!357 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!358 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!359 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!360 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!361 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!362 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!363 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!364 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!365 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!366 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!367 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!368 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!369 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!370 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!371 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!372 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!373 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!374 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!375 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!376 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!377 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!378 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!379 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!380 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!381 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!382 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!383 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!384 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!385 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!386 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!387 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!388 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!389 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!390 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!391 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!392 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!393 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!394 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!395 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!396 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!397 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!398 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!399 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!400 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!401 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!402 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!403 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!404 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !187, line: 237, baseType: !32, size: 32, elements: !405)
!405 = !{!406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438}
!406 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!407 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!408 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!409 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!410 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!411 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!412 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!413 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!414 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!415 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!416 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!417 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!418 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!419 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!420 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!421 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!422 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!423 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!424 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!425 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!426 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!427 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!428 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!429 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!430 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!431 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!432 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!433 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!434 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!435 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!436 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!437 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!438 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!439 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !284, line: 44, baseType: !32, size: 32, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467}
!441 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!442 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!443 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!444 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!445 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!446 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!447 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!448 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!449 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!450 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!451 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!452 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!453 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!454 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!455 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!456 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!457 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!458 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!459 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!460 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!461 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!462 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!463 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!464 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!465 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!466 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!467 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!468 = !{!469, !541, !584, !597, !142}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !471, line: 4575, baseType: !472)
!471 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 4532, size: 390144, elements: !473)
!473 = !{!474, !476, !477, !478, !479, !483, !493, !497, !507, !511}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !472, file: !471, line: 4533, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !142)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !472, file: !471, line: 4534, baseType: !475, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !472, file: !471, line: 4535, baseType: !475, size: 32, offset: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !472, file: !471, line: 4536, baseType: !475, size: 32, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !472, file: !471, line: 4537, baseType: !480, size: 16256, offset: 128)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 16256, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 2032)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !472, file: !471, line: 4543, baseType: !484, size: 4224, offset: 16384)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 4224, elements: !491)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !472, file: !471, line: 4538, size: 128, elements: !486)
!486 = !{!487, !488, !489, !490}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !485, file: !471, line: 4539, baseType: !475, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_SET", scope: !485, file: !471, line: 4540, baseType: !475, size: 32, offset: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_CLR", scope: !485, file: !471, line: 4541, baseType: !475, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_TOG", scope: !485, file: !471, line: 4542, baseType: !475, size: 32, offset: 96)
!491 = !{!492}
!492 = !DISubrange(count: 33)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !472, file: !471, line: 4544, baseType: !494, size: 110464, offset: 20608)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 110464, elements: !495)
!495 = !{!496}
!496 = !DISubrange(count: 13808)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !472, file: !471, line: 4550, baseType: !498, size: 24448, offset: 131072)
!498 = !DICompositeType(tag: DW_TAG_array_type, baseType: !499, size: 24448, elements: !505)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !472, file: !471, line: 4545, size: 128, elements: !500)
!500 = !{!501, !502, !503, !504}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !499, file: !471, line: 4546, baseType: !475, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_SET", scope: !499, file: !471, line: 4547, baseType: !475, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_CLR", scope: !499, file: !471, line: 4548, baseType: !475, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_TOG", scope: !499, file: !471, line: 4549, baseType: !475, size: 32, offset: 96)
!505 = !{!506}
!506 = !DISubrange(count: 191)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !472, file: !471, line: 4551, baseType: !508, size: 106624, offset: 155520)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 106624, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 13328)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !472, file: !471, line: 4574, baseType: !512, size: 128000, offset: 262144)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 128000, elements: !539)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !472, file: !471, line: 4552, size: 1024, elements: !514)
!514 = !{!515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !535, !536, !537, !538}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT", scope: !513, file: !471, line: 4553, baseType: !475, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_SET", scope: !513, file: !471, line: 4554, baseType: !475, size: 32, offset: 32)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_CLR", scope: !513, file: !471, line: 4555, baseType: !475, size: 32, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_TOG", scope: !513, file: !471, line: 4556, baseType: !475, size: 32, offset: 96)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "MISC", scope: !513, file: !471, line: 4557, baseType: !475, size: 32, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_SET", scope: !513, file: !471, line: 4558, baseType: !475, size: 32, offset: 160)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_CLR", scope: !513, file: !471, line: 4559, baseType: !475, size: 32, offset: 192)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_TOG", scope: !513, file: !471, line: 4560, baseType: !475, size: 32, offset: 224)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "POST", scope: !513, file: !471, line: 4561, baseType: !475, size: 32, offset: 256)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_SET", scope: !513, file: !471, line: 4562, baseType: !475, size: 32, offset: 288)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_CLR", scope: !513, file: !471, line: 4563, baseType: !475, size: 32, offset: 320)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_TOG", scope: !513, file: !471, line: 4564, baseType: !475, size: 32, offset: 352)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "PRE", scope: !513, file: !471, line: 4565, baseType: !475, size: 32, offset: 384)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_SET", scope: !513, file: !471, line: 4566, baseType: !475, size: 32, offset: 416)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_CLR", scope: !513, file: !471, line: 4567, baseType: !475, size: 32, offset: 448)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_TOG", scope: !513, file: !471, line: 4568, baseType: !475, size: 32, offset: 480)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !513, file: !471, line: 4569, baseType: !532, size: 384, offset: 512)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 384, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 48)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL", scope: !513, file: !471, line: 4570, baseType: !475, size: 32, offset: 896)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_SET", scope: !513, file: !471, line: 4571, baseType: !475, size: 32, offset: 928)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_CLR", scope: !513, file: !471, line: 4572, baseType: !475, size: 32, offset: 960)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !513, file: !471, line: 4573, baseType: !475, size: 32, offset: 992)
!539 = !{!540}
!540 = !DISubrange(count: 125)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDC_Type", file: !471, line: 38320, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 38303, size: 23040, elements: !544)
!544 = !{!545, !547, !551, !552, !553, !554, !558, !562, !566, !570, !574}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "VIR", scope: !543, file: !471, line: 38304, baseType: !546, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !475)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !543, file: !471, line: 38305, baseType: !548, size: 256, offset: 32)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 256, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 32)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "STAT", scope: !543, file: !471, line: 38306, baseType: !475, size: 32, offset: 288)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "INTCTRL", scope: !543, file: !471, line: 38307, baseType: !475, size: 32, offset: 320)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "INTSTAT", scope: !543, file: !471, line: 38308, baseType: !475, size: 32, offset: 352)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !543, file: !471, line: 38309, baseType: !555, size: 3712, offset: 384)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 3712, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 464)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "MDA", scope: !543, file: !471, line: 38310, baseType: !559, size: 864, offset: 4096)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 864, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 27)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !543, file: !471, line: 38311, baseType: !563, size: 3232, offset: 4960)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 3232, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 404)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "PDAP", scope: !543, file: !471, line: 38312, baseType: !567, size: 3776, offset: 8192)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 3776, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 118)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_3", scope: !543, file: !471, line: 38313, baseType: !571, size: 4416, offset: 11968)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 4416, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 552)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "MR", scope: !543, file: !471, line: 38319, baseType: !575, size: 6656, offset: 16384)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 6656, elements: !582)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !543, file: !471, line: 38314, size: 128, elements: !577)
!577 = !{!578, !579, !580, !581}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "MRSA", scope: !576, file: !471, line: 38315, baseType: !475, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "MREA", scope: !576, file: !471, line: 38316, baseType: !475, size: 32, offset: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "MRC", scope: !576, file: !471, line: 38317, baseType: !475, size: 32, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "MRVS", scope: !576, file: !471, line: 38318, baseType: !475, size: 32, offset: 96)
!582 = !{!583}
!583 = !DISubrange(count: 52)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "WDOG_Type", file: !471, line: 43319, baseType: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 43313, size: 80, elements: !587)
!587 = !{!588, !592, !593, !595, !596}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "WCR", scope: !586, file: !471, line: 43314, baseType: !589, size: 16)
!589 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !591)
!591 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "WSR", scope: !586, file: !471, line: 43315, baseType: !589, size: 16, offset: 16)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "WRSR", scope: !586, file: !471, line: 43316, baseType: !594, size: 16, offset: 32)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !589)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "WICR", scope: !586, file: !471, line: 43317, baseType: !589, size: 16, offset: 48)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "WMCR", scope: !586, file: !471, line: 43318, baseType: !589, size: 16, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 32)
!598 = !{!181}
!599 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !602, line: 51, size: 64, elements: !603)
!602 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!603 = !{!604, !611}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !601, file: !602, line: 60, baseType: !605, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!606 = !DISubroutineType(types: !607)
!607 = !{!103, !608}
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!610 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !602, line: 48, flags: DIFlagFwdDecl)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !601, file: !602, line: 65, baseType: !608, size: 32, offset: 32)
!612 = !DIGlobalVariableExpression(var: !613, expr: !DIExpression())
!613 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !614, file: !621, line: 21, type: !178, isLocal: true, isDefinition: true)
!614 = distinct !DICompileUnit(language: DW_LANG_C99, file: !615, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !616, globals: !620, splitDebugInlining: false, nameTableKind: None)
!615 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/ipm_mcux")
!616 = !{!617, !103, !104}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !619, line: 22, baseType: !103)
!619 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!620 = !{!612}
!621 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !624, file: !715, line: 603, type: !717, isLocal: true, isDefinition: true, align: 32)
!624 = distinct !DICompileUnit(language: DW_LANG_C99, file: !625, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !626, globals: !712, splitDebugInlining: false, nameTableKind: None)
!625 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/ipm_mcux")
!626 = !{!104, !103, !627}
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !629)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !630, line: 336, size: 608, elements: !631)
!630 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!631 = !{!632, !652, !656, !660, !673, !678, !684, !690, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !629, file: !630, line: 365, baseType: !633, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!634 = !DISubroutineType(types: !635)
!635 = !{!103, !636, !651}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !639)
!639 = !{!640, !641, !642, !643, !649, !650}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !638, file: !118, line: 380, baseType: !121, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !638, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !638, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !638, file: !118, line: 386, baseType: !644, size: 32, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !645, file: !118, line: 359, baseType: !131, size: 8)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !645, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !638, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !638, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !629, file: !630, line: 366, baseType: !653, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 32)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !636, !132}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !629, file: !630, line: 374, baseType: !657, size: 32, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!658 = !DISubroutineType(types: !659)
!659 = !{!103, !636}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !629, file: !630, line: 377, baseType: !661, size: 32, offset: 96)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!662 = !DISubroutineType(types: !663)
!663 = !{!103, !636, !664}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !630, line: 122, size: 64, elements: !667)
!667 = !{!668, !669, !670, !671, !672}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !666, file: !630, line: 123, baseType: !142, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !666, file: !630, line: 124, baseType: !131, size: 8, offset: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !666, file: !630, line: 125, baseType: !131, size: 8, offset: 40)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !666, file: !630, line: 126, baseType: !131, size: 8, offset: 48)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !666, file: !630, line: 127, baseType: !131, size: 8, offset: 56)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !629, file: !630, line: 379, baseType: !674, size: 32, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 32)
!675 = !DISubroutineType(types: !676)
!676 = !{!103, !636, !677}
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !629, file: !630, line: 384, baseType: !679, size: 32, offset: 160)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!680 = !DISubroutineType(types: !681)
!681 = !{!103, !636, !682, !103}
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !629, file: !630, line: 393, baseType: !685, size: 32, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!686 = !DISubroutineType(types: !687)
!687 = !{!103, !636, !688, !689}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !629, file: !630, line: 402, baseType: !691, size: 32, offset: 224)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = !DISubroutineType(types: !693)
!693 = !{null, !636}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !629, file: !630, line: 405, baseType: !691, size: 32, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !629, file: !630, line: 408, baseType: !657, size: 32, offset: 288)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !629, file: !630, line: 411, baseType: !691, size: 32, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !629, file: !630, line: 414, baseType: !691, size: 32, offset: 352)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !629, file: !630, line: 417, baseType: !657, size: 32, offset: 384)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !629, file: !630, line: 420, baseType: !657, size: 32, offset: 416)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !629, file: !630, line: 423, baseType: !691, size: 32, offset: 448)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !629, file: !630, line: 426, baseType: !691, size: 32, offset: 480)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !629, file: !630, line: 429, baseType: !657, size: 32, offset: 512)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !629, file: !630, line: 432, baseType: !657, size: 32, offset: 544)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !629, file: !630, line: 435, baseType: !705, size: 32, offset: 576)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!706 = !DISubroutineType(types: !707)
!707 = !{null, !636, !708, !104}
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !630, line: 142, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 32)
!710 = !DISubroutineType(types: !711)
!711 = !{null, !636, !104}
!712 = !{!622, !713}
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !624, file: !715, line: 38, type: !716, isLocal: true, isDefinition: true)
!715 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!716 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !636)
!717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !602, line: 51, size: 64, elements: !719)
!719 = !{!720, !721}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !718, file: !602, line: 60, baseType: !657, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !718, file: !602, line: 65, baseType: !636, size: 32, offset: 32)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "mcux_igpio_pinmux_0", scope: !724, file: !829, line: 318, type: !906, isLocal: false, isDefinition: true)
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !725, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !726, retainedTypes: !743, globals: !826, splitDebugInlining: false, nameTableKind: None)
!725 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/ipm_mcux")
!726 = !{!727, !733, !738}
!727 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !728, line: 506, baseType: !32, size: 32, elements: !729)
!728 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!729 = !{!730, !731, !732}
!730 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!731 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!732 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!733 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !728, line: 512, baseType: !32, size: 32, elements: !734)
!734 = !{!735, !736, !737}
!735 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!736 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!737 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!738 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_gpio_pin_action", file: !739, line: 66, baseType: !32, size: 32, elements: !740)
!739 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./gpio_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!740 = !{!741, !742}
!741 = !DIEnumerator(name: "gpioPinClear", value: 0)
!742 = !DIEnumerator(name: "gpioPinSet", value: 1)
!743 = !{!744, !814, !819, !779, !733, !727, !824, !104, !597, !794, !825}
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !746)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !728, line: 523, size: 288, elements: !747)
!747 = !{!748, !769, !775, !780, !784, !785, !786, !790, !810}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !746, file: !728, line: 524, baseType: !749, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 32)
!750 = !DISubroutineType(types: !751)
!751 = !{!103, !752, !767, !768}
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !755)
!755 = !{!756, !757, !758, !759, !765, !766}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !754, file: !118, line: 380, baseType: !121, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !754, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !754, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !754, file: !118, line: 386, baseType: !760, size: 32, offset: 96)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 32)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !761, file: !118, line: 359, baseType: !131, size: 8)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !761, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !754, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !754, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !728, line: 237, baseType: !131)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !728, line: 257, baseType: !142)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !746, file: !728, line: 530, baseType: !770, size: 32, offset: 32)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 32)
!771 = !DISubroutineType(types: !772)
!772 = !{!103, !752, !773}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !728, line: 229, baseType: !142)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !746, file: !728, line: 532, baseType: !776, size: 32, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!777 = !DISubroutineType(types: !778)
!778 = !{!103, !752, !779, !774}
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !728, line: 216, baseType: !142)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !746, file: !728, line: 535, baseType: !781, size: 32, offset: 96)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DISubroutineType(types: !783)
!783 = !{!103, !752, !779}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !746, file: !728, line: 537, baseType: !781, size: 32, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !746, file: !728, line: 539, baseType: !781, size: 32, offset: 160)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !746, file: !728, line: 541, baseType: !787, size: 32, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DISubroutineType(types: !789)
!789 = !{!103, !752, !767, !727, !733}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !746, file: !728, line: 544, baseType: !791, size: 32, offset: 224)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = !DISubroutineType(types: !793)
!793 = !{!103, !752, !794, !134}
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !728, line: 478, size: 96, elements: !796)
!796 = !{!797, !804, !809}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !795, file: !728, line: 482, baseType: !798, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !799, line: 33, baseType: !800)
!799 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !799, line: 29, size: 32, elements: !801)
!801 = !{!802}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !800, file: !799, line: 30, baseType: !803, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !795, file: !728, line: 485, baseType: !805, size: 32, offset: 32)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !728, line: 464, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 32)
!807 = !DISubroutineType(types: !808)
!808 = !{null, !752, !794, !779}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !795, file: !728, line: 493, baseType: !779, size: 32, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !746, file: !728, line: 547, baseType: !811, size: 32, offset: 256)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 32)
!812 = !DISubroutineType(types: !813)
!813 = !{!142, !752}
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !816)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !728, line: 428, size: 32, elements: !817)
!817 = !{!818}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !816, file: !728, line: 434, baseType: !779, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !821)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !728, line: 441, size: 32, elements: !822)
!822 = !{!823}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !821, file: !728, line: 447, baseType: !779, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!826 = !{!722, !827, !833, !835, !845, !857, !859, !890, !892, !904}
!827 = !DIGlobalVariableExpression(var: !828, expr: !DIExpression())
!828 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !724, file: !829, line: 318, type: !830, isLocal: false, isDefinition: true, align: 16)
!829 = !DIFile(filename: "zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 400, elements: !831)
!831 = !{!832}
!832 = !DISubrange(count: 25)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "__device_dts_ord_25", scope: !724, file: !829, line: 318, type: !753, isLocal: false, isDefinition: true, align: 32)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_25", scope: !724, file: !829, line: 318, type: !837, isLocal: true, isDefinition: true, align: 32)
!837 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !602, line: 51, size: 64, elements: !839)
!839 = !{!840, !844}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !838, file: !602, line: 60, baseType: !841, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 32)
!842 = !DISubroutineType(types: !843)
!843 = !{!103, !752}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !838, file: !602, line: 65, baseType: !752, size: 32, offset: 32)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "imx_gpio_0_data", scope: !724, file: !829, line: 318, type: !847, isLocal: true, isDefinition: true)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_data", file: !829, line: 33, size: 96, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !847, file: !829, line: 35, baseType: !821, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !847, file: !829, line: 37, baseType: !851, size: 64, offset: 32)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !799, line: 40, baseType: !852)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !799, line: 35, size: 64, elements: !853)
!853 = !{!854, !856}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !852, file: !799, line: 36, baseType: !855, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !852, file: !799, line: 37, baseType: !855, size: 32, offset: 32)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_25", scope: !724, file: !829, line: 318, type: !761, isLocal: true, isDefinition: true, align: 8)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "imx_gpio_0_config", scope: !724, file: !829, line: 318, type: !861, isLocal: true, isDefinition: true)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_config", file: !829, line: 23, size: 128, elements: !863)
!863 = !{!864, !865, !878, !889}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !862, file: !829, line: 25, baseType: !816, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !862, file: !829, line: 26, baseType: !866, size: 32, offset: 32)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_Type", file: !471, line: 19729, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 19720, size: 256, elements: !869)
!869 = !{!870, !871, !872, !873, !874, !875, !876, !877}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !868, file: !471, line: 19721, baseType: !475, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "GDIR", scope: !868, file: !471, line: 19722, baseType: !475, size: 32, offset: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "PSR", scope: !868, file: !471, line: 19723, baseType: !546, size: 32, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ICR1", scope: !868, file: !471, line: 19724, baseType: !475, size: 32, offset: 96)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ICR2", scope: !868, file: !471, line: 19725, baseType: !475, size: 32, offset: 128)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !868, file: !471, line: 19726, baseType: !475, size: 32, offset: 160)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ISR", scope: !868, file: !471, line: 19727, baseType: !475, size: 32, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "EDGE_SEL", scope: !868, file: !471, line: 19728, baseType: !475, size: 32, offset: 224)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "pin_muxes", scope: !862, file: !829, line: 28, baseType: !879, size: 32, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !881)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_soc_pinmux", file: !882, line: 51, size: 128, elements: !883)
!882 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/pinctrl_soc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!883 = !{!884, !885, !886, !887, !888}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "mux_register", scope: !881, file: !882, line: 52, baseType: !142, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "config_register", scope: !881, file: !882, line: 53, baseType: !142, size: 32, offset: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "input_register", scope: !881, file: !882, line: 54, baseType: !142, size: 32, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "mux_mode", scope: !881, file: !882, line: 55, baseType: !131, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "input_daisy", scope: !881, file: !882, line: 56, baseType: !142, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "mux_count", scope: !862, file: !829, line: 29, baseType: !131, size: 8, offset: 96)
!890 = !DIGlobalVariableExpression(var: !891, expr: !DIExpression())
!891 = distinct !DIGlobalVariable(name: "imx_gpio_driver_api", scope: !724, file: !829, line: 249, type: !745, isLocal: true, isDefinition: true)
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "__isr_imx_gpio_port_isr_irq_0", scope: !894, file: !829, line: 318, type: !897, isLocal: true, isDefinition: true, align: 32)
!894 = distinct !DISubprogram(name: "imx_gpio_0_init", scope: !829, file: !829, line: 318, type: !842, scopeLine: 318, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !724, retainedNodes: !895)
!895 = !{!896}
!896 = !DILocalVariable(name: "port", arg: 1, scope: !894, file: !829, line: 318, type: !752)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !898)
!898 = !{!899, !901, !902, !903}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !897, file: !10, line: 55, baseType: !900, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !897, file: !10, line: 57, baseType: !900, size: 32, offset: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !897, file: !10, line: 59, baseType: !104, size: 32, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !897, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "__isr_imx_gpio_port_isr_irq_1", scope: !894, file: !829, line: 318, type: !897, isLocal: true, isDefinition: true, align: 32)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !880, size: 2048, elements: !907)
!907 = !{!908}
!908 = !DISubrange(count: 16)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !911, file: !916, line: 7, type: !917, isLocal: false, isDefinition: true, align: 16)
!911 = distinct !DICompileUnit(language: DW_LANG_C99, file: !912, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !913, splitDebugInlining: false, nameTableKind: None)
!912 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/ipm_mcux/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/ipm_mcux")
!913 = !{!909, !914, !920}
!914 = !DIGlobalVariableExpression(var: !915, expr: !DIExpression())
!915 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_190", scope: !911, file: !916, line: 12, type: !917, isLocal: false, isDefinition: true, align: 16)
!916 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/ipm_mcux")
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 48, elements: !918)
!918 = !{!919}
!919 = !DISubrange(count: 3)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_198", scope: !911, file: !916, line: 17, type: !917, isLocal: false, isDefinition: true, align: 16)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(name: "imx_mu_b_config", scope: !924, file: !1002, line: 337, type: !1038, isLocal: true, isDefinition: true)
!924 = distinct !DICompileUnit(language: DW_LANG_C99, file: !925, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !926, retainedTypes: !938, globals: !999, splitDebugInlining: false, nameTableKind: None)
!925 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/ipm/ipm_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/ipm_mcux")
!926 = !{!30, !927}
!927 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_mu_status", file: !928, line: 70, baseType: !32, size: 32, elements: !929)
!928 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./mu_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!929 = !{!930, !931, !932, !933, !934, !935, !936, !937}
!930 = !DIEnumerator(name: "kStatus_MU_Success", value: 0)
!931 = !DIEnumerator(name: "kStatus_MU_TxNotEmpty", value: 1)
!932 = !DIEnumerator(name: "kStatus_MU_RxNotFull", value: 2)
!933 = !DIEnumerator(name: "kStatus_MU_FlagPending", value: 3)
!934 = !DIEnumerator(name: "kStatus_MU_EventPending", value: 4)
!935 = !DIEnumerator(name: "kStatus_MU_Initialized", value: 5)
!936 = !DIEnumerator(name: "kStatus_MU_IntPending", value: 6)
!937 = !DIEnumerator(name: "kStatus_MU_Failed", value: 7)
!938 = !{!104, !103, !939, !987, !142, !134}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipm_driver_api", file: !108, line: 98, size: 160, elements: !942)
!942 = !{!943, !963, !972, !977, !982}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "send", scope: !941, file: !108, line: 99, baseType: !944, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_send_t", file: !108, line: 54, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 32)
!946 = !DISubroutineType(types: !947)
!947 = !{!103, !948, !103, !142, !13, !103}
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !951)
!951 = !{!952, !953, !954, !955, !961, !962}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !950, file: !118, line: 380, baseType: !121, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !950, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !950, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !950, file: !118, line: 386, baseType: !956, size: 32, offset: 96)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 32)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !958)
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !957, file: !118, line: 359, baseType: !131, size: 8)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !957, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !950, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !950, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "register_callback", scope: !941, file: !108, line: 100, baseType: !964, size: 32, offset: 32)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_register_callback_t", file: !108, line: 78, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = !DISubroutineType(types: !967)
!967 = !{null, !948, !968, !104}
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_callback_t", file: !108, line: 45, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DISubroutineType(types: !971)
!971 = !{null, !948, !104, !142, !152}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "max_data_size_get", scope: !941, file: !108, line: 101, baseType: !973, size: 32, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_data_size_get_t", file: !108, line: 62, baseType: !974)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 32)
!975 = !DISubroutineType(types: !976)
!976 = !{!103, !948}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "max_id_val_get", scope: !941, file: !108, line: 102, baseType: !978, size: 32, offset: 96)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_max_id_val_get_t", file: !108, line: 70, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 32)
!980 = !DISubroutineType(types: !981)
!981 = !{!142, !948}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "set_enabled", scope: !941, file: !108, line: 103, baseType: !983, size: 32, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "ipm_set_enabled_t", file: !108, line: 88, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DISubroutineType(types: !986)
!986 = !{!103, !948, !103}
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "MU_Type", file: !471, line: 30872, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 30867, size: 320, elements: !990)
!990 = !{!991, !995, !997, !998}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "TR", scope: !989, file: !471, line: 30868, baseType: !992, size: 128)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 128, elements: !993)
!993 = !{!994}
!994 = !DISubrange(count: 4)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "RR", scope: !989, file: !471, line: 30869, baseType: !996, size: 128, offset: 128)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 128, elements: !993)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !989, file: !471, line: 30870, baseType: !475, size: 32, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !989, file: !471, line: 30871, baseType: !475, size: 32, offset: 288)
!999 = !{!1000, !1006, !1008, !1015, !1021, !922, !1023, !1036}
!1000 = !DIGlobalVariableExpression(var: !1001, expr: !DIExpression())
!1001 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_190", scope: !924, file: !1002, line: 344, type: !1003, isLocal: false, isDefinition: true, align: 16)
!1002 = !DIFile(filename: "zephyr/drivers/ipm/ipm_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1003 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 80, elements: !1004)
!1004 = !{!1005}
!1005 = !DISubrange(count: 5)
!1006 = !DIGlobalVariableExpression(var: !1007, expr: !DIExpression())
!1007 = distinct !DIGlobalVariable(name: "__device_dts_ord_190", scope: !924, file: !1002, line: 344, type: !949, isLocal: false, isDefinition: true, align: 32)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_190", scope: !924, file: !1002, line: 344, type: !1010, isLocal: true, isDefinition: true, align: 32)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !602, line: 51, size: 64, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1011, file: !602, line: 60, baseType: !974, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1011, file: !602, line: 65, baseType: !948, size: 32, offset: 32)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "imx_mu_b_data", scope: !924, file: !1002, line: 342, type: !1017, isLocal: true, isDefinition: true)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_mu_data", file: !1002, line: 34, size: 64, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1017, file: !1002, line: 35, baseType: !968, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !1017, file: !1002, line: 36, baseType: !104, size: 32, offset: 32)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_190", scope: !924, file: !1002, line: 344, type: !957, isLocal: true, isDefinition: true, align: 8)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(name: "__isr_imx_mu_isr_irq_0", scope: !1025, file: !1002, line: 353, type: !1030, isLocal: true, isDefinition: true, align: 32)
!1025 = distinct !DISubprogram(name: "imx_mu_config_func_b", scope: !1002, file: !1002, line: 351, type: !1026, scopeLine: 352, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !924, retainedNodes: !1028)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{null, !948}
!1028 = !{!1029}
!1029 = !DILocalVariable(name: "dev", arg: 1, scope: !1025, file: !1002, line: 351, type: !948)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !1031)
!1031 = !{!1032, !1033, !1034, !1035}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !1030, file: !10, line: 55, baseType: !900, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1030, file: !10, line: 57, baseType: !900, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1030, file: !10, line: 59, baseType: !104, size: 32, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !1030, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "imx_mu_driver_api", scope: !924, file: !1002, line: 325, type: !940, isLocal: true, isDefinition: true)
!1038 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_mu_config", file: !1002, line: 29, size: 64, elements: !1040)
!1040 = !{!1041, !1042}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1039, file: !1002, line: 30, baseType: !987, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "irq_config_func", scope: !1039, file: !1002, line: 31, baseType: !1043, size: 32, offset: 32)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 32)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(name: "imx_uart_0_config", scope: !1046, file: !1243, line: 339, type: !1241, isLocal: true, isDefinition: true)
!1046 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1047, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1048, retainedTypes: !1134, globals: !1279, splitDebugInlining: false, nameTableKind: None)
!1047 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/ipm_mcux")
!1048 = !{!30, !1049, !1087, !1115, !1119, !1123, !1128}
!1049 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_status_flag", file: !1050, line: 122, baseType: !32, size: 32, elements: !1051)
!1050 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./uart_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1051 = !{!1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086}
!1052 = !DIEnumerator(name: "uartStatusRxCharReady", value: 15)
!1053 = !DIEnumerator(name: "uartStatusRxError", value: 14)
!1054 = !DIEnumerator(name: "uartStatusRxOverrunError", value: 13)
!1055 = !DIEnumerator(name: "uartStatusRxFrameError", value: 12)
!1056 = !DIEnumerator(name: "uartStatusRxBreakDetect", value: 11)
!1057 = !DIEnumerator(name: "uartStatusRxParityError", value: 10)
!1058 = !DIEnumerator(name: "uartStatusParityError", value: 9699343)
!1059 = !DIEnumerator(name: "uartStatusRtsStatus", value: 9699342)
!1060 = !DIEnumerator(name: "uartStatusTxReady", value: 9699341)
!1061 = !DIEnumerator(name: "uartStatusRtsDelta", value: 9699340)
!1062 = !DIEnumerator(name: "uartStatusEscape", value: 9699339)
!1063 = !DIEnumerator(name: "uartStatusFrameError", value: 9699338)
!1064 = !DIEnumerator(name: "uartStatusRxReady", value: 9699337)
!1065 = !DIEnumerator(name: "uartStatusAgingTimer", value: 9699336)
!1066 = !DIEnumerator(name: "uartStatusDtrDelta", value: 9699335)
!1067 = !DIEnumerator(name: "uartStatusRxDs", value: 9699334)
!1068 = !DIEnumerator(name: "uartStatustAirWake", value: 9699333)
!1069 = !DIEnumerator(name: "uartStatusAwake", value: 9699332)
!1070 = !DIEnumerator(name: "uartStatusRs485SlaveAddrMatch", value: 9699331)
!1071 = !DIEnumerator(name: "uartStatusAutoBaud", value: 9961487)
!1072 = !DIEnumerator(name: "uartStatusTxEmpty", value: 9961486)
!1073 = !DIEnumerator(name: "uartStatusDtr", value: 9961485)
!1074 = !DIEnumerator(name: "uartStatusIdle", value: 9961484)
!1075 = !DIEnumerator(name: "uartStatusAutoBaudCntStop", value: 9961483)
!1076 = !DIEnumerator(name: "uartStatusRiDelta", value: 9961482)
!1077 = !DIEnumerator(name: "uartStatusRi", value: 9961481)
!1078 = !DIEnumerator(name: "uartStatusIr", value: 9961480)
!1079 = !DIEnumerator(name: "uartStatusWake", value: 9961479)
!1080 = !DIEnumerator(name: "uartStatusDcdDelta", value: 9961478)
!1081 = !DIEnumerator(name: "uartStatusDcd", value: 9961477)
!1082 = !DIEnumerator(name: "uartStatusRts", value: 9961476)
!1083 = !DIEnumerator(name: "uartStatusTxComplete", value: 9961475)
!1084 = !DIEnumerator(name: "uartStatusBreakDetect", value: 9961474)
!1085 = !DIEnumerator(name: "uartStatusRxOverrun", value: 9961473)
!1086 = !DIEnumerator(name: "uartStatusRxDataReady", value: 9961472)
!1087 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_interrupt", file: !1050, line: 91, baseType: !32, size: 32, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114}
!1089 = !DIEnumerator(name: "uartIntAutoBaud", value: 8388623)
!1090 = !DIEnumerator(name: "uartIntTxReady", value: 8388621)
!1091 = !DIEnumerator(name: "uartIntIdle", value: 8388620)
!1092 = !DIEnumerator(name: "uartIntRxReady", value: 8388617)
!1093 = !DIEnumerator(name: "uartIntTxEmpty", value: 8388614)
!1094 = !DIEnumerator(name: "uartIntRtsDelta", value: 8388613)
!1095 = !DIEnumerator(name: "uartIntEscape", value: 8650767)
!1096 = !DIEnumerator(name: "uartIntRts", value: 8650756)
!1097 = !DIEnumerator(name: "uartIntAgingTimer", value: 8650755)
!1098 = !DIEnumerator(name: "uartIntDtr", value: 8912909)
!1099 = !DIEnumerator(name: "uartIntParityError", value: 8912908)
!1100 = !DIEnumerator(name: "uartIntFrameError", value: 8912907)
!1101 = !DIEnumerator(name: "uartIntDcd", value: 8912905)
!1102 = !DIEnumerator(name: "uartIntRi", value: 8912904)
!1103 = !DIEnumerator(name: "uartIntRxDs", value: 8912902)
!1104 = !DIEnumerator(name: "uartInttAirWake", value: 8912901)
!1105 = !DIEnumerator(name: "uartIntAwake", value: 8912900)
!1106 = !DIEnumerator(name: "uartIntDtrDelta", value: 8912899)
!1107 = !DIEnumerator(name: "uartIntAutoBaudCnt", value: 8912896)
!1108 = !DIEnumerator(name: "uartIntIr", value: 9175048)
!1109 = !DIEnumerator(name: "uartIntWake", value: 9175047)
!1110 = !DIEnumerator(name: "uartIntTxComplete", value: 9175043)
!1111 = !DIEnumerator(name: "uartIntBreakDetect", value: 9175042)
!1112 = !DIEnumerator(name: "uartIntRxOverrun", value: 9175041)
!1113 = !DIEnumerator(name: "uartIntRxDataReady", value: 9175040)
!1114 = !DIEnumerator(name: "uartIntRs485SlaveAddrMatch", value: 12058627)
!1115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_word_length", file: !1050, line: 60, baseType: !32, size: 32, elements: !1116)
!1116 = !{!1117, !1118}
!1117 = !DIEnumerator(name: "uartWordLength7Bits", value: 0)
!1118 = !DIEnumerator(name: "uartWordLength8Bits", value: 32)
!1119 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_stop_bit_num", file: !1050, line: 67, baseType: !32, size: 32, elements: !1120)
!1120 = !{!1121, !1122}
!1121 = !DIEnumerator(name: "uartStopBitNumOne", value: 0)
!1122 = !DIEnumerator(name: "uartStopBitNumTwo", value: 64)
!1123 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_partity_mode", file: !1050, line: 74, baseType: !32, size: 32, elements: !1124)
!1124 = !{!1125, !1126, !1127}
!1125 = !DIEnumerator(name: "uartParityDisable", value: 0)
!1126 = !DIEnumerator(name: "uartParityEven", value: 256)
!1127 = !DIEnumerator(name: "uartParityOdd", value: 384)
!1128 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_direction_mode", file: !1050, line: 82, baseType: !32, size: 32, elements: !1129)
!1129 = !{!1130, !1131, !1132, !1133}
!1130 = !DIEnumerator(name: "uartDirectionDisable", value: 0)
!1131 = !DIEnumerator(name: "uartDirectionTx", value: 4)
!1132 = !DIEnumerator(name: "uartDirectionRx", value: 2)
!1133 = !DIEnumerator(name: "uartDirectionTxRx", value: 6)
!1134 = !{!104, !103, !1135, !1214, !1240, !1278, !142, !134, !131}
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 32)
!1136 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1137)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !630, line: 336, size: 608, elements: !1138)
!1138 = !{!1139, !1158, !1162, !1166, !1179, !1184, !1188, !1192, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !1137, file: !630, line: 365, baseType: !1140, size: 32)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 32)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!103, !1143, !651}
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 32)
!1144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !118, line: 378, size: 192, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1156, !1157}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1145, file: !118, line: 380, baseType: !121, size: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1145, file: !118, line: 382, baseType: !13, size: 32, offset: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1145, file: !118, line: 384, baseType: !13, size: 32, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1145, file: !118, line: 386, baseType: !1151, size: 32, offset: 96)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 32)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !118, line: 351, size: 16, elements: !1153)
!1153 = !{!1154, !1155}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1152, file: !118, line: 359, baseType: !131, size: 8)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1152, file: !118, line: 364, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1145, file: !118, line: 388, baseType: !104, size: 32, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1145, file: !118, line: 396, baseType: !137, size: 32, offset: 160)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !1137, file: !630, line: 366, baseType: !1159, size: 32, offset: 32)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 32)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{null, !1143, !132}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !1137, file: !630, line: 374, baseType: !1163, size: 32, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 32)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!103, !1143}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !1137, file: !630, line: 377, baseType: !1167, size: 32, offset: 96)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 32)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{!103, !1143, !1170}
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 32)
!1171 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1172)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !630, line: 122, size: 64, elements: !1173)
!1173 = !{!1174, !1175, !1176, !1177, !1178}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !1172, file: !630, line: 123, baseType: !142, size: 32)
