; ModuleID = 'build/arduino_nano_33_ble/subsys/logging/syst/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.log_output = type { i32 (i8*, i32, i8*)*, %struct.log_output_control_block*, i8*, i32 }
%struct.log_output_control_block = type { i32, i8*, i8* }
%struct.log_msg = type { %struct.log_msg_hdr, [4 x i8], [0 x i8] }
%struct.log_msg_hdr = type { %union.anon.3, i8*, i32 }
%union.anon.3 = type { i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.mpsc_pbuf_buffer = type { i32, i32, i32, i32, i32, %struct.k_spinlock, {}*, i32 (%union.mpsc_pbuf_generic*)*, i32*, i32, i32, %struct.k_sem }
%struct.k_spinlock = type {}
%union.mpsc_pbuf_generic = type { %union.anon.3 }
%struct.mpsc_pbuf_buffer_config = type { i32*, i32, void (%struct.mpsc_pbuf_buffer*, %union.mpsc_pbuf_generic*)*, i32 (%union.mpsc_pbuf_generic*)*, i32 }
%struct.log_msg_ptr = type { %union.log_msg_generic* }
%union.log_msg_generic = type { %struct.log_msg }
%struct.log_mpsc_pbuf = type { %struct.mpsc_pbuf_buffer }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/logging/syst/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/logging/syst")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/logging/syst")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 256, baseType: !24)
!23 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stdint.h", directory: "")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_syst", scope: !27, file: !123, line: 15, type: !125, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !112, globals: !120, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/logging/syst/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/logging/syst")
!29 = !{!30, !37, !42}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "z_log_msg_mode", file: !31, line: 121, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/logging/log_msg.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36}
!34 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_RUNTIME", value: 0)
!35 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_FROM_STACK", value: 1)
!36 = !DIEnumerator(name: "Z_LOG_MSG2_MODE_ZERO_COPY", value: 2)
!37 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "log_backend_evt", file: !38, line: 33, baseType: !32, size: 32, elements: !39)
!38 = !DIFile(filename: "zephyr/include/zephyr/logging/log_backend.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!39 = !{!40, !41}
!40 = !DIEnumerator(name: "LOG_BACKEND_EVT_PROCESS_THREAD_DONE", value: 0)
!41 = !DIEnumerator(name: "LOG_BACKEND_EVT_MAX", value: 1)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !43, line: 27, baseType: !32, size: 32, elements: !44)
!43 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!44 = !{!45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!45 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!46 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!47 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!48 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!49 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!50 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!51 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!52 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!53 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!54 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!55 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!56 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!57 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!58 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!59 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!60 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!61 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!111 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!112 = !{!113, !114, !117, !119}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 226, baseType: !116)
!116 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!119 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!120 = !{!25, !121}
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !27, file: !123, line: 15, type: !124, isLocal: true, isDefinition: true)
!123 = !DIFile(filename: "zephyr/samples/subsys/logging/syst/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!125 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !126)
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !127, line: 16, size: 64, elements: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !{!129, !133}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !126, file: !127, line: 17, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!132 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !126, file: !127, line: 18, baseType: !115, size: 8, offset: 32)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !136, file: !159, line: 18, type: !161, isLocal: false, isDefinition: true)
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !138, retainedTypes: !139, globals: !156, splitDebugInlining: false, nameTableKind: None)
!137 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/logging/syst")
!138 = !{!30}
!139 = !{!22, !113, !24, !140, !142, !144, !145, !119, !147, !148, !150, !152, !153, !114, !154, !130}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !146, line: 46, baseType: !32)
!146 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 207, baseType: !155)
!155 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!156 = !{!134, !157}
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !136, file: !159, line: 18, type: !160, isLocal: true, isDefinition: true)
!159 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !127, line: 16, size: 64, elements: !163)
!163 = !{!164, !165}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !162, file: !127, line: 17, baseType: !130, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !162, file: !127, line: 18, baseType: !115, size: 8, offset: 32)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "_char_out", scope: !168, file: !173, line: 54, type: !174, isLocal: false, isDefinition: true)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, retainedTypes: !171, globals: !172, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/logging/syst")
!170 = !{!42}
!171 = !{!113, !119}
!172 = !{!166}
!173 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 32)
!175 = !DISubroutineType(types: !176)
!176 = !{!119, !119}
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "log_const_log", scope: !179, file: !254, line: 25, type: !499, isLocal: false, isDefinition: true)
!179 = distinct !DICompileUnit(language: DW_LANG_C99, file: !180, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !181, retainedTypes: !182, globals: !251, splitDebugInlining: false, nameTableKind: None)
!180 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/logging/syst")
!181 = !{!37, !30, !42}
!182 = !{!145, !119, !113, !114, !183, !22, !238, !24, !194, !239, !241, !247, !249}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !185)
!185 = !{!186, !204, !210}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !184, file: !31, line: 112, baseType: !187, size: 32)
!187 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !188, line: 49, size: 32, elements: !189)
!188 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_packet.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!189 = !{!190, !197, !203}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !187, file: !188, line: 50, baseType: !191, size: 32)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !188, line: 37, size: 32, elements: !192)
!192 = !{!193, !195, !196}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !191, file: !188, line: 38, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 172, baseType: !32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !191, file: !188, line: 38, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !191, file: !188, line: 39, baseType: !194, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !187, file: !188, line: 51, baseType: !198, size: 32)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !188, line: 43, size: 32, elements: !199)
!199 = !{!200, !201, !202}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !198, file: !188, line: 44, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !198, file: !188, line: 44, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !198, file: !188, line: 45, baseType: !194, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !187, file: !188, line: 52, baseType: !194, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !184, file: !31, line: 113, baseType: !205, size: 32)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !206)
!206 = !{!207, !208, !209}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !205, file: !31, line: 108, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !205, file: !31, line: 108, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !205, file: !31, line: 108, baseType: !194, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !184, file: !31, line: 114, baseType: !211, size: 128)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !212)
!212 = !{!213, !230, !234}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !211, file: !31, line: 89, baseType: !214, size: 96)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !215)
!215 = !{!216, !227, !228}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !214, file: !31, line: 67, baseType: !217, size: 32)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !217, file: !31, line: 52, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !217, file: !31, line: 52, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !217, file: !31, line: 52, baseType: !194, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !217, file: !31, line: 53, baseType: !194, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !217, file: !31, line: 54, baseType: !194, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !217, file: !31, line: 55, baseType: !194, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !217, file: !31, line: 56, baseType: !194, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !217, file: !31, line: 57, baseType: !194, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !214, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !214, file: !31, line: 76, baseType: !229, size: 32, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_t", file: !31, line: 35, baseType: !194)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !211, file: !31, line: 93, baseType: !231, size: 32, offset: 96)
!231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 32, elements: !232)
!232 = !{!233}
!233 = !DISubrange(count: 4)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !211, file: !31, line: 94, baseType: !235, offset: 128)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, elements: !236)
!236 = !{!237}
!237 = !DISubrange(count: -1)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 98, baseType: !240)
!240 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !242, line: 46, baseType: !243)
!242 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !244, line: 56, baseType: !245)
!244 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/../../../../arm-zephyr-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !246, line: 103, baseType: !151)
!246 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/../../../../arm-zephyr-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !211)
!251 = !{!177, !252, !281, !295, !298, !300, !304, !306, !308, !310, !312, !318, !351, !354, !363, !456, !483, !490, !492, !496, !504, !514}
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "log_process_thread_sem", scope: !179, file: !254, line: 93, type: !255, isLocal: false, isDefinition: true, align: 32)
!254 = !DIFile(filename: "zephyr/subsys/logging/log_core.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !256, line: 2909, size: 128, elements: !257)
!256 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!257 = !{!258, !279, !280}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !255, file: !256, line: 2910, baseType: !259, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !260, line: 233, baseType: !261)
!260 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !260, line: 231, size: 64, elements: !262)
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !261, file: !260, line: 232, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !265, line: 48, baseType: !266)
!265 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !265, line: 37, size: 64, elements: !267)
!267 = !{!268, !274}
!268 = !DIDerivedType(tag: DW_TAG_member, scope: !266, file: !265, line: 38, baseType: !269, size: 32)
!269 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !265, line: 38, size: 32, elements: !270)
!270 = !{!271, !273}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !269, file: !265, line: 39, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !269, file: !265, line: 40, baseType: !272, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, scope: !266, file: !265, line: 42, baseType: !275, size: 32, offset: 32)
!275 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !266, file: !265, line: 42, size: 32, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !275, file: !265, line: 43, baseType: !272, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !275, file: !265, line: 44, baseType: !272, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !255, file: !256, line: 2911, baseType: !32, size: 32, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !255, file: !256, line: 2912, baseType: !32, size: 32, offset: 96)
!281 = !DIGlobalVariableExpression(var: !282, expr: !DIExpression())
!282 = distinct !DIGlobalVariable(name: "__init_enable_logger", scope: !179, file: !254, line: 910, type: !283, isLocal: true, isDefinition: true, align: 32)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !285, line: 51, size: 64, elements: !286)
!285 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!286 = !{!287, !294}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !284, file: !285, line: 60, baseType: !288, size: 32)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DISubroutineType(types: !290)
!290 = !{!119, !291}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !293)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !285, line: 48, flags: DIFlagFwdDecl)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !284, file: !285, line: 65, baseType: !291, size: 32, offset: 32)
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "panic_mode", scope: !179, file: !254, line: 96, type: !297, isLocal: true, isDefinition: true)
!297 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "backend_attached", scope: !179, file: !254, line: 97, type: !297, isLocal: true, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "buffered_cnt", scope: !179, file: !254, line: 98, type: !302, isLocal: true, isDefinition: true)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !303, line: 22, baseType: !149)
!303 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "dropped_cnt", scope: !179, file: !254, line: 99, type: !302, isLocal: true, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "timestamp_freq", scope: !179, file: !254, line: 105, type: !194, isLocal: true, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "prev_timestamp", scope: !179, file: !254, line: 107, type: !229, isLocal: true, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "unordered_cnt", scope: !179, file: !254, line: 108, type: !302, isLocal: true, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "log_msg_ptr", scope: !179, file: !254, line: 111, type: !314, isLocal: true, isDefinition: true, align: 32)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_ptr", file: !315, line: 29, size: 32, elements: !316)
!315 = !DIFile(filename: "zephyr/include/zephyr/logging/log_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!316 = !{!317}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !314, file: !315, line: 30, baseType: !183, size: 32)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "log_buffer", scope: !179, file: !254, line: 112, type: !320, isLocal: true, isDefinition: true, align: 32)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !321, line: 87, size: 448, elements: !322)
!321 = !DIFile(filename: "zephyr/include/zephyr/sys/mpsc_pbuf.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = !{!323, !324, !325, !326, !327, !328, !332, !341, !346, !348, !349, !350}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !320, file: !321, line: 89, baseType: !194, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !320, file: !321, line: 92, baseType: !194, size: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !320, file: !321, line: 95, baseType: !194, size: 32, offset: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !320, file: !321, line: 98, baseType: !194, size: 32, offset: 96)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !320, file: !321, line: 101, baseType: !194, size: 32, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !320, file: !321, line: 104, baseType: !329, offset: 160)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !330, line: 43, elements: !331)
!330 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!331 = !{}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !320, file: !321, line: 110, baseType: !333, size: 32, offset: 160)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !321, line: 83, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !337, !339}
!337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !187)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !320, file: !321, line: 113, baseType: !342, size: 32, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !321, line: 75, baseType: !343)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 32)
!344 = !DISubroutineType(types: !345)
!345 = !{!194, !339}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !320, file: !321, line: 116, baseType: !347, size: 32, offset: 224)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !320, file: !321, line: 119, baseType: !194, size: 32, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !320, file: !321, line: 122, baseType: !194, size: 32, offset: 288)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !320, file: !321, line: 124, baseType: !255, size: 128, offset: 320)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "curr_log_buffer", scope: !179, file: !254, line: 113, type: !353, isLocal: true, isDefinition: true)
!353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!354 = !DIGlobalVariableExpression(var: !355, expr: !DIExpression())
!355 = distinct !DIGlobalVariable(name: "logging_stack", scope: !179, file: !254, line: 884, type: !356, isLocal: false, isDefinition: true, align: 512)
!356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !357, size: 576, elements: !361)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !358, line: 47, size: 8, elements: !359)
!358 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!359 = !{!360}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !357, file: !358, line: 48, baseType: !132, size: 8)
!361 = !{!362}
!362 = !DISubrange(count: 72)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "logging_thread", scope: !179, file: !254, line: 885, type: !365, isLocal: false, isDefinition: true)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !366, line: 245, size: 1024, elements: !367)
!366 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!367 = !{!368, !414, !427, !428, !429, !430, !436, !451}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !365, file: !366, line: 247, baseType: !369, size: 384)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !366, line: 57, size: 384, elements: !370)
!370 = !{!371, !385, !387, !388, !389, !401, !402, !403}
!371 = !DIDerivedType(tag: DW_TAG_member, scope: !369, file: !366, line: 60, baseType: !372, size: 64)
!372 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !369, file: !366, line: 60, size: 64, elements: !373)
!373 = !{!374, !376}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !372, file: !366, line: 61, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !265, line: 49, baseType: !266)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !372, file: !366, line: 62, baseType: !377, size: 64)
!377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !378, line: 49, size: 64, elements: !379)
!378 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!379 = !{!380}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !377, file: !378, line: 50, baseType: !381, size: 64)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 64, elements: !383)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 32)
!383 = !{!384}
!384 = !DISubrange(count: 2)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !369, file: !366, line: 68, baseType: !386, size: 32, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !369, file: !366, line: 71, baseType: !115, size: 8, offset: 96)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !369, file: !366, line: 74, baseType: !115, size: 8, offset: 104)
!389 = !DIDerivedType(tag: DW_TAG_member, scope: !369, file: !366, line: 90, baseType: !390, size: 16, offset: 112)
!390 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !369, file: !366, line: 90, size: 16, elements: !391)
!391 = !{!392, !400}
!392 = !DIDerivedType(tag: DW_TAG_member, scope: !390, file: !366, line: 91, baseType: !393, size: 16)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !390, file: !366, line: 91, size: 16, elements: !394)
!394 = !{!395, !399}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !393, file: !366, line: 96, baseType: !396, size: 8)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !244, line: 20, baseType: !397)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !246, line: 41, baseType: !398)
!398 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !393, file: !366, line: 97, baseType: !115, size: 8, offset: 8)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !390, file: !366, line: 100, baseType: !154, size: 16)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !369, file: !366, line: 107, baseType: !194, size: 32, offset: 128)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !369, file: !366, line: 127, baseType: !113, size: 32, offset: 160)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !369, file: !366, line: 131, baseType: !404, size: 192, offset: 192)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !260, line: 244, size: 192, elements: !405)
!405 = !{!406, !407, !413}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !404, file: !260, line: 245, baseType: !375, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !404, file: !260, line: 246, baseType: !408, size: 32, offset: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !260, line: 242, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !404, file: !260, line: 249, baseType: !243, size: 64, offset: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !365, file: !366, line: 250, baseType: !415, size: 288, offset: 384)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !416, line: 25, size: 288, elements: !417)
!416 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!417 = !{!418, !419, !420, !421, !422, !423, !424, !425, !426}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !415, file: !416, line: 26, baseType: !194, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !415, file: !416, line: 27, baseType: !194, size: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !415, file: !416, line: 28, baseType: !194, size: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !415, file: !416, line: 29, baseType: !194, size: 32, offset: 96)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !415, file: !416, line: 30, baseType: !194, size: 32, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !415, file: !416, line: 31, baseType: !194, size: 32, offset: 160)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !415, file: !416, line: 32, baseType: !194, size: 32, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !415, file: !416, line: 33, baseType: !194, size: 32, offset: 224)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !415, file: !416, line: 34, baseType: !194, size: 32, offset: 256)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !365, file: !366, line: 253, baseType: !113, size: 32, offset: 672)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !365, file: !366, line: 256, baseType: !259, size: 64, offset: 704)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !365, file: !366, line: 294, baseType: !119, size: 32, offset: 768)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !365, file: !366, line: 300, baseType: !431, size: 96, offset: 800)
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !366, line: 149, size: 96, elements: !432)
!432 = !{!433, !434, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !431, file: !366, line: 153, baseType: !22, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !431, file: !366, line: 162, baseType: !145, size: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !431, file: !366, line: 168, baseType: !145, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !365, file: !366, line: 325, baseType: !437, size: 32, offset: 896)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !256, line: 5073, size: 160, elements: !439)
!439 = !{!440, !449, !450}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !438, file: !256, line: 5074, baseType: !441, size: 96)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !442, line: 56, size: 96, elements: !443)
!442 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!443 = !{!444, !447, !448}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !441, file: !442, line: 57, baseType: !445, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !442, line: 57, flags: DIFlagFwdDecl)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !441, file: !442, line: 58, baseType: !113, size: 32, offset: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !441, file: !442, line: 59, baseType: !145, size: 32, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !438, file: !256, line: 5075, baseType: !259, size: 64, offset: 96)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !438, file: !256, line: 5076, baseType: !329, offset: 160)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !365, file: !366, line: 343, baseType: !452, size: 64, offset: 928)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !416, line: 60, size: 64, elements: !453)
!453 = !{!454, !455}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !452, file: !416, line: 63, baseType: !194, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !452, file: !416, line: 66, baseType: !194, size: 32, offset: 32)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "format_table", scope: !179, file: !254, line: 72, type: !458, isLocal: true, isDefinition: true)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 128, elements: !232)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !460)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_format_func_t", file: !461, line: 105, baseType: !462)
!461 = !DIFile(filename: "zephyr/include/zephyr/logging/log_output.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 32)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !465, !238, !194}
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !461, line: 89, size: 128, elements: !468)
!468 = !{!469, !474, !481, !482}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !467, file: !461, line: 90, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_output_func_t", file: !461, line: 79, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!472 = !DISubroutineType(types: !473)
!473 = !{!119, !114, !145, !113}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !467, file: !461, line: 91, baseType: !475, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !461, line: 82, size: 96, elements: !477)
!477 = !{!478, !479, !480}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !476, file: !461, line: 83, baseType: !302, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !476, file: !461, line: 84, baseType: !113, size: 32, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !476, file: !461, line: 85, baseType: !130, size: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !467, file: !461, line: 92, baseType: !114, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !467, file: !461, line: 93, baseType: !145, size: 32, offset: 96)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "timestamp_func", scope: !179, file: !254, line: 104, type: !485, isLocal: true, isDefinition: true)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_timestamp_get_t", file: !486, line: 33, baseType: !487)
!486 = !DIFile(filename: "zephyr/include/zephyr/logging/log_ctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 32)
!488 = !DISubroutineType(types: !489)
!489 = !{!229}
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "initialized", scope: !179, file: !254, line: 95, type: !302, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "proc_tid", scope: !179, file: !254, line: 100, type: !494, isLocal: true, isDefinition: true)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_tid_t", file: !366, line: 347, baseType: !495)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "__log_current_const_data", scope: !179, file: !254, line: 25, type: !498, isLocal: true, isDefinition: true)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !127, line: 16, size: 64, elements: !501)
!501 = !{!502, !503}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !500, file: !127, line: 17, baseType: !130, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !500, file: !127, line: 18, baseType: !115, size: 8, offset: 32)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "mpsc_config", scope: !179, file: !254, line: 121, type: !506, isLocal: true, isDefinition: true)
!506 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !507)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !321, line: 128, size: 160, elements: !508)
!508 = !{!509, !510, !511, !512, !513}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !507, file: !321, line: 130, baseType: !347, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !507, file: !321, line: 133, baseType: !194, size: 32, offset: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !507, file: !321, line: 136, baseType: !333, size: 32, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !507, file: !321, line: 137, baseType: !342, size: 32, offset: 96)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !507, file: !321, line: 140, baseType: !194, size: 32, offset: 128)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "buf32", scope: !179, file: !254, line: 116, type: !516, isLocal: true, isDefinition: true, align: 64)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !194, size: 32, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 1)
!519 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "log_const_log_mgmt", scope: !522, file: !529, line: 14, type: !762, isLocal: false, isDefinition: true)
!522 = distinct !DICompileUnit(language: DW_LANG_C99, file: !523, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !524, retainedTypes: !525, globals: !526, splitDebugInlining: false, nameTableKind: None)
!523 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/logging/syst")
!524 = !{!37, !42}
!525 = !{!113, !119, !117, !114, !130, !22}
!526 = !{!520, !527, !555, !737, !739, !753, !755, !760}
!527 = !DIGlobalVariableExpression(var: !528, expr: !DIExpression())
!528 = distinct !DIGlobalVariable(name: "sname_cache", scope: !522, file: !529, line: 44, type: !530, isLocal: true, isDefinition: true)
!529 = !DIFile(filename: "zephyr/subsys/logging/log_mgmt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache", file: !531, line: 30, size: 256, elements: !532)
!531 = !DIFile(filename: "zephyr/subsys/logging/log_cache.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!532 = !{!533, !546, !547, !552, !553, !554}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !530, file: !531, line: 31, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !535, line: 40, baseType: !536)
!535 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !535, line: 35, size: 64, elements: !537)
!537 = !{!538, !545}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !536, file: !535, line: 36, baseType: !539, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 32)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !535, line: 33, baseType: !541)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !535, line: 29, size: 32, elements: !542)
!542 = !{!543}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !541, file: !535, line: 30, baseType: !544, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !536, file: !535, line: 37, baseType: !539, size: 32, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "idle", scope: !530, file: !531, line: 32, baseType: !534, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !530, file: !531, line: 33, baseType: !548, size: 32, offset: 128)
!548 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_cache_cmp_func_t", file: !531, line: 21, baseType: !549)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 32)
!550 = !DISubroutineType(types: !551)
!551 = !{!297, !22, !22}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !530, file: !531, line: 34, baseType: !194, size: 32, offset: 160)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "miss", scope: !530, file: !531, line: 35, baseType: !194, size: 32, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !530, file: !531, line: 36, baseType: !145, size: 32, offset: 224)
!555 = !DIGlobalVariableExpression(var: !556, expr: !DIExpression())
!556 = distinct !DIGlobalVariable(name: "invalid_domain", scope: !557, file: !529, line: 261, type: !130, isLocal: true, isDefinition: true)
!557 = distinct !DISubprogram(name: "link_domain_name_get", scope: !529, file: !529, line: 256, type: !558, scopeLine: 257, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !522, retainedNodes: !560)
!558 = !DISubroutineType(types: !559)
!559 = !{!130, !115}
!560 = !{!561, !562, !563, !564, !565, !568, !736}
!561 = !DILocalVariable(name: "domain_id", arg: 1, scope: !557, file: !529, line: 256, type: !115)
!562 = !DILocalVariable(name: "cached", scope: !557, file: !529, line: 258, type: !114)
!563 = !DILocalVariable(name: "cache_size", scope: !557, file: !529, line: 259, type: !145)
!564 = !DILocalVariable(name: "id", scope: !557, file: !529, line: 260, type: !22)
!565 = !DILocalVariable(name: "rel_domain_id", scope: !566, file: !529, line: 265, type: !115)
!566 = distinct !DILexicalBlock(scope: !567, file: !529, line: 264, column: 49)
!567 = distinct !DILexicalBlock(scope: !557, file: !529, line: 264, column: 6)
!568 = !DILocalVariable(name: "link", scope: !566, file: !529, line: 266, type: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 32)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !571)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link", file: !572, line: 61, size: 192, elements: !573)
!572 = !DIFile(filename: "zephyr/include/zephyr/logging/log_link.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!573 = !{!574, !663, !664, !673, !674, !726}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !571, file: !572, line: 62, baseType: !575, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !577)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_api", file: !572, line: 38, size: 192, elements: !578)
!578 = !{!579, !642, !646, !651, !655, !659}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "initiate", scope: !577, file: !572, line: 39, baseType: !580, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 32)
!581 = !DISubroutineType(types: !582)
!582 = !{!119, !569, !583}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 32)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_config", file: !572, line: 33, size: 64, elements: !585)
!585 = !{!586, !637}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "msg_cb", scope: !584, file: !572, line: 34, baseType: !587, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_callback_t", file: !572, line: 27, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 32)
!589 = !DISubroutineType(types: !590)
!590 = !{null, !569, !591}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!592 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !593)
!593 = !{!594, !610, !616}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !592, file: !31, line: 112, baseType: !595, size: 32)
!595 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !188, line: 49, size: 32, elements: !596)
!596 = !{!597, !603, !609}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !595, file: !188, line: 50, baseType: !598, size: 32)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !188, line: 37, size: 32, elements: !599)
!599 = !{!600, !601, !602}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !598, file: !188, line: 38, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !598, file: !188, line: 38, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !598, file: !188, line: 39, baseType: !194, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !595, file: !188, line: 51, baseType: !604, size: 32)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !188, line: 43, size: 32, elements: !605)
!605 = !{!606, !607, !608}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !604, file: !188, line: 44, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !604, file: !188, line: 44, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !604, file: !188, line: 45, baseType: !194, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !595, file: !188, line: 52, baseType: !194, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !592, file: !31, line: 113, baseType: !611, size: 32)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !612)
!612 = !{!613, !614, !615}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !611, file: !31, line: 108, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !611, file: !31, line: 108, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !611, file: !31, line: 108, baseType: !194, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !592, file: !31, line: 114, baseType: !617, size: 128)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !618)
!618 = !{!619, !635, !636}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !617, file: !31, line: 89, baseType: !620, size: 96)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !621)
!621 = !{!622, !633, !634}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !620, file: !31, line: 67, baseType: !623, size: 32)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !624)
!624 = !{!625, !626, !627, !628, !629, !630, !631, !632}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !623, file: !31, line: 52, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !623, file: !31, line: 52, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !623, file: !31, line: 52, baseType: !194, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !623, file: !31, line: 53, baseType: !194, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !623, file: !31, line: 54, baseType: !194, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !623, file: !31, line: 55, baseType: !194, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !623, file: !31, line: 56, baseType: !194, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !623, file: !31, line: 57, baseType: !194, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !620, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !620, file: !31, line: 76, baseType: !229, size: 32, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !617, file: !31, line: 93, baseType: !231, size: 32, offset: 96)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !617, file: !31, line: 94, baseType: !235, offset: 128)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "dropped_cb", scope: !584, file: !572, line: 35, baseType: !638, size: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_link_dropped_cb_t", file: !572, line: 30, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 32)
!640 = !DISubroutineType(types: !641)
!641 = !{null, !569, !194}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "activate", scope: !577, file: !572, line: 40, baseType: !643, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 32)
!644 = !DISubroutineType(types: !645)
!645 = !{!119, !569}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "get_domain_name", scope: !577, file: !572, line: 41, baseType: !647, size: 32, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 32)
!648 = !DISubroutineType(types: !649)
!649 = !{!119, !569, !194, !153, !650}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "get_source_name", scope: !577, file: !572, line: 43, baseType: !652, size: 32, offset: 96)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 32)
!653 = !DISubroutineType(types: !654)
!654 = !{!119, !569, !194, !154, !153, !650}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "get_levels", scope: !577, file: !572, line: 45, baseType: !656, size: 32, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 32)
!657 = !DISubroutineType(types: !658)
!658 = !{!119, !569, !194, !154, !114, !114}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "set_runtime_level", scope: !577, file: !572, line: 48, baseType: !660, size: 32, offset: 160)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 32)
!661 = !DISubroutineType(types: !662)
!662 = !{!119, !569, !194, !154, !115}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !571, file: !572, line: 63, baseType: !130, size: 32, offset: 32)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "ctrl_blk", scope: !571, file: !572, line: 64, baseType: !665, size: 32, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 32)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_link_ctrl_blk", file: !572, line: 52, size: 128, elements: !667)
!667 = !{!668, !669, !671, !672}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "domain_cnt", scope: !666, file: !572, line: 53, baseType: !194, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "source_cnt", scope: !666, file: !572, line: 54, baseType: !670, size: 16, offset: 32)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !154, size: 16, elements: !517)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "domain_offset", scope: !666, file: !572, line: 57, baseType: !194, size: 32, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "filters", scope: !666, file: !572, line: 58, baseType: !347, size: 32, offset: 96)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !571, file: !572, line: 65, baseType: !113, size: 32, offset: 96)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf", scope: !571, file: !572, line: 66, baseType: !675, size: 32, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 32)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer", file: !321, line: 87, size: 448, elements: !677)
!677 = !{!678, !679, !680, !681, !682, !683, !685, !694, !699, !700, !701, !702}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_wr_idx", scope: !676, file: !321, line: 89, baseType: !194, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "wr_idx", scope: !676, file: !321, line: 92, baseType: !194, size: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "tmp_rd_idx", scope: !676, file: !321, line: 95, baseType: !194, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "rd_idx", scope: !676, file: !321, line: 98, baseType: !194, size: 32, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !676, file: !321, line: 101, baseType: !194, size: 32, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !676, file: !321, line: 104, baseType: !684, offset: 160)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !330, line: 43, elements: !331)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !676, file: !321, line: 110, baseType: !686, size: 32, offset: 160)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_notify_drop", file: !321, line: 83, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = !DISubroutineType(types: !689)
!689 = !{null, !690, !692}
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !676)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !595)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !676, file: !321, line: 113, baseType: !695, size: 32, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "mpsc_pbuf_get_wlen", file: !321, line: 75, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 32)
!697 = !DISubroutineType(types: !698)
!698 = !{!194, !692}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !676, file: !321, line: 116, baseType: !347, size: 32, offset: 224)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !676, file: !321, line: 119, baseType: !194, size: 32, offset: 256)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "max_usage", scope: !676, file: !321, line: 122, baseType: !194, size: 32, offset: 288)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !676, file: !321, line: 124, baseType: !703, size: 128, offset: 320)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !256, line: 2909, size: 128, elements: !704)
!704 = !{!705, !724, !725}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !703, file: !256, line: 2910, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !260, line: 233, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !260, line: 231, size: 64, elements: !708)
!708 = !{!709}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !707, file: !260, line: 232, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !265, line: 48, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !265, line: 37, size: 64, elements: !712)
!712 = !{!713, !719}
!713 = !DIDerivedType(tag: DW_TAG_member, scope: !711, file: !265, line: 38, baseType: !714, size: 32)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !711, file: !265, line: 38, size: 32, elements: !715)
!715 = !{!716, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !714, file: !265, line: 39, baseType: !717, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !714, file: !265, line: 40, baseType: !717, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, scope: !711, file: !265, line: 42, baseType: !720, size: 32, offset: 32)
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !711, file: !265, line: 42, size: 32, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !720, file: !265, line: 43, baseType: !717, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !720, file: !265, line: 44, baseType: !717, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !703, file: !256, line: 2911, baseType: !32, size: 32, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !703, file: !256, line: 2912, baseType: !32, size: 32, offset: 96)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "mpsc_pbuf_config", scope: !571, file: !572, line: 67, baseType: !727, size: 32, offset: 160)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_buffer_config", file: !321, line: 128, size: 160, elements: !730)
!730 = !{!731, !732, !733, !734, !735}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !729, file: !321, line: 130, baseType: !347, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !729, file: !321, line: 133, baseType: !194, size: 32, offset: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "notify_drop", scope: !729, file: !321, line: 136, baseType: !686, size: 32, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "get_wlen", scope: !729, file: !321, line: 137, baseType: !695, size: 32, offset: 96)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !729, file: !321, line: 140, baseType: !194, size: 32, offset: 128)
!736 = !DILocalVariable(name: "err", scope: !566, file: !529, line: 267, type: !119)
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "dname_cache", scope: !522, file: !529, line: 43, type: !530, isLocal: true, isDefinition: true)
!739 = !DIGlobalVariableExpression(var: !740, expr: !DIExpression())
!740 = distinct !DIGlobalVariable(name: "dname_cache_config", scope: !741, file: !529, line: 152, type: !746, isLocal: true, isDefinition: true)
!741 = distinct !DISubprogram(name: "cache_init", scope: !529, file: !529, line: 149, type: !742, scopeLine: 150, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !522, retainedNodes: !744)
!742 = !DISubroutineType(types: !743)
!743 = !{null}
!744 = !{!745}
!745 = !DILocalVariable(name: "err", scope: !741, file: !529, line: 151, type: !119)
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_cache_config", file: !531, line: 23, size: 128, elements: !748)
!748 = !{!749, !750, !751, !752}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !747, file: !531, line: 24, baseType: !113, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "buf_len", scope: !747, file: !531, line: 25, baseType: !145, size: 32, offset: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "item_size", scope: !747, file: !531, line: 26, baseType: !145, size: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !747, file: !531, line: 27, baseType: !548, size: 32, offset: 96)
!753 = !DIGlobalVariableExpression(var: !754, expr: !DIExpression())
!754 = distinct !DIGlobalVariable(name: "sname_cache_config", scope: !741, file: !529, line: 158, type: !746, isLocal: true, isDefinition: true)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "dname_cache_buffer", scope: !522, file: !529, line: 40, type: !757, isLocal: true, isDefinition: true, align: 32)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 72, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 9)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "sname_cache_buffer", scope: !522, file: !529, line: 41, type: !757, isLocal: true, isDefinition: true, align: 32)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !127, line: 16, size: 64, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !763, file: !127, line: 17, baseType: !130, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !763, file: !127, line: 18, baseType: !115, size: 8, offset: 32)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "prefix", scope: !769, file: !770, line: 562, type: !815, isLocal: true, isDefinition: true)
!769 = distinct !DISubprogram(name: "log_output_dropped_process", scope: !770, file: !770, line: 558, type: !771, scopeLine: 559, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !787, retainedNodes: !808)
!770 = !DIFile(filename: "zephyr/subsys/logging/log_output.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!771 = !DISubroutineType(types: !772)
!772 = !{null, !773, !194}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 32)
!774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !461, line: 89, size: 128, elements: !776)
!776 = !{!777, !778, !785, !786}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !775, file: !461, line: 90, baseType: !470, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !775, file: !461, line: 91, baseType: !779, size: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 32)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !461, line: 82, size: 96, elements: !781)
!781 = !{!782, !783, !784}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !780, file: !461, line: 83, baseType: !302, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !780, file: !461, line: 84, baseType: !113, size: 32, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !780, file: !461, line: 85, baseType: !130, size: 32, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !775, file: !461, line: 92, baseType: !114, size: 32, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !775, file: !461, line: 93, baseType: !145, size: 32, offset: 96)
!787 = distinct !DICompileUnit(language: DW_LANG_C99, file: !788, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !170, retainedTypes: !789, globals: !790, splitDebugInlining: false, nameTableKind: None)
!788 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/log_output.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/logging/syst")
!789 = !{!22, !113, !114, !239, !119, !194, !773, !132, !116, !117}
!790 = !{!767, !791, !796, !798, !800, !806}
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "postfix", scope: !769, file: !770, line: 563, type: !793, isLocal: true, isDefinition: true)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 224, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 28)
!796 = !DIGlobalVariableExpression(var: !797, expr: !DIExpression())
!797 = distinct !DIGlobalVariable(name: "freq", scope: !787, file: !770, line: 46, type: !194, isLocal: true, isDefinition: true)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "timestamp_div", scope: !787, file: !770, line: 47, type: !229, isLocal: true, isDefinition: true)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "colors", scope: !787, file: !770, line: 38, type: !802, isLocal: true, isDefinition: true)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !803, size: 160, elements: !804)
!803 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !130)
!804 = !{!805}
!805 = !DISubrange(count: 5)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "severity", scope: !787, file: !770, line: 30, type: !802, isLocal: true, isDefinition: true)
!808 = !{!809, !810, !811, !813, !814}
!809 = !DILocalVariable(name: "output", arg: 1, scope: !769, file: !770, line: 558, type: !773)
!810 = !DILocalVariable(name: "cnt", arg: 2, scope: !769, file: !770, line: 558, type: !194)
!811 = !DILocalVariable(name: "buf", scope: !769, file: !770, line: 560, type: !812)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 40, elements: !804)
!813 = !DILocalVariable(name: "len", scope: !769, file: !770, line: 561, type: !119)
!814 = !DILocalVariable(name: "outf", scope: !769, file: !770, line: 565, type: !470)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !131, size: 96, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 12)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "log_const_log_uart", scope: !820, file: !884, line: 16, type: !1012, isLocal: false, isDefinition: true)
!820 = distinct !DICompileUnit(language: DW_LANG_C99, file: !821, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !524, retainedTypes: !822, globals: !881, splitDebugInlining: false, nameTableKind: None)
!821 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/logging/backends/log_backend_uart.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/subsys/logging/syst")
!822 = !{!113, !119, !823}
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !825)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !826, line: 336, size: 160, elements: !827)
!826 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!827 = !{!828, !855, !859, !863, !876}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !825, file: !826, line: 365, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32)
!830 = !DISubroutineType(types: !831)
!831 = !{!119, !832, !854}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !835, line: 378, size: 192, elements: !836)
!835 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!836 = !{!837, !838, !839, !840, !846, !847}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !834, file: !835, line: 380, baseType: !130, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !834, file: !835, line: 382, baseType: !13, size: 32, offset: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !834, file: !835, line: 384, baseType: !13, size: 32, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !834, file: !835, line: 386, baseType: !841, size: 32, offset: 96)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 32)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !835, line: 351, size: 16, elements: !843)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !842, file: !835, line: 359, baseType: !115, size: 8)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !842, file: !835, line: 364, baseType: !297, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !834, file: !835, line: 388, baseType: !113, size: 32, offset: 128)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !834, file: !835, line: 396, baseType: !848, size: 32, offset: 160)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !850)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !835, line: 43, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !244, line: 32, baseType: !852)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !246, line: 55, baseType: !853)
!853 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !825, file: !826, line: 366, baseType: !856, size: 32, offset: 32)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DISubroutineType(types: !858)
!858 = !{null, !832, !116}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !825, file: !826, line: 374, baseType: !860, size: 32, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DISubroutineType(types: !862)
!862 = !{!119, !832}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !825, file: !826, line: 377, baseType: !864, size: 32, offset: 96)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!865 = !DISubroutineType(types: !866)
!866 = !{!119, !832, !867}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !826, line: 122, size: 64, elements: !870)
!870 = !{!871, !872, !873, !874, !875}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !869, file: !826, line: 123, baseType: !194, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !869, file: !826, line: 124, baseType: !115, size: 8, offset: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !869, file: !826, line: 125, baseType: !115, size: 8, offset: 40)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !869, file: !826, line: 126, baseType: !115, size: 8, offset: 48)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !869, file: !826, line: 127, baseType: !115, size: 8, offset: 56)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !825, file: !826, line: 379, baseType: !877, size: 32, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!878 = !DISubroutineType(types: !879)
!879 = !{!119, !832, !880}
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 32)
!881 = !{!818, !882, !980, !982, !984, !999, !1002, !1004, !1007, !1010}
!882 = !DIGlobalVariableExpression(var: !883, expr: !DIExpression())
!883 = distinct !DIGlobalVariable(name: "log_backend_uart_api", scope: !820, file: !884, line: 156, type: !885, isLocal: false, isDefinition: true)
!884 = !DIFile(filename: "zephyr/subsys/logging/backends/log_backend_uart.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!885 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_backend_api", file: !38, line: 62, size: 224, elements: !887)
!887 = !{!888, !955, !959, !963, !964, !968, !972}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "process", scope: !886, file: !38, line: 63, baseType: !889, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 32)
!890 = !DISubroutineType(types: !891)
!891 = !{null, !892, !909}
!892 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !893)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_backend", file: !38, line: 93, size: 128, elements: !896)
!896 = !{!897, !899, !907, !908}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !895, file: !38, line: 94, baseType: !898, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !895, file: !38, line: 95, baseType: !900, size: 32, offset: 32)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_backend_control_block", file: !38, line: 81, size: 64, elements: !902)
!902 = !{!903, !904, !905, !906}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !901, file: !38, line: 82, baseType: !113, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !901, file: !38, line: 83, baseType: !115, size: 8, offset: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !901, file: !38, line: 84, baseType: !297, size: 8, offset: 40)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !901, file: !38, line: 87, baseType: !115, size: 8, offset: 48)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !895, file: !38, line: 96, baseType: !130, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "autostart", scope: !895, file: !38, line: 97, baseType: !297, size: 8, offset: 96)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!910 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_msg_generic", file: !31, line: 111, size: 128, elements: !911)
!911 = !{!912, !928, !934}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !910, file: !31, line: 112, baseType: !913, size: 32)
!913 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "mpsc_pbuf_generic", file: !188, line: 49, size: 32, elements: !914)
!914 = !{!915, !921, !927}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !913, file: !188, line: 50, baseType: !916, size: 32)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_hdr", file: !188, line: 37, size: 32, elements: !917)
!917 = !{!918, !919, !920}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !916, file: !188, line: 38, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !916, file: !188, line: 38, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !916, file: !188, line: 39, baseType: !194, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "skip", scope: !913, file: !188, line: 51, baseType: !922, size: 32)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mpsc_pbuf_skip", file: !188, line: 43, size: 32, elements: !923)
!923 = !{!924, !925, !926}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !922, file: !188, line: 44, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !922, file: !188, line: 44, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !922, file: !188, line: 45, baseType: !194, size: 30, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !913, file: !188, line: 52, baseType: !194, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "generic", scope: !910, file: !31, line: 113, baseType: !929, size: 32)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_generic_hdr", file: !31, line: 107, size: 32, elements: !930)
!930 = !{!931, !932, !933}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !929, file: !31, line: 108, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !929, file: !31, line: 108, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !929, file: !31, line: 108, baseType: !194, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "log", scope: !910, file: !31, line: 114, baseType: !935, size: 128)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg", file: !31, line: 88, size: 128, elements: !936)
!936 = !{!937, !953, !954}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "hdr", scope: !935, file: !31, line: 89, baseType: !938, size: 96)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_hdr", file: !31, line: 66, size: 96, elements: !939)
!939 = !{!940, !951, !952}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "desc", scope: !938, file: !31, line: 67, baseType: !941, size: 32)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_msg_desc", file: !31, line: 51, size: 32, elements: !942)
!942 = !{!943, !944, !945, !946, !947, !948, !949, !950}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "valid", scope: !941, file: !31, line: 52, baseType: !194, size: 1, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "busy", scope: !941, file: !31, line: 52, baseType: !194, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !941, file: !31, line: 52, baseType: !194, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !941, file: !31, line: 53, baseType: !194, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !941, file: !31, line: 54, baseType: !194, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "package_len", scope: !941, file: !31, line: 55, baseType: !194, size: 10, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "data_len", scope: !941, file: !31, line: 56, baseType: !194, size: 12, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !941, file: !31, line: 57, baseType: !194, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !938, file: !31, line: 75, baseType: !13, size: 32, offset: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "timestamp", scope: !938, file: !31, line: 76, baseType: !229, size: 32, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !935, file: !31, line: 93, baseType: !231, size: 32, offset: 96)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !935, file: !31, line: 94, baseType: !235, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "dropped", scope: !886, file: !38, line: 66, baseType: !956, size: 32, offset: 32)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 32)
!957 = !DISubroutineType(types: !958)
!958 = !{null, !892, !194}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "panic", scope: !886, file: !38, line: 67, baseType: !960, size: 32, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = !DISubroutineType(types: !962)
!962 = !{null, !892}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !886, file: !38, line: 68, baseType: !960, size: 32, offset: 96)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "is_ready", scope: !886, file: !38, line: 69, baseType: !965, size: 32, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = !DISubroutineType(types: !967)
!967 = !{!119, !892}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "format_set", scope: !886, file: !38, line: 70, baseType: !969, size: 32, offset: 160)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DISubroutineType(types: !971)
!971 = !{!119, !892, !194}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !886, file: !38, line: 73, baseType: !973, size: 32, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 32)
!974 = !DISubroutineType(types: !975)
!975 = !{null, !892, !37, !976}
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!977 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "log_backend_evt_arg", file: !38, line: 54, size: 32, elements: !978)
!978 = !{!979}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !977, file: !38, line: 56, baseType: !113, size: 32)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "log_backend_uart", scope: !820, file: !884, line: 164, type: !894, isLocal: true, isDefinition: true, align: 32)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "log_format_current", scope: !820, file: !884, line: 28, type: !194, isLocal: true, isDefinition: true)
!984 = !DIGlobalVariableExpression(var: !985, expr: !DIExpression())
!985 = distinct !DIGlobalVariable(name: "log_output_uart", scope: !820, file: !884, line: 91, type: !986, isLocal: true, isDefinition: true)
!986 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !987)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output", file: !461, line: 89, size: 128, elements: !988)
!988 = !{!989, !990, !997, !998}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !987, file: !461, line: 90, baseType: !470, size: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "control_block", scope: !987, file: !461, line: 91, baseType: !991, size: 32, offset: 32)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_output_control_block", file: !461, line: 82, size: 96, elements: !993)
!993 = !{!994, !995, !996}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !992, file: !461, line: 83, baseType: !302, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !992, file: !461, line: 84, baseType: !113, size: 32, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "hostname", scope: !992, file: !461, line: 85, baseType: !130, size: 32, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !987, file: !461, line: 92, baseType: !114, size: 32, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !987, file: !461, line: 93, baseType: !145, size: 32, offset: 96)
!999 = !DIGlobalVariableExpression(var: !1000, expr: !DIExpression())
!1000 = distinct !DIGlobalVariable(name: "uart_dev", scope: !820, file: !884, line: 23, type: !1001, isLocal: true, isDefinition: true)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !832)
!1002 = !DIGlobalVariableExpression(var: !1003, expr: !DIExpression())
!1003 = distinct !DIGlobalVariable(name: "log_output_uart_control_block", scope: !820, file: !884, line: 91, type: !992, isLocal: true, isDefinition: true)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "uart_output_buf", scope: !820, file: !884, line: 90, type: !1006, isLocal: true, isDefinition: true)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !115, size: 8, elements: !517)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "in_panic", scope: !820, file: !884, line: 26, type: !1009, isLocal: true, isDefinition: true)
!1009 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !297)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(name: "backend_cb_log_backend_uart", scope: !820, file: !884, line: 164, type: !901, isLocal: true, isDefinition: true)
!1012 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !127, line: 16, size: 64, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1013, file: !127, line: 17, baseType: !130, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1013, file: !127, line: 18, baseType: !115, size: 8, offset: 32)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "log_syst_handle", scope: !1019, file: !1082, line: 21, type: !1099, isLocal: true, isDefinition: true)
