; ModuleID = 'build/adafruit_itsybitsy_m4_express/drivers/uart/echo_bot/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type {}
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.z_heap_bucket = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.sam0_eic_data = type { [2 x %struct.sam0_eic_port_data], [16 x %struct.anon.11] }
%struct.sam0_eic_port_data = type { void (i32, i8*)*, i8* }
%struct.anon.11 = type { i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.uart_sam0_dev_cfg = type { %struct.SercomUsart*, i32, i32, i8, i32*, i32, i16, void (%struct.device*)*, %struct.pinctrl_dev_config* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/uart/echo_bot/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/uart/echo_bot")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 149, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/uart/echo_bot")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8768, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 137)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4384, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "uart_msgq", scope: !27, file: !209, line: 19, type: !223, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !206, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/uart/echo_bot/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/uart/echo_bot")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !111, line: 336, size: 608, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !145, !149, !153, !167, !172, !178, !184, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !110, file: !111, line: 365, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DISubroutineType(types: !116)
!116 = !{!107, !117, !144}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !120, line: 378, size: 192, elements: !121)
!120 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!121 = !{!122, !126, !127, !128, !137, !138}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !119, file: !120, line: 380, baseType: !123, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !119, file: !120, line: 382, baseType: !13, size: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !119, file: !120, line: 384, baseType: !13, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !119, file: !120, line: 386, baseType: !129, size: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !120, line: 351, size: 16, elements: !131)
!131 = !{!132, !135}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !130, file: !120, line: 359, baseType: !133, size: 8)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !134)
!134 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !130, file: !120, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!136 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !119, file: !120, line: 388, baseType: !102, size: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !119, file: !120, line: 396, baseType: !139, size: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !120, line: 43, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !143)
!143 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !110, file: !111, line: 366, baseType: !146, size: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !117, !134}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !110, file: !111, line: 374, baseType: !150, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DISubroutineType(types: !152)
!152 = !{!107, !117}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !110, file: !111, line: 377, baseType: !154, size: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DISubroutineType(types: !156)
!156 = !{!107, !117, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !111, line: 122, size: 64, elements: !160)
!160 = !{!161, !163, !164, !165, !166}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !159, file: !111, line: 123, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !159, file: !111, line: 124, baseType: !133, size: 8, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !159, file: !111, line: 125, baseType: !133, size: 8, offset: 40)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !159, file: !111, line: 126, baseType: !133, size: 8, offset: 48)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !159, file: !111, line: 127, baseType: !133, size: 8, offset: 56)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !110, file: !111, line: 379, baseType: !168, size: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!169 = !DISubroutineType(types: !170)
!170 = !{!107, !117, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !110, file: !111, line: 384, baseType: !173, size: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DISubroutineType(types: !175)
!175 = !{!107, !117, !176, !107}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !110, file: !111, line: 393, baseType: !179, size: 32, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!107, !117, !182, !183}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !110, file: !111, line: 402, baseType: !185, size: 32, offset: 224)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !117}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !110, file: !111, line: 405, baseType: !185, size: 32, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !110, file: !111, line: 408, baseType: !150, size: 32, offset: 288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !110, file: !111, line: 411, baseType: !185, size: 32, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !110, file: !111, line: 414, baseType: !185, size: 32, offset: 352)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !110, file: !111, line: 417, baseType: !150, size: 32, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !110, file: !111, line: 420, baseType: !150, size: 32, offset: 416)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !110, file: !111, line: 423, baseType: !185, size: 32, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !110, file: !111, line: 426, baseType: !185, size: 32, offset: 480)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !110, file: !111, line: 429, baseType: !150, size: 32, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !110, file: !111, line: 432, baseType: !150, size: 32, offset: 544)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !110, file: !111, line: 435, baseType: !199, size: 32, offset: 576)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !117, !202, !102}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !111, line: 142, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !117, !102}
!206 = !{!25, !207, !211, !216, !221}
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "uart_dev", scope: !27, file: !209, line: 21, type: !210, isLocal: true, isDefinition: true)
!209 = !DIFile(filename: "zephyr/samples/drivers/uart/echo_bot/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "_k_fifo_buf_uart_msgq", scope: !27, file: !209, line: 19, type: !213, isLocal: true, isDefinition: true, align: 32)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 2560, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 320)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "rx_buf", scope: !27, file: !209, line: 24, type: !218, isLocal: true, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 256, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 32)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "rx_buf_pos", scope: !27, file: !209, line: 25, type: !107, isLocal: true, isDefinition: true)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !224, line: 4204, size: 320, elements: !225)
!224 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!225 = !{!226, !247, !251, !254, !255, !257, !258, !259, !260, !261}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !223, file: !224, line: 4206, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !228, line: 233, baseType: !229)
!228 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !228, line: 231, size: 64, elements: !230)
!230 = !{!231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !229, file: !228, line: 232, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !233, line: 48, baseType: !234)
!233 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !233, line: 37, size: 64, elements: !235)
!235 = !{!236, !242}
!236 = !DIDerivedType(tag: DW_TAG_member, scope: !234, file: !233, line: 38, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !234, file: !233, line: 38, size: 32, elements: !238)
!238 = !{!239, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !237, file: !233, line: 39, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !237, file: !233, line: 40, baseType: !240, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, scope: !234, file: !233, line: 42, baseType: !243, size: 32, offset: 32)
!243 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !234, file: !233, line: 42, size: 32, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !243, file: !233, line: 43, baseType: !240, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !243, file: !233, line: 44, baseType: !240, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !223, file: !224, line: 4208, baseType: !248, offset: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!249 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!250 = !{}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !223, file: !224, line: 4210, baseType: !252, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !253, line: 214, baseType: !32)
!253 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!254 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !223, file: !224, line: 4212, baseType: !162, size: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !223, file: !224, line: 4214, baseType: !256, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !223, file: !224, line: 4216, baseType: !256, size: 32, offset: 160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !223, file: !224, line: 4218, baseType: !256, size: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !223, file: !224, line: 4220, baseType: !256, size: 32, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !223, file: !224, line: 4222, baseType: !162, size: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !223, file: !224, line: 4227, baseType: !133, size: 8, offset: 288)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "_char_out", scope: !264, file: !268, line: 54, type: !269, isLocal: false, isDefinition: true)
!264 = distinct !DICompileUnit(language: DW_LANG_C99, file: !265, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !266, globals: !267, splitDebugInlining: false, nameTableKind: None)
!265 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/uart/echo_bot")
!266 = !{!102, !107}
!267 = !{!262}
!268 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DISubroutineType(types: !271)
!271 = !{!107, !107}
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !274, file: !811, line: 149, type: !812, isLocal: true, isDefinition: true, align: 32)
!274 = distinct !DICompileUnit(language: DW_LANG_C99, file: !275, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !276, globals: !810, splitDebugInlining: false, nameTableKind: None)
!275 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/uart/echo_bot")
!276 = !{!102, !107, !277, !411, !496}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "Cmcc", file: !279, line: 352, baseType: !280)
!279 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/cmcc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !279, line: 339, size: 448, elements: !281)
!281 = !{!282, !298, !310, !320, !331, !341, !349, !359, !370, !380, !390, !400}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !280, file: !279, line: 340, baseType: !283, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !284)
!284 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_TYPE_Type", file: !279, line: 57, baseType: !286)
!286 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 44, size: 32, elements: !287)
!287 = !{!288, !297}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !286, file: !279, line: 55, baseType: !289, size: 32)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !286, file: !279, line: 45, size: 32, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "GCLK", scope: !289, file: !279, line: 47, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "RRP", scope: !289, file: !279, line: 49, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "WAYNUM", scope: !289, file: !279, line: 50, baseType: !162, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "LCKDOWN", scope: !289, file: !279, line: 51, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZE", scope: !289, file: !279, line: 52, baseType: !162, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "CLSIZE", scope: !289, file: !279, line: 53, baseType: !162, size: 3, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !286, file: !279, line: 56, baseType: !162, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "CFG", scope: !280, file: !279, line: 341, baseType: !299, size: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CFG_Type", file: !279, line: 124, baseType: !301)
!301 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 114, size: 32, elements: !302)
!302 = !{!303, !309}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !301, file: !279, line: 122, baseType: !304, size: 32)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !301, file: !279, line: 115, size: 32, elements: !305)
!305 = !{!306, !307, !308}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ICDIS", scope: !304, file: !279, line: 117, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "DCDIS", scope: !304, file: !279, line: 118, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "CSIZESW", scope: !304, file: !279, line: 120, baseType: !162, size: 3, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !301, file: !279, line: 123, baseType: !162, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !280, file: !279, line: 342, baseType: !311, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_CTRL_Type", file: !279, line: 161, baseType: !313)
!313 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 155, size: 32, elements: !314)
!314 = !{!315, !319}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !313, file: !279, line: 159, baseType: !316, size: 32)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !313, file: !279, line: 156, size: 32, elements: !317)
!317 = !{!318}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !316, file: !279, line: 157, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !313, file: !279, line: 160, baseType: !162, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !280, file: !279, line: 343, baseType: !321, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_SR_Type", file: !279, line: 179, baseType: !324)
!324 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 173, size: 32, elements: !325)
!325 = !{!326, !330}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !324, file: !279, line: 177, baseType: !327, size: 32)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !324, file: !279, line: 174, size: 32, elements: !328)
!328 = !{!329}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "CSTS", scope: !327, file: !279, line: 175, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !324, file: !279, line: 178, baseType: !162, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !280, file: !279, line: 344, baseType: !332, size: 32, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !333)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_LCKWAY_Type", file: !279, line: 197, baseType: !334)
!334 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 191, size: 32, elements: !335)
!335 = !{!336, !340}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !334, file: !279, line: 195, baseType: !337, size: 32)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !334, file: !279, line: 192, size: 32, elements: !338)
!338 = !{!339}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "LCKWAY", scope: !337, file: !279, line: 193, baseType: !162, size: 4, flags: DIFlagBitField, extraData: i64 0)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !334, file: !279, line: 196, baseType: !162, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !280, file: !279, line: 345, baseType: !342, size: 96, offset: 160)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 96, elements: !347)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !344, line: 53, baseType: !345)
!344 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/samd51g19a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !133)
!347 = !{!348}
!348 = !DISubrange(count: 12)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT0", scope: !280, file: !279, line: 346, baseType: !350, size: 32, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT0_Type", file: !279, line: 216, baseType: !352)
!352 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 210, size: 32, elements: !353)
!353 = !{!354, !358}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !352, file: !279, line: 214, baseType: !355, size: 32)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !352, file: !279, line: 211, size: 32, elements: !356)
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "INVALL", scope: !355, file: !279, line: 212, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !352, file: !279, line: 215, baseType: !162, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "MAINT1", scope: !280, file: !279, line: 347, baseType: !360, size: 32, offset: 288)
!360 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MAINT1_Type", file: !279, line: 236, baseType: !362)
!362 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 228, size: 32, elements: !363)
!363 = !{!364, !369}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !362, file: !279, line: 234, baseType: !365, size: 32)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !362, file: !279, line: 229, size: 32, elements: !366)
!366 = !{!367, !368}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "INDEX", scope: !365, file: !279, line: 231, baseType: !162, size: 8, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "WAY", scope: !365, file: !279, line: 233, baseType: !162, size: 4, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !362, file: !279, line: 235, baseType: !162, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "MCFG", scope: !280, file: !279, line: 348, baseType: !371, size: 32, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCFG_Type", file: !279, line: 266, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 260, size: 32, elements: !374)
!374 = !{!375, !379}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !373, file: !279, line: 264, baseType: !376, size: 32)
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !373, file: !279, line: 261, size: 32, elements: !377)
!377 = !{!378}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !376, file: !279, line: 262, baseType: !162, size: 2, flags: DIFlagBitField, extraData: i64 0)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !373, file: !279, line: 265, baseType: !162, size: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "MEN", scope: !280, file: !279, line: 349, baseType: !381, size: 32, offset: 352)
!381 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !382)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MEN_Type", file: !279, line: 291, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 285, size: 32, elements: !384)
!384 = !{!385, !389}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !383, file: !279, line: 289, baseType: !386, size: 32)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !383, file: !279, line: 286, size: 32, elements: !387)
!387 = !{!388}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "MENABLE", scope: !386, file: !279, line: 287, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !383, file: !279, line: 290, baseType: !162, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "MCTRL", scope: !280, file: !279, line: 350, baseType: !391, size: 32, offset: 384)
!391 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !392)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MCTRL_Type", file: !279, line: 309, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 303, size: 32, elements: !394)
!394 = !{!395, !399}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !393, file: !279, line: 307, baseType: !396, size: 32)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !393, file: !279, line: 304, size: 32, elements: !397)
!397 = !{!398}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !396, file: !279, line: 305, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !393, file: !279, line: 308, baseType: !162, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "MSR", scope: !280, file: !279, line: 351, baseType: !401, size: 32, offset: 416)
!401 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!402 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "CMCC_MSR_Type", file: !279, line: 326, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !279, line: 321, size: 32, elements: !405)
!405 = !{!406, !410}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !404, file: !279, line: 324, baseType: !407, size: 32)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !404, file: !279, line: 322, size: 32, elements: !408)
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "EVENT_CNT", scope: !407, file: !279, line: 323, baseType: !162, size: 32, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !404, file: !279, line: 325, baseType: !162, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "Gclk", file: !413, line: 267, baseType: !414)
!413 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/gclk.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !413, line: 259, size: 2560, elements: !415)
!415 = !{!416, !426, !430, !457, !461, !479, !483}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !414, file: !413, line: 260, baseType: !417, size: 8)
!417 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_CTRLA_Type", file: !413, line: 50, baseType: !419)
!419 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 44, size: 8, elements: !420)
!420 = !{!421, !425}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !419, file: !413, line: 48, baseType: !422, size: 8)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !419, file: !413, line: 45, size: 8, elements: !423)
!423 = !{!424}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !422, file: !413, line: 46, baseType: !133, size: 1, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !419, file: !413, line: 49, baseType: !133, size: 8)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !414, file: !413, line: 261, baseType: !427, size: 24, offset: 8)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 24, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 3)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "SYNCBUSY", scope: !414, file: !413, line: 262, baseType: !431, size: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !432)
!432 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !433)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_SYNCBUSY_Type", file: !413, line: 86, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 62, size: 32, elements: !435)
!435 = !{!436, !452, !456}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !434, file: !413, line: 79, baseType: !437, size: 32)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !434, file: !413, line: 63, size: 32, elements: !438)
!438 = !{!439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "SWRST", scope: !437, file: !413, line: 64, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL0", scope: !437, file: !413, line: 66, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL1", scope: !437, file: !413, line: 67, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL2", scope: !437, file: !413, line: 68, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL3", scope: !437, file: !413, line: 69, baseType: !162, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL4", scope: !437, file: !413, line: 70, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL5", scope: !437, file: !413, line: 71, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL6", scope: !437, file: !413, line: 72, baseType: !162, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL7", scope: !437, file: !413, line: 73, baseType: !162, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL8", scope: !437, file: !413, line: 74, baseType: !162, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL9", scope: !437, file: !413, line: 75, baseType: !162, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL10", scope: !437, file: !413, line: 76, baseType: !162, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL11", scope: !437, file: !413, line: 77, baseType: !162, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !434, file: !413, line: 84, baseType: !453, size: 32)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !434, file: !413, line: 80, size: 32, elements: !454)
!454 = !{!455}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !453, file: !413, line: 82, baseType: !162, size: 12, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !434, file: !413, line: 85, baseType: !162, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !414, file: !413, line: 263, baseType: !458, size: 192, offset: 64)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 192, elements: !459)
!459 = !{!460}
!460 = !DISubrange(count: 24)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "GENCTRL", scope: !414, file: !413, line: 264, baseType: !462, size: 384, offset: 256)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 384, elements: !347)
!463 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !464)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_GENCTRL_Type", file: !413, line: 163, baseType: !465)
!465 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 149, size: 32, elements: !466)
!466 = !{!467, !478}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !465, file: !413, line: 161, baseType: !468, size: 32)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !465, file: !413, line: 150, size: 32, elements: !469)
!469 = !{!470, !471, !472, !473, !474, !475, !476, !477}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "SRC", scope: !468, file: !413, line: 151, baseType: !162, size: 4, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "GENEN", scope: !468, file: !413, line: 153, baseType: !162, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "IDC", scope: !468, file: !413, line: 154, baseType: !162, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "OOV", scope: !468, file: !413, line: 155, baseType: !162, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "OE", scope: !468, file: !413, line: 156, baseType: !162, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "DIVSEL", scope: !468, file: !413, line: 157, baseType: !162, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !468, file: !413, line: 158, baseType: !162, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !468, file: !413, line: 160, baseType: !162, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !465, file: !413, line: 162, baseType: !162, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !414, file: !413, line: 265, baseType: !480, size: 384, offset: 640)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 384, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 48)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "PCHCTRL", scope: !414, file: !413, line: 266, baseType: !484, size: 1536, offset: 1024)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 1536, elements: !481)
!485 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "GCLK_PCHCTRL_Type", file: !413, line: 218, baseType: !487)
!487 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !413, line: 209, size: 32, elements: !488)
!488 = !{!489, !495}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !487, file: !413, line: 216, baseType: !490, size: 32)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !487, file: !413, line: 210, size: 32, elements: !491)
!491 = !{!492, !493, !494}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "GEN", scope: !490, file: !413, line: 211, baseType: !162, size: 4, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "CHEN", scope: !490, file: !413, line: 213, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !490, file: !413, line: 214, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !487, file: !413, line: 217, baseType: !162, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "Oscctrl", file: !498, line: 788, baseType: !499)
!498 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd51/component/oscctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !498, line: 771, size: 704, elements: !500)
!500 = !{!501, !516, !517, !548, !579, !612, !647, !671, !683, !684, !701, !702, !714, !726, !739, !740}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "EVCTRL", scope: !499, file: !498, line: 772, baseType: !502, size: 8)
!502 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !503)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_EVCTRL_Type", file: !498, line: 55, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !498, line: 44, size: 8, elements: !505)
!505 = !{!506, !511, !515}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !504, file: !498, line: 49, baseType: !507, size: 8)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !504, file: !498, line: 45, size: 8, elements: !508)
!508 = !{!509, !510}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO0", scope: !507, file: !498, line: 46, baseType: !133, size: 1, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO1", scope: !507, file: !498, line: 47, baseType: !133, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !504, file: !498, line: 53, baseType: !512, size: 8)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !504, file: !498, line: 50, size: 8, elements: !513)
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEO", scope: !512, file: !498, line: 51, baseType: !133, size: 2, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !504, file: !498, line: 54, baseType: !133, size: 8)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !499, file: !498, line: 773, baseType: !427, size: 24, offset: 8)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !499, file: !498, line: 774, baseType: !518, size: 32, offset: 32)
!518 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENCLR_Type", file: !498, line: 102, baseType: !520)
!520 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !498, line: 72, size: 32, elements: !521)
!521 = !{!522, !542, !547}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !520, file: !498, line: 95, baseType: !523, size: 32)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !520, file: !498, line: 73, size: 32, elements: !524)
!524 = !{!525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !523, file: !498, line: 74, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !523, file: !498, line: 75, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !523, file: !498, line: 76, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !523, file: !498, line: 77, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !523, file: !498, line: 79, baseType: !162, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !523, file: !498, line: 80, baseType: !162, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !523, file: !498, line: 81, baseType: !162, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !523, file: !498, line: 82, baseType: !162, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !523, file: !498, line: 83, baseType: !162, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !523, file: !498, line: 85, baseType: !162, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !523, file: !498, line: 86, baseType: !162, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !523, file: !498, line: 87, baseType: !162, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !523, file: !498, line: 88, baseType: !162, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !523, file: !498, line: 90, baseType: !162, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !523, file: !498, line: 91, baseType: !162, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !523, file: !498, line: 92, baseType: !162, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !523, file: !498, line: 93, baseType: !162, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !520, file: !498, line: 100, baseType: !543, size: 32)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !520, file: !498, line: 96, size: 32, elements: !544)
!544 = !{!545, !546}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !543, file: !498, line: 97, baseType: !162, size: 2, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !543, file: !498, line: 98, baseType: !162, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !520, file: !498, line: 101, baseType: !162, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !499, file: !498, line: 775, baseType: !549, size: 32, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !550)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTENSET_Type", file: !498, line: 182, baseType: !551)
!551 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !498, line: 152, size: 32, elements: !552)
!552 = !{!553, !573, !578}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !551, file: !498, line: 175, baseType: !554, size: 32)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !551, file: !498, line: 153, size: 32, elements: !555)
!555 = !{!556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !554, file: !498, line: 154, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !554, file: !498, line: 155, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !554, file: !498, line: 156, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !554, file: !498, line: 157, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !554, file: !498, line: 159, baseType: !162, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !554, file: !498, line: 160, baseType: !162, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !554, file: !498, line: 161, baseType: !162, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !554, file: !498, line: 162, baseType: !162, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !554, file: !498, line: 163, baseType: !162, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !554, file: !498, line: 165, baseType: !162, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !554, file: !498, line: 166, baseType: !162, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !554, file: !498, line: 167, baseType: !162, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !554, file: !498, line: 168, baseType: !162, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !554, file: !498, line: 170, baseType: !162, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !554, file: !498, line: 171, baseType: !162, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !554, file: !498, line: 172, baseType: !162, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !554, file: !498, line: 173, baseType: !162, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !551, file: !498, line: 180, baseType: !574, size: 32)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !551, file: !498, line: 176, size: 32, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !574, file: !498, line: 177, baseType: !162, size: 2, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !574, file: !498, line: 178, baseType: !162, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !551, file: !498, line: 181, baseType: !162, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !499, file: !498, line: 776, baseType: !580, size: 32, offset: 96)
!580 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_INTFLAG_Type", file: !498, line: 262, baseType: !582)
!582 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !498, line: 232, size: 32, elements: !583)
!583 = !{!584, !606, !611}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !582, file: !498, line: 255, baseType: !585, size: 32)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !582, file: !498, line: 233, size: 32, elements: !586)
!586 = !{!587, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !585, file: !498, line: 234, baseType: !588, size: 1, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !589)
!589 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !162)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !585, file: !498, line: 235, baseType: !588, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !585, file: !498, line: 236, baseType: !588, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !585, file: !498, line: 237, baseType: !588, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !585, file: !498, line: 239, baseType: !588, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !585, file: !498, line: 240, baseType: !588, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !585, file: !498, line: 241, baseType: !588, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !585, file: !498, line: 242, baseType: !588, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !585, file: !498, line: 243, baseType: !588, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !585, file: !498, line: 245, baseType: !588, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !585, file: !498, line: 246, baseType: !588, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LTO", scope: !585, file: !498, line: 247, baseType: !588, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !585, file: !498, line: 248, baseType: !588, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !585, file: !498, line: 250, baseType: !588, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !585, file: !498, line: 251, baseType: !588, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LTO", scope: !585, file: !498, line: 252, baseType: !588, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !585, file: !498, line: 253, baseType: !588, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !582, file: !498, line: 260, baseType: !607, size: 32)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !582, file: !498, line: 256, size: 32, elements: !608)
!608 = !{!609, !610}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !607, file: !498, line: 257, baseType: !588, size: 2, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !607, file: !498, line: 258, baseType: !588, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !582, file: !498, line: 261, baseType: !162, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !499, file: !498, line: 777, baseType: !613, size: 32, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !615)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_STATUS_Type", file: !498, line: 345, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !498, line: 312, size: 32, elements: !617)
!617 = !{!618, !640, !646}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !616, file: !498, line: 337, baseType: !619, size: 32)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !616, file: !498, line: 313, size: 32, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY0", scope: !619, file: !498, line: 314, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY1", scope: !619, file: !498, line: 315, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL0", scope: !619, file: !498, line: 316, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL1", scope: !619, file: !498, line: 317, baseType: !162, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW0", scope: !619, file: !498, line: 318, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW1", scope: !619, file: !498, line: 319, baseType: !162, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !619, file: !498, line: 321, baseType: !162, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !619, file: !498, line: 322, baseType: !162, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !619, file: !498, line: 323, baseType: !162, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !619, file: !498, line: 324, baseType: !162, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !619, file: !498, line: 325, baseType: !162, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKR", scope: !619, file: !498, line: 327, baseType: !162, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LCKF", scope: !619, file: !498, line: 328, baseType: !162, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0TO", scope: !619, file: !498, line: 329, baseType: !162, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL0LDRTO", scope: !619, file: !498, line: 330, baseType: !162, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKR", scope: !619, file: !498, line: 332, baseType: !162, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LCKF", scope: !619, file: !498, line: 333, baseType: !162, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1TO", scope: !619, file: !498, line: 334, baseType: !162, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "DPLL1LDRTO", scope: !619, file: !498, line: 335, baseType: !162, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !616, file: !498, line: 343, baseType: !641, size: 32)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !616, file: !498, line: 338, size: 32, elements: !642)
!642 = !{!643, !644, !645}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !641, file: !498, line: 339, baseType: !162, size: 2, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCFAIL", scope: !641, file: !498, line: 340, baseType: !162, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCKSW", scope: !641, file: !498, line: 341, baseType: !162, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !616, file: !498, line: 344, baseType: !162, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCCTRL", scope: !499, file: !498, line: 778, baseType: !648, size: 64, offset: 160)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 64, elements: !669)
!649 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_XOSCCTRL_Type", file: !498, line: 422, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !498, line: 402, size: 32, elements: !652)
!652 = !{!653, !668}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !651, file: !498, line: 420, baseType: !654, size: 32)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !651, file: !498, line: 403, size: 32, elements: !655)
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !654, file: !498, line: 405, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !654, file: !498, line: 406, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !654, file: !498, line: 408, baseType: !162, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !654, file: !498, line: 409, baseType: !162, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "LOWBUFGAIN", scope: !654, file: !498, line: 410, baseType: !162, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "IPTAT", scope: !654, file: !498, line: 411, baseType: !162, size: 2, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "IMULT", scope: !654, file: !498, line: 412, baseType: !162, size: 4, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ENALC", scope: !654, file: !498, line: 413, baseType: !162, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "CFDEN", scope: !654, file: !498, line: 414, baseType: !162, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "SWBEN", scope: !654, file: !498, line: 415, baseType: !162, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !654, file: !498, line: 417, baseType: !162, size: 4, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "CFDPRESC", scope: !654, file: !498, line: 418, baseType: !162, size: 4, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !651, file: !498, line: 421, baseType: !162, size: 32)
!669 = !{!670}
!670 = !DISubrange(count: 2)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLA", scope: !499, file: !498, line: 779, baseType: !672, size: 8, offset: 224)
!672 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLA_Type", file: !498, line: 469, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !498, line: 460, size: 8, elements: !675)
!675 = !{!676, !682}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !674, file: !498, line: 467, baseType: !677, size: 8)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !674, file: !498, line: 461, size: 8, elements: !678)
!678 = !{!679, !680, !681}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !677, file: !498, line: 463, baseType: !133, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !677, file: !498, line: 465, baseType: !133, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !677, file: !498, line: 466, baseType: !133, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !674, file: !498, line: 468, baseType: !133, size: 8)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !499, file: !498, line: 780, baseType: !427, size: 24, offset: 232)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !499, file: !498, line: 781, baseType: !685, size: 8, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLCTRLB_Type", file: !498, line: 497, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !498, line: 485, size: 8, elements: !688)
!688 = !{!689, !700}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !687, file: !498, line: 495, baseType: !690, size: 8)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !687, file: !498, line: 486, size: 8, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !690, file: !498, line: 487, baseType: !133, size: 1, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !690, file: !498, line: 488, baseType: !133, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !690, file: !498, line: 489, baseType: !133, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !690, file: !498, line: 490, baseType: !133, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !690, file: !498, line: 491, baseType: !133, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !690, file: !498, line: 492, baseType: !133, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !690, file: !498, line: 493, baseType: !133, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !690, file: !498, line: 494, baseType: !133, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !687, file: !498, line: 496, baseType: !133, size: 8)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !499, file: !498, line: 782, baseType: !427, size: 24, offset: 264)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !499, file: !498, line: 783, baseType: !703, size: 32, offset: 288)
!703 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLVAL_Type", file: !498, line: 531, baseType: !705)
!705 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !498, line: 523, size: 32, elements: !706)
!706 = !{!707, !713}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !705, file: !498, line: 529, baseType: !708, size: 32)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !705, file: !498, line: 524, size: 32, elements: !709)
!709 = !{!710, !711, !712}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !708, file: !498, line: 525, baseType: !162, size: 8, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !708, file: !498, line: 527, baseType: !162, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !708, file: !498, line: 528, baseType: !162, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !705, file: !498, line: 530, baseType: !162, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !499, file: !498, line: 784, baseType: !715, size: 32, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLMUL_Type", file: !498, line: 558, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !498, line: 550, size: 32, elements: !718)
!718 = !{!719, !725}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !717, file: !498, line: 556, baseType: !720, size: 32)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !717, file: !498, line: 551, size: 32, elements: !721)
!721 = !{!722, !723, !724}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !720, file: !498, line: 552, baseType: !162, size: 16, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !720, file: !498, line: 553, baseType: !162, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !720, file: !498, line: 555, baseType: !162, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !717, file: !498, line: 557, baseType: !162, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !499, file: !498, line: 785, baseType: !727, size: 8, offset: 352)
!727 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DFLLSYNC_Type", file: !498, line: 587, baseType: !729)
!729 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !498, line: 577, size: 8, elements: !730)
!730 = !{!731, !738}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !729, file: !498, line: 585, baseType: !732, size: 8)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !729, file: !498, line: 578, size: 8, elements: !733)
!733 = !{!734, !735, !736, !737}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !732, file: !498, line: 580, baseType: !133, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRLB", scope: !732, file: !498, line: 581, baseType: !133, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !732, file: !498, line: 582, baseType: !133, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !732, file: !498, line: 583, baseType: !133, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !729, file: !498, line: 586, baseType: !133, size: 8)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !499, file: !498, line: 786, baseType: !427, size: 24, offset: 360)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "Dpll", scope: !499, file: !498, line: 787, baseType: !741, size: 320, offset: 384)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 320, elements: !669)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "OscctrlDpll", file: !498, line: 766, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !498, line: 759, size: 160, elements: !744)
!744 = !{!745, !757, !758, !769, !786, !798}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !743, file: !498, line: 760, baseType: !746, size: 8)
!746 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLA_Type", file: !498, line: 614, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !498, line: 605, size: 8, elements: !749)
!749 = !{!750, !756}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !748, file: !498, line: 612, baseType: !751, size: 8)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !748, file: !498, line: 606, size: 8, elements: !752)
!752 = !{!753, !754, !755}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !751, file: !498, line: 608, baseType: !133, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !751, file: !498, line: 610, baseType: !133, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !751, file: !498, line: 611, baseType: !133, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !748, file: !498, line: 613, baseType: !133, size: 8)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !743, file: !498, line: 761, baseType: !427, size: 24, offset: 8)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !743, file: !498, line: 762, baseType: !759, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLRATIO_Type", file: !498, line: 638, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !498, line: 630, size: 32, elements: !762)
!762 = !{!763, !768}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !761, file: !498, line: 636, baseType: !764, size: 32)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !761, file: !498, line: 631, size: 32, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !764, file: !498, line: 632, baseType: !162, size: 13, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !764, file: !498, line: 634, baseType: !162, size: 5, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !761, file: !498, line: 637, baseType: !162, size: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !743, file: !498, line: 763, baseType: !770, size: 32, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLCTRLB_Type", file: !498, line: 667, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !498, line: 654, size: 32, elements: !773)
!773 = !{!774, !785}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !772, file: !498, line: 665, baseType: !775, size: 32)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !772, file: !498, line: 655, size: 32, elements: !776)
!776 = !{!777, !778, !779, !780, !781, !782, !783, !784}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !775, file: !498, line: 656, baseType: !162, size: 4, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !775, file: !498, line: 657, baseType: !162, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !775, file: !498, line: 658, baseType: !162, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !775, file: !498, line: 659, baseType: !162, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !775, file: !498, line: 660, baseType: !162, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "DCOFILTER", scope: !775, file: !498, line: 661, baseType: !162, size: 3, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "DCOEN", scope: !775, file: !498, line: 662, baseType: !162, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !775, file: !498, line: 663, baseType: !162, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !772, file: !498, line: 666, baseType: !162, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSYNCBUSY", scope: !743, file: !498, line: 764, baseType: !787, size: 32, offset: 96)
!787 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !788)
!788 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !789)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSYNCBUSY_Type", file: !498, line: 724, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !498, line: 716, size: 32, elements: !791)
!791 = !{!792, !797}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !790, file: !498, line: 722, baseType: !793, size: 32)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !790, file: !498, line: 717, size: 32, elements: !794)
!794 = !{!795, !796}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !793, file: !498, line: 719, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !793, file: !498, line: 720, baseType: !162, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !790, file: !498, line: 723, baseType: !162, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !743, file: !498, line: 765, baseType: !799, size: 32, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "OSCCTRL_DPLLSTATUS_Type", file: !498, line: 745, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !498, line: 738, size: 32, elements: !803)
!803 = !{!804, !809}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !802, file: !498, line: 743, baseType: !805, size: 32)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !802, file: !498, line: 739, size: 32, elements: !806)
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !805, file: !498, line: 740, baseType: !162, size: 1, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !805, file: !498, line: 741, baseType: !162, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !802, file: !498, line: 744, baseType: !162, size: 32)
!810 = !{!272}
!811 = !DIFile(filename: "zephyr/soc/arm/atmel_sam0/common/soc_samd5x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!812 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !813)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !814, line: 51, size: 64, elements: !815)
!814 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!815 = !{!816, !835}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !813, file: !814, line: 60, baseType: !817, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!818 = !DISubroutineType(types: !819)
!819 = !{!107, !820}
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !120, line: 378, size: 192, elements: !823)
!823 = !{!824, !825, !826, !827, !833, !834}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !822, file: !120, line: 380, baseType: !123, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !822, file: !120, line: 382, baseType: !13, size: 32, offset: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !822, file: !120, line: 384, baseType: !13, size: 32, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !822, file: !120, line: 386, baseType: !828, size: 32, offset: 96)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !120, line: 351, size: 16, elements: !830)
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !829, file: !120, line: 359, baseType: !133, size: 8)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !829, file: !120, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !822, file: !120, line: 388, baseType: !102, size: 32, offset: 128)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !822, file: !120, line: 396, baseType: !139, size: 32, offset: 160)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !813, file: !814, line: 65, baseType: !820, size: 32, offset: 32)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "static_regions", scope: !838, file: !845, line: 62, type: !975, isLocal: true, isDefinition: true)
!838 = distinct !DICompileUnit(language: DW_LANG_C99, file: !839, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !840, globals: !841, splitDebugInlining: false, nameTableKind: None)
!839 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_itsybitsy_m4_express/drivers/uart/echo_bot")
!840 = !{!252, !107, !162, !102}
!841 = !{!842, !836}
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !844, file: !845, line: 198, type: !961, isLocal: true, isDefinition: true)
!844 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !845, file: !845, line: 175, type: !846, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !838, retainedNodes: !958)
!845 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!846 = !DISubroutineType(types: !847)
!847 = !{null, !848}
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !850, line: 245, size: 1024, elements: !851)
!850 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!851 = !{!852, !915, !928, !929, !930, !931, !937, !953}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !849, file: !850, line: 247, baseType: !853, size: 384)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !850, line: 57, size: 384, elements: !854)
!854 = !{!855, !880, !887, !888, !889, !902, !903, !904}
!855 = !DIDerivedType(tag: DW_TAG_member, scope: !853, file: !850, line: 60, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !853, file: !850, line: 60, size: 64, elements: !857)
!857 = !{!858, !873}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !856, file: !850, line: 61, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !233, line: 49, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !233, line: 37, size: 64, elements: !861)
!861 = !{!862, !868}
!862 = !DIDerivedType(tag: DW_TAG_member, scope: !860, file: !233, line: 38, baseType: !863, size: 32)
!863 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !860, file: !233, line: 38, size: 32, elements: !864)
!864 = !{!865, !867}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !863, file: !233, line: 39, baseType: !866, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !863, file: !233, line: 40, baseType: !866, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, scope: !860, file: !233, line: 42, baseType: !869, size: 32, offset: 32)
!869 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !860, file: !233, line: 42, size: 32, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !869, file: !233, line: 43, baseType: !866, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !869, file: !233, line: 44, baseType: !866, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !856, file: !850, line: 62, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !875, line: 49, size: 64, elements: !876)
!875 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!876 = !{!877}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !874, file: !875, line: 50, baseType: !878, size: 64)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !879, size: 64, elements: !669)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !853, file: !850, line: 68, baseType: !881, size: 32, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !228, line: 233, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !228, line: 231, size: 64, elements: !884)
!884 = !{!885}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !883, file: !228, line: 232, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !233, line: 48, baseType: !860)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !853, file: !850, line: 71, baseType: !133, size: 8, offset: 96)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !853, file: !850, line: 74, baseType: !133, size: 8, offset: 104)
!889 = !DIDerivedType(tag: DW_TAG_member, scope: !853, file: !850, line: 90, baseType: !890, size: 16, offset: 112)
!890 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !853, file: !850, line: 90, size: 16, elements: !891)
!891 = !{!892, !899}
!892 = !DIDerivedType(tag: DW_TAG_member, scope: !890, file: !850, line: 91, baseType: !893, size: 16)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !890, file: !850, line: 91, size: 16, elements: !894)
!894 = !{!895, !898}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !893, file: !850, line: 96, baseType: !896, size: 8)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !897)
!897 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !893, file: !850, line: 97, baseType: !133, size: 8, offset: 8)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !890, file: !850, line: 100, baseType: !900, size: 16)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !901)
!901 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !853, file: !850, line: 107, baseType: !162, size: 32, offset: 128)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !853, file: !850, line: 127, baseType: !102, size: 32, offset: 160)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !853, file: !850, line: 131, baseType: !905, size: 192, offset: 192)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !228, line: 244, size: 192, elements: !906)
!906 = !{!907, !908, !914}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !905, file: !228, line: 245, baseType: !859, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !905, file: !228, line: 246, baseType: !909, size: 32, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !228, line: 242, baseType: !910)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = !DISubroutineType(types: !912)
!912 = !{null, !913}
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !905, file: !228, line: 249, baseType: !105, size: 64, offset: 128)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !849, file: !850, line: 250, baseType: !916, size: 288, offset: 384)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !917, line: 25, size: 288, elements: !918)
!917 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!918 = !{!919, !920, !921, !922, !923, !924, !925, !926, !927}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !916, file: !917, line: 26, baseType: !162, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !916, file: !917, line: 27, baseType: !162, size: 32, offset: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !916, file: !917, line: 28, baseType: !162, size: 32, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !916, file: !917, line: 29, baseType: !162, size: 32, offset: 96)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !916, file: !917, line: 30, baseType: !162, size: 32, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !916, file: !917, line: 31, baseType: !162, size: 32, offset: 160)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !916, file: !917, line: 32, baseType: !162, size: 32, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !916, file: !917, line: 33, baseType: !162, size: 32, offset: 224)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !916, file: !917, line: 34, baseType: !162, size: 32, offset: 256)
