; ModuleID = 'build/actinius_icarus/getline/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.k_fifo = type { %struct.k_queue }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %union.anon }
%struct._sflist = type { %struct.z_heap_bucket*, %struct.z_heap_bucket* }
%struct.z_heap_bucket = type { i32 }
%struct.k_spinlock = type {}
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.console_input = type { i32, i8, [128 x i8] }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/getline/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/getline")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/getline")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/getline")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !111, file: !173, line: 65, type: !174, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !166, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/getline")
!113 = !{!102, !103, !114, !119, !126}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !116, file: !115, line: 167, baseType: !125)
!115 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !115, file: !115, line: 134, type: !117, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !111, retainedNodes: !120)
!117 = !DISubroutineType(types: !118)
!118 = !{null, !119}
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!120 = !{!121, !122, !124}
!121 = !DILocalVariable(name: "time_us", arg: 1, scope: !116, file: !115, line: 134, type: !119)
!122 = !DILocalVariable(name: "delay_cycles", scope: !116, file: !115, line: 168, type: !123)
!123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !114)
!124 = !DILocalVariable(name: "cycles", scope: !116, file: !115, line: 171, type: !119)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !128, line: 1928, baseType: !129)
!128 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 1909, size: 11360, elements: !130)
!130 = !{!131, !137, !138, !139, !140, !144, !145, !146, !147, !151, !152, !156, !157, !158, !159, !160, !164, !165}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !129, file: !128, line: 1910, baseType: !132, size: 8192)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 8192, elements: !135)
!133 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !119)
!135 = !{!136}
!136 = !DISubrange(count: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !129, file: !128, line: 1911, baseType: !133, size: 32, offset: 8192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !129, file: !128, line: 1912, baseType: !133, size: 32, offset: 8224)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !129, file: !128, line: 1913, baseType: !133, size: 32, offset: 8256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !129, file: !128, line: 1914, baseType: !141, size: 1984, offset: 8288)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 1984, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 62)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !129, file: !128, line: 1915, baseType: !134, size: 32, offset: 10272)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !129, file: !128, line: 1916, baseType: !133, size: 32, offset: 10304)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !129, file: !128, line: 1917, baseType: !134, size: 32, offset: 10336)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !129, file: !128, line: 1918, baseType: !148, size: 96, offset: 10368)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 96, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 3)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !129, file: !128, line: 1919, baseType: !134, size: 32, offset: 10464)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !129, file: !128, line: 1920, baseType: !153, size: 256, offset: 10496)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 256, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 8)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !129, file: !128, line: 1921, baseType: !134, size: 32, offset: 10752)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !129, file: !128, line: 1922, baseType: !133, size: 32, offset: 10784)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !129, file: !128, line: 1923, baseType: !134, size: 32, offset: 10816)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !129, file: !128, line: 1924, baseType: !134, size: 32, offset: 10848)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !129, file: !128, line: 1925, baseType: !161, size: 416, offset: 10880)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 416, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 13)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !129, file: !128, line: 1926, baseType: !134, size: 32, offset: 11296)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !129, file: !128, line: 1927, baseType: !134, size: 32, offset: 11328)
!166 = !{!109, !167}
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !116, file: !115, line: 161, type: !169, isLocal: true, isDefinition: true, align: 128)
!169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !170, size: 48, elements: !149)
!170 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !171)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !172)
!172 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!173 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !177)
!176 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!177 = !{!178, !185}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !175, file: !176, line: 60, baseType: !179, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!103, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !176, line: 48, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !175, file: !176, line: 65, baseType: !182, size: 32, offset: 32)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "free_queue", scope: !188, file: !297, line: 17, type: !298, isLocal: true, isDefinition: true, align: 32)
!188 = distinct !DICompileUnit(language: DW_LANG_C99, file: !189, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !190, globals: !294, splitDebugInlining: false, nameTableKind: None)
!189 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/console/getline.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/getline")
!190 = !{!102, !191, !195, !103, !197}
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !192, line: 46, baseType: !193)
!192 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !194)
!194 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !196, line: 214, baseType: !32)
!196 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !200, line: 336, size: 608, elements: !201)
!200 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!201 = !{!202, !234, !238, !242, !255, !260, !266, !272, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !199, file: !200, line: 365, baseType: !203, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{!103, !206, !233}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 32)
!207 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !208)
!208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !209, line: 378, size: 192, elements: !210)
!209 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = !{!211, !215, !216, !217, !226, !227}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !208, file: !209, line: 380, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!214 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !208, file: !209, line: 382, baseType: !13, size: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !208, file: !209, line: 384, baseType: !13, size: 32, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !208, file: !209, line: 386, baseType: !218, size: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 32)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !209, line: 351, size: 16, elements: !220)
!220 = !{!221, !224}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !219, file: !209, line: 359, baseType: !222, size: 8)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !223)
!223 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !219, file: !209, line: 364, baseType: !225, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!225 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !208, file: !209, line: 388, baseType: !102, size: 32, offset: 128)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !208, file: !209, line: 396, baseType: !228, size: 32, offset: 160)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !209, line: 43, baseType: !231)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !232)
!232 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !199, file: !200, line: 366, baseType: !235, size: 32, offset: 32)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !206, !223}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !199, file: !200, line: 374, baseType: !239, size: 32, offset: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = !DISubroutineType(types: !241)
!241 = !{!103, !206}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !199, file: !200, line: 377, baseType: !243, size: 32, offset: 96)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = !DISubroutineType(types: !245)
!245 = !{!103, !206, !246}
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !200, line: 122, size: 64, elements: !249)
!249 = !{!250, !251, !252, !253, !254}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !248, file: !200, line: 123, baseType: !119, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !248, file: !200, line: 124, baseType: !222, size: 8, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !248, file: !200, line: 125, baseType: !222, size: 8, offset: 40)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !248, file: !200, line: 126, baseType: !222, size: 8, offset: 48)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !248, file: !200, line: 127, baseType: !222, size: 8, offset: 56)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !199, file: !200, line: 379, baseType: !256, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DISubroutineType(types: !258)
!258 = !{!103, !206, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !199, file: !200, line: 384, baseType: !261, size: 32, offset: 160)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 32)
!262 = !DISubroutineType(types: !263)
!263 = !{!103, !206, !264, !103}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !222)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !199, file: !200, line: 393, baseType: !267, size: 32, offset: 192)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = !DISubroutineType(types: !269)
!269 = !{!103, !206, !270, !271}
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !199, file: !200, line: 402, baseType: !273, size: 32, offset: 224)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DISubroutineType(types: !275)
!275 = !{null, !206}
!276 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !199, file: !200, line: 405, baseType: !273, size: 32, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !199, file: !200, line: 408, baseType: !239, size: 32, offset: 288)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !199, file: !200, line: 411, baseType: !273, size: 32, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !199, file: !200, line: 414, baseType: !273, size: 32, offset: 352)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !199, file: !200, line: 417, baseType: !239, size: 32, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !199, file: !200, line: 420, baseType: !239, size: 32, offset: 416)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !199, file: !200, line: 423, baseType: !273, size: 32, offset: 448)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !199, file: !200, line: 426, baseType: !273, size: 32, offset: 480)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !199, file: !200, line: 429, baseType: !239, size: 32, offset: 512)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !199, file: !200, line: 432, baseType: !239, size: 32, offset: 544)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !199, file: !200, line: 435, baseType: !287, size: 32, offset: 576)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !206, !290, !102}
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !200, line: 142, baseType: !291)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 32)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !206, !102}
!294 = !{!186, !295, !342, !363}
!295 = !DIGlobalVariableExpression(var: !296, expr: !DIExpression())
!296 = distinct !DIGlobalVariable(name: "used_queue", scope: !188, file: !297, line: 18, type: !298, isLocal: true, isDefinition: true, align: 32)
!297 = !DIFile(filename: "zephyr/subsys/console/getline.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_fifo", file: !299, line: 2208, size: 128, elements: !300)
!299 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!300 = !{!301}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_queue", scope: !298, file: !299, line: 2209, baseType: !302, size: 128)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !299, line: 1709, size: 128, elements: !303)
!303 = !{!304, !317, !321}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !302, file: !299, line: 1710, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !306, line: 46, baseType: !307)
!306 = !DIFile(filename: "zephyr/include/zephyr/sys/sflist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !306, line: 41, size: 64, elements: !308)
!308 = !{!309, !316}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !307, file: !306, line: 42, baseType: !310, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !306, line: 39, baseType: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !306, line: 35, size: 32, elements: !313)
!313 = !{!314}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !312, file: !306, line: 36, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !306, line: 32, baseType: !119)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !307, file: !306, line: 43, baseType: !310, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !302, file: !299, line: 1711, baseType: !318, offset: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !319, line: 43, elements: !320)
!319 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!320 = !{}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !302, file: !299, line: 1712, baseType: !322, size: 64, offset: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !323, line: 233, baseType: !324)
!323 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 231, size: 64, elements: !325)
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !324, file: !323, line: 232, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !328, line: 48, baseType: !329)
!328 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !328, line: 37, size: 64, elements: !330)
!330 = !{!331, !337}
!331 = !DIDerivedType(tag: DW_TAG_member, scope: !329, file: !328, line: 38, baseType: !332, size: 32)
!332 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !329, file: !328, line: 38, size: 32, elements: !333)
!333 = !{!334, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !332, file: !328, line: 39, baseType: !335, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !332, file: !328, line: 40, baseType: !335, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, scope: !329, file: !328, line: 42, baseType: !338, size: 32, offset: 32)
!338 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !329, file: !328, line: 42, size: 32, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !338, file: !328, line: 43, baseType: !335, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !338, file: !328, line: 44, baseType: !335, size: 32)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "cmd", scope: !344, file: !297, line: 22, type: !351, isLocal: true, isDefinition: true)
!344 = distinct !DISubprogram(name: "console_getline", scope: !297, file: !297, line: 20, type: !345, scopeLine: 21, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !188, retainedNodes: !348)
!345 = !DISubroutineType(types: !346)
!346 = !{!347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!348 = !{!349}
!349 = !DILocalVariable(name: "ret", scope: !350, file: !297, line: 29, type: !102)
!350 = distinct !DILexicalBlock(scope: !344, file: !297, line: 29, column: 8)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "console_input", file: !353, line: 21, size: 1088, elements: !354)
!353 = !DIFile(filename: "zephyr/include/zephyr/drivers/console/console.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!354 = !{!355, !358, !359}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !352, file: !353, line: 23, baseType: !356, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !357)
!357 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "is_mcumgr", scope: !352, file: !353, line: 25, baseType: !222, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !352, file: !353, line: 27, baseType: !360, size: 1024, offset: 40)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !214, size: 1024, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 128)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "line_bufs", scope: !188, file: !297, line: 15, type: !365, isLocal: true, isDefinition: true)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 2176, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 2)
!368 = !DIGlobalVariableExpression(var: !369, expr: !DIExpression())
!369 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !370, file: !406, line: 27, type: !431, isLocal: true, isDefinition: true)
!370 = distinct !DICompileUnit(language: DW_LANG_C99, file: !371, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !372, retainedTypes: !384, globals: !403, splitDebugInlining: false, nameTableKind: None)
!371 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/getline")
!372 = !{!373, !30}
!373 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !374, line: 27, baseType: !32, size: 32, elements: !375)
!374 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!375 = !{!376, !377, !378, !379, !380, !381, !382, !383}
!376 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!377 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!378 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!379 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!380 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!381 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!382 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!383 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!384 = !{!102, !191, !103, !24, !385, !347, !119, !401}
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !387, line: 54, size: 96, elements: !388)
!387 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!388 = !{!389, !396, !400}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !386, file: !387, line: 55, baseType: !390, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !391, line: 33, baseType: !392)
!391 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !391, line: 29, size: 32, elements: !393)
!393 = !{!394}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !392, file: !391, line: 30, baseType: !395, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !386, file: !387, line: 60, baseType: !397, size: 32, offset: 32)
!397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !398, size: 32)
!398 = !DISubroutineType(types: !399)
!399 = !{null, !373}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !386, file: !387, line: 65, baseType: !397, size: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !402)
!402 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!403 = !{!368, !404, !408, !410, !421, !423}
!404 = !DIGlobalVariableExpression(var: !405, expr: !DIExpression())
!405 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !370, file: !406, line: 44, type: !407, isLocal: true, isDefinition: true)
!406 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !319, line: 43, elements: !320)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !370, file: !406, line: 49, type: !407, isLocal: true, isDefinition: true)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !370, file: !406, line: 36, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 128, elements: !419)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !374, line: 114, size: 128, elements: !414)
!414 = !{!415, !416, !417, !418}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !413, file: !374, line: 115, baseType: !373, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !413, file: !374, line: 141, baseType: !222, size: 8, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !413, file: !374, line: 149, baseType: !119, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !413, file: !374, line: 156, baseType: !119, size: 32, offset: 96)
!419 = !{!420}
!420 = !DISubrange(count: 1)
!421 = !DIGlobalVariableExpression(var: !422, expr: !DIExpression())
!422 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !370, file: !406, line: 40, type: !412, isLocal: true, isDefinition: true)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !370, file: !406, line: 28, type: !425, isLocal: true, isDefinition: true)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !391, line: 40, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !391, line: 35, size: 64, elements: !427)
!427 = !{!428, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !426, file: !391, line: 36, baseType: !429, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !426, file: !391, line: 37, baseType: !429, size: 32, offset: 32)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 32, elements: !419)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !433, line: 22, baseType: !357)
!433 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!434 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!435 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !438, file: !465, line: 50, type: !452, isLocal: true, isDefinition: true)
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !372, retainedTypes: !440, globals: !462, splitDebugInlining: false, nameTableKind: None)
!439 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/getline")
!440 = !{!231, !191, !195, !103, !102, !119, !401, !441, !347, !452, !453}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !443, line: 45, size: 64, elements: !444)
!443 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!444 = !{!445, !451}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !442, file: !443, line: 46, baseType: !446, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !391, line: 33, baseType: !447)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !391, line: 29, size: 32, elements: !448)
!448 = !{!449}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !447, file: !391, line: 30, baseType: !450, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !442, file: !443, line: 48, baseType: !119, size: 32, offset: 32)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !443, line: 38, size: 64, elements: !455)
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !454, file: !443, line: 39, baseType: !446, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !454, file: !443, line: 41, baseType: !458, size: 32, offset: 32)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !443, line: 35, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !452}
!462 = !{!463, !467, !475, !436, !477, !487}
!463 = !DIGlobalVariableExpression(var: !464, expr: !DIExpression())
!464 = distinct !DIGlobalVariable(name: "latency_lock", scope: !438, file: !465, line: 44, type: !466, isLocal: true, isDefinition: true)
!465 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !319, line: 43, elements: !320)
!467 = !DIGlobalVariableExpression(var: !468, expr: !DIExpression())
!468 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !438, file: !465, line: 46, type: !469, isLocal: true, isDefinition: true)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !391, line: 40, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !391, line: 35, size: 64, elements: !471)
!471 = !{!472, !474}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !470, file: !391, line: 36, baseType: !473, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !470, file: !391, line: 37, baseType: !473, size: 32, offset: 32)
!475 = !DIGlobalVariableExpression(var: !476, expr: !DIExpression())
!476 = distinct !DIGlobalVariable(name: "latency_subs", scope: !438, file: !465, line: 52, type: !469, isLocal: true, isDefinition: true)
!477 = !DIGlobalVariableExpression(var: !478, expr: !DIExpression())
!478 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !438, file: !465, line: 39, type: !479, isLocal: true, isDefinition: true)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, elements: !485)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !465, line: 35, size: 96, elements: !481)
!481 = !{!482, !483, !484}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !480, file: !465, line: 36, baseType: !373, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !480, file: !465, line: 37, baseType: !222, size: 8, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !480, file: !465, line: 38, baseType: !432, size: 32, offset: 64)
!485 = !{!486}
!486 = !DISubrange(count: 0)
!487 = !DIGlobalVariableExpression(var: !488, expr: !DIExpression())
!488 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !438, file: !465, line: 48, type: !452, isLocal: true, isDefinition: true)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !491, file: !498, line: 47, type: !511, isLocal: true, isDefinition: true)
!491 = distinct !DICompileUnit(language: DW_LANG_C99, file: !492, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !493, retainedTypes: !494, globals: !495, splitDebugInlining: false, nameTableKind: None)
!492 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/getline")
!493 = !{!373}
!494 = !{!195, !103}
!495 = !{!496, !489, !508}
!496 = !DIGlobalVariableExpression(var: !497, expr: !DIExpression())
!497 = distinct !DIGlobalVariable(name: "cpus_states", scope: !491, file: !498, line: 50, type: !499, isLocal: true, isDefinition: true)
!498 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !500, size: 32, elements: !419)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !374, line: 114, size: 128, elements: !503)
!503 = !{!504, !505, !506, !507}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !502, file: !374, line: 115, baseType: !373, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !502, file: !374, line: 141, baseType: !222, size: 8, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !502, file: !374, line: 149, baseType: !119, size: 32, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !502, file: !374, line: 156, baseType: !119, size: 32, offset: 96)
!508 = !DIGlobalVariableExpression(var: !509, expr: !DIExpression())
!509 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !491, file: !498, line: 55, type: !510, isLocal: true, isDefinition: true)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 8, elements: !419)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !501, elements: !485)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "static_regions", scope: !514, file: !521, line: 62, type: !648, isLocal: true, isDefinition: true)
!514 = distinct !DICompileUnit(language: DW_LANG_C99, file: !515, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !516, globals: !517, splitDebugInlining: false, nameTableKind: None)
!515 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/getline")
!516 = !{!195, !103, !119, !102}
!517 = !{!518, !512}
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !520, file: !521, line: 198, type: !635, isLocal: true, isDefinition: true)
!520 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !521, file: !521, line: 175, type: !522, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !514, retainedNodes: !632)
!521 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!522 = !DISubroutineType(types: !523)
!523 = !{null, !524}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !526, line: 245, size: 1024, elements: !527)
!526 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!527 = !{!528, !589, !602, !603, !604, !605, !611, !627}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !525, file: !526, line: 247, baseType: !529, size: 384)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !526, line: 57, size: 384, elements: !530)
!530 = !{!531, !556, !563, !564, !565, !576, !577, !578}
!531 = !DIDerivedType(tag: DW_TAG_member, scope: !529, file: !526, line: 60, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !529, file: !526, line: 60, size: 64, elements: !533)
!533 = !{!534, !549}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !532, file: !526, line: 61, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !328, line: 49, baseType: !536)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !328, line: 37, size: 64, elements: !537)
!537 = !{!538, !544}
!538 = !DIDerivedType(tag: DW_TAG_member, scope: !536, file: !328, line: 38, baseType: !539, size: 32)
!539 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !536, file: !328, line: 38, size: 32, elements: !540)
!540 = !{!541, !543}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !539, file: !328, line: 39, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !539, file: !328, line: 40, baseType: !542, size: 32)
!544 = !DIDerivedType(tag: DW_TAG_member, scope: !536, file: !328, line: 42, baseType: !545, size: 32, offset: 32)
!545 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !536, file: !328, line: 42, size: 32, elements: !546)
!546 = !{!547, !548}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !545, file: !328, line: 43, baseType: !542, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !545, file: !328, line: 44, baseType: !542, size: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !532, file: !526, line: 62, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !551, line: 49, size: 64, elements: !552)
!551 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!552 = !{!553}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !550, file: !551, line: 50, baseType: !554, size: 64)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 64, elements: !366)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !529, file: !526, line: 68, baseType: !557, size: 32, offset: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 32)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !323, line: 233, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 231, size: 64, elements: !560)
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !559, file: !323, line: 232, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !328, line: 48, baseType: !536)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !529, file: !526, line: 71, baseType: !222, size: 8, offset: 96)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !529, file: !526, line: 74, baseType: !222, size: 8, offset: 104)
!565 = !DIDerivedType(tag: DW_TAG_member, scope: !529, file: !526, line: 90, baseType: !566, size: 16, offset: 112)
!566 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !529, file: !526, line: 90, size: 16, elements: !567)
!567 = !{!568, !575}
!568 = !DIDerivedType(tag: DW_TAG_member, scope: !566, file: !526, line: 91, baseType: !569, size: 16)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !566, file: !526, line: 91, size: 16, elements: !570)
!570 = !{!571, !574}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !569, file: !526, line: 96, baseType: !572, size: 8)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !573)
!573 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !569, file: !526, line: 97, baseType: !222, size: 8, offset: 8)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !566, file: !526, line: 100, baseType: !171, size: 16)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !529, file: !526, line: 107, baseType: !119, size: 32, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !529, file: !526, line: 127, baseType: !102, size: 32, offset: 160)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !529, file: !526, line: 131, baseType: !579, size: 192, offset: 192)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !323, line: 244, size: 192, elements: !580)
!580 = !{!581, !582, !588}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !579, file: !323, line: 245, baseType: !535, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !579, file: !323, line: 246, baseType: !583, size: 32, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !323, line: 242, baseType: !584)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 32)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !579, file: !323, line: 249, baseType: !193, size: 64, offset: 128)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !525, file: !526, line: 250, baseType: !590, size: 288, offset: 384)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !591, line: 25, size: 288, elements: !592)
!591 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !590, file: !591, line: 26, baseType: !119, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !590, file: !591, line: 27, baseType: !119, size: 32, offset: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !590, file: !591, line: 28, baseType: !119, size: 32, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !590, file: !591, line: 29, baseType: !119, size: 32, offset: 96)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !590, file: !591, line: 30, baseType: !119, size: 32, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !590, file: !591, line: 31, baseType: !119, size: 32, offset: 160)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !590, file: !591, line: 32, baseType: !119, size: 32, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !590, file: !591, line: 33, baseType: !119, size: 32, offset: 224)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !590, file: !591, line: 34, baseType: !119, size: 32, offset: 256)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !525, file: !526, line: 253, baseType: !102, size: 32, offset: 672)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !525, file: !526, line: 256, baseType: !558, size: 64, offset: 704)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !525, file: !526, line: 294, baseType: !103, size: 32, offset: 768)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !525, file: !526, line: 300, baseType: !606, size: 96, offset: 800)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !526, line: 149, size: 96, elements: !607)
!607 = !{!608, !609, !610}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !606, file: !526, line: 153, baseType: !22, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !606, file: !526, line: 162, baseType: !195, size: 32, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !606, file: !526, line: 168, baseType: !195, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !525, file: !526, line: 325, baseType: !612, size: 32, offset: 896)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !299, line: 5073, size: 160, elements: !614)
!614 = !{!615, !624, !625}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !613, file: !299, line: 5074, baseType: !616, size: 96)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !617, line: 56, size: 96, elements: !618)
!617 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!618 = !{!619, !622, !623}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !616, file: !617, line: 57, baseType: !620, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!621 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !617, line: 57, flags: DIFlagFwdDecl)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !616, file: !617, line: 58, baseType: !102, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !616, file: !617, line: 59, baseType: !195, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !613, file: !299, line: 5075, baseType: !558, size: 64, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !613, file: !299, line: 5076, baseType: !626, offset: 160)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !319, line: 43, elements: !320)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !525, file: !526, line: 343, baseType: !628, size: 64, offset: 928)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !591, line: 60, size: 64, elements: !629)
!629 = !{!630, !631}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !628, file: !591, line: 63, baseType: !119, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !628, file: !591, line: 66, baseType: !119, size: 32, offset: 32)
!632 = !{!633, !634}
!633 = !DILocalVariable(name: "thread", arg: 1, scope: !520, file: !521, line: 175, type: !524)
!634 = !DILocalVariable(name: "region_num", scope: !520, file: !521, line: 200, type: !222)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !636, elements: !485)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !637, line: 52, size: 96, elements: !638)
!637 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!638 = !{!639, !640, !641}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !636, file: !637, line: 53, baseType: !22, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !636, file: !637, line: 54, baseType: !195, size: 32, offset: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !636, file: !637, line: 55, baseType: !642, size: 32, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !643, line: 304, baseType: !644)
!643 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !643, line: 301, size: 32, elements: !645)
!645 = !{!646, !647}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !644, file: !643, line: 302, baseType: !171, size: 16)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !644, file: !643, line: 303, baseType: !171, size: 16, offset: 16)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 96, elements: !419)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !636)
!650 = !DIGlobalVariableExpression(var: !651, expr: !DIExpression())
!651 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !652, file: !706, line: 39, type: !222, isLocal: true, isDefinition: true)
!652 = distinct !DICompileUnit(language: DW_LANG_C99, file: !653, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !654, globals: !697, splitDebugInlining: false, nameTableKind: None)
!653 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/getline")
!654 = !{!655, !102, !103, !683}
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !657, line: 1495, baseType: !658)
!657 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !657, line: 1474, size: 448, elements: !659)
!659 = !{!660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !673}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !658, file: !657, line: 1476, baseType: !133, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !658, file: !657, line: 1477, baseType: !134, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !658, file: !657, line: 1478, baseType: !134, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !658, file: !657, line: 1479, baseType: !134, size: 32, offset: 96)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !658, file: !657, line: 1480, baseType: !134, size: 32, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !658, file: !657, line: 1481, baseType: !134, size: 32, offset: 160)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !658, file: !657, line: 1482, baseType: !134, size: 32, offset: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !658, file: !657, line: 1483, baseType: !134, size: 32, offset: 224)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !658, file: !657, line: 1484, baseType: !134, size: 32, offset: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !658, file: !657, line: 1485, baseType: !134, size: 32, offset: 288)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !658, file: !657, line: 1486, baseType: !134, size: 32, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !658, file: !657, line: 1487, baseType: !672, size: 32, offset: 352)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 32, elements: !419)
!673 = !DIDerivedType(tag: DW_TAG_member, scope: !658, file: !657, line: 1488, baseType: !674, size: 64, offset: 384)
!674 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !658, file: !657, line: 1488, size: 64, elements: !675)
!675 = !{!676, !678}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !674, file: !657, line: 1489, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 64, elements: !366)
!678 = !DIDerivedType(tag: DW_TAG_member, scope: !674, file: !657, line: 1490, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !674, file: !657, line: 1490, size: 64, elements: !680)
!680 = !{!681, !682}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !679, file: !657, line: 1491, baseType: !134, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !679, file: !657, line: 1492, baseType: !134, size: 32, offset: 32)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !686, line: 27, size: 128, elements: !687)
!686 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!687 = !{!688, !689, !690}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !685, file: !686, line: 29, baseType: !119, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !685, file: !686, line: 31, baseType: !212, size: 32, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !685, file: !686, line: 37, baseType: !691, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !643, line: 298, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !643, line: 289, size: 64, elements: !693)
!693 = !{!694, !695, !696}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !692, file: !643, line: 291, baseType: !222, size: 5, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !692, file: !643, line: 293, baseType: !222, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !692, file: !643, line: 295, baseType: !119, size: 32, offset: 32)
!697 = !{!650, !698}
!698 = !DIGlobalVariableExpression(var: !699, expr: !DIExpression())
!699 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !652, file: !700, line: 31, type: !701, isLocal: true, isDefinition: true)
!700 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!701 = !DICompositeType(tag: DW_TAG_array_type, baseType: !702, size: 160, elements: !419)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !700, line: 21, size: 160, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !702, file: !700, line: 22, baseType: !103, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !702, file: !700, line: 23, baseType: !685, size: 128, offset: 32)
!706 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !709, file: !716, line: 21, type: !106, isLocal: true, isDefinition: true)
!709 = distinct !DICompileUnit(language: DW_LANG_C99, file: !710, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !711, globals: !715, splitDebugInlining: false, nameTableKind: None)
!710 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/getline")
!711 = !{!712, !103, !102}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !714, line: 22, baseType: !103)
!714 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!715 = !{!707}
!716 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !719, file: !724, line: 13, type: !743, isLocal: true, isDefinition: true)
!719 = distinct !DICompileUnit(language: DW_LANG_C99, file: !720, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !721, splitDebugInlining: false, nameTableKind: None)
!720 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/getline")
!721 = !{!722, !717}
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "mpu_config", scope: !719, file: !724, line: 37, type: !725, isLocal: false, isDefinition: true)
!724 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!725 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !686, line: 41, size: 64, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !726, file: !686, line: 43, baseType: !119, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !726, file: !686, line: 45, baseType: !730, size: 32, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !686, line: 27, size: 128, elements: !733)
!733 = !{!734, !735, !736}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !732, file: !686, line: 29, baseType: !119, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !732, file: !686, line: 31, baseType: !212, size: 32, offset: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !732, file: !686, line: 37, baseType: !737, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !643, line: 298, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !643, line: 289, size: 64, elements: !739)
!739 = !{!740, !741, !742}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !738, file: !643, line: 291, baseType: !222, size: 5, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !738, file: !643, line: 293, baseType: !222, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !738, file: !643, line: 295, baseType: !119, size: 32, offset: 32)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !731, size: 256, elements: !366)
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "__device_dts_ord_65", scope: !746, file: !949, line: 733, type: !1052, isLocal: false, isDefinition: true, align: 32)
!746 = distinct !DICompileUnit(language: DW_LANG_C99, file: !747, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !748, retainedTypes: !866, globals: !945, splitDebugInlining: false, nameTableKind: None)
!747 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/getline")
!748 = !{!749, !755, !30, !760, !765, !769, !773, !777, !783, !787, !831, !838, !857}
!749 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !750, line: 23, baseType: !32, size: 32, elements: !751)
!750 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!751 = !{!752, !753, !754}
!752 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!753 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!754 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!755 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !750, line: 48, baseType: !32, size: 32, elements: !756)
!756 = !{!757, !758, !759}
!757 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!758 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!759 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!760 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !761, line: 167, baseType: !32, size: 32, elements: !762)
!761 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!762 = !{!763, !764}
!763 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!764 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!765 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !761, line: 107, baseType: !32, size: 32, elements: !766)
!766 = !{!767, !768}
!767 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!768 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!769 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !761, line: 208, baseType: !32, size: 32, elements: !770)
!770 = !{!771, !772}
!771 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!772 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!773 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !761, line: 261, baseType: !32, size: 32, elements: !774)
!774 = !{!775, !776}
!775 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!776 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!777 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !761, line: 237, baseType: !32, size: 32, elements: !778)
!778 = !{!779, !780, !781, !782}
!779 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!780 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!781 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!782 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!783 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !761, line: 152, baseType: !32, size: 32, elements: !784)
!784 = !{!785, !786}
!785 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!786 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!787 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !128, line: 71, baseType: !103, size: 32, elements: !788)
!788 = !{!789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830}
!789 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!790 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!791 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!792 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!793 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!794 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!795 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!796 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!797 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!798 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!799 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!800 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!801 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!802 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!803 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!804 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!805 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!806 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!807 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!808 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!809 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!810 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!811 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!812 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!813 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!814 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!815 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!816 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!817 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!818 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!819 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!820 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!821 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!822 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!823 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!824 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!825 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!826 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!827 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!828 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!829 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!830 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!831 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !832, line: 44, baseType: !32, size: 32, elements: !833)
!832 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!833 = !{!834, !835, !836, !837}
!834 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!835 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!836 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!837 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!838 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !839, line: 54, baseType: !32, size: 32, elements: !840)
!839 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!840 = !{!841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856}
!841 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!842 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!843 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!844 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!845 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!846 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!847 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!848 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!849 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!850 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!851 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!852 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!853 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!854 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!855 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!856 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!857 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !858, line: 53, baseType: !32, size: 32, elements: !859)
!858 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!859 = !{!860, !861, !862, !863, !864, !865}
!860 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!861 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!862 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!863 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!864 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!865 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!866 = !{!749, !102, !103, !867, !909, !910, !911, !912, !191, !119, !401, !225, !913, !270, !452, !914, !944, !195}
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !128, line: 923, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 883, size: 10464, elements: !870)
!870 = !{!871, !872, !873, !874, !875, !879, !880, !881, !882, !883, !884, !885, !886, !890, !891, !892, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !869, file: !128, line: 884, baseType: !134, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !869, file: !128, line: 885, baseType: !134, size: 32, offset: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !869, file: !128, line: 886, baseType: !134, size: 32, offset: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !869, file: !128, line: 887, baseType: !134, size: 32, offset: 96)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !869, file: !128, line: 888, baseType: !876, size: 896, offset: 128)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 896, elements: !877)
!877 = !{!878}
!878 = !DISubrange(count: 28)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !869, file: !128, line: 889, baseType: !134, size: 32, offset: 1024)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !869, file: !128, line: 890, baseType: !134, size: 32, offset: 1056)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !869, file: !128, line: 891, baseType: !134, size: 32, offset: 1088)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !869, file: !128, line: 892, baseType: !134, size: 32, offset: 1120)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !869, file: !128, line: 893, baseType: !876, size: 896, offset: 1152)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !869, file: !128, line: 894, baseType: !134, size: 32, offset: 2048)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !869, file: !128, line: 895, baseType: !134, size: 32, offset: 2080)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !869, file: !128, line: 896, baseType: !887, size: 960, offset: 2112)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 960, elements: !888)
!888 = !{!889}
!889 = !DISubrange(count: 30)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !869, file: !128, line: 897, baseType: !134, size: 32, offset: 3072)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !869, file: !128, line: 898, baseType: !134, size: 32, offset: 3104)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !869, file: !128, line: 899, baseType: !893, size: 3008, offset: 3136)
!893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !133, size: 3008, elements: !894)
!894 = !{!895}
!895 = !DISubrange(count: 94)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !869, file: !128, line: 900, baseType: !134, size: 32, offset: 6144)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !869, file: !128, line: 901, baseType: !134, size: 32, offset: 6176)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !869, file: !128, line: 902, baseType: !134, size: 32, offset: 6208)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !869, file: !128, line: 903, baseType: !133, size: 32, offset: 6240)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !869, file: !128, line: 904, baseType: !141, size: 1984, offset: 6272)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !869, file: !128, line: 905, baseType: !133, size: 32, offset: 8256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !869, file: !128, line: 907, baseType: !133, size: 32, offset: 8288)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !869, file: !128, line: 910, baseType: !133, size: 32, offset: 8320)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !869, file: !128, line: 911, baseType: !133, size: 32, offset: 8352)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !869, file: !128, line: 913, baseType: !133, size: 32, offset: 8384)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !869, file: !128, line: 917, baseType: !133, size: 32, offset: 8416)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !869, file: !128, line: 919, baseType: !141, size: 1984, offset: 8448)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !869, file: !128, line: 920, baseType: !134, size: 32, offset: 10432)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !761, line: 146, baseType: !765)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 32)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !761, line: 164, baseType: !783)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !657, line: 485, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !657, line: 468, size: 28704, elements: !917)
!917 = !{!918, !922, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !939, !943}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !916, file: !657, line: 470, baseType: !919, size: 512)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 512, elements: !920)
!920 = !{!921}
!921 = !DISubrange(count: 16)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !916, file: !657, line: 471, baseType: !923, size: 512, offset: 512)
!923 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 512, elements: !920)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !916, file: !657, line: 472, baseType: !919, size: 512, offset: 1024)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !916, file: !657, line: 473, baseType: !923, size: 512, offset: 1536)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !916, file: !657, line: 474, baseType: !919, size: 512, offset: 2048)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !916, file: !657, line: 475, baseType: !923, size: 512, offset: 2560)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !916, file: !657, line: 476, baseType: !919, size: 512, offset: 3072)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !916, file: !657, line: 477, baseType: !923, size: 512, offset: 3584)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !916, file: !657, line: 478, baseType: !919, size: 512, offset: 4096)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !916, file: !657, line: 479, baseType: !923, size: 512, offset: 4608)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !916, file: !657, line: 480, baseType: !919, size: 512, offset: 5120)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !916, file: !657, line: 481, baseType: !923, size: 512, offset: 5632)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !916, file: !657, line: 482, baseType: !935, size: 3968, offset: 6144)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 3968, elements: !937)
!936 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !222)
!937 = !{!938}
!938 = !DISubrange(count: 496)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !916, file: !657, line: 483, baseType: !940, size: 18560, offset: 10112)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !119, size: 18560, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 580)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !916, file: !657, line: 484, baseType: !134, size: 32, offset: 28672)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !832, line: 56, baseType: !102)
!945 = !{!946, !996, !1037, !744, !1042, !1067, !1069, !1086, !1088, !1098, !1101, !1116, !1154, !1168}
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "on", scope: !948, file: !949, line: 549, type: !432, isLocal: true, isDefinition: true)
!948 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !949, file: !949, line: 547, type: !950, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !746, retainedNodes: !952)
!949 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!950 = !DISubroutineType(types: !951)
!951 = !{null, !755}
!952 = !{!953, !954, !957}
!953 = !DILocalVariable(name: "start_mode", arg: 1, scope: !948, file: !949, line: 547, type: !755)
!954 = !DILocalVariable(name: "err", scope: !955, file: !949, line: 553, type: !103)
!955 = distinct !DILexicalBlock(scope: !956, file: !949, line: 552, column: 31)
!956 = distinct !DILexicalBlock(scope: !948, file: !949, line: 552, column: 6)
!957 = !DILocalVariable(name: "mgr", scope: !955, file: !949, line: 554, type: !958)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 32)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !960, line: 154, size: 224, elements: !961)
!960 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!961 = !{!962, !974, !975, !991, !993, !994, !995}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !959, file: !960, line: 158, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !391, line: 40, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !391, line: 35, size: 64, elements: !965)
!965 = !{!966, !973}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !964, file: !391, line: 36, baseType: !967, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !391, line: 33, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !391, line: 29, size: 32, elements: !970)
!970 = !{!971}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !969, file: !391, line: 30, baseType: !972, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !964, file: !391, line: 37, baseType: !967, size: 32, offset: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !959, file: !960, line: 163, baseType: !963, size: 64, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !959, file: !960, line: 166, baseType: !976, size: 32, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !960, line: 133, size: 96, elements: !979)
!979 = !{!980, !989, !990}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !978, file: !960, line: 135, baseType: !981, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !960, line: 129, baseType: !982)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 32)
!983 = !DISubroutineType(types: !984)
!984 = !{null, !958, !985}
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !960, line: 101, baseType: !986)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DISubroutineType(types: !988)
!988 = !{null, !958, !103}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !978, file: !960, line: 138, baseType: !981, size: 32, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !978, file: !960, line: 143, baseType: !981, size: 32, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !959, file: !960, line: 169, baseType: !992, offset: 160)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !319, line: 43, elements: !320)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !959, file: !960, line: 172, baseType: !103, size: 32, offset: 160)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !959, file: !960, line: 175, baseType: !171, size: 16, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !959, file: !960, line: 178, baseType: !171, size: 16, offset: 208)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "cli", scope: !948, file: !949, line: 550, type: !998, isLocal: true, isDefinition: true)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !960, line: 273, size: 128, elements: !999)
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !998, file: !960, line: 280, baseType: !968, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !998, file: !960, line: 283, baseType: !1002, size: 96, offset: 32)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !1003, line: 138, size: 96, elements: !1004)
!1003 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1004 = !{!1005, !1034, !1035}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !1002, file: !1003, line: 149, baseType: !1006, size: 32)
!1006 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !1003, line: 139, size: 32, elements: !1007)
!1007 = !{!1008, !1029}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !1006, file: !1003, line: 145, baseType: !1009, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !299, line: 5397, size: 128, elements: !1011)
!1011 = !{!1012, !1027, !1028}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !1010, file: !299, line: 5399, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !328, line: 48, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !328, line: 37, size: 64, elements: !1015)
!1015 = !{!1016, !1022}
!1016 = !DIDerivedType(tag: DW_TAG_member, scope: !1014, file: !328, line: 38, baseType: !1017, size: 32)
!1017 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1014, file: !328, line: 38, size: 32, elements: !1018)
!1018 = !{!1019, !1021}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1017, file: !328, line: 39, baseType: !1020, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1017, file: !328, line: 40, baseType: !1020, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, scope: !1014, file: !328, line: 42, baseType: !1023, size: 32, offset: 32)
!1023 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1014, file: !328, line: 42, size: 32, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1023, file: !328, line: 43, baseType: !1020, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1023, file: !328, line: 44, baseType: !1020, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !1010, file: !299, line: 5405, baseType: !32, size: 32, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1010, file: !299, line: 5408, baseType: !103, size: 32, offset: 96)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1006, file: !1003, line: 148, baseType: !1030, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !1003, line: 98, baseType: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 32)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{null, null}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1002, file: !1003, line: 165, baseType: !134, size: 32, offset: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1002, file: !1003, line: 174, baseType: !1036, size: 32, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_65", scope: !746, file: !949, line: 733, type: !1039, isLocal: false, isDefinition: true, align: 16)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !229, size: 80, elements: !1040)
!1040 = !{!1041}
!1041 = !DISubrange(count: 5)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_65", scope: !746, file: !949, line: 733, type: !1044, isLocal: true, isDefinition: true, align: 32)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !176, line: 51, size: 64, elements: !1046)
!1046 = !{!1047, !1066}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1045, file: !176, line: 60, baseType: !1048, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 32)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!103, !1051}
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 32)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1053)
