; ModuleID = './Build/eint_edge_falling.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.GPT_REGISTER_T = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.GPT_REGISTER_GLOABL_T = type { i32, i32, i32 }
%struct.gpt_context_t = type { i32, %struct.gpt_callback_context_t, i8, i8 }
%struct.gpt_callback_context_t = type { void (i8*)*, i8* }
%struct.gpt_sw_context_t = type { [32 x %struct.gpt_sw_timer_t], i32, i32, i32, i32, i8, i8, i8 }
%struct.gpt_sw_timer_t = type { %struct.gpt_callback_context_t, i32, i8, i8 }
%struct.GPIO_REGISTER_T = type { [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIN_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [4 x %struct.GPIO_DIR_REGISTER_T], [192 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [224 x i8], [2 x %struct.GPIO_DIR_REGISTER_T], [2 x %struct.GPIO_DIR_REGISTER_T], [192 x i8], [7 x %struct.GPIO_DIR_REGISTER_T], [144 x i8], [4 x %struct.GPIO_DIR_REGISTER_T], [192 x i8], [6 x %struct.GPIO_DIN_REGISTER_T] }
%struct.GPIO_DIN_REGISTER_T = type { i32, [12 x i8] }

!88 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!89 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!90 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!91 = !DIEnumerator(name: "OSTimer_IRQn", value: 0)
!92 = !DIEnumerator(name: "Reserved1_IRQn", value: 1)
!93 = !DIEnumerator(name: "MD_TOPSM_IRQn", value: 2)
!94 = !DIEnumerator(name: "CM4_TOPSM_IRQn", value: 3)
!95 = !DIEnumerator(name: "Reserved2_IRQn", value: 4)
!96 = !DIEnumerator(name: "Reserved3_IRQn", value: 5)
!97 = !DIEnumerator(name: "Reserved4_IRQn", value: 6)
!98 = !DIEnumerator(name: "Reserved5_IRQn", value: 7)
!99 = !DIEnumerator(name: "ACCDET_IRQn", value: 8)
!100 = !DIEnumerator(name: "RTC_IRQn", value: 9)
!101 = !DIEnumerator(name: "KP_IRQn", value: 10)
!102 = !DIEnumerator(name: "GPTimer_IRQn", value: 11)
!103 = !DIEnumerator(name: "EINT_IRQn", value: 12)
!104 = !DIEnumerator(name: "LCD_IRQn", value: 13)
!105 = !DIEnumerator(name: "LCD_AAL_IRQn", value: 14)
!106 = !DIEnumerator(name: "DSI_IRQn", value: 15)
!107 = !DIEnumerator(name: "RESIZE_IRQn", value: 16)
!108 = !DIEnumerator(name: "G2D_IRQn", value: 17)
!109 = !DIEnumerator(name: "CAM_IRQn", value: 18)
!110 = !DIEnumerator(name: "ROT_DMA_IRQn", value: 19)
!111 = !DIEnumerator(name: "SCAM_IRQn", value: 20)
!112 = !DIEnumerator(name: "DMA_IRQn", value: 21)
!113 = !DIEnumerator(name: "DMA_AO_IRQn", value: 22)
!114 = !DIEnumerator(name: "I2C_DUAL_IRQn", value: 23)
!115 = !DIEnumerator(name: "I2C0_IRQn", value: 24)
!116 = !DIEnumerator(name: "I2C1_IRQn", value: 25)
!117 = !DIEnumerator(name: "I2C2_IRQn", value: 26)
!118 = !DIEnumerator(name: "Reserved6_IRQn", value: 27)
!119 = !DIEnumerator(name: "GPCounter_IRQn", value: 28)
!120 = !DIEnumerator(name: "UART0_IRQn", value: 29)
!121 = !DIEnumerator(name: "UART1_IRQn", value: 30)
!122 = !DIEnumerator(name: "UART2_IRQn", value: 31)
!123 = !DIEnumerator(name: "UART3_IRQn", value: 32)
!124 = !DIEnumerator(name: "USB20_IRQn", value: 33)
!125 = !DIEnumerator(name: "MSDC0_IRQn", value: 34)
!126 = !DIEnumerator(name: "MSDC1_IRQn", value: 35)
!127 = !DIEnumerator(name: "Reserved7_IRQn", value: 36)
!128 = !DIEnumerator(name: "Reserved8_IRQn", value: 37)
!129 = !DIEnumerator(name: "SF_IRQn", value: 38)
!130 = !DIEnumerator(name: "DSP22CPU_IRQn", value: 39)
!131 = !DIEnumerator(name: "SensorDMA_IRQn", value: 40)
!132 = !DIEnumerator(name: "RGU_IRQn", value: 41)
!133 = !DIEnumerator(name: "SPI_SLV_IRQn", value: 42)
!134 = !DIEnumerator(name: "SPI_MST0_IRQn", value: 43)
!135 = !DIEnumerator(name: "SPI_MST1_IRQn", value: 44)
!136 = !DIEnumerator(name: "SPI_MST2_IRQn", value: 45)
!137 = !DIEnumerator(name: "SPI_MST3_IRQn", value: 46)
!138 = !DIEnumerator(name: "TRNG_IRQn", value: 47)
!139 = !DIEnumerator(name: "BT_TIMCON_IRQn", value: 48)
!140 = !DIEnumerator(name: "BTIF_IRQn", value: 49)
!141 = !DIEnumerator(name: "Reserved9_IRQn", value: 50)
!142 = !DIEnumerator(name: "Reserved10_IRQn", value: 51)
!143 = !DIEnumerator(name: "LISR0_IRQn", value: 52)
!144 = !DIEnumerator(name: "LISR1_IRQn", value: 53)
!145 = !DIEnumerator(name: "LISR2_IRQn", value: 54)
!146 = !DIEnumerator(name: "LISR3_IRQn", value: 55)
!147 = !DIEnumerator(name: "PSI_RISE_IRQn", value: 56)
!148 = !DIEnumerator(name: "PSI_FALL_IRQn", value: 57)
!149 = !DIEnumerator(name: "Reserved11_IRQn", value: 58)
!150 = !DIEnumerator(name: "Reserved12_IRQn", value: 59)
!151 = !DIEnumerator(name: "Reserved13_IRQn", value: 60)
!152 = !DIEnumerator(name: "Reserved14_IRQn", value: 61)
!153 = !DIEnumerator(name: "Reserved15_IRQn", value: 62)
!154 = !DIEnumerator(name: "Reserved16_IRQn", value: 63)
!155 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 64)
!156 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 846, baseType: !7, size: 32, elements: !157)
!157 = !{!158, !159, !160, !161, !162, !163, !164}
!158 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!159 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!160 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!161 = !DIEnumerator(name: "HAL_GPT_3", value: 3)
!162 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!163 = !DIEnumerator(name: "HAL_GPT_5", value: 5)
!164 = !DIEnumerator(name: "HAL_GPT_MAX_PORT", value: 6)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !166, line: 380, baseType: !7, size: 32, elements: !167)
!166 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/eint_edge_falling/GCC")
!167 = !{!168, !169}
!168 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!169 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!170 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !166, line: 397, baseType: !7, size: 32, elements: !171)
!171 = !{!172, !173}
!172 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!173 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!174 = !{!175, !179, !194}
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !176, line: 48, baseType: !177)
!176 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!177 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !178, line: 79, baseType: !7)
!178 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_T", file: !78, line: 1272, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1262, size: 288, elements: !182)
!182 = !{!183, !185, !186, !187, !189, !190, !191, !192, !193}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CON", scope: !181, file: !78, line: 1263, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !175)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_CLK", scope: !181, file: !78, line: 1264, baseType: !184, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_EN", scope: !181, file: !78, line: 1265, baseType: !184, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_STA", scope: !181, file: !78, line: 1266, baseType: !188, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQ_ACK", scope: !181, file: !78, line: 1267, baseType: !184, size: 32, offset: 128)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNT", scope: !181, file: !78, line: 1268, baseType: !184, size: 32, offset: 160)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPARE", scope: !181, file: !78, line: 1269, baseType: !184, size: 32, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COUNTH", scope: !181, file: !78, line: 1270, baseType: !184, size: 32, offset: 224)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_COMPAREH", scope: !181, file: !78, line: 1271, baseType: !184, size: 32, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!195 = !{!0, !196, !205, !212, !234, !257}
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "gp_gpt_glb", scope: !2, file: !3, line: 49, type: !198, isLocal: false, isDefinition: true)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPT_REGISTER_GLOABL_T", file: !78, line: 1260, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1256, size: 96, elements: !201)
!201 = !{!202, !203, !204}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQSTA", scope: !200, file: !78, line: 1257, baseType: !188, size: 32)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK0", scope: !200, file: !78, line: 1258, baseType: !184, size: 32, offset: 32)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_IRQMSK1", scope: !200, file: !78, line: 1259, baseType: !184, size: 32, offset: 64)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "flag", scope: !207, file: !3, line: 88, type: !211, isLocal: true, isDefinition: true)
!207 = distinct !DISubprogram(name: "gpt_get_lfosc_clock", scope: !3, file: !3, line: 86, type: !208, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !210)
!208 = !DISubroutineType(types: !209)
!209 = !{null}
!210 = !{}
!211 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !2, file: !3, line: 51, type: !214, isLocal: false, isDefinition: true)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 768, elements: !232)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_context_t", file: !67, line: 116, baseType: !216)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 111, size: 128, elements: !217)
!217 = !{!218, !220, !230, !231}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !216, file: !67, line: 112, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !166, line: 400, baseType: !170)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !216, file: !67, line: 113, baseType: !221, size: 64, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_callback_context_t", file: !67, line: 109, baseType: !222)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 106, size: 64, elements: !223)
!223 = !{!224, !229}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !222, file: !67, line: 107, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !166, line: 371, baseType: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 32)
!227 = !DISubroutineType(types: !228)
!228 = !{null, !194}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !222, file: !67, line: 108, baseType: !194, size: 32, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "has_initilized", scope: !216, file: !67, line: 114, baseType: !211, size: 8, offset: 96)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "is_gpt_locked_sleep", scope: !216, file: !67, line: 115, baseType: !211, size: 8, offset: 104)
!232 = !{!233}
!233 = !DISubrange(count: 6)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "gpt_sw_context", scope: !2, file: !3, line: 52, type: !236, isLocal: false, isDefinition: true)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_context_t", file: !67, line: 134, baseType: !237)
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 125, size: 4256, elements: !238)
!238 = !{!239, !250, !251, !252, !253, !254, !255, !256}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !237, file: !67, line: 126, baseType: !240, size: 4096)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 4096, elements: !248)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_sw_timer_t", file: !67, line: 123, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !67, line: 118, size: 128, elements: !243)
!243 = !{!244, !245, !246, !247}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !242, file: !67, line: 119, baseType: !221, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "time_out_ms", scope: !242, file: !67, line: 120, baseType: !175, size: 32, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "is_used", scope: !242, file: !67, line: 121, baseType: !211, size: 8, offset: 96)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "is_running", scope: !242, file: !67, line: 122, baseType: !211, size: 8, offset: 104)
!248 = !{!249}
!249 = !DISubrange(count: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "absolute_time", scope: !237, file: !67, line: 127, baseType: !175, size: 32, offset: 4096)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "last_absolute_time", scope: !237, file: !67, line: 128, baseType: !175, size: 32, offset: 4128)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "used_timer_count", scope: !237, file: !67, line: 129, baseType: !175, size: 32, offset: 4160)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "running_timer_count", scope: !237, file: !67, line: 130, baseType: !175, size: 32, offset: 4192)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_init", scope: !237, file: !67, line: 131, baseType: !211, size: 8, offset: 4224)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "is_start_from_isr", scope: !237, file: !67, line: 132, baseType: !211, size: 8, offset: 4232)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "is_sw_gpt", scope: !237, file: !67, line: 133, baseType: !211, size: 8, offset: 4240)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "gpt_clock_source", scope: !2, file: !3, line: 53, type: !175, isLocal: false, isDefinition: true)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 192, elements: !232)
!260 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "gpio_register_base", scope: !263, file: !264, line: 64, type: !364, isLocal: false, isDefinition: true)
!263 = distinct !DICompileUnit(language: DW_LANG_C99, file: !264, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !265, retainedTypes: !359, globals: !363, splitDebugInlining: false, nameTableKind: None)
!264 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/eint_edge_falling/GCC")
!265 = !{!266, !318, !325, !329, !335, !339, !348, !353}
!266 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 339, baseType: !7, size: 32, elements: !267)
!267 = !{!268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317}
!268 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!269 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!270 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!271 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!272 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!273 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!274 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!275 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!276 = !DIEnumerator(name: "HAL_GPIO_8", value: 8)
!277 = !DIEnumerator(name: "HAL_GPIO_9", value: 9)
!278 = !DIEnumerator(name: "HAL_GPIO_10", value: 10)
!279 = !DIEnumerator(name: "HAL_GPIO_11", value: 11)
!280 = !DIEnumerator(name: "HAL_GPIO_12", value: 12)
!281 = !DIEnumerator(name: "HAL_GPIO_13", value: 13)
!282 = !DIEnumerator(name: "HAL_GPIO_14", value: 14)
!283 = !DIEnumerator(name: "HAL_GPIO_15", value: 15)
!284 = !DIEnumerator(name: "HAL_GPIO_16", value: 16)
!285 = !DIEnumerator(name: "HAL_GPIO_17", value: 17)
!286 = !DIEnumerator(name: "HAL_GPIO_18", value: 18)
!287 = !DIEnumerator(name: "HAL_GPIO_19", value: 19)
!288 = !DIEnumerator(name: "HAL_GPIO_20", value: 20)
!289 = !DIEnumerator(name: "HAL_GPIO_21", value: 21)
!290 = !DIEnumerator(name: "HAL_GPIO_22", value: 22)
!291 = !DIEnumerator(name: "HAL_GPIO_23", value: 23)
!292 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!293 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!294 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!295 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!296 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!297 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!298 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!299 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!300 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!301 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!302 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!303 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!304 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!305 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!306 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!307 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!308 = !DIEnumerator(name: "HAL_GPIO_40", value: 40)
!309 = !DIEnumerator(name: "HAL_GPIO_41", value: 41)
!310 = !DIEnumerator(name: "HAL_GPIO_42", value: 42)
!311 = !DIEnumerator(name: "HAL_GPIO_43", value: 43)
!312 = !DIEnumerator(name: "HAL_GPIO_44", value: 44)
!313 = !DIEnumerator(name: "HAL_GPIO_45", value: 45)
!314 = !DIEnumerator(name: "HAL_GPIO_46", value: 46)
!315 = !DIEnumerator(name: "HAL_GPIO_47", value: 47)
!316 = !DIEnumerator(name: "HAL_GPIO_48", value: 48)
!317 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 49)
!318 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !319, line: 224, baseType: !79, size: 32, elements: !320)
!319 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/eint_edge_falling/GCC")
!320 = !{!321, !322, !323, !324}
!321 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!322 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!323 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!324 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!325 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !319, line: 210, baseType: !7, size: 32, elements: !326)
!326 = !{!327, !328}
!327 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!328 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!329 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !319, line: 233, baseType: !79, size: 32, elements: !330)
!330 = !{!331, !332, !333, !334}
!331 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!332 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!333 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!334 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!335 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !319, line: 217, baseType: !7, size: 32, elements: !336)
!336 = !{!337, !338}
!337 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!338 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!339 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 415, baseType: !7, size: 32, elements: !340)
!340 = !{!341, !342, !343, !344, !345, !346, !347}
!341 = !DIEnumerator(name: "HAL_GPIO_CLOCK_0", value: 0)
!342 = !DIEnumerator(name: "HAL_GPIO_CLOCK_1", value: 1)
!343 = !DIEnumerator(name: "HAL_GPIO_CLOCK_2", value: 2)
!344 = !DIEnumerator(name: "HAL_GPIO_CLOCK_3", value: 3)
!345 = !DIEnumerator(name: "HAL_GPIO_CLOCK_4", value: 4)
!346 = !DIEnumerator(name: "HAL_GPIO_CLOCK_5", value: 5)
!347 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MAX", value: 6)
!348 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 427, baseType: !7, size: 32, elements: !349)
!349 = !{!350, !351, !352}
!350 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_26M", value: 1)
!351 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_32K", value: 4)
!352 = !DIEnumerator(name: "HAL_GPIO_CLOCK_MODE_MAX", value: 5)
!353 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !319, line: 242, baseType: !7, size: 32, elements: !354)
!354 = !{!355, !356, !357, !358}
!355 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!356 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!357 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!358 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!359 = !{!194, !360, !361, !362}
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_direction_t", file: !319, line: 213, baseType: !325)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !319, line: 220, baseType: !335)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !319, line: 247, baseType: !353)
!363 = !{!261}
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_REGISTER_T", file: !78, line: 1554, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1522, size: 29440, elements: !367)
!367 = !{!368, !385, !389, !398, !399, !408, !409, !418, !419, !429, !430, !439, !440, !449, !450, !459, !460, !469, !473, !482, !483, !492, !493, !502, !511, !512, !523, !527, !536, !537}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_REGISTER", scope: !366, file: !78, line: 1523, baseType: !369, size: 256)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !370, size: 256, elements: !383)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIR_REGISTER_T", file: !78, line: 1400, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1395, size: 128, elements: !372)
!372 = !{!373, !374, !375, !376}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR", scope: !371, file: !78, line: 1396, baseType: !184, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_SET", scope: !371, file: !78, line: 1397, baseType: !184, size: 32, offset: 32)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIR_CLR", scope: !371, file: !78, line: 1398, baseType: !184, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !371, file: !78, line: 1399, baseType: !377, size: 32, offset: 96)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 32, elements: !381)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !176, line: 24, baseType: !379)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !178, line: 43, baseType: !380)
!380 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!381 = !{!382}
!382 = !DISubrange(count: 4)
!383 = !{!384}
!384 = !DISubrange(count: 2)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET1", scope: !366, file: !78, line: 1524, baseType: !386, size: 1792, offset: 256)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 1792, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 224)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_REGISTER", scope: !366, file: !78, line: 1525, baseType: !390, size: 256, offset: 2048)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !391, size: 256, elements: !383)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLEN_REGISTER_T", file: !78, line: 1409, baseType: !392)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1404, size: 128, elements: !393)
!393 = !{!394, !395, !396, !397}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN", scope: !392, file: !78, line: 1405, baseType: !184, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_SET", scope: !392, file: !78, line: 1406, baseType: !184, size: 32, offset: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLEN_CLR", scope: !392, file: !78, line: 1407, baseType: !184, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !392, file: !78, line: 1408, baseType: !377, size: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET2", scope: !366, file: !78, line: 1526, baseType: !386, size: 1792, offset: 2304)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_REGISTER", scope: !366, file: !78, line: 1527, baseType: !400, size: 256, offset: 4096)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 256, elements: !383)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DINV_REGISTER_T", file: !78, line: 1417, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1412, size: 128, elements: !403)
!403 = !{!404, !405, !406, !407}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV", scope: !402, file: !78, line: 1413, baseType: !184, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_SET", scope: !402, file: !78, line: 1414, baseType: !184, size: 32, offset: 32)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DINV_CLR", scope: !402, file: !78, line: 1415, baseType: !184, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !402, file: !78, line: 1416, baseType: !377, size: 32, offset: 96)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET3", scope: !366, file: !78, line: 1528, baseType: !386, size: 1792, offset: 4352)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_REGISTER", scope: !366, file: !78, line: 1529, baseType: !410, size: 256, offset: 6144)
!410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 256, elements: !383)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DOUT_REGISTER_T", file: !78, line: 1426, baseType: !412)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1421, size: 128, elements: !413)
!413 = !{!414, !415, !416, !417}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT", scope: !412, file: !78, line: 1422, baseType: !184, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_SET", scope: !412, file: !78, line: 1423, baseType: !184, size: 32, offset: 32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DOUT_CLR", scope: !412, file: !78, line: 1424, baseType: !184, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !412, file: !78, line: 1425, baseType: !377, size: 32, offset: 96)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET4", scope: !366, file: !78, line: 1530, baseType: !386, size: 1792, offset: 6400)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN_REGISTER", scope: !366, file: !78, line: 1531, baseType: !420, size: 256, offset: 8192)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 256, elements: !383)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DIN_REGISTER_T", file: !78, line: 1432, baseType: !422)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1429, size: 128, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DIN", scope: !422, file: !78, line: 1430, baseType: !184, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !422, file: !78, line: 1431, baseType: !426, size: 96, offset: 32)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 96, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 12)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET5", scope: !366, file: !78, line: 1532, baseType: !386, size: 1792, offset: 8448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_REGISTER", scope: !366, file: !78, line: 1533, baseType: !431, size: 256, offset: 10240)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !432, size: 256, elements: !383)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PULLSEL_REGISTER_T", file: !78, line: 1440, baseType: !433)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1435, size: 128, elements: !434)
!434 = !{!435, !436, !437, !438}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL", scope: !433, file: !78, line: 1436, baseType: !184, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_SET", scope: !433, file: !78, line: 1437, baseType: !184, size: 32, offset: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PULLSEL_CLR", scope: !433, file: !78, line: 1438, baseType: !184, size: 32, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !433, file: !78, line: 1439, baseType: !377, size: 32, offset: 96)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET6", scope: !366, file: !78, line: 1534, baseType: !386, size: 1792, offset: 10496)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_REGISTER", scope: !366, file: !78, line: 1535, baseType: !441, size: 256, offset: 12288)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 256, elements: !383)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SMT_REGISTER_T", file: !78, line: 1448, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1443, size: 128, elements: !444)
!444 = !{!445, !446, !447, !448}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT", scope: !443, file: !78, line: 1444, baseType: !184, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_SET", scope: !443, file: !78, line: 1445, baseType: !184, size: 32, offset: 32)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SMT_CLR", scope: !443, file: !78, line: 1446, baseType: !184, size: 32, offset: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !443, file: !78, line: 1447, baseType: !377, size: 32, offset: 96)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET7", scope: !366, file: !78, line: 1536, baseType: !386, size: 1792, offset: 12544)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_REGISTER", scope: !366, file: !78, line: 1537, baseType: !451, size: 256, offset: 14336)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 256, elements: !383)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_SR_REGISTER_T", file: !78, line: 1455, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1450, size: 128, elements: !454)
!454 = !{!455, !456, !457, !458}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR", scope: !453, file: !78, line: 1451, baseType: !184, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_SET", scope: !453, file: !78, line: 1452, baseType: !184, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_SR_CLR", scope: !453, file: !78, line: 1453, baseType: !184, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !453, file: !78, line: 1454, baseType: !377, size: 32, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET8", scope: !366, file: !78, line: 1538, baseType: !386, size: 1792, offset: 14592)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_REGISTER", scope: !366, file: !78, line: 1539, baseType: !461, size: 512, offset: 16384)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 512, elements: !381)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_DRV_REGISTER_T", file: !78, line: 1463, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1458, size: 128, elements: !464)
!464 = !{!465, !466, !467, !468}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV", scope: !463, file: !78, line: 1459, baseType: !184, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_SET", scope: !463, file: !78, line: 1460, baseType: !184, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_DRV_CLR", scope: !463, file: !78, line: 1461, baseType: !184, size: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !463, file: !78, line: 1462, baseType: !377, size: 32, offset: 96)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET9", scope: !366, file: !78, line: 1540, baseType: !470, size: 1536, offset: 16896)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 1536, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 192)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_REGISTER", scope: !366, file: !78, line: 1541, baseType: !474, size: 256, offset: 18432)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 256, elements: !383)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_IES_REGISTER_T", file: !78, line: 1471, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1466, size: 128, elements: !477)
!477 = !{!478, !479, !480, !481}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES", scope: !476, file: !78, line: 1467, baseType: !184, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_SET", scope: !476, file: !78, line: 1468, baseType: !184, size: 32, offset: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_IES_CLR", scope: !476, file: !78, line: 1469, baseType: !184, size: 32, offset: 64)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !476, file: !78, line: 1470, baseType: !377, size: 32, offset: 96)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET10", scope: !366, file: !78, line: 1542, baseType: !386, size: 1792, offset: 18688)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_REGISTER", scope: !366, file: !78, line: 1543, baseType: !484, size: 256, offset: 20480)
!484 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 256, elements: !383)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_PUPD_REGISTER_T", file: !78, line: 1480, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1475, size: 128, elements: !487)
!487 = !{!488, !489, !490, !491}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD", scope: !486, file: !78, line: 1476, baseType: !184, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_SET", scope: !486, file: !78, line: 1477, baseType: !184, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_PUPD_CLR", scope: !486, file: !78, line: 1478, baseType: !184, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !486, file: !78, line: 1479, baseType: !377, size: 32, offset: 96)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET11", scope: !366, file: !78, line: 1544, baseType: !386, size: 1792, offset: 20736)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_REGISTER", scope: !366, file: !78, line: 1545, baseType: !494, size: 256, offset: 22528)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, size: 256, elements: !383)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN0_REGISTER_T", file: !78, line: 1489, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1484, size: 128, elements: !497)
!497 = !{!498, !499, !500, !501}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0", scope: !496, file: !78, line: 1485, baseType: !184, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_SET", scope: !496, file: !78, line: 1486, baseType: !184, size: 32, offset: 32)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN0_CLR", scope: !496, file: !78, line: 1487, baseType: !184, size: 32, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !496, file: !78, line: 1488, baseType: !377, size: 32, offset: 96)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_REGISTER", scope: !366, file: !78, line: 1546, baseType: !503, size: 256, offset: 22784)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 256, elements: !383)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_RESEN1_REGISTER_T", file: !78, line: 1497, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1492, size: 128, elements: !506)
!506 = !{!507, !508, !509, !510}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1", scope: !505, file: !78, line: 1493, baseType: !184, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_SET", scope: !505, file: !78, line: 1494, baseType: !184, size: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_RESEN1_CLR", scope: !505, file: !78, line: 1495, baseType: !184, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !505, file: !78, line: 1496, baseType: !377, size: 32, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET12", scope: !366, file: !78, line: 1547, baseType: !470, size: 1536, offset: 23040)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_REGISTER", scope: !366, file: !78, line: 1548, baseType: !513, size: 896, offset: 24576)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 896, elements: !521)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_MODE_REGISTER_T", file: !78, line: 1505, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1500, size: 128, elements: !516)
!516 = !{!517, !518, !519, !520}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE", scope: !515, file: !78, line: 1501, baseType: !184, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_SET", scope: !515, file: !78, line: 1502, baseType: !184, size: 32, offset: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_MODE_CLR", scope: !515, file: !78, line: 1503, baseType: !184, size: 32, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !515, file: !78, line: 1504, baseType: !377, size: 32, offset: 96)
!521 = !{!522}
!522 = !DISubrange(count: 7)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET13", scope: !366, file: !78, line: 1549, baseType: !524, size: 1152, offset: 25472)
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 1152, elements: !525)
!525 = !{!526}
!526 = !DISubrange(count: 144)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_REGISTER", scope: !366, file: !78, line: 1550, baseType: !528, size: 512, offset: 26624)
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 512, elements: !381)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TDSEL_REGISTER_T", file: !78, line: 1513, baseType: !530)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1508, size: 128, elements: !531)
!531 = !{!532, !533, !534, !535}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL", scope: !530, file: !78, line: 1509, baseType: !184, size: 32)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_SET", scope: !530, file: !78, line: 1510, baseType: !184, size: 32, offset: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_TDSEL_CLR", scope: !530, file: !78, line: 1511, baseType: !184, size: 32, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !530, file: !78, line: 1512, baseType: !377, size: 32, offset: 96)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET14", scope: !366, file: !78, line: 1551, baseType: !470, size: 1536, offset: 27136)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT_REGISTER", scope: !366, file: !78, line: 1552, baseType: !538, size: 768, offset: 28672)
!538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 768, elements: !232)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_CLKOUT_REGISTER_T", file: !78, line: 1519, baseType: !540)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 1516, size: 128, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_CLKOUT", scope: !540, file: !78, line: 1517, baseType: !184, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "GPIO_OFFSET", scope: !540, file: !78, line: 1518, baseType: !426, size: 96, offset: 32)
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "g_uart_hwstatus", scope: !546, file: !547, line: 101, type: !695, isLocal: true, isDefinition: true)
!546 = distinct !DICompileUnit(language: DW_LANG_C99, file: !547, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !548, retainedTypes: !645, globals: !654, splitDebugInlining: false, nameTableKind: None)
!547 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/eint_edge_falling/GCC")
!548 = !{!549, !556, !571, !577, !583, !588, !595, !611, !617, !621, !626, !633, !641}
!549 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 180, baseType: !7, size: 32, elements: !550)
!550 = !{!551, !552, !553, !554, !555}
!551 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!552 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!553 = !DIEnumerator(name: "HAL_UART_2", value: 2)
!554 = !DIEnumerator(name: "HAL_UART_3", value: 3)
!555 = !DIEnumerator(name: "HAL_UART_MAX", value: 4)
!556 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !557, line: 189, baseType: !7, size: 32, elements: !558)
!557 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_pdma_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/eint_edge_falling/GCC")
!558 = !{!559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!559 = !DIEnumerator(name: "VDMA_START_CHANNEL", value: 8)
!560 = !DIEnumerator(name: "VDMA_UART1TX", value: 8)
!561 = !DIEnumerator(name: "VDMA_UART1RX", value: 9)
!562 = !DIEnumerator(name: "VDMA_UART2TX", value: 10)
!563 = !DIEnumerator(name: "VDMA_UART2RX", value: 11)
!564 = !DIEnumerator(name: "VDMA_UART3TX", value: 12)
!565 = !DIEnumerator(name: "VDMA_UART3RX", value: 13)
!566 = !DIEnumerator(name: "VDMA_UART0TX", value: 14)
!567 = !DIEnumerator(name: "VDMA_UART0RX", value: 15)
!568 = !DIEnumerator(name: "VDMA_BTIFTX", value: 16)
!569 = !DIEnumerator(name: "VDMA_BTIFRX", value: 17)
!570 = !DIEnumerator(name: "VDMA_END_CHANNEL", value: 18)
!571 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !572, line: 355, baseType: !79, size: 32, elements: !573)
!572 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/eint_edge_falling/GCC")
!573 = !{!574, !575, !576}
!574 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!575 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!576 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!577 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !557, line: 206, baseType: !79, size: 32, elements: !578)
!578 = !{!579, !580, !581, !582}
!579 = !DIEnumerator(name: "VDMA_ERROR", value: -3)
!580 = !DIEnumerator(name: "VDMA_ERROR_CHANNEL", value: -2)
!581 = !DIEnumerator(name: "VDMA_INVALID_PARAMETER", value: -1)
!582 = !DIEnumerator(name: "VDMA_OK", value: 0)
!583 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !547, line: 65, baseType: !7, size: 32, elements: !584)
!584 = !{!585, !586, !587}
!585 = !DIEnumerator(name: "UART_HWSTATUS_UNINITIALIZED", value: 0)
!586 = !DIEnumerator(name: "UART_HWSTATUS_POLL_INITIALIZED", value: 1)
!587 = !DIEnumerator(name: "UART_HWSTATUS_DMA_INITIALIZED", value: 2)
!588 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !572, line: 345, baseType: !79, size: 32, elements: !589)
!589 = !{!590, !591, !592, !593, !594}
!590 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!591 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!592 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!593 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!594 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!595 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !572, line: 302, baseType: !7, size: 32, elements: !596)
!596 = !{!597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610}
!597 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!598 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!599 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!600 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!601 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!602 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!603 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!604 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!605 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!606 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!607 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!608 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!609 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!610 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!611 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !572, line: 321, baseType: !7, size: 32, elements: !612)
!612 = !{!613, !614, !615, !616}
!613 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!614 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!615 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!616 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!617 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !572, line: 330, baseType: !7, size: 32, elements: !618)
!618 = !{!619, !620}
!619 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!620 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!621 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !572, line: 337, baseType: !7, size: 32, elements: !622)
!622 = !{!623, !624, !625}
!623 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!624 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!625 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!626 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !627, line: 101, baseType: !79, size: 32, elements: !628)
!627 = !DIFile(filename: "../../../../../driver/chip/inc/hal_clock.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/eint_edge_falling/GCC")
!628 = !{!629, !630, !631, !632}
!629 = !DIEnumerator(name: "HAL_CLOCK_STATUS_UNINITIALIZED", value: -3)
!630 = !DIEnumerator(name: "HAL_CLOCK_STATUS_INVALID_PARAMETER", value: -2)
!631 = !DIEnumerator(name: "HAL_CLOCK_STATUS_ERROR", value: -1)
!632 = !DIEnumerator(name: "HAL_CLOCK_STATUS_OK", value: 0)
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !634, line: 152, baseType: !79, size: 32, elements: !635)
!634 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/eint_edge_falling/GCC")
!635 = !{!636, !637, !638, !639, !640}
!636 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!637 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!638 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!639 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!640 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!641 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !557, line: 222, baseType: !79, size: 32, elements: !642)
!642 = !{!643, !644}
!643 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_ERROR", value: -1)
!644 = !DIEnumerator(name: "VDMA_EVENT_TRANSACTION_SUCCESS", value: 0)
!645 = !{!194, !175, !646}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 32)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_dma_callback_data_t", file: !648, line: 96, baseType: !649)
!648 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_uart_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/eint_edge_falling/GCC")
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !648, line: 93, size: 64, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "is_rx", scope: !649, file: !648, line: 94, baseType: !211, size: 8)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "uart_port", scope: !649, file: !648, line: 95, baseType: !653, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !6, line: 186, baseType: !549)
!654 = !{!544, !655, !668, !673, !687, !693}
!655 = !DIGlobalVariableExpression(var: !656, expr: !DIExpression())
!656 = distinct !DIGlobalVariable(name: "g_uart_callback", scope: !546, file: !547, line: 102, type: !657, isLocal: true, isDefinition: true)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 256, elements: !381)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_callback_t", file: !547, line: 74, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !547, line: 71, size: 64, elements: !660)
!660 = !{!661, !667}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !659, file: !547, line: 72, baseType: !662, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !572, line: 410, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 32)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !666, !194}
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !572, line: 359, baseType: !571)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !659, file: !547, line: 73, baseType: !194, size: 32, offset: 32)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "g_uart_dma_callback_data", scope: !546, file: !547, line: 103, type: !670, isLocal: true, isDefinition: true)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 512, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 8)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "g_uart_dma_config", scope: !546, file: !547, line: 104, type: !675, isLocal: true, isDefinition: true)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 896, elements: !381)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !572, line: 390, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !572, line: 382, size: 224, elements: !678)
!678 = !{!679, !681, !682, !683, !684, !685, !686}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !677, file: !572, line: 383, baseType: !680, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !677, file: !572, line: 384, baseType: !175, size: 32, offset: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !677, file: !572, line: 385, baseType: !175, size: 32, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !677, file: !572, line: 386, baseType: !680, size: 32, offset: 96)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !677, file: !572, line: 387, baseType: !175, size: 32, offset: 128)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !677, file: !572, line: 388, baseType: !175, size: 32, offset: 160)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !677, file: !572, line: 389, baseType: !175, size: 32, offset: 192)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "g_uart_baudrate_map", scope: !546, file: !547, line: 105, type: !689, isLocal: true, isDefinition: true)
!689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 416, elements: !691)
!690 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!691 = !{!692}
!692 = !DISubrange(count: 13)
!693 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression())
!694 = distinct !DIGlobalVariable(name: "g_uart_global_data_initialized", scope: !546, file: !547, line: 90, type: !211, isLocal: true, isDefinition: true)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !696, size: 128, elements: !381)
!696 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_hwstatus_t", file: !547, line: 69, baseType: !583)
!698 = !DIGlobalVariableExpression(var: !694, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!699 = !DIGlobalVariableExpression(var: !700, expr: !DIExpression())
!700 = distinct !DIGlobalVariable(name: "g_uart_regbase", scope: !701, file: !702, line: 53, type: !782, isLocal: false, isDefinition: true)
!701 = distinct !DICompileUnit(language: DW_LANG_C99, file: !702, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !703, retainedTypes: !714, globals: !770, splitDebugInlining: false, nameTableKind: None)
!702 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_uart_internal_platform.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/eint_edge_falling/GCC")
!703 = !{!5, !77, !556, !549, !704}
!704 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !648, line: 46, baseType: !7, size: 32, elements: !705)
!705 = !{!706, !707, !708, !709, !710, !711, !712, !713}
!706 = !DIEnumerator(name: "UART_INTERRUPT_NONE", value: 0)
!707 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_ERROR", value: 1)
!708 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_TIMEOUT", value: 2)
!709 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_BREAK", value: 3)
!710 = !DIEnumerator(name: "UART_INTERRUPT_RECEIVE_AVAILABLE", value: 4)
!711 = !DIEnumerator(name: "UART_INTERRUPT_SEND_AVAILABLE", value: 5)
!712 = !DIEnumerator(name: "UART_INTERRUPT_SOFTWARE_FLOWCONTROL", value: 6)
!713 = !DIEnumerator(name: "UART_INTERRUPT_HARDWARE_FLOWCONTROL", value: 7)
!714 = !{!715}
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "UART_REGISTER_T", file: !78, line: 588, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 542, size: 800, elements: !718)
!718 = !{!719, !725, !730, !736, !737, !742, !747, !748, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "RBR_THR_DLL", scope: !717, file: !78, line: 547, baseType: !720, size: 32)
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !717, file: !78, line: 543, size: 32, elements: !721)
!721 = !{!722, !723, !724}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "RBR", scope: !720, file: !78, line: 544, baseType: !188, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "THR", scope: !720, file: !78, line: 545, baseType: !184, size: 32)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "DLL", scope: !720, file: !78, line: 546, baseType: !184, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "IER_DLM", scope: !717, file: !78, line: 551, baseType: !726, size: 32, offset: 32)
!726 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !717, file: !78, line: 548, size: 32, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "IER", scope: !726, file: !78, line: 549, baseType: !184, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "DLM", scope: !726, file: !78, line: 550, baseType: !184, size: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "IIR_FCR_EFR", scope: !717, file: !78, line: 556, baseType: !731, size: 32, offset: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !717, file: !78, line: 552, size: 32, elements: !732)
!732 = !{!733, !734, !735}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "IIR", scope: !731, file: !78, line: 553, baseType: !188, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "FCR", scope: !731, file: !78, line: 554, baseType: !184, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "EFR", scope: !731, file: !78, line: 555, baseType: !184, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "LCR", scope: !717, file: !78, line: 557, baseType: !184, size: 32, offset: 96)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "MCR_XON1", scope: !717, file: !78, line: 561, baseType: !738, size: 32, offset: 128)
!738 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !717, file: !78, line: 558, size: 32, elements: !739)
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "MCR", scope: !738, file: !78, line: 559, baseType: !184, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "XON1", scope: !738, file: !78, line: 560, baseType: !184, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "LSR_XON2", scope: !717, file: !78, line: 565, baseType: !743, size: 32, offset: 160)
!743 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !717, file: !78, line: 562, size: 32, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "LSR", scope: !743, file: !78, line: 563, baseType: !188, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "XON2", scope: !743, file: !78, line: 564, baseType: !184, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF1", scope: !717, file: !78, line: 566, baseType: !184, size: 32, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "SCR_XOFF2", scope: !717, file: !78, line: 570, baseType: !749, size: 32, offset: 224)
!749 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !717, file: !78, line: 567, size: 32, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !749, file: !78, line: 568, baseType: !184, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "XOFF2", scope: !749, file: !78, line: 569, baseType: !184, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_EN", scope: !717, file: !78, line: 571, baseType: !184, size: 32, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "HIGHSPEED", scope: !717, file: !78, line: 572, baseType: !184, size: 32, offset: 288)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_COUNT", scope: !717, file: !78, line: 573, baseType: !184, size: 32, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "SAMPLE_POINT", scope: !717, file: !78, line: 574, baseType: !184, size: 32, offset: 352)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUD_REG", scope: !717, file: !78, line: 575, baseType: !188, size: 32, offset: 384)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "RATEFIX_AD", scope: !717, file: !78, line: 576, baseType: !184, size: 32, offset: 416)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "AUTOBAUDSAMPLE", scope: !717, file: !78, line: 577, baseType: !184, size: 32, offset: 448)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "GUARD", scope: !717, file: !78, line: 578, baseType: !184, size: 32, offset: 480)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_DAT", scope: !717, file: !78, line: 579, baseType: !184, size: 32, offset: 512)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "ESCAPE_EN", scope: !717, file: !78, line: 580, baseType: !184, size: 32, offset: 544)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEP_EN", scope: !717, file: !78, line: 581, baseType: !184, size: 32, offset: 576)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "DMA_EN", scope: !717, file: !78, line: 582, baseType: !184, size: 32, offset: 608)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "RXTRI_AD", scope: !717, file: !78, line: 583, baseType: !184, size: 32, offset: 640)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_L", scope: !717, file: !78, line: 584, baseType: !184, size: 32, offset: 672)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "FRACDIV_M", scope: !717, file: !78, line: 585, baseType: !184, size: 32, offset: 704)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "FCR_RD", scope: !717, file: !78, line: 586, baseType: !188, size: 32, offset: 736)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "TX_ACTIVE_EN", scope: !717, file: !78, line: 587, baseType: !184, size: 32, offset: 768)
!770 = !{!699, !771, !776}
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "g_uart_port_to_pdn", scope: !701, file: !702, line: 54, type: !773, isLocal: false, isDefinition: true)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !774, size: 128, elements: !381)
!774 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_clock_cg_id", file: !6, line: 1237, baseType: !5)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "g_uart_port_to_irq_num", scope: !701, file: !702, line: 55, type: !778, isLocal: false, isDefinition: true)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !779, size: 128, elements: !381)
!779 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !78, line: 125, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !78, line: 123, baseType: !77)
!782 = !DICompositeType(tag: DW_TAG_array_type, baseType: !783, size: 128, elements: !381)
!783 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !715)
!784 = !DIGlobalVariableExpression(var: !785, expr: !DIExpression())
!785 = distinct !DIGlobalVariable(name: "EINT_REGISTER", scope: !786, file: !787, line: 55, type: !877, isLocal: false, isDefinition: true)
!786 = distinct !DICompileUnit(language: DW_LANG_C99, file: !787, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !788, retainedTypes: !843, globals: !849, splitDebugInlining: false, nameTableKind: None)
!787 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_eint.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/eint_edge_falling/GCC")
!788 = !{!789, !796, !831, !77, !838}
!789 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !790, line: 204, baseType: !79, size: 32, elements: !791)
!790 = !DIFile(filename: "../../../../../driver/chip/inc/hal_eint.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/eint_edge_falling/GCC")
!791 = !{!792, !793, !794, !795}
!792 = !DIEnumerator(name: "HAL_EINT_STATUS_ERROR_EINT_NUMBER", value: -3)
!793 = !DIEnumerator(name: "HAL_EINT_STATUS_INVALID_PARAMETER", value: -2)
!794 = !DIEnumerator(name: "HAL_EINT_STATUS_ERROR", value: -1)
!795 = !DIEnumerator(name: "HAL_EINT_STATUS_OK", value: 0)
!796 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 787, baseType: !7, size: 32, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830}
!798 = !DIEnumerator(name: "HAL_EINT_NUMBER_0", value: 0)
!799 = !DIEnumerator(name: "HAL_EINT_NUMBER_1", value: 1)
!800 = !DIEnumerator(name: "HAL_EINT_NUMBER_2", value: 2)
!801 = !DIEnumerator(name: "HAL_EINT_NUMBER_3", value: 3)
!802 = !DIEnumerator(name: "HAL_EINT_NUMBER_4", value: 4)
!803 = !DIEnumerator(name: "HAL_EINT_NUMBER_5", value: 5)
!804 = !DIEnumerator(name: "HAL_EINT_NUMBER_6", value: 6)
!805 = !DIEnumerator(name: "HAL_EINT_NUMBER_7", value: 7)
!806 = !DIEnumerator(name: "HAL_EINT_NUMBER_8", value: 8)
!807 = !DIEnumerator(name: "HAL_EINT_NUMBER_9", value: 9)
!808 = !DIEnumerator(name: "HAL_EINT_NUMBER_10", value: 10)
!809 = !DIEnumerator(name: "HAL_EINT_NUMBER_11", value: 11)
!810 = !DIEnumerator(name: "HAL_EINT_NUMBER_12", value: 12)
!811 = !DIEnumerator(name: "HAL_EINT_NUMBER_13", value: 13)
!812 = !DIEnumerator(name: "HAL_EINT_NUMBER_14", value: 14)
!813 = !DIEnumerator(name: "HAL_EINT_NUMBER_15", value: 15)
!814 = !DIEnumerator(name: "HAL_EINT_NUMBER_16", value: 16)
!815 = !DIEnumerator(name: "HAL_EINT_NUMBER_17", value: 17)
!816 = !DIEnumerator(name: "HAL_EINT_NUMBER_18", value: 18)
!817 = !DIEnumerator(name: "HAL_EINT_NUMBER_19", value: 19)
!818 = !DIEnumerator(name: "HAL_EINT_KEYPAD", value: 20)
!819 = !DIEnumerator(name: "HAL_EINT_UART_0_RX", value: 21)
!820 = !DIEnumerator(name: "HAL_EINT_UART_1_RX", value: 22)
!821 = !DIEnumerator(name: "HAL_EINT_UART_2_RX", value: 23)
!822 = !DIEnumerator(name: "HAL_EINT_UART_3_RX", value: 24)
!823 = !DIEnumerator(name: "HAL_EINT_BTSYS", value: 25)
!824 = !DIEnumerator(name: "HAL_EINT_BTSYS_BTIF", value: 26)
!825 = !DIEnumerator(name: "HAL_EINT_USB", value: 27)
!826 = !DIEnumerator(name: "HAL_EINT_ACCDET", value: 28)
!827 = !DIEnumerator(name: "HAL_EINT_RTC", value: 29)
!828 = !DIEnumerator(name: "HAL_EINT_PMIC", value: 30)
!829 = !DIEnumerator(name: "HAL_EINT_GPCOUNTER", value: 31)
!830 = !DIEnumerator(name: "HAL_EINT_NUMBER_MAX", value: 32)
!831 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !790, line: 194, baseType: !7, size: 32, elements: !832)
!832 = !{!833, !834, !835, !836, !837}
!833 = !DIEnumerator(name: "HAL_EINT_LEVEL_LOW", value: 0)
!834 = !DIEnumerator(name: "HAL_EINT_LEVEL_HIGH", value: 1)
!835 = !DIEnumerator(name: "HAL_EINT_EDGE_FALLING", value: 2)
!836 = !DIEnumerator(name: "HAL_EINT_EDGE_RISING", value: 3)
!837 = !DIEnumerator(name: "HAL_EINT_EDGE_FALLING_AND_RISING", value: 4)
!838 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !839, line: 59, baseType: !7, size: 32, elements: !840)
!839 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_eint_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/eint_edge_falling/GCC")
!840 = !{!841, !842}
!841 = !DIEnumerator(name: "EINT_DOMAIN_DISABLE", value: 0)
!842 = !DIEnumerator(name: "EINT_DOMAIN_ENABLE", value: 1)
!843 = !{!844, !194, !848}
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_isr_t", file: !634, line: 175, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 32)
!846 = !DISubroutineType(types: !847)
!847 = !{null, !780}
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_eint_number_t", file: !6, line: 821, baseType: !796)
!849 = !{!784, !850, !869}
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "ini_state", scope: !852, file: !787, line: 134, type: !175, isLocal: true, isDefinition: true)
!852 = distinct !DISubprogram(name: "hal_eint_init", scope: !787, file: !787, line: 130, type: !853, scopeLine: 131, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !786, retainedNodes: !864)
!853 = !DISubroutineType(types: !854)
!854 = !{!855, !848, !856}
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_eint_status_t", file: !790, line: 209, baseType: !789)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_eint_config_t", file: !790, line: 225, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !790, line: 222, size: 64, elements: !860)
!860 = !{!861, !863}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "trigger_mode", scope: !859, file: !790, line: 223, baseType: !862, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_eint_trigger_mode_t", file: !790, line: 200, baseType: !831)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "debounce_time", scope: !859, file: !790, line: 224, baseType: !175, size: 32, offset: 32)
!864 = !{!865, !866, !867, !868}
!865 = !DILocalVariable(name: "eint_number", arg: 1, scope: !852, file: !787, line: 130, type: !848)
!866 = !DILocalVariable(name: "eint_config", arg: 2, scope: !852, file: !787, line: 130, type: !856)
!867 = !DILocalVariable(name: "status", scope: !852, file: !787, line: 132, type: !855)
!868 = !DILocalVariable(name: "mask", scope: !852, file: !787, line: 133, type: !175)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(name: "eint_function_table", scope: !786, file: !787, line: 56, type: !871, isLocal: true, isDefinition: true)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !872, size: 2048, elements: !248)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "eint_function_t", file: !839, line: 44, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !839, line: 41, size: 64, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "eint_callback", scope: !873, file: !839, line: 42, baseType: !226, size: 32)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !873, file: !839, line: 43, baseType: !194, size: 32, offset: 32)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "EINT_REGISTER_T", file: !78, line: 2305, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 2264, size: 4096, elements: !880)
!880 = !{!881, !882, !883, !884, !885, !886, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !925}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_STA", scope: !879, file: !78, line: 2265, baseType: !188, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !879, file: !78, line: 2266, baseType: !175, size: 32, offset: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "EITN_INTACK", scope: !879, file: !78, line: 2267, baseType: !184, size: 32, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !879, file: !78, line: 2268, baseType: !175, size: 32, offset: 96)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_EEVT", scope: !879, file: !78, line: 2269, baseType: !188, size: 32, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !879, file: !78, line: 2270, baseType: !887, size: 96, offset: 160)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 96, elements: !888)
!888 = !{!889}
!889 = !DISubrange(count: 3)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_MASK", scope: !879, file: !78, line: 2271, baseType: !188, size: 32, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !879, file: !78, line: 2272, baseType: !175, size: 32, offset: 288)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_MASK_SET", scope: !879, file: !78, line: 2273, baseType: !184, size: 32, offset: 320)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !879, file: !78, line: 2274, baseType: !175, size: 32, offset: 352)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_MASK_CLR", scope: !879, file: !78, line: 2275, baseType: !184, size: 32, offset: 384)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !879, file: !78, line: 2276, baseType: !887, size: 96, offset: 416)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_WAKEUP_MASK", scope: !879, file: !78, line: 2277, baseType: !188, size: 32, offset: 512)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !879, file: !78, line: 2278, baseType: !175, size: 32, offset: 544)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_WAKEUP_MASK_SET", scope: !879, file: !78, line: 2280, baseType: !184, size: 32, offset: 576)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !879, file: !78, line: 2281, baseType: !175, size: 32, offset: 608)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_WAKEUP_MASK_CLR", scope: !879, file: !78, line: 2282, baseType: !184, size: 32, offset: 640)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !879, file: !78, line: 2283, baseType: !887, size: 96, offset: 672)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_SENS", scope: !879, file: !78, line: 2284, baseType: !188, size: 32, offset: 768)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !879, file: !78, line: 2285, baseType: !175, size: 32, offset: 800)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_SENS_SET", scope: !879, file: !78, line: 2286, baseType: !184, size: 32, offset: 832)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !879, file: !78, line: 2287, baseType: !175, size: 32, offset: 864)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_SENS_CLR", scope: !879, file: !78, line: 2288, baseType: !184, size: 32, offset: 896)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !879, file: !78, line: 2289, baseType: !887, size: 96, offset: 928)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_DUALEDGE_SENS", scope: !879, file: !78, line: 2290, baseType: !188, size: 32, offset: 1024)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !879, file: !78, line: 2291, baseType: !175, size: 32, offset: 1056)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_DUALEDGE_SENS_SET", scope: !879, file: !78, line: 2292, baseType: !184, size: 32, offset: 1088)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !879, file: !78, line: 2293, baseType: !175, size: 32, offset: 1120)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_DUALEDGE_SENS_CLR", scope: !879, file: !78, line: 2294, baseType: !184, size: 32, offset: 1152)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED14", scope: !879, file: !78, line: 2295, baseType: !887, size: 96, offset: 1184)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_SOFT", scope: !879, file: !78, line: 2296, baseType: !188, size: 32, offset: 1280)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED15", scope: !879, file: !78, line: 2297, baseType: !175, size: 32, offset: 1312)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_SOFT_SET", scope: !879, file: !78, line: 2298, baseType: !184, size: 32, offset: 1344)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED16", scope: !879, file: !78, line: 2299, baseType: !175, size: 32, offset: 1376)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_SOFT_CLR", scope: !879, file: !78, line: 2300, baseType: !184, size: 32, offset: 1408)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED17", scope: !879, file: !78, line: 2301, baseType: !887, size: 96, offset: 1440)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_DOMEN", scope: !879, file: !78, line: 2302, baseType: !184, size: 32, offset: 1536)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED18", scope: !879, file: !78, line: 2303, baseType: !922, size: 480, offset: 1568)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 480, elements: !923)
!923 = !{!924}
!924 = !DISubrange(count: 15)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_CON", scope: !879, file: !78, line: 2304, baseType: !926, size: 2048, offset: 2048)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !927, size: 2048, elements: !945)
!927 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !928)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "EINT_CON_REGISTER_T", file: !78, line: 2261, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 2259, size: 32, elements: !930)
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "CON_REGISTER", scope: !929, file: !78, line: 2260, baseType: !932, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "EINT_CON_T", file: !78, line: 2257, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !78, line: 2246, size: 32, elements: !934)
!934 = !{!935, !944}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_CON_B", scope: !933, file: !78, line: 2255, baseType: !936, size: 32)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !933, file: !78, line: 2247, size: 32, elements: !937)
!937 = !{!938, !939, !940, !941, !942, !943}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_CNT", scope: !936, file: !78, line: 2248, baseType: !175, size: 10, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_POL", scope: !936, file: !78, line: 2250, baseType: !175, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_PRESCALER", scope: !936, file: !78, line: 2251, baseType: !175, size: 4, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_EN", scope: !936, file: !78, line: 2252, baseType: !175, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "reserved", scope: !936, file: !78, line: 2253, baseType: !175, size: 15, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "RSTDBC", scope: !936, file: !78, line: 2254, baseType: !175, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "EINT_CON_W", scope: !933, file: !78, line: 2256, baseType: !175, size: 32)
!945 = !{!946}
!946 = !DISubrange(count: 64)
!947 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!949 = distinct !DIGlobalVariable(name: "priority_set", scope: !950, file: !951, line: 128, type: !175, isLocal: true, isDefinition: true)
!950 = distinct !DISubprogram(name: "hal_nvic_init", scope: !951, file: !951, line: 126, type: !952, scopeLine: 127, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !955, retainedNodes: !1037)
!951 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/eint_edge_falling/GCC")
!952 = !DISubroutineType(types: !953)
!953 = !{!954}
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_status_t", file: !634, line: 158, baseType: !633)
!955 = distinct !DICompileUnit(language: DW_LANG_C99, file: !951, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !956, retainedTypes: !957, globals: !1024, splitDebugInlining: false, nameTableKind: None)
!956 = !{!633, !77}
!957 = !{!780, !194, !958, !175, !992, !1022}
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !960, line: 418, baseType: !961)
!960 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/eint_edge_falling/GCC")
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !960, line: 395, size: 1120, elements: !962)
!962 = !{!963, !964, !965, !966, !967, !968, !969, !972, !973, !974, !975, !976, !977, !978, !979, !981, !982, !983, !985, !989, !991}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !961, file: !960, line: 397, baseType: !188, size: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !961, file: !960, line: 398, baseType: !184, size: 32, offset: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !961, file: !960, line: 399, baseType: !184, size: 32, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !961, file: !960, line: 400, baseType: !184, size: 32, offset: 96)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !961, file: !960, line: 401, baseType: !184, size: 32, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !961, file: !960, line: 402, baseType: !184, size: 32, offset: 160)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !961, file: !960, line: 403, baseType: !970, size: 96, offset: 192)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 96, elements: !427)
!971 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !378)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !961, file: !960, line: 404, baseType: !184, size: 32, offset: 288)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !961, file: !960, line: 405, baseType: !184, size: 32, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !961, file: !960, line: 406, baseType: !184, size: 32, offset: 352)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !961, file: !960, line: 407, baseType: !184, size: 32, offset: 384)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !961, file: !960, line: 408, baseType: !184, size: 32, offset: 416)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !961, file: !960, line: 409, baseType: !184, size: 32, offset: 448)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !961, file: !960, line: 410, baseType: !184, size: 32, offset: 480)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !961, file: !960, line: 411, baseType: !980, size: 64, offset: 512)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 64, elements: !383)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !961, file: !960, line: 412, baseType: !188, size: 32, offset: 576)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !961, file: !960, line: 413, baseType: !188, size: 32, offset: 608)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !961, file: !960, line: 414, baseType: !984, size: 128, offset: 640)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 128, elements: !381)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !961, file: !960, line: 415, baseType: !986, size: 160, offset: 768)
!986 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 160, elements: !987)
!987 = !{!988}
!988 = !DISubrange(count: 5)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !961, file: !960, line: 416, baseType: !990, size: 160, offset: 928)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 160, elements: !987)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !961, file: !960, line: 417, baseType: !184, size: 32, offset: 1088)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !960, line: 378, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !960, line: 363, size: 28704, elements: !995)
!995 = !{!996, !998, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1013, !1017, !1021}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !994, file: !960, line: 365, baseType: !997, size: 256)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 256, elements: !671)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !994, file: !960, line: 366, baseType: !999, size: 768, offset: 256)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 768, elements: !1000)
!1000 = !{!1001}
!1001 = !DISubrange(count: 24)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !994, file: !960, line: 367, baseType: !997, size: 256, offset: 1024)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !994, file: !960, line: 368, baseType: !999, size: 768, offset: 1280)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !994, file: !960, line: 369, baseType: !997, size: 256, offset: 2048)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !994, file: !960, line: 370, baseType: !999, size: 768, offset: 2304)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !994, file: !960, line: 371, baseType: !997, size: 256, offset: 3072)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !994, file: !960, line: 372, baseType: !999, size: 768, offset: 3328)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !994, file: !960, line: 373, baseType: !997, size: 256, offset: 4096)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !994, file: !960, line: 374, baseType: !1010, size: 1792, offset: 4352)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 1792, elements: !1011)
!1011 = !{!1012}
!1012 = !DISubrange(count: 56)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !994, file: !960, line: 375, baseType: !1014, size: 1920, offset: 6144)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 1920, elements: !1015)
!1015 = !{!1016}
!1016 = !DISubrange(count: 240)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !994, file: !960, line: 376, baseType: !1018, size: 20608, offset: 8064)
!1018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !175, size: 20608, elements: !1019)
!1019 = !{!1020}
!1020 = !DISubrange(count: 644)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !994, file: !960, line: 377, baseType: !184, size: 32, offset: 28672)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !176, line: 44, baseType: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !178, line: 77, baseType: !79)
!1024 = !{!1025, !1026, !1034}
!1025 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!1026 = !DIGlobalVariableExpression(var: !1027, expr: !DIExpression())
!1027 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !955, file: !951, line: 119, type: !1028, isLocal: false, isDefinition: true)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 4096, elements: !945)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !951, line: 50, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !951, line: 47, size: 64, elements: !1031)
!1031 = !{!1032, !1033}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !1030, file: !951, line: 48, baseType: !845, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !1030, file: !951, line: 49, baseType: !175, size: 32, offset: 32)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "defualt_irq_priority", scope: !955, file: !951, line: 52, type: !1036, isLocal: true, isDefinition: true)
!1036 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 2048, elements: !945)
!1037 = !{!1038}
!1038 = !DILocalVariable(name: "i", scope: !950, file: !951, line: 129, type: !175)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(name: "emi_settings", scope: !1041, file: !1042, line: 44, type: !1189, isLocal: false, isDefinition: true)
!1041 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1042, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1043, retainedTypes: !1049, globals: !1051, splitDebugInlining: false, nameTableKind: None)
!1042 = !DIFile(filename: "../../../../../driver/chip/mt2523/src/hal_emi.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/eint_edge_falling/GCC")
!1043 = !{!1044}
!1044 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "emi_clock_enum_t", file: !1045, line: 40, baseType: !7, size: 32, elements: !1046)
!1045 = !DIFile(filename: "../../../../../driver/chip/mt2523/inc/hal_emi_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt2523_hdk/hal_examples/eint_edge_falling/GCC")
!1046 = !{!1047, !1048}
!1047 = !DIEnumerator(name: "EMI_CLK_LOW_TO_HIGH", value: 0)
!1048 = !DIEnumerator(name: "EMI_CLK_HIGH_TO_LOW", value: 1)
!1049 = !{!1050}
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!1051 = !{!1039, !1052, !1054, !1056, !1058, !1159, !1161, !1163, !1165, !1167, !1169, !1171, !1173, !1175, !1177, !1179, !1181, !1183, !1185, !1187}
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
!1053 = distinct !DIGlobalVariable(name: "__EMI_CurSR0", scope: !1041, file: !1042, line: 65, type: !175, isLocal: false, isDefinition: true)
!1054 = !DIGlobalVariableExpression(var: !1055, expr: !DIExpression())
!1055 = distinct !DIGlobalVariable(name: "__EMI_CurSR1", scope: !1041, file: !1042, line: 66, type: !175, isLocal: false, isDefinition: true)
!1056 = !DIGlobalVariableExpression(var: !1057, expr: !DIExpression())
!1057 = distinct !DIGlobalVariable(name: "__EMI_CurSR2", scope: !1041, file: !1042, line: 67, type: !175, isLocal: false, isDefinition: true)
!1058 = !DIGlobalVariableExpression(var: !1059, expr: !DIExpression())
!1059 = distinct !DIGlobalVariable(name: "emi_register", scope: !1041, file: !1042, line: 83, type: !1060, isLocal: false, isDefinition: true)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 32)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "EMI_REGISTER_T", file: !78, line: 2524, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !78, line: 2447, size: 6752, elements: !1063)
!1063 = !{!1064, !1068, !1069, !1070, !1071, !1075, !1076, !1078, !1079, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !1062, file: !78, line: 2448, baseType: !1065, size: 768)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 768, elements: !1066)
!1066 = !{!1067}
!1067 = !DISubrange(count: 96)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_CONM", scope: !1062, file: !78, line: 2449, baseType: !184, size: 32, offset: 768)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1062, file: !78, line: 2450, baseType: !970, size: 96, offset: 800)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_GENA", scope: !1062, file: !78, line: 2451, baseType: !184, size: 32, offset: 896)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1062, file: !78, line: 2452, baseType: !1072, size: 160, offset: 928)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 160, elements: !1073)
!1073 = !{!1074}
!1074 = !DISubrange(count: 20)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_RDCT", scope: !1062, file: !78, line: 2453, baseType: !184, size: 32, offset: 1088)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1062, file: !78, line: 2454, baseType: !1077, size: 32, offset: 1120)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 32, elements: !381)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_DLLV", scope: !1062, file: !78, line: 2455, baseType: !184, size: 32, offset: 1152)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !1062, file: !78, line: 2456, baseType: !1080, size: 480, offset: 1184)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 480, elements: !1081)
!1081 = !{!1082}
!1082 = !DISubrange(count: 60)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_IDLC", scope: !1062, file: !78, line: 2457, baseType: !184, size: 32, offset: 1664)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !1062, file: !78, line: 2458, baseType: !1077, size: 32, offset: 1696)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_IDLD", scope: !1062, file: !78, line: 2459, baseType: !184, size: 32, offset: 1728)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !1062, file: !78, line: 2460, baseType: !1077, size: 32, offset: 1760)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_IDLE", scope: !1062, file: !78, line: 2461, baseType: !184, size: 32, offset: 1792)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !1062, file: !78, line: 2462, baseType: !1072, size: 160, offset: 1824)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_ODLC", scope: !1062, file: !78, line: 2463, baseType: !184, size: 32, offset: 1984)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !1062, file: !78, line: 2464, baseType: !1077, size: 32, offset: 2016)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_ODLD", scope: !1062, file: !78, line: 2465, baseType: !184, size: 32, offset: 2048)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !1062, file: !78, line: 2466, baseType: !1077, size: 32, offset: 2080)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_ODLE", scope: !1062, file: !78, line: 2467, baseType: !184, size: 32, offset: 2112)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !1062, file: !78, line: 2468, baseType: !1077, size: 32, offset: 2144)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_ODLF", scope: !1062, file: !78, line: 2469, baseType: !184, size: 32, offset: 2176)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !1062, file: !78, line: 2470, baseType: !1097, size: 224, offset: 2208)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 224, elements: !1098)
!1098 = !{!1099}
!1099 = !DISubrange(count: 28)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_IOA", scope: !1062, file: !78, line: 2471, baseType: !184, size: 32, offset: 2432)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !1062, file: !78, line: 2472, baseType: !1077, size: 32, offset: 2464)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_IOB", scope: !1062, file: !78, line: 2473, baseType: !184, size: 32, offset: 2496)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED14", scope: !1062, file: !78, line: 2474, baseType: !970, size: 96, offset: 2528)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_HFSLP", scope: !1062, file: !78, line: 2475, baseType: !184, size: 32, offset: 2624)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED15", scope: !1062, file: !78, line: 2476, baseType: !1077, size: 32, offset: 2656)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_DSRAM", scope: !1062, file: !78, line: 2477, baseType: !184, size: 32, offset: 2688)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED16", scope: !1062, file: !78, line: 2478, baseType: !1077, size: 32, offset: 2720)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_MSRAM", scope: !1062, file: !78, line: 2479, baseType: !184, size: 32, offset: 2752)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED17", scope: !1062, file: !78, line: 2480, baseType: !1077, size: 32, offset: 2784)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_MREG_RW", scope: !1062, file: !78, line: 2481, baseType: !184, size: 32, offset: 2816)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED18", scope: !1062, file: !78, line: 2482, baseType: !970, size: 96, offset: 2848)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_ARBA", scope: !1062, file: !78, line: 2483, baseType: !184, size: 32, offset: 2944)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED19", scope: !1062, file: !78, line: 2484, baseType: !1077, size: 32, offset: 2976)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_ARBB", scope: !1062, file: !78, line: 2485, baseType: !184, size: 32, offset: 3008)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED20", scope: !1062, file: !78, line: 2486, baseType: !1077, size: 32, offset: 3040)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_ARBC", scope: !1062, file: !78, line: 2487, baseType: !184, size: 32, offset: 3072)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED21", scope: !1062, file: !78, line: 2488, baseType: !1072, size: 160, offset: 3104)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_SLCT", scope: !1062, file: !78, line: 2489, baseType: !184, size: 32, offset: 3264)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED22", scope: !1062, file: !78, line: 2490, baseType: !1077, size: 32, offset: 3296)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_ABCT", scope: !1062, file: !78, line: 2491, baseType: !184, size: 32, offset: 3328)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED23", scope: !1062, file: !78, line: 2492, baseType: !1122, size: 736, offset: 3360)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !971, size: 736, elements: !1123)
!1123 = !{!1124}
!1124 = !DISubrange(count: 92)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_BMEN", scope: !1062, file: !78, line: 2493, baseType: !184, size: 32, offset: 4096)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED24", scope: !1062, file: !78, line: 2494, baseType: !1077, size: 32, offset: 4128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "EMI_BCNT", scope: !1062, file: !78, line: 2495, baseType: !184, size: 32, offset: 4160)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED25", scope: !1062, file: !78, line: 2496, baseType: !1077, size: 32, offset: 4192)
