; ModuleID = 'build/96b_wistrio/crypto/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.mode_test = type { i8*, void (%struct.device*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.ctr_params }
%struct.ctr_params = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.ctr_params }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.stm32_exti_data = type { [16 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !294, line: 18, type: !371, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !123, globals: !290, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/crypto/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto")
!29 = !{!30, !39, !42, !46, !116}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_mode", file: !31, line: 44, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/crypto/cipher.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38}
!34 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_ECB", value: 1)
!35 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CBC", value: 2)
!36 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CTR", value: 3)
!37 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CCM", value: 4)
!38 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_GCM", value: 5)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_algo", file: !31, line: 29, baseType: !32, size: 32, elements: !40)
!40 = !{!41}
!41 = !DIEnumerator(name: "CRYPTO_CIPHER_ALGO_AES", value: 1)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_op", file: !31, line: 34, baseType: !32, size: 32, elements: !43)
!43 = !{!44, !45}
!44 = !DIEnumerator(name: "CRYPTO_CIPHER_OP_DECRYPT", value: 0)
!45 = !DIEnumerator(name: "CRYPTO_CIPHER_OP_ENCRYPT", value: 1)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !47, line: 27, baseType: !32, size: 32, elements: !48)
!47 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!49 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!50 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!51 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!52 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!53 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!54 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!55 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!56 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!57 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!58 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!59 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!60 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!61 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!62 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!63 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!64 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!65 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!115 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hash_algo", file: !117, line: 26, baseType: !32, size: 32, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/crypto/hash.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !120, !121, !122}
!119 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA224", value: 1)
!120 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA256", value: 2)
!121 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA384", value: 3)
!122 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA512", value: 4)
!123 = !{!124, !125, !126}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!125 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_driver_api", file: !128, line: 65, size: 224, elements: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/crypto/crypto.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = !{!130, !161, !241, !245, !253, !278, !282}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "query_hw_caps", scope: !127, file: !128, line: 66, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!132 = !DISubroutineType(types: !133)
!133 = !{!125, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = !{!139, !143, !144, !145, !154, !155}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !136, file: !137, line: 380, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !136, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !136, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !136, file: !137, line: 386, baseType: !146, size: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !137, line: 351, size: 16, elements: !148)
!148 = !{!149, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !147, file: !137, line: 359, baseType: !150, size: 8)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !151)
!151 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !147, file: !137, line: 364, baseType: !153, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!153 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !136, file: !137, line: 388, baseType: !124, size: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !136, file: !137, line: 396, baseType: !156, size: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !137, line: 43, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !160)
!160 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_begin_session", scope: !127, file: !128, line: 69, baseType: !162, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DISubroutineType(types: !164)
!164 = !{!125, !134, !165, !39, !30, !42}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ctx", file: !31, line: 110, size: 256, elements: !167)
!167 = !{!168, !212, !217, !218, !219, !220, !239, !240}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !166, file: !31, line: 116, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ops", file: !31, line: 74, size: 64, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_mode", scope: !169, file: !31, line: 76, baseType: !30, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !169, file: !31, line: 78, baseType: !173, size: 32, offset: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !31, line: 78, size: 32, elements: !174)
!174 = !{!175, !190, !195, !197, !210}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "block_crypt_hndlr", scope: !173, file: !31, line: 79, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_op_t", file: !31, line: 57, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DISubroutineType(types: !179)
!179 = !{!125, !165, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_pkt", file: !31, line: 180, size: 192, elements: !182)
!182 = !{!183, !185, !186, !187, !188, !189}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !181, file: !31, line: 183, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !181, file: !31, line: 186, baseType: !125, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !181, file: !31, line: 192, baseType: !184, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf_max", scope: !181, file: !31, line: 197, baseType: !125, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "out_len", scope: !181, file: !31, line: 202, baseType: !125, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !181, file: !31, line: 208, baseType: !165, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cbc_crypt_hndlr", scope: !173, file: !31, line: 80, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "cbc_op_t", file: !31, line: 62, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DISubroutineType(types: !194)
!194 = !{!125, !165, !180, !184}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_crypt_hndlr", scope: !173, file: !31, line: 81, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ctr_op_t", file: !31, line: 65, baseType: !192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_crypt_hndlr", scope: !173, file: !31, line: 82, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ccm_op_t", file: !31, line: 68, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!125, !165, !202, !184}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_aead_pkt", file: !31, line: 217, size: 128, elements: !204)
!204 = !{!205, !206, !207, !209}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pkt", scope: !203, file: !31, line: 219, baseType: !180, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !203, file: !31, line: 224, baseType: !184, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ad_len", scope: !203, file: !31, line: 227, baseType: !208, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !203, file: !31, line: 233, baseType: !184, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_crypt_hndlr", scope: !173, file: !31, line: 83, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcm_op_t", file: !31, line: 71, baseType: !199)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !166, file: !31, line: 126, baseType: !213, size: 32, offset: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !31, line: 119, size: 32, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "bit_stream", scope: !213, file: !31, line: 121, baseType: !184, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !213, file: !31, line: 125, baseType: !124, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !166, file: !31, line: 131, baseType: !134, size: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !166, file: !31, line: 140, baseType: !124, size: 32, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "app_sessn_state", scope: !166, file: !31, line: 146, baseType: !124, size: 32, offset: 160)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mode_params", scope: !166, file: !31, line: 156, baseType: !221, size: 32, offset: 192)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !31, line: 152, size: 32, elements: !222)
!222 = !{!223, !230, !234}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_info", scope: !221, file: !31, line: 153, baseType: !224, size: 32)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ccm_params", file: !31, line: 87, size: 32, elements: !225)
!225 = !{!226, !229}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !224, file: !31, line: 88, baseType: !227, size: 16)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !228)
!228 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !224, file: !31, line: 89, baseType: !227, size: 16, offset: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_info", scope: !221, file: !31, line: 154, baseType: !231, size: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctr_params", file: !31, line: 92, size: 32, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_len", scope: !231, file: !31, line: 96, baseType: !208, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_info", scope: !221, file: !31, line: 155, baseType: !235, size: 32)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gcm_params", file: !31, line: 99, size: 32, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !235, file: !31, line: 100, baseType: !227, size: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !235, file: !31, line: 101, baseType: !227, size: 16, offset: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !166, file: !31, line: 161, baseType: !227, size: 16, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !166, file: !31, line: 169, baseType: !227, size: 16, offset: 240)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_free_session", scope: !127, file: !128, line: 74, baseType: !242, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DISubroutineType(types: !244)
!244 = !{!125, !134, !165}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_async_callback_set", scope: !127, file: !128, line: 77, baseType: !246, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DISubroutineType(types: !248)
!248 = !{!125, !134, !249}
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "cipher_completion_cb", file: !31, line: 242, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !180, !125}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "hash_begin_session", scope: !127, file: !128, line: 81, baseType: !254, size: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DISubroutineType(types: !256)
!256 = !{!125, !134, !257, !116}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_ctx", file: !117, line: 47, size: 128, elements: !259)
!259 = !{!260, !261, !262, !276, !277}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !258, file: !117, line: 51, baseType: !134, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !258, file: !117, line: 60, baseType: !124, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "hash_hndlr", scope: !258, file: !117, line: 65, baseType: !263, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_op_t", file: !117, line: 38, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DISubroutineType(types: !266)
!266 = !{!125, !257, !267, !153}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_pkt", file: !117, line: 88, size: 128, elements: !269)
!269 = !{!270, !271, !274, !275}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !268, file: !117, line: 91, baseType: !184, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !268, file: !117, line: 94, baseType: !272, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !273, line: 214, baseType: !32)
!273 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !268, file: !117, line: 101, baseType: !184, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !268, file: !117, line: 107, baseType: !257, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "started", scope: !258, file: !117, line: 70, baseType: !153, size: 8, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !258, file: !117, line: 78, baseType: !227, size: 16, offset: 112)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "hash_free_session", scope: !127, file: !128, line: 84, baseType: !279, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DISubroutineType(types: !281)
!281 = !{!125, !134, !257}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "hash_async_callback_set", scope: !127, file: !128, line: 86, baseType: !283, size: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DISubroutineType(types: !285)
!285 = !{!125, !134, !286}
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_completion_cb", file: !117, line: 114, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !267, !125}
!290 = !{!25, !291, !314, !316, !318, !320, !324, !327, !329, !334, !339, !344, !349, !351, !356, !361, !366}
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "iv", scope: !293, file: !294, line: 227, type: !311, isLocal: true, isDefinition: true)
!293 = distinct !DISubprogram(name: "cbc_mode", scope: !294, file: !294, line: 205, type: !295, scopeLine: 206, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !297)
!294 = !DIFile(filename: "zephyr/samples/drivers/crypto/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!295 = !DISubroutineType(types: !296)
!296 = !{null, !134}
!297 = !{!298, !299, !303, !307, !308, !309, !310}
!298 = !DILocalVariable(name: "dev", arg: 1, scope: !293, file: !294, line: 205, type: !134)
!299 = !DILocalVariable(name: "encrypted", scope: !293, file: !294, line: 207, type: !300)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 640, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 80)
!303 = !DILocalVariable(name: "decrypted", scope: !293, file: !294, line: 208, type: !304)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 512, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 64)
!307 = !DILocalVariable(name: "ini", scope: !293, file: !294, line: 209, type: !166)
!308 = !DILocalVariable(name: "encrypt", scope: !293, file: !294, line: 214, type: !181)
!309 = !DILocalVariable(name: "decrypt", scope: !293, file: !294, line: 220, type: !181)
!310 = !DILabel(scope: !293, name: "out", file: !294, line: 279)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 128, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 16)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "cap_flags", scope: !27, file: !294, line: 48, type: !208, isLocal: false, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "key", scope: !27, file: !294, line: 34, type: !311, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "plaintext", scope: !27, file: !294, line: 39, type: !304, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "cbc_ciphertext", scope: !27, file: !294, line: 195, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 640, elements: !301)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "ctr_ciphertext", scope: !27, file: !294, line: 283, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 512, elements: !305)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "ccm_key", scope: !27, file: !294, line: 373, type: !311, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "ccm_data", scope: !27, file: !294, line: 384, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 184, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 23)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "ccm_hdr", scope: !27, file: !294, line: 381, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 64, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 8)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "ccm_nonce", scope: !27, file: !294, line: 377, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 104, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 13)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "ccm_expected", scope: !27, file: !294, line: 388, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 248, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 31)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "gcm_key", scope: !27, file: !294, line: 485, type: !311, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "gcm_data", scope: !27, file: !294, line: 496, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 336, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 42)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "gcm_hdr", scope: !27, file: !294, line: 492, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 160, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 20)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "gcm_nonce", scope: !27, file: !294, line: 489, type: !363, isLocal: true, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 96, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 12)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "gcm_expected", scope: !27, file: !294, line: 502, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 464, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 58)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !374)
!373 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !372, file: !373, line: 17, baseType: !140, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !372, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !379, file: !395, line: 18, type: !396, isLocal: false, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !381, globals: !394, splitDebugInlining: false, nameTableKind: None)
!380 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto")
!381 = !{!22, !124, !24, !382, !384, !386, !272, !125, !387, !388, !390, !392, !393, !184, !227, !140}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!394 = !{!377}
!395 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !397, file: !373, line: 17, baseType: !140, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !397, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "_char_out", scope: !403, file: !408, line: 54, type: !409, isLocal: false, isDefinition: true)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !406, globals: !407, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto")
!405 = !{!46}
!406 = !{!124, !125}
!407 = !{!401}
!408 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DISubroutineType(types: !411)
!411 = !{!125, !125}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "__init_stm32l1_init", scope: !414, file: !444, line: 60, type: !445, isLocal: true, isDefinition: true, align: 32)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !416, globals: !443, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto")
!416 = !{!417, !437}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !419, line: 386, baseType: !420)
!419 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l151xba.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 370, size: 448, elements: !421)
!421 = !{!422, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !420, file: !419, line: 372, baseType: !423, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !208)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !420, file: !419, line: 373, baseType: !423, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !420, file: !419, line: 374, baseType: !423, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !420, file: !419, line: 375, baseType: !423, size: 32, offset: 96)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !420, file: !419, line: 376, baseType: !423, size: 32, offset: 128)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !420, file: !419, line: 377, baseType: !423, size: 32, offset: 160)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !420, file: !419, line: 378, baseType: !423, size: 32, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !420, file: !419, line: 379, baseType: !423, size: 32, offset: 224)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !420, file: !419, line: 380, baseType: !423, size: 32, offset: 256)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !420, file: !419, line: 381, baseType: !423, size: 32, offset: 288)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !420, file: !419, line: 382, baseType: !423, size: 32, offset: 320)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !420, file: !419, line: 383, baseType: !423, size: 32, offset: 352)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !420, file: !419, line: 384, baseType: !423, size: 32, offset: 384)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !420, file: !419, line: 385, baseType: !423, size: 32, offset: 416)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !419, line: 364, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 360, size: 64, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !439, file: !419, line: 362, baseType: !423, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !439, file: !419, line: 363, baseType: !423, size: 32, offset: 32)
!443 = !{!412}
!444 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !447, line: 51, size: 64, elements: !448)
!447 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!448 = !{!449, !468}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !446, file: !447, line: 60, baseType: !450, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 32)
!451 = !DISubroutineType(types: !452)
!452 = !{!125, !453}
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !456)
!456 = !{!457, !458, !459, !460, !466, !467}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !455, file: !137, line: 380, baseType: !140, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !455, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !455, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !455, file: !137, line: 386, baseType: !461, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !137, line: 351, size: 16, elements: !463)
!463 = !{!464, !465}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !462, file: !137, line: 359, baseType: !150, size: 8)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !462, file: !137, line: 364, baseType: !153, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !455, file: !137, line: 388, baseType: !124, size: 32, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !455, file: !137, line: 396, baseType: !156, size: 32, offset: 160)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !446, file: !447, line: 65, baseType: !453, size: 32, offset: 32)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !471, file: !474, line: 71, type: !475, isLocal: true, isDefinition: true, align: 32)
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !472, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !473, splitDebugInlining: false, nameTableKind: None)
!472 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto")
!473 = !{!469}
!474 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !447, line: 51, size: 64, elements: !477)
!477 = !{!478, !497}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !476, file: !447, line: 60, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!480 = !DISubroutineType(types: !481)
!481 = !{!125, !482}
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !484)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !485)
!485 = !{!486, !487, !488, !489, !495, !496}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !484, file: !137, line: 380, baseType: !140, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !484, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !484, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !484, file: !137, line: 386, baseType: !490, size: 32, offset: 96)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 32)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !137, line: 351, size: 16, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !491, file: !137, line: 359, baseType: !150, size: 8)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !491, file: !137, line: 364, baseType: !153, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !484, file: !137, line: 388, baseType: !124, size: 32, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !484, file: !137, line: 396, baseType: !156, size: 32, offset: 160)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !476, file: !447, line: 65, baseType: !482, size: 32, offset: 32)
!498 = !DIGlobalVariableExpression(var: !499, expr: !DIExpression())
!499 = distinct !DIGlobalVariable(name: "inv_sbox", scope: !500, file: !514, line: 37, type: !515, isLocal: true, isDefinition: true)
!500 = distinct !DICompileUnit(language: DW_LANG_C99, file: !501, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !502, globals: !513, splitDebugInlining: false, nameTableKind: None)
!501 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/modules/crypto/tinycrypt/lib/source/aes_decrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto")
!502 = !{!184, !503, !504, !150}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCAesKeySched_t", file: !505, line: 66, baseType: !506)
!505 = !DIFile(filename: "modules/crypto/tinycrypt/lib/include/tinycrypt/aes.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tc_aes_key_sched_struct", file: !505, line: 64, size: 1408, elements: !508)
!508 = !{!509}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !507, file: !505, line: 65, baseType: !510, size: 1408)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1408, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 44)
!513 = !{!498}
!514 = !DIFile(filename: "modules/crypto/tinycrypt/lib/source/aes_decrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 2048, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 256)
!518 = !DIGlobalVariableExpression(var: !519, expr: !DIExpression())
!519 = distinct !DIGlobalVariable(name: "sbox", scope: !520, file: !529, line: 37, type: !515, isLocal: true, isDefinition: true)
!520 = distinct !DICompileUnit(language: DW_LANG_C99, file: !521, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !522, globals: !528, splitDebugInlining: false, nameTableKind: None)
!521 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/modules/crypto/tinycrypt/lib/source/aes_encrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto")
!522 = !{!523, !503, !184, !150}
!523 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCAesKeySched_t", file: !505, line: 66, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 32)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tc_aes_key_sched_struct", file: !505, line: 64, size: 1408, elements: !526)
!526 = !{!527}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !525, file: !505, line: 65, baseType: !510, size: 1408)
!528 = !{!518}
!529 = !DIFile(filename: "modules/crypto/tinycrypt/lib/source/aes_encrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!530 = !DIGlobalVariableExpression(var: !531, expr: !DIExpression())
!531 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !532, file: !539, line: 17, type: !681, isLocal: false, isDefinition: true)
!532 = distinct !DICompileUnit(language: DW_LANG_C99, file: !533, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !534, globals: !535, splitDebugInlining: false, nameTableKind: None)
!533 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto")
!534 = !{!272, !125, !208, !124}
!535 = !{!530, !536, !677}
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !538, file: !539, line: 198, type: !663, isLocal: true, isDefinition: true)
!538 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !539, file: !539, line: 175, type: !540, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !532, retainedNodes: !658)
!539 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!540 = !DISubroutineType(types: !541)
!541 = !{null, !542}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !544, line: 245, size: 1024, elements: !545)
!544 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!545 = !{!546, !612, !625, !626, !627, !628, !634, !653}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !543, file: !544, line: 247, baseType: !547, size: 384)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !544, line: 57, size: 384, elements: !548)
!548 = !{!549, !577, !585, !586, !587, !598, !599, !600}
!549 = !DIDerivedType(tag: DW_TAG_member, scope: !547, file: !544, line: 60, baseType: !550, size: 64)
!550 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !547, file: !544, line: 60, size: 64, elements: !551)
!551 = !{!552, !568}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !550, file: !544, line: 61, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !554, line: 49, baseType: !555)
!554 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !554, line: 37, size: 64, elements: !556)
!556 = !{!557, !563}
!557 = !DIDerivedType(tag: DW_TAG_member, scope: !555, file: !554, line: 38, baseType: !558, size: 32)
!558 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !555, file: !554, line: 38, size: 32, elements: !559)
!559 = !{!560, !562}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !558, file: !554, line: 39, baseType: !561, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !558, file: !554, line: 40, baseType: !561, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_member, scope: !555, file: !554, line: 42, baseType: !564, size: 32, offset: 32)
!564 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !555, file: !554, line: 42, size: 32, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !564, file: !554, line: 43, baseType: !561, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !564, file: !554, line: 44, baseType: !561, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !550, file: !544, line: 62, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !570, line: 49, size: 64, elements: !571)
!570 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !569, file: !570, line: 50, baseType: !573, size: 64)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !574, size: 64, elements: !575)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!575 = !{!576}
!576 = !DISubrange(count: 2)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !547, file: !544, line: 68, baseType: !578, size: 32, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !580, line: 233, baseType: !581)
!580 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !580, line: 231, size: 64, elements: !582)
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !581, file: !580, line: 232, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !554, line: 48, baseType: !555)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !547, file: !544, line: 71, baseType: !150, size: 8, offset: 96)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !547, file: !544, line: 74, baseType: !150, size: 8, offset: 104)
!587 = !DIDerivedType(tag: DW_TAG_member, scope: !547, file: !544, line: 90, baseType: !588, size: 16, offset: 112)
!588 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !547, file: !544, line: 90, size: 16, elements: !589)
!589 = !{!590, !597}
!590 = !DIDerivedType(tag: DW_TAG_member, scope: !588, file: !544, line: 91, baseType: !591, size: 16)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !588, file: !544, line: 91, size: 16, elements: !592)
!592 = !{!593, !596}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !591, file: !544, line: 96, baseType: !594, size: 8)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !595)
!595 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !591, file: !544, line: 97, baseType: !150, size: 8, offset: 8)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !588, file: !544, line: 100, baseType: !227, size: 16)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !547, file: !544, line: 107, baseType: !208, size: 32, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !547, file: !544, line: 127, baseType: !124, size: 32, offset: 160)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !547, file: !544, line: 131, baseType: !601, size: 192, offset: 192)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !580, line: 244, size: 192, elements: !602)
!602 = !{!603, !604, !610}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !601, file: !580, line: 245, baseType: !553, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !601, file: !580, line: 246, baseType: !605, size: 32, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !580, line: 242, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 32)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !609}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !601, file: !580, line: 249, baseType: !611, size: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !391)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !543, file: !544, line: 250, baseType: !613, size: 288, offset: 384)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !614, line: 25, size: 288, elements: !615)
!614 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !613, file: !614, line: 26, baseType: !208, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !613, file: !614, line: 27, baseType: !208, size: 32, offset: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !613, file: !614, line: 28, baseType: !208, size: 32, offset: 64)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !613, file: !614, line: 29, baseType: !208, size: 32, offset: 96)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !613, file: !614, line: 30, baseType: !208, size: 32, offset: 128)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !613, file: !614, line: 31, baseType: !208, size: 32, offset: 160)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !613, file: !614, line: 32, baseType: !208, size: 32, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !613, file: !614, line: 33, baseType: !208, size: 32, offset: 224)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !613, file: !614, line: 34, baseType: !208, size: 32, offset: 256)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !543, file: !544, line: 253, baseType: !124, size: 32, offset: 672)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !543, file: !544, line: 256, baseType: !579, size: 64, offset: 704)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !543, file: !544, line: 294, baseType: !125, size: 32, offset: 768)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !543, file: !544, line: 300, baseType: !629, size: 96, offset: 800)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !544, line: 149, size: 96, elements: !630)
!630 = !{!631, !632, !633}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !629, file: !544, line: 153, baseType: !22, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !629, file: !544, line: 162, baseType: !272, size: 32, offset: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !629, file: !544, line: 168, baseType: !272, size: 32, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !543, file: !544, line: 325, baseType: !635, size: 32, offset: 896)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 32)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !637, line: 5073, size: 160, elements: !638)
!637 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!638 = !{!639, !648, !649}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !636, file: !637, line: 5074, baseType: !640, size: 96)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !641, line: 56, size: 96, elements: !642)
!641 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!642 = !{!643, !646, !647}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !640, file: !641, line: 57, baseType: !644, size: 32)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !641, line: 57, flags: DIFlagFwdDecl)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !640, file: !641, line: 58, baseType: !124, size: 32, offset: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !640, file: !641, line: 59, baseType: !272, size: 32, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !636, file: !637, line: 5075, baseType: !579, size: 64, offset: 96)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !636, file: !637, line: 5076, baseType: !650, offset: 160)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !651, line: 43, elements: !652)
!651 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!652 = !{}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !543, file: !544, line: 343, baseType: !654, size: 64, offset: 928)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !614, line: 60, size: 64, elements: !655)
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !654, file: !614, line: 63, baseType: !208, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !654, file: !614, line: 66, baseType: !208, size: 32, offset: 32)
!658 = !{!659, !660, !661, !662}
!659 = !DILocalVariable(name: "thread", arg: 1, scope: !538, file: !539, line: 175, type: !542)
!660 = !DILocalVariable(name: "region_num", scope: !538, file: !539, line: 200, type: !150)
!661 = !DILocalVariable(name: "guard_start", scope: !538, file: !539, line: 265, type: !22)
!662 = !DILocalVariable(name: "guard_size", scope: !538, file: !539, line: 266, type: !272)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 96, elements: !675)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !665, line: 52, size: 96, elements: !666)
!665 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!666 = !{!667, !668, !669}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !664, file: !665, line: 53, baseType: !22, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !664, file: !665, line: 54, baseType: !272, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !664, file: !665, line: 55, baseType: !670, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !671, line: 151, baseType: !672)
!671 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !671, line: 149, size: 32, elements: !673)
!673 = !{!674}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !672, file: !671, line: 150, baseType: !208, size: 32)
!675 = !{!676}
!676 = !DISubrange(count: 1)
!677 = !DIGlobalVariableExpression(var: !678, expr: !DIExpression())
!678 = distinct !DIGlobalVariable(name: "static_regions", scope: !532, file: !539, line: 62, type: !679, isLocal: true, isDefinition: true)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !680, size: 96, elements: !675)
!680 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !664)
!681 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !682, file: !373, line: 17, baseType: !140, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !682, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !688, file: !721, line: 39, type: !150, isLocal: true, isDefinition: true)
!688 = distinct !DICompileUnit(language: DW_LANG_C99, file: !689, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !690, globals: !720, splitDebugInlining: false, nameTableKind: None)
!689 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto")
!690 = !{!691, !124, !125, !708, !150}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !693, line: 1168, baseType: !694)
!693 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !693, line: 1155, size: 352, elements: !695)
!695 = !{!696, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !694, file: !693, line: 1157, baseType: !697, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !694, file: !693, line: 1158, baseType: !423, size: 32, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !694, file: !693, line: 1159, baseType: !423, size: 32, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !694, file: !693, line: 1160, baseType: !423, size: 32, offset: 96)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !694, file: !693, line: 1161, baseType: !423, size: 32, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !694, file: !693, line: 1162, baseType: !423, size: 32, offset: 160)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !694, file: !693, line: 1163, baseType: !423, size: 32, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !694, file: !693, line: 1164, baseType: !423, size: 32, offset: 224)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !694, file: !693, line: 1165, baseType: !423, size: 32, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !694, file: !693, line: 1166, baseType: !423, size: 32, offset: 288)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !694, file: !693, line: 1167, baseType: !423, size: 32, offset: 320)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !711, line: 27, size: 96, elements: !712)
!711 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!712 = !{!713, !714, !715}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !710, file: !711, line: 29, baseType: !208, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !710, file: !711, line: 31, baseType: !140, size: 32, offset: 32)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !710, file: !711, line: 37, baseType: !716, size: 32, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !671, line: 146, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !671, line: 141, size: 32, elements: !718)
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !717, file: !671, line: 143, baseType: !208, size: 32)
!720 = !{!686}
!721 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !724, file: !731, line: 21, type: !409, isLocal: true, isDefinition: true)
!724 = distinct !DICompileUnit(language: DW_LANG_C99, file: !725, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !726, globals: !730, splitDebugInlining: false, nameTableKind: None)
!725 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto")
!726 = !{!727, !125, !124}
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !729, line: 22, baseType: !125)
!729 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!730 = !{!722}
!731 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !734, file: !739, line: 13, type: !756, isLocal: true, isDefinition: true)
!734 = distinct !DICompileUnit(language: DW_LANG_C99, file: !735, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !736, splitDebugInlining: false, nameTableKind: None)
!735 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto")
!736 = !{!737, !732}
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "mpu_config", scope: !734, file: !739, line: 37, type: !740, isLocal: false, isDefinition: true)
!739 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !711, line: 41, size: 64, elements: !742)
!742 = !{!743, !744}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !741, file: !711, line: 43, baseType: !208, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !741, file: !711, line: 45, baseType: !745, size: 32, offset: 32)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !711, line: 27, size: 96, elements: !748)
!748 = !{!749, !750, !751}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !747, file: !711, line: 29, baseType: !208, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !747, file: !711, line: 31, baseType: !140, size: 32, offset: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !747, file: !711, line: 37, baseType: !752, size: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !671, line: 146, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !671, line: 141, size: 32, elements: !754)
!754 = !{!755}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !753, file: !671, line: 143, baseType: !208, size: 32)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 192, elements: !575)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "__init_rf_init", scope: !759, file: !856, line: 36, type: !857, isLocal: true, isDefinition: true, align: 32)
!759 = distinct !DICompileUnit(language: DW_LANG_C99, file: !760, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !761, retainedTypes: !773, globals: !855, splitDebugInlining: false, nameTableKind: None)
!760 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto")
!761 = !{!762, !768}
!762 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !763, line: 506, baseType: !32, size: 32, elements: !764)
!763 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!764 = !{!765, !766, !767}
!765 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!766 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!767 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!768 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !763, line: 512, baseType: !32, size: 32, elements: !769)
!769 = !{!770, !771, !772}
!770 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!771 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!772 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!773 = !{!774, !844, !849, !809, !768, !762, !854, !124}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !763, line: 523, size: 288, elements: !777)
!777 = !{!778, !799, !805, !810, !814, !815, !816, !820, !840}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !776, file: !763, line: 524, baseType: !779, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 32)
!780 = !DISubroutineType(types: !781)
!781 = !{!125, !782, !797, !798}
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !785)
!785 = !{!786, !787, !788, !789, !795, !796}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !784, file: !137, line: 380, baseType: !140, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !784, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !784, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !784, file: !137, line: 386, baseType: !790, size: 32, offset: 96)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !137, line: 351, size: 16, elements: !792)
!792 = !{!793, !794}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !791, file: !137, line: 359, baseType: !150, size: 8)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !791, file: !137, line: 364, baseType: !153, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !784, file: !137, line: 388, baseType: !124, size: 32, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !784, file: !137, line: 396, baseType: !156, size: 32, offset: 160)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !763, line: 237, baseType: !150)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !763, line: 257, baseType: !208)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !776, file: !763, line: 530, baseType: !800, size: 32, offset: 32)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 32)
!801 = !DISubroutineType(types: !802)
!802 = !{!125, !782, !803}
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !763, line: 229, baseType: !208)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !776, file: !763, line: 532, baseType: !806, size: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 32)
!807 = !DISubroutineType(types: !808)
!808 = !{!125, !782, !809, !804}
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !763, line: 216, baseType: !208)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !776, file: !763, line: 535, baseType: !811, size: 32, offset: 96)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 32)
!812 = !DISubroutineType(types: !813)
!813 = !{!125, !782, !809}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !776, file: !763, line: 537, baseType: !811, size: 32, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !776, file: !763, line: 539, baseType: !811, size: 32, offset: 160)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !776, file: !763, line: 541, baseType: !817, size: 32, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!818 = !DISubroutineType(types: !819)
!819 = !{!125, !782, !797, !762, !768}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !776, file: !763, line: 544, baseType: !821, size: 32, offset: 224)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 32)
!822 = !DISubroutineType(types: !823)
!823 = !{!125, !782, !824, !153}
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 32)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !763, line: 478, size: 96, elements: !826)
!826 = !{!827, !834, !839}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !825, file: !763, line: 482, baseType: !828, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !829, line: 33, baseType: !830)
!829 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !829, line: 29, size: 32, elements: !831)
!831 = !{!832}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !830, file: !829, line: 30, baseType: !833, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !825, file: !763, line: 485, baseType: !835, size: 32, offset: 32)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !763, line: 464, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!837 = !DISubroutineType(types: !838)
!838 = !{null, !782, !824, !809}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !825, file: !763, line: 493, baseType: !809, size: 32, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !776, file: !763, line: 547, baseType: !841, size: 32, offset: 256)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 32)
!842 = !DISubroutineType(types: !843)
!843 = !{!208, !782}
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !763, line: 428, size: 32, elements: !847)
!847 = !{!848}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !846, file: !763, line: 434, baseType: !809, size: 32)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !763, line: 441, size: 32, elements: !852)
!852 = !{!853}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !851, file: !763, line: 447, baseType: !809, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 32)
!855 = !{!757}
!856 = !DIFile(filename: "zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!857 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !447, line: 51, size: 64, elements: !859)
!859 = !{!860, !864}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !858, file: !447, line: 60, baseType: !861, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!862 = !DISubroutineType(types: !863)
!863 = !{!125, !782}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !858, file: !447, line: 65, baseType: !782, size: 32, offset: 32)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !867, file: !939, line: 48, type: !1013, isLocal: true, isDefinition: true)
!867 = distinct !DICompileUnit(language: DW_LANG_C99, file: !868, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !869, retainedTypes: !925, globals: !936, splitDebugInlining: false, nameTableKind: None)
!868 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto")
!869 = !{!46, !870}
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !419, line: 69, baseType: !125, size: 32, elements: !871)
!871 = !{!872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924}
!872 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!873 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!874 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!875 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!876 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!877 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!878 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!879 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!880 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!881 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!882 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!883 = !DIEnumerator(name: "TAMPER_STAMP_IRQn", value: 2)
!884 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!885 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!886 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!887 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!888 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!889 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!890 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!891 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!892 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!893 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!894 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!895 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!896 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!897 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!898 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!899 = !DIEnumerator(name: "ADC1_IRQn", value: 18)
!900 = !DIEnumerator(name: "USB_HP_IRQn", value: 19)
!901 = !DIEnumerator(name: "USB_LP_IRQn", value: 20)
!902 = !DIEnumerator(name: "DAC_IRQn", value: 21)
!903 = !DIEnumerator(name: "COMP_IRQn", value: 22)
!904 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!905 = !DIEnumerator(name: "TIM9_IRQn", value: 25)
!906 = !DIEnumerator(name: "TIM10_IRQn", value: 26)
!907 = !DIEnumerator(name: "TIM11_IRQn", value: 27)
!908 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!909 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!910 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!911 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!912 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!913 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!914 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!915 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!916 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!917 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!918 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!919 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!920 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!921 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!922 = !DIEnumerator(name: "USB_FS_WKUP_IRQn", value: 42)
!923 = !DIEnumerator(name: "TIM6_IRQn", value: 43)
!924 = !DIEnumerator(name: "TIM7_IRQn", value: 44)
!925 = !{!272, !125, !124, !926}
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !419, line: 270, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 262, size: 192, elements: !929)
!929 = !{!930, !931, !932, !933, !934, !935}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !928, file: !419, line: 264, baseType: !423, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !928, file: !419, line: 265, baseType: !423, size: 32, offset: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !928, file: !419, line: 266, baseType: !423, size: 32, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !928, file: !419, line: 267, baseType: !423, size: 32, offset: 96)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !928, file: !419, line: 268, baseType: !423, size: 32, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !928, file: !419, line: 269, baseType: !423, size: 32, offset: 160)
!936 = !{!937, !943, !959, !970, !985, !865, !987, !1001, !1003, !1005, !1007, !1009, !1011}
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !867, file: !939, line: 424, type: !940, isLocal: false, isDefinition: true, align: 16)
!939 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 64, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 4)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(name: "__device_dts_ord_32", scope: !867, file: !939, line: 424, type: !945, isLocal: false, isDefinition: true, align: 32)
!945 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !946)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !947)
!947 = !{!948, !949, !950, !951, !957, !958}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !946, file: !137, line: 380, baseType: !140, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !946, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !946, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !946, file: !137, line: 386, baseType: !952, size: 32, offset: 96)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 32)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !137, line: 351, size: 16, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !953, file: !137, line: 359, baseType: !150, size: 8)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !953, file: !137, line: 364, baseType: !153, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !946, file: !137, line: 388, baseType: !124, size: 32, offset: 128)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !946, file: !137, line: 396, baseType: !156, size: 32, offset: 160)
!959 = !DIGlobalVariableExpression(var: !960, expr: !DIExpression())
!960 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_32", scope: !867, file: !939, line: 424, type: !961, isLocal: true, isDefinition: true, align: 32)
!961 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !447, line: 51, size: 64, elements: !963)
!963 = !{!964, !969}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !962, file: !447, line: 60, baseType: !965, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 32)
!966 = !DISubroutineType(types: !967)
!967 = !{!125, !968}
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !962, file: !447, line: 65, baseType: !968, size: 32, offset: 32)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "exti_data", scope: !867, file: !939, line: 423, type: !972, isLocal: true, isDefinition: true)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !939, line: 107, size: 1024, elements: !973)
!973 = !{!974}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !972, file: !939, line: 109, baseType: !975, size: 1024)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !976, size: 1024, elements: !312)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !939, line: 101, size: 64, elements: !977)
!977 = !{!978, !984}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !976, file: !939, line: 102, baseType: !979, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !980, line: 63, baseType: !981)
!980 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 32)
!982 = !DISubroutineType(types: !983)
!983 = !{null, !125, !124}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !976, file: !939, line: 103, baseType: !124, size: 32, offset: 32)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_32", scope: !867, file: !939, line: 424, type: !953, isLocal: true, isDefinition: true, align: 8)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !989, file: !939, line: 493, type: !994, isLocal: true, isDefinition: true, align: 32)
!989 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !939, file: !939, line: 460, type: !990, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !867, retainedNodes: !992)
!990 = !DISubroutineType(types: !991)
!991 = !{null, !968}
!992 = !{!993}
!993 = !DILocalVariable(name: "dev", arg: 1, scope: !989, file: !939, line: 460, type: !968)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !995)
!995 = !{!996, !998, !999, !1000}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !994, file: !10, line: 55, baseType: !997, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !125)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !994, file: !10, line: 57, baseType: !997, size: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !994, file: !10, line: 59, baseType: !124, size: 32, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !994, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !989, file: !939, line: 497, type: !994, isLocal: true, isDefinition: true, align: 32)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !989, file: !939, line: 507, type: !994, isLocal: true, isDefinition: true, align: 32)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !989, file: !939, line: 512, type: !994, isLocal: true, isDefinition: true, align: 32)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !989, file: !939, line: 516, type: !994, isLocal: true, isDefinition: true, align: 32)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !989, file: !939, line: 523, type: !994, isLocal: true, isDefinition: true, align: 32)
!1011 = !DIGlobalVariableExpression(var: !1012, expr: !DIExpression())
!1012 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !989, file: !939, line: 527, type: !994, isLocal: true, isDefinition: true, align: 32)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 512, elements: !312)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !419, line: 127, baseType: !870)
!1016 = !DIGlobalVariableExpression(var: !1017, expr: !DIExpression())
!1017 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !1018, file: !1023, line: 21, type: !1045, isLocal: false, isDefinition: true, align: 16)
!1018 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1019, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1020, splitDebugInlining: false, nameTableKind: None)
!1019 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto")
!1020 = !{!1021, !1016, !1027, !1029, !1031, !1033, !1035, !1037, !1039, !1041, !1043}
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !1018, file: !1023, line: 16, type: !1024, isLocal: false, isDefinition: true, align: 16)
!1023 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto")
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 176, elements: !1025)
!1025 = !{!1026}
!1026 = !DISubrange(count: 11)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_17", scope: !1018, file: !1023, line: 28, type: !940, isLocal: false, isDefinition: true, align: 16)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !1018, file: !1023, line: 35, type: !940, isLocal: false, isDefinition: true, align: 16)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_53", scope: !1018, file: !1023, line: 42, type: !940, isLocal: false, isDefinition: true, align: 16)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_59", scope: !1018, file: !1023, line: 49, type: !940, isLocal: false, isDefinition: true, align: 16)
!1035 = !DIGlobalVariableExpression(var: !1036, expr: !DIExpression())
!1036 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_15", scope: !1018, file: !1023, line: 56, type: !940, isLocal: false, isDefinition: true, align: 16)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !1018, file: !1023, line: 63, type: !940, isLocal: false, isDefinition: true, align: 16)
!1039 = !DIGlobalVariableExpression(var: !1040, expr: !DIExpression())
!1040 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !1018, file: !1023, line: 70, type: !940, isLocal: false, isDefinition: true, align: 16)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !1018, file: !1023, line: 77, type: !940, isLocal: false, isDefinition: true, align: 16)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(name: "__devicehdl_crypto_tinycrypt", scope: !1018, file: !1023, line: 82, type: !1045, isLocal: false, isDefinition: true, align: 16)
!1045 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 48, elements: !1046)
!1046 = !{!1047}
!1047 = !DISubrange(count: 3)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !1050, file: !1094, line: 398, type: !1127, isLocal: true, isDefinition: true)
!1050 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1051, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1052, retainedTypes: !1065, globals: !1091, splitDebugInlining: false, nameTableKind: None)
!1051 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/crypto")
!1052 = !{!1053, !46, !1058}
!1053 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1054, line: 190, baseType: !32, size: 32, elements: !1055)
!1054 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l1xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1055 = !{!1056, !1057}
!1056 = !DIEnumerator(name: "SUCCESS", value: 0)
!1057 = !DIEnumerator(name: "ERROR", value: 1)
!1058 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !1059, line: 44, baseType: !32, size: 32, elements: !1060)
!1059 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1060 = !{!1061, !1062, !1063, !1064}
!1061 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!1062 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!1063 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!1064 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!1065 = !{!124, !125, !208, !1066, !1084, !1090}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 32)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !419, line: 386, baseType: !1068)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 370, size: 448, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !1068, file: !419, line: 372, baseType: !423, size: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !1068, file: !419, line: 373, baseType: !423, size: 32, offset: 32)
