; ModuleID = 'build/arduino_due/application_development/external_lib/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.wdt_sam_dev_cfg = type { %struct._thread_stack_info* }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.wdt_driver_api = type { i32 (%struct.device*, i8)*, i32 (%struct.device*)*, i32 (%struct.device*, %struct.wdt_timeout_cfg*)*, i32 (%struct.device*, i32)* }
%struct.wdt_timeout_cfg = type { %struct._thread_arch, void (%struct.device*, i32)*, i8 }
%struct._thread_arch = type { i32, i32 }
%struct.wdt_sam_dev_data = type { void (%struct.device*, i32)*, i32, i8, i8 }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.uart_sam_dev_cfg = type { %struct.Uart*, i32, %struct.pinctrl_dev_config* }
%struct.Uart = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, [55 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/application_development/external_lib/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/application_development/external_lib")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/application_development/external_lib")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/application_development/external_lib")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !111, file: !177, line: 235, type: !178, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !113, globals: !176, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/application_development/external_lib")
!113 = !{!102, !103, !114, !126}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !116, line: 46, baseType: !117)
!116 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 41, size: 128, elements: !118)
!118 = !{!119, !122, !123, !125}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !117, file: !116, line: 42, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !117, file: !116, line: 43, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !117, file: !116, line: 44, baseType: !124, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !117, file: !116, line: 45, baseType: !124, size: 32, offset: 96)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !128, line: 75, baseType: !129)
!128 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !128, line: 41, size: 2176, elements: !130)
!130 = !{!131, !132, !133, !134, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !154, !158, !159, !160, !161, !162, !163, !164, !165, !169, !170, !171, !172, !173, !174, !175}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !129, file: !128, line: 42, baseType: !120, size: 32)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !129, file: !128, line: 43, baseType: !120, size: 32, offset: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !129, file: !128, line: 44, baseType: !124, size: 32, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !129, file: !128, line: 45, baseType: !135, size: 32, offset: 96)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 32, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 1)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !129, file: !128, line: 46, baseType: !120, size: 32, offset: 128)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !129, file: !128, line: 47, baseType: !120, size: 32, offset: 160)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !129, file: !128, line: 48, baseType: !124, size: 32, offset: 192)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !129, file: !128, line: 49, baseType: !120, size: 32, offset: 224)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !129, file: !128, line: 50, baseType: !120, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !129, file: !128, line: 51, baseType: !124, size: 32, offset: 288)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !129, file: !128, line: 52, baseType: !120, size: 32, offset: 320)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !129, file: !128, line: 53, baseType: !135, size: 32, offset: 352)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !129, file: !128, line: 54, baseType: !120, size: 32, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !129, file: !128, line: 55, baseType: !135, size: 32, offset: 416)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !129, file: !128, line: 56, baseType: !120, size: 32, offset: 448)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !129, file: !128, line: 57, baseType: !135, size: 32, offset: 480)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !129, file: !128, line: 58, baseType: !151, size: 96, offset: 512)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 96, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 3)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !129, file: !128, line: 59, baseType: !155, size: 160, offset: 608)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 160, elements: !156)
!156 = !{!157}
!157 = !DISubrange(count: 5)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !129, file: !128, line: 60, baseType: !120, size: 32, offset: 768)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !129, file: !128, line: 61, baseType: !120, size: 32, offset: 800)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !129, file: !128, line: 62, baseType: !124, size: 32, offset: 832)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !129, file: !128, line: 63, baseType: !124, size: 32, offset: 864)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !129, file: !128, line: 64, baseType: !120, size: 32, offset: 896)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !129, file: !128, line: 65, baseType: !120, size: 32, offset: 928)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !129, file: !128, line: 66, baseType: !120, size: 32, offset: 960)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !129, file: !128, line: 67, baseType: !166, size: 832, offset: 992)
!166 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 832, elements: !167)
!167 = !{!168}
!168 = !DISubrange(count: 26)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !129, file: !128, line: 68, baseType: !120, size: 32, offset: 1824)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !129, file: !128, line: 69, baseType: !124, size: 32, offset: 1856)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !129, file: !128, line: 70, baseType: !155, size: 160, offset: 1888)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !129, file: !128, line: 71, baseType: !120, size: 32, offset: 2048)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !129, file: !128, line: 72, baseType: !120, size: 32, offset: 2080)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !129, file: !128, line: 73, baseType: !124, size: 32, offset: 2112)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !129, file: !128, line: 74, baseType: !120, size: 32, offset: 2144)
!176 = !{!109}
!177 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!178 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !181)
!180 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!181 = !{!182, !213}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !179, file: !180, line: 60, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 32)
!184 = !DISubroutineType(types: !185)
!185 = !{!103, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 32)
!187 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !190)
!189 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!190 = !{!191, !195, !196, !197, !206, !207}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !188, file: !189, line: 380, baseType: !192, size: 32)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !188, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !188, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !188, file: !189, line: 386, baseType: !198, size: 32, offset: 96)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !200)
!200 = !{!201, !204}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !199, file: !189, line: 359, baseType: !202, size: 8)
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !203)
!203 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !199, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!205 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !188, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !188, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !189, line: 43, baseType: !211)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !212)
!212 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !179, file: !180, line: 65, baseType: !186, size: 32, offset: 32)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "static_regions", scope: !216, file: !225, line: 62, type: !364, isLocal: true, isDefinition: true)
!216 = distinct !DICompileUnit(language: DW_LANG_C99, file: !217, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !218, globals: !221, splitDebugInlining: false, nameTableKind: None)
!217 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/application_development/external_lib")
!218 = !{!219, !103, !121, !102}
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !220, line: 214, baseType: !32)
!220 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!221 = !{!222, !214}
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !224, file: !225, line: 198, type: !352, isLocal: true, isDefinition: true)
!224 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !225, file: !225, line: 175, type: !226, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !216, retainedNodes: !347)
!225 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!226 = !DISubroutineType(types: !227)
!227 = !{null, !228}
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !230, line: 245, size: 1024, elements: !231)
!230 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!231 = !{!232, !301, !314, !315, !316, !317, !323, !342}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !229, file: !230, line: 247, baseType: !233, size: 384)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !230, line: 57, size: 384, elements: !234)
!234 = !{!235, !263, !271, !272, !273, !286, !287, !288}
!235 = !DIDerivedType(tag: DW_TAG_member, scope: !233, file: !230, line: 60, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !233, file: !230, line: 60, size: 64, elements: !237)
!237 = !{!238, !254}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !236, file: !230, line: 61, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !240, line: 49, baseType: !241)
!240 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !240, line: 37, size: 64, elements: !242)
!242 = !{!243, !249}
!243 = !DIDerivedType(tag: DW_TAG_member, scope: !241, file: !240, line: 38, baseType: !244, size: 32)
!244 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !241, file: !240, line: 38, size: 32, elements: !245)
!245 = !{!246, !248}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !244, file: !240, line: 39, baseType: !247, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !244, file: !240, line: 40, baseType: !247, size: 32)
!249 = !DIDerivedType(tag: DW_TAG_member, scope: !241, file: !240, line: 42, baseType: !250, size: 32, offset: 32)
!250 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !241, file: !240, line: 42, size: 32, elements: !251)
!251 = !{!252, !253}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !250, file: !240, line: 43, baseType: !247, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !250, file: !240, line: 44, baseType: !247, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !236, file: !230, line: 62, baseType: !255, size: 64)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !256, line: 49, size: 64, elements: !257)
!256 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!257 = !{!258}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !255, file: !256, line: 50, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 64, elements: !261)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!261 = !{!262}
!262 = !DISubrange(count: 2)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !233, file: !230, line: 68, baseType: !264, size: 32, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !266, line: 233, baseType: !267)
!266 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !266, line: 231, size: 64, elements: !268)
!268 = !{!269}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !267, file: !266, line: 232, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !240, line: 48, baseType: !241)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !233, file: !230, line: 71, baseType: !202, size: 8, offset: 96)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !233, file: !230, line: 74, baseType: !202, size: 8, offset: 104)
!273 = !DIDerivedType(tag: DW_TAG_member, scope: !233, file: !230, line: 90, baseType: !274, size: 16, offset: 112)
!274 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !233, file: !230, line: 90, size: 16, elements: !275)
!275 = !{!276, !283}
!276 = !DIDerivedType(tag: DW_TAG_member, scope: !274, file: !230, line: 91, baseType: !277, size: 16)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !274, file: !230, line: 91, size: 16, elements: !278)
!278 = !{!279, !282}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !277, file: !230, line: 96, baseType: !280, size: 8)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !281)
!281 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !277, file: !230, line: 97, baseType: !202, size: 8, offset: 8)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !274, file: !230, line: 100, baseType: !284, size: 16)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !285)
!285 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !233, file: !230, line: 107, baseType: !121, size: 32, offset: 128)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !233, file: !230, line: 127, baseType: !102, size: 32, offset: 160)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !233, file: !230, line: 131, baseType: !289, size: 192, offset: 192)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !266, line: 244, size: 192, elements: !290)
!290 = !{!291, !292, !298}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !289, file: !266, line: 245, baseType: !239, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !289, file: !266, line: 246, baseType: !293, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !266, line: 242, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 32)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !297}
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !289, file: !266, line: 249, baseType: !299, size: 64, offset: 128)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !300)
!300 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !229, file: !230, line: 250, baseType: !302, size: 288, offset: 384)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !303, line: 25, size: 288, elements: !304)
!303 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!304 = !{!305, !306, !307, !308, !309, !310, !311, !312, !313}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !302, file: !303, line: 26, baseType: !121, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !302, file: !303, line: 27, baseType: !121, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !302, file: !303, line: 28, baseType: !121, size: 32, offset: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !302, file: !303, line: 29, baseType: !121, size: 32, offset: 96)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !302, file: !303, line: 30, baseType: !121, size: 32, offset: 128)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !302, file: !303, line: 31, baseType: !121, size: 32, offset: 160)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !302, file: !303, line: 32, baseType: !121, size: 32, offset: 192)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !302, file: !303, line: 33, baseType: !121, size: 32, offset: 224)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !302, file: !303, line: 34, baseType: !121, size: 32, offset: 256)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !229, file: !230, line: 253, baseType: !102, size: 32, offset: 672)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !229, file: !230, line: 256, baseType: !265, size: 64, offset: 704)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !229, file: !230, line: 294, baseType: !103, size: 32, offset: 768)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !229, file: !230, line: 300, baseType: !318, size: 96, offset: 800)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !230, line: 149, size: 96, elements: !319)
!319 = !{!320, !321, !322}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !318, file: !230, line: 153, baseType: !22, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !318, file: !230, line: 162, baseType: !219, size: 32, offset: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !318, file: !230, line: 168, baseType: !219, size: 32, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !229, file: !230, line: 325, baseType: !324, size: 32, offset: 896)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 32)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !326, line: 5073, size: 160, elements: !327)
!326 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!327 = !{!328, !337, !338}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !325, file: !326, line: 5074, baseType: !329, size: 96)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !330, line: 56, size: 96, elements: !331)
!330 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!331 = !{!332, !335, !336}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !329, file: !330, line: 57, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !330, line: 57, flags: DIFlagFwdDecl)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !329, file: !330, line: 58, baseType: !102, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !329, file: !330, line: 59, baseType: !219, size: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !325, file: !326, line: 5075, baseType: !265, size: 64, offset: 96)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !325, file: !326, line: 5076, baseType: !339, offset: 160)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !340, line: 43, elements: !341)
!340 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!341 = !{}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !229, file: !230, line: 343, baseType: !343, size: 64, offset: 928)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !303, line: 60, size: 64, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !343, file: !303, line: 63, baseType: !121, size: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !343, file: !303, line: 66, baseType: !121, size: 32, offset: 32)
!347 = !{!348, !349, !350, !351}
!348 = !DILocalVariable(name: "thread", arg: 1, scope: !224, file: !225, line: 175, type: !228)
!349 = !DILocalVariable(name: "region_num", scope: !224, file: !225, line: 200, type: !202)
!350 = !DILocalVariable(name: "guard_start", scope: !224, file: !225, line: 265, type: !22)
!351 = !DILocalVariable(name: "guard_size", scope: !224, file: !225, line: 266, type: !219)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 96, elements: !136)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !354, line: 52, size: 96, elements: !355)
!354 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!355 = !{!356, !357, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !353, file: !354, line: 53, baseType: !22, size: 32)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !353, file: !354, line: 54, baseType: !219, size: 32, offset: 32)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !353, file: !354, line: 55, baseType: !359, size: 32, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !360, line: 151, baseType: !361)
!360 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !360, line: 149, size: 32, elements: !362)
!362 = !{!363}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !361, file: !360, line: 150, baseType: !121, size: 32)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 96, elements: !136)
!365 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !368, file: !400, line: 39, type: !202, isLocal: true, isDefinition: true)
!368 = distinct !DICompileUnit(language: DW_LANG_C99, file: !369, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !370, globals: !399, splitDebugInlining: false, nameTableKind: None)
!369 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/application_development/external_lib")
!370 = !{!371, !102, !103, !387, !202}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !373, line: 1168, baseType: !374)
!373 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 1155, size: 352, elements: !375)
!375 = !{!376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !374, file: !373, line: 1157, baseType: !124, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !374, file: !373, line: 1158, baseType: !120, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !374, file: !373, line: 1159, baseType: !120, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !374, file: !373, line: 1160, baseType: !120, size: 32, offset: 96)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !374, file: !373, line: 1161, baseType: !120, size: 32, offset: 128)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !374, file: !373, line: 1162, baseType: !120, size: 32, offset: 160)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !374, file: !373, line: 1163, baseType: !120, size: 32, offset: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !374, file: !373, line: 1164, baseType: !120, size: 32, offset: 224)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !374, file: !373, line: 1165, baseType: !120, size: 32, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !374, file: !373, line: 1166, baseType: !120, size: 32, offset: 288)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !374, file: !373, line: 1167, baseType: !120, size: 32, offset: 320)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !389)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !390, line: 27, size: 96, elements: !391)
!390 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!391 = !{!392, !393, !394}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !389, file: !390, line: 29, baseType: !121, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !389, file: !390, line: 31, baseType: !192, size: 32, offset: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !389, file: !390, line: 37, baseType: !395, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !360, line: 146, baseType: !396)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !360, line: 141, size: 32, elements: !397)
!397 = !{!398}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !396, file: !360, line: 143, baseType: !121, size: 32)
!399 = !{!366}
!400 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !403, file: !410, line: 21, type: !106, isLocal: true, isDefinition: true)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !405, globals: !409, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/application_development/external_lib")
!405 = !{!406, !103, !102}
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !408, line: 22, baseType: !103)
!408 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = !{!401}
!410 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!411 = !DIGlobalVariableExpression(var: !412, expr: !DIExpression())
!412 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !413, file: !418, line: 13, type: !435, isLocal: true, isDefinition: true)
!413 = distinct !DICompileUnit(language: DW_LANG_C99, file: !414, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !415, splitDebugInlining: false, nameTableKind: None)
!414 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/application_development/external_lib")
!415 = !{!416, !411}
!416 = !DIGlobalVariableExpression(var: !417, expr: !DIExpression())
!417 = distinct !DIGlobalVariable(name: "mpu_config", scope: !413, file: !418, line: 37, type: !419, isLocal: false, isDefinition: true)
!418 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!419 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !420)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !390, line: 41, size: 64, elements: !421)
!421 = !{!422, !423}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !420, file: !390, line: 43, baseType: !121, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !420, file: !390, line: 45, baseType: !424, size: 32, offset: 32)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !426)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !390, line: 27, size: 96, elements: !427)
!427 = !{!428, !429, !430}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !426, file: !390, line: 29, baseType: !121, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !426, file: !390, line: 31, baseType: !192, size: 32, offset: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !426, file: !390, line: 37, baseType: !431, size: 32, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !360, line: 146, baseType: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !360, line: 141, size: 32, elements: !433)
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !432, file: !360, line: 143, baseType: !121, size: 32)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !425, size: 192, elements: !261)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !438, file: !495, line: 603, type: !497, isLocal: true, isDefinition: true, align: 32)
!438 = distinct !DICompileUnit(language: DW_LANG_C99, file: !439, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !440, globals: !492, splitDebugInlining: false, nameTableKind: None)
!439 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/application_development/external_lib")
!440 = !{!102, !103, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !444, line: 336, size: 160, elements: !445)
!444 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!445 = !{!446, !466, !470, !474, !487}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !443, file: !444, line: 365, baseType: !447, size: 32)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 32)
!448 = !DISubroutineType(types: !449)
!449 = !{!103, !450, !465}
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !453)
!453 = !{!454, !455, !456, !457, !463, !464}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !452, file: !189, line: 380, baseType: !192, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !452, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !452, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !452, file: !189, line: 386, baseType: !458, size: 32, offset: 96)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 32)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !460)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !459, file: !189, line: 359, baseType: !202, size: 8)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !459, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !452, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !452, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !443, file: !444, line: 366, baseType: !467, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !450, !203}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !443, file: !444, line: 374, baseType: !471, size: 32, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 32)
!472 = !DISubroutineType(types: !473)
!473 = !{!103, !450}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !443, file: !444, line: 377, baseType: !475, size: 32, offset: 96)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 32)
!476 = !DISubroutineType(types: !477)
!477 = !{!103, !450, !478}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !480)
!480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !444, line: 122, size: 64, elements: !481)
!481 = !{!482, !483, !484, !485, !486}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !480, file: !444, line: 123, baseType: !121, size: 32)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !480, file: !444, line: 124, baseType: !202, size: 8, offset: 32)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !480, file: !444, line: 125, baseType: !202, size: 8, offset: 40)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !480, file: !444, line: 126, baseType: !202, size: 8, offset: 48)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !480, file: !444, line: 127, baseType: !202, size: 8, offset: 56)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !443, file: !444, line: 379, baseType: !488, size: 32, offset: 128)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = !DISubroutineType(types: !490)
!490 = !{!103, !450, !491}
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 32)
!492 = !{!436, !493}
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !438, file: !495, line: 38, type: !496, isLocal: true, isDefinition: true)
!495 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!496 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !450)
!497 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !498, file: !180, line: 60, baseType: !471, size: 32)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !498, file: !180, line: 65, baseType: !450, size: 32, offset: 32)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !504, file: !509, line: 7, type: !510, isLocal: false, isDefinition: true, align: 16)
!504 = distinct !DICompileUnit(language: DW_LANG_C99, file: !505, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !506, splitDebugInlining: false, nameTableKind: None)
!505 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/application_development/external_lib/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/application_development/external_lib")
!506 = !{!502, !507}
!507 = !DIGlobalVariableExpression(var: !508, expr: !DIExpression())
!508 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !504, file: !509, line: 12, type: !510, isLocal: false, isDefinition: true, align: 16)
!509 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/application_development/external_lib")
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 48, elements: !152)
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "wdt_sam_cfg", scope: !513, file: !574, line: 234, type: !609, isLocal: true, isDefinition: true)
!513 = distinct !DICompileUnit(language: DW_LANG_C99, file: !514, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !515, globals: !571, splitDebugInlining: false, nameTableKind: None)
!514 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/application_development/external_lib")
!515 = !{!516, !121}
!516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !517, size: 32)
!517 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !518)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !519, line: 134, size: 128, elements: !520)
!519 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!520 = !{!521, !541, !546, !566}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !518, file: !519, line: 135, baseType: !522, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !519, line: 113, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 32)
!524 = !DISubroutineType(types: !525)
!525 = !{!103, !526, !202}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !529)
!529 = !{!530, !531, !532, !533, !539, !540}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !528, file: !189, line: 380, baseType: !192, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !528, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !528, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !528, file: !189, line: 386, baseType: !534, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 32)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !535, file: !189, line: 359, baseType: !202, size: 8)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !535, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !528, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !528, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "disable", scope: !518, file: !519, line: 136, baseType: !542, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_disable", file: !519, line: 119, baseType: !543)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 32)
!544 = !DISubroutineType(types: !545)
!545 = !{!103, !526}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "install_timeout", scope: !518, file: !519, line: 137, baseType: !547, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_install_timeout", file: !519, line: 125, baseType: !548)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!549 = !DISubroutineType(types: !550)
!550 = !{!103, !526, !551}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 32)
!552 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !553)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_timeout_cfg", file: !519, line: 88, size: 128, elements: !554)
!554 = !{!555, !560, !565}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !553, file: !519, line: 90, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_window", file: !519, line: 72, size: 64, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "min", scope: !556, file: !519, line: 74, baseType: !121, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "max", scope: !556, file: !519, line: 76, baseType: !121, size: 32, offset: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !553, file: !519, line: 92, baseType: !561, size: 32, offset: 64)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_callback_t", file: !519, line: 85, baseType: !562)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!563 = !DISubroutineType(types: !564)
!564 = !{null, !526, !103}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !553, file: !519, line: 104, baseType: !202, size: 8, offset: 96)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "feed", scope: !518, file: !519, line: 138, baseType: !567, size: 32, offset: 96)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_feed", file: !519, line: 132, baseType: !568)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!569 = !DISubroutineType(types: !570)
!570 = !{!103, !526, !103}
!571 = !{!572, !576, !578, !585, !511, !587, !589, !597}
!572 = !DIGlobalVariableExpression(var: !573, expr: !DIExpression())
!573 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !513, file: !574, line: 256, type: !575, isLocal: false, isDefinition: true, align: 16)
!574 = !DIFile(filename: "zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 80, elements: !156)
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "__device_dts_ord_26", scope: !513, file: !574, line: 256, type: !527, isLocal: false, isDefinition: true, align: 32)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_26", scope: !513, file: !574, line: 256, type: !580, isLocal: true, isDefinition: true, align: 32)
!580 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !581)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !581, file: !180, line: 60, baseType: !543, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !581, file: !180, line: 65, baseType: !526, size: 32, offset: 32)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_26", scope: !513, file: !574, line: 256, type: !535, isLocal: true, isDefinition: true, align: 8)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "wdt_sam_api", scope: !513, file: !574, line: 227, type: !517, isLocal: true, isDefinition: true)
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "wdt_sam_data", scope: !513, file: !574, line: 45, type: !591, isLocal: true, isDefinition: true)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_data", file: !574, line: 38, size: 96, elements: !592)
!592 = !{!593, !594, !595, !596}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !591, file: !574, line: 39, baseType: !561, size: 32)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !591, file: !574, line: 40, baseType: !121, size: 32, offset: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "timeout_valid", scope: !591, file: !574, line: 41, baseType: !205, size: 8, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "mode_set", scope: !591, file: !574, line: 42, baseType: !205, size: 8, offset: 72)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "__isr_wdt_sam_isr_irq_0", scope: !599, file: !574, line: 240, type: !602, isLocal: true, isDefinition: true, align: 32)
!599 = distinct !DISubprogram(name: "wdt_sam_irq_config", scope: !574, file: !574, line: 238, type: !600, scopeLine: 239, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !513, retainedNodes: !341)
!600 = !DISubroutineType(types: !601)
!601 = !{null}
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !603)
!603 = !{!604, !606, !607, !608}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !602, file: !10, line: 55, baseType: !605, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !602, file: !10, line: 57, baseType: !605, size: 32, offset: 32)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !602, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !602, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_sam_dev_cfg", file: !574, line: 34, size: 32, elements: !611)
!611 = !{!612}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !610, file: !574, line: 35, baseType: !613, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "Wdt", file: !615, line: 45, baseType: !616)
!615 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/wdt.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !615, line: 41, size: 96, elements: !617)
!617 = !{!618, !619, !620}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_CR", scope: !616, file: !615, line: 42, baseType: !120, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_MR", scope: !616, file: !615, line: 43, baseType: !120, size: 32, offset: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "WDT_SR", scope: !616, file: !615, line: 44, baseType: !124, size: 32, offset: 64)
!621 = !DIGlobalVariableExpression(var: !622, expr: !DIExpression())
!622 = distinct !DIGlobalVariable(name: "uart0_sam_config", scope: !623, file: !711, line: 494, type: !758, isLocal: true, isDefinition: true)
!623 = distinct !DICompileUnit(language: DW_LANG_C99, file: !624, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !625, retainedTypes: !658, globals: !708, splitDebugInlining: false, nameTableKind: None)
!624 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/application_development/external_lib")
!625 = !{!626, !633, !639, !646, !651}
!626 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_rx_stop_reason", file: !444, line: 47, baseType: !32, size: 32, elements: !627)
!627 = !{!628, !629, !630, !631, !632}
!628 = !DIEnumerator(name: "UART_ERROR_OVERRUN", value: 1)
!629 = !DIEnumerator(name: "UART_ERROR_PARITY", value: 2)
!630 = !DIEnumerator(name: "UART_ERROR_FRAMING", value: 4)
!631 = !DIEnumerator(name: "UART_BREAK", value: 8)
!632 = !DIEnumerator(name: "UART_ERROR_COLLISION", value: 16)
!633 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_stop_bits", file: !444, line: 84, baseType: !32, size: 32, elements: !634)
!634 = !{!635, !636, !637, !638}
!635 = !DIEnumerator(name: "UART_CFG_STOP_BITS_0_5", value: 0)
!636 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1", value: 1)
!637 = !DIEnumerator(name: "UART_CFG_STOP_BITS_1_5", value: 2)
!638 = !DIEnumerator(name: "UART_CFG_STOP_BITS_2", value: 3)
!639 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_data_bits", file: !444, line: 92, baseType: !32, size: 32, elements: !640)
!640 = !{!641, !642, !643, !644, !645}
!641 = !DIEnumerator(name: "UART_CFG_DATA_BITS_5", value: 0)
!642 = !DIEnumerator(name: "UART_CFG_DATA_BITS_6", value: 1)
!643 = !DIEnumerator(name: "UART_CFG_DATA_BITS_7", value: 2)
!644 = !DIEnumerator(name: "UART_CFG_DATA_BITS_8", value: 3)
!645 = !DIEnumerator(name: "UART_CFG_DATA_BITS_9", value: 4)
!646 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_flow_control", file: !444, line: 107, baseType: !32, size: 32, elements: !647)
!647 = !{!648, !649, !650}
!648 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_NONE", value: 0)
!649 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_RTS_CTS", value: 1)
!650 = !DIEnumerator(name: "UART_CFG_FLOW_CTRL_DTR_DSR", value: 2)
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "uart_config_parity", file: !444, line: 75, baseType: !32, size: 32, elements: !652)
!652 = !{!653, !654, !655, !656, !657}
!653 = !DIEnumerator(name: "UART_CFG_PARITY_NONE", value: 0)
!654 = !DIEnumerator(name: "UART_CFG_PARITY_ODD", value: 1)
!655 = !DIEnumerator(name: "UART_CFG_PARITY_EVEN", value: 2)
!656 = !DIEnumerator(name: "UART_CFG_PARITY_MARK", value: 3)
!657 = !DIEnumerator(name: "UART_CFG_PARITY_SPACE", value: 4)
!658 = !{!659, !102, !203, !121}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !444, line: 336, size: 160, elements: !662)
!662 = !{!663, !682, !686, !690, !703}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !661, file: !444, line: 365, baseType: !664, size: 32)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 32)
!665 = !DISubroutineType(types: !666)
!666 = !{!103, !667, !465}
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !670)
!670 = !{!671, !672, !673, !674, !680, !681}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !669, file: !189, line: 380, baseType: !192, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !669, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !669, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !669, file: !189, line: 386, baseType: !675, size: 32, offset: 96)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 32)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !677)
!677 = !{!678, !679}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !676, file: !189, line: 359, baseType: !202, size: 8)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !676, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !669, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !669, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !661, file: !444, line: 366, baseType: !683, size: 32, offset: 32)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 32)
!684 = !DISubroutineType(types: !685)
!685 = !{null, !667, !203}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !661, file: !444, line: 374, baseType: !687, size: 32, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 32)
!688 = !DISubroutineType(types: !689)
!689 = !{!103, !667}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !661, file: !444, line: 377, baseType: !691, size: 32, offset: 96)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = !DISubroutineType(types: !693)
!693 = !{!103, !667, !694}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !444, line: 122, size: 64, elements: !697)
!697 = !{!698, !699, !700, !701, !702}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !696, file: !444, line: 123, baseType: !121, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !696, file: !444, line: 124, baseType: !202, size: 8, offset: 32)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !696, file: !444, line: 125, baseType: !202, size: 8, offset: 40)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !696, file: !444, line: 126, baseType: !202, size: 8, offset: 48)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !696, file: !444, line: 127, baseType: !202, size: 8, offset: 56)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !661, file: !444, line: 379, baseType: !704, size: 32, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!705 = !DISubroutineType(types: !706)
!706 = !{!103, !667, !707}
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!708 = !{!709, !715, !717, !724, !726, !728, !621, !733, !752, !755}
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !623, file: !711, line: 494, type: !712, isLocal: false, isDefinition: true, align: 16)
!711 = !DIFile(filename: "zephyr/drivers/serial/uart_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !209, size: 96, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 6)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "__device_dts_ord_21", scope: !623, file: !711, line: 494, type: !668, isLocal: false, isDefinition: true, align: 32)
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_21", scope: !623, file: !711, line: 494, type: !719, isLocal: true, isDefinition: true, align: 32)
!719 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !720, file: !180, line: 60, baseType: !687, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !720, file: !180, line: 65, baseType: !667, size: 32, offset: 32)
!724 = !DIGlobalVariableExpression(var: !725, expr: !DIExpression())
!725 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_21", scope: !623, file: !711, line: 494, type: !676, isLocal: true, isDefinition: true, align: 8)
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "uart_sam_driver_api", scope: !623, file: !711, line: 419, type: !660, isLocal: true, isDefinition: true)
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "uart0_sam_data", scope: !623, file: !711, line: 494, type: !730, isLocal: true, isDefinition: true)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_sam_dev_data", file: !711, line: 38, size: 32, elements: !731)
!731 = !{!732}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "baud_rate", scope: !730, file: !711, line: 39, baseType: !121, size: 32)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "__pinctrl_dev_config__device_dts_ord_21", scope: !623, file: !711, line: 494, type: !735, isLocal: true, isDefinition: true)
!735 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_dev_config", file: !737, line: 60, size: 64, elements: !738)
!737 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!738 = !{!739, !751}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "states", scope: !736, file: !737, line: 69, baseType: !740, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_state", file: !737, line: 50, size: 64, elements: !743)
!743 = !{!744, !749, !750}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "pins", scope: !742, file: !737, line: 52, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "pinctrl_soc_pin_t", file: !748, line: 32, baseType: !121)
!748 = !DIFile(filename: "zephyr/include/zephyr/drivers/pinctrl/pinctrl_soc_sam_common.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!749 = !DIDerivedType(tag: DW_TAG_member, name: "pin_cnt", scope: !742, file: !737, line: 54, baseType: !202, size: 8, offset: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !742, file: !737, line: 56, baseType: !202, size: 8, offset: 40)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "state_cnt", scope: !736, file: !737, line: 71, baseType: !202, size: 8, offset: 32)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "__pinctrl_states__device_dts_ord_21", scope: !623, file: !711, line: 494, type: !754, isLocal: true, isDefinition: true)
!754 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 64, elements: !136)
!755 = !DIGlobalVariableExpression(var: !756, expr: !DIExpression())
!756 = distinct !DIGlobalVariable(name: "__pinctrl_state_pins_0__device_dts_ord_21", scope: !623, file: !711, line: 494, type: !757, isLocal: true, isDefinition: true)
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 64, elements: !261)
!758 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_sam_dev_cfg", file: !711, line: 27, size: 96, elements: !760)
!760 = !{!761, !790, !791}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !759, file: !711, line: 28, baseType: !762, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "Uart", file: !764, line: 62, baseType: !765)
!764 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !764, line: 41, size: 2368, elements: !766)
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "UART_CR", scope: !765, file: !764, line: 42, baseType: !120, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "UART_MR", scope: !765, file: !764, line: 43, baseType: !120, size: 32, offset: 32)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IER", scope: !765, file: !764, line: 44, baseType: !120, size: 32, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IDR", scope: !765, file: !764, line: 45, baseType: !120, size: 32, offset: 96)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "UART_IMR", scope: !765, file: !764, line: 46, baseType: !124, size: 32, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "UART_SR", scope: !765, file: !764, line: 47, baseType: !124, size: 32, offset: 160)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RHR", scope: !765, file: !764, line: 48, baseType: !124, size: 32, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "UART_THR", scope: !765, file: !764, line: 49, baseType: !120, size: 32, offset: 224)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "UART_BRGR", scope: !765, file: !764, line: 50, baseType: !120, size: 32, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !765, file: !764, line: 51, baseType: !777, size: 1760, offset: 288)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 1760, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 55)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RPR", scope: !765, file: !764, line: 52, baseType: !120, size: 32, offset: 2048)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RCR", scope: !765, file: !764, line: 53, baseType: !120, size: 32, offset: 2080)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TPR", scope: !765, file: !764, line: 54, baseType: !120, size: 32, offset: 2112)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TCR", scope: !765, file: !764, line: 55, baseType: !120, size: 32, offset: 2144)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RNPR", scope: !765, file: !764, line: 56, baseType: !120, size: 32, offset: 2176)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "UART_RNCR", scope: !765, file: !764, line: 57, baseType: !120, size: 32, offset: 2208)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TNPR", scope: !765, file: !764, line: 58, baseType: !120, size: 32, offset: 2240)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "UART_TNCR", scope: !765, file: !764, line: 59, baseType: !120, size: 32, offset: 2272)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "UART_PTCR", scope: !765, file: !764, line: 60, baseType: !120, size: 32, offset: 2304)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "UART_PTSR", scope: !765, file: !764, line: 61, baseType: !124, size: 32, offset: 2336)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "periph_id", scope: !759, file: !711, line: 29, baseType: !121, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "pcfg", scope: !759, file: !711, line: 30, baseType: !792, size: 32, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 32)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "overflow_cyc", scope: !795, file: !931, line: 65, type: !120, isLocal: true, isDefinition: true)
!795 = distinct !DICompileUnit(language: DW_LANG_C99, file: !796, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !797, retainedTypes: !851, globals: !928, splitDebugInlining: false, nameTableKind: None)
!796 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/timer/cortex_m_systick.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/application_development/external_lib")
!797 = !{!798}
!798 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !799, line: 57, baseType: !103, size: 32, elements: !800)
!799 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/sam3x8e.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!800 = !{!801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850}
!801 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!802 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!803 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!804 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!805 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!806 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!807 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!808 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!809 = !DIEnumerator(name: "SUPC_IRQn", value: 0)
!810 = !DIEnumerator(name: "RSTC_IRQn", value: 1)
!811 = !DIEnumerator(name: "RTC_IRQn", value: 2)
!812 = !DIEnumerator(name: "RTT_IRQn", value: 3)
!813 = !DIEnumerator(name: "WDT_IRQn", value: 4)
!814 = !DIEnumerator(name: "PMC_IRQn", value: 5)
!815 = !DIEnumerator(name: "EFC0_IRQn", value: 6)
!816 = !DIEnumerator(name: "EFC1_IRQn", value: 7)
!817 = !DIEnumerator(name: "UART_IRQn", value: 8)
!818 = !DIEnumerator(name: "SMC_IRQn", value: 9)
!819 = !DIEnumerator(name: "PIOA_IRQn", value: 11)
!820 = !DIEnumerator(name: "PIOB_IRQn", value: 12)
!821 = !DIEnumerator(name: "PIOC_IRQn", value: 13)
!822 = !DIEnumerator(name: "PIOD_IRQn", value: 14)
!823 = !DIEnumerator(name: "USART0_IRQn", value: 17)
!824 = !DIEnumerator(name: "USART1_IRQn", value: 18)
!825 = !DIEnumerator(name: "USART2_IRQn", value: 19)
!826 = !DIEnumerator(name: "USART3_IRQn", value: 20)
!827 = !DIEnumerator(name: "HSMCI_IRQn", value: 21)
!828 = !DIEnumerator(name: "TWI0_IRQn", value: 22)
!829 = !DIEnumerator(name: "TWI1_IRQn", value: 23)
!830 = !DIEnumerator(name: "SPI0_IRQn", value: 24)
!831 = !DIEnumerator(name: "SSC_IRQn", value: 26)
!832 = !DIEnumerator(name: "TC0_IRQn", value: 27)
!833 = !DIEnumerator(name: "TC1_IRQn", value: 28)
!834 = !DIEnumerator(name: "TC2_IRQn", value: 29)
!835 = !DIEnumerator(name: "TC3_IRQn", value: 30)
!836 = !DIEnumerator(name: "TC4_IRQn", value: 31)
!837 = !DIEnumerator(name: "TC5_IRQn", value: 32)
!838 = !DIEnumerator(name: "TC6_IRQn", value: 33)
!839 = !DIEnumerator(name: "TC7_IRQn", value: 34)
!840 = !DIEnumerator(name: "TC8_IRQn", value: 35)
!841 = !DIEnumerator(name: "PWM_IRQn", value: 36)
!842 = !DIEnumerator(name: "ADC_IRQn", value: 37)
!843 = !DIEnumerator(name: "DACC_IRQn", value: 38)
!844 = !DIEnumerator(name: "DMAC_IRQn", value: 39)
!845 = !DIEnumerator(name: "UOTGHS_IRQn", value: 40)
!846 = !DIEnumerator(name: "TRNG_IRQn", value: 41)
!847 = !DIEnumerator(name: "EMAC_IRQn", value: 42)
!848 = !DIEnumerator(name: "CAN0_IRQn", value: 43)
!849 = !DIEnumerator(name: "CAN1_IRQn", value: 44)
!850 = !DIEnumerator(name: "PERIPH_COUNT_IRQn", value: 45)
!851 = !{!852, !854, !605, !202, !121, !862, !895}
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !853, line: 46, baseType: !299)
!853 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !373, line: 712, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 706, size: 128, elements: !857)
!857 = !{!858, !859, !860, !861}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !856, file: !373, line: 708, baseType: !120, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !856, file: !373, line: 709, baseType: !120, size: 32, offset: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !856, file: !373, line: 710, baseType: !120, size: 32, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !856, file: !373, line: 711, baseType: !124, size: 32, offset: 96)
!862 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !863, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !373, line: 360, baseType: !864)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 345, size: 28704, elements: !865)
!865 = !{!866, !870, !874, !875, !876, !877, !878, !879, !880, !881, !885, !890, !894}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !864, file: !373, line: 347, baseType: !867, size: 256)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 256, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 8)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !864, file: !373, line: 348, baseType: !871, size: 768, offset: 256)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 768, elements: !872)
!872 = !{!873}
!873 = !DISubrange(count: 24)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !864, file: !373, line: 349, baseType: !867, size: 256, offset: 1024)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !864, file: !373, line: 350, baseType: !871, size: 768, offset: 1280)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !864, file: !373, line: 351, baseType: !867, size: 256, offset: 2048)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !864, file: !373, line: 352, baseType: !871, size: 768, offset: 2304)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !864, file: !373, line: 353, baseType: !867, size: 256, offset: 3072)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !864, file: !373, line: 354, baseType: !871, size: 768, offset: 3328)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !864, file: !373, line: 355, baseType: !867, size: 256, offset: 4096)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !864, file: !373, line: 356, baseType: !882, size: 1792, offset: 4352)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 1792, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 56)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !864, file: !373, line: 357, baseType: !886, size: 1920, offset: 6144)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !887, size: 1920, elements: !888)
!887 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !202)
!888 = !{!889}
!889 = !DISubrange(count: 240)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !864, file: !373, line: 358, baseType: !891, size: 20608, offset: 8064)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 20608, elements: !892)
!892 = !{!893}
!893 = !DISubrange(count: 644)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !864, file: !373, line: 359, baseType: !120, size: 32, offset: 28672)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !373, line: 402, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !373, line: 379, size: 1120, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !909, !910, !911, !912, !913, !914, !915, !916, !918, !919, !920, !924, !925, !927}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !897, file: !373, line: 381, baseType: !124, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !897, file: !373, line: 382, baseType: !120, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !897, file: !373, line: 383, baseType: !120, size: 32, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !897, file: !373, line: 384, baseType: !120, size: 32, offset: 96)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !897, file: !373, line: 385, baseType: !120, size: 32, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !897, file: !373, line: 386, baseType: !120, size: 32, offset: 160)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !897, file: !373, line: 387, baseType: !906, size: 96, offset: 192)
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !887, size: 96, elements: !907)
!907 = !{!908}
!908 = !DISubrange(count: 12)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !897, file: !373, line: 388, baseType: !120, size: 32, offset: 288)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !897, file: !373, line: 389, baseType: !120, size: 32, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !897, file: !373, line: 390, baseType: !120, size: 32, offset: 352)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !897, file: !373, line: 391, baseType: !120, size: 32, offset: 384)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !897, file: !373, line: 392, baseType: !120, size: 32, offset: 416)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !897, file: !373, line: 393, baseType: !120, size: 32, offset: 448)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !897, file: !373, line: 394, baseType: !120, size: 32, offset: 480)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !897, file: !373, line: 395, baseType: !917, size: 64, offset: 512)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 64, elements: !261)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !897, file: !373, line: 396, baseType: !124, size: 32, offset: 576)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !897, file: !373, line: 397, baseType: !124, size: 32, offset: 608)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !897, file: !373, line: 398, baseType: !921, size: 128, offset: 640)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 128, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 4)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !897, file: !373, line: 399, baseType: !155, size: 160, offset: 768)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !897, file: !373, line: 400, baseType: !926, size: 160, offset: 928)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 160, elements: !156)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !897, file: !373, line: 401, baseType: !120, size: 32, offset: 1088)
!928 = !{!929, !955, !958, !960, !962, !793}
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(name: "__init_sys_clock_driver_init", scope: !795, file: !931, line: 285, type: !932, isLocal: true, isDefinition: true, align: 32)
!931 = !DIFile(filename: "zephyr/drivers/timer/cortex_m_systick.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!932 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !180, line: 51, size: 64, elements: !934)
!934 = !{!935, !954}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !933, file: !180, line: 60, baseType: !936, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!937 = !DISubroutineType(types: !938)
!938 = !{!103, !939}
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !189, line: 378, size: 192, elements: !942)
!942 = !{!943, !944, !945, !946, !952, !953}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !941, file: !189, line: 380, baseType: !192, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !941, file: !189, line: 382, baseType: !13, size: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !941, file: !189, line: 384, baseType: !13, size: 32, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !941, file: !189, line: 386, baseType: !947, size: 32, offset: 96)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 32)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !189, line: 351, size: 16, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !948, file: !189, line: 359, baseType: !202, size: 8)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !948, file: !189, line: 364, baseType: !205, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !941, file: !189, line: 388, baseType: !102, size: 32, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !941, file: !189, line: 396, baseType: !208, size: 32, offset: 160)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !933, file: !180, line: 65, baseType: !939, size: 32, offset: 32)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(name: "lock", scope: !795, file: !931, line: 34, type: !957, isLocal: true, isDefinition: true)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !340, line: 43, elements: !341)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(name: "last_load", scope: !795, file: !931, line: 36, type: !121, isLocal: true, isDefinition: true)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(name: "cycle_count", scope: !795, file: !931, line: 48, type: !121, isLocal: true, isDefinition: true)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(name: "announced_cycles", scope: !795, file: !931, line: 54, type: !121, isLocal: true, isDefinition: true)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "sam_port_addrs", scope: !966, file: !1032, line: 21, type: !1033, isLocal: true, isDefinition: true)
!966 = distinct !DICompileUnit(language: DW_LANG_C99, file: !967, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !968, globals: !1029, splitDebugInlining: false, nameTableKind: None)
!967 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/pinctrl/pinctrl_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/application_development/external_lib")
!968 = !{!969}
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pio", file: !971, line: 96, baseType: !972)
!971 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !971, line: 41, size: 1888, elements: !973)
!973 = !{!974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PER", scope: !972, file: !971, line: 42, baseType: !120, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PDR", scope: !972, file: !971, line: 43, baseType: !120, size: 32, offset: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PSR", scope: !972, file: !971, line: 44, baseType: !124, size: 32, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !972, file: !971, line: 45, baseType: !135, size: 32, offset: 96)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OER", scope: !972, file: !971, line: 46, baseType: !120, size: 32, offset: 128)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ODR", scope: !972, file: !971, line: 47, baseType: !120, size: 32, offset: 160)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OSR", scope: !972, file: !971, line: 48, baseType: !124, size: 32, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !972, file: !971, line: 49, baseType: !135, size: 32, offset: 224)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IFER", scope: !972, file: !971, line: 50, baseType: !120, size: 32, offset: 256)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IFDR", scope: !972, file: !971, line: 51, baseType: !120, size: 32, offset: 288)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IFSR", scope: !972, file: !971, line: 52, baseType: !124, size: 32, offset: 320)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !972, file: !971, line: 53, baseType: !135, size: 32, offset: 352)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_SODR", scope: !972, file: !971, line: 54, baseType: !120, size: 32, offset: 384)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_CODR", scope: !972, file: !971, line: 55, baseType: !120, size: 32, offset: 416)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ODSR", scope: !972, file: !971, line: 56, baseType: !120, size: 32, offset: 448)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PDSR", scope: !972, file: !971, line: 57, baseType: !124, size: 32, offset: 480)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IER", scope: !972, file: !971, line: 58, baseType: !120, size: 32, offset: 512)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IDR", scope: !972, file: !971, line: 59, baseType: !120, size: 32, offset: 544)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IMR", scope: !972, file: !971, line: 60, baseType: !124, size: 32, offset: 576)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ISR", scope: !972, file: !971, line: 61, baseType: !124, size: 32, offset: 608)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_MDER", scope: !972, file: !971, line: 62, baseType: !120, size: 32, offset: 640)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_MDDR", scope: !972, file: !971, line: 63, baseType: !120, size: 32, offset: 672)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_MDSR", scope: !972, file: !971, line: 64, baseType: !124, size: 32, offset: 704)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !972, file: !971, line: 65, baseType: !135, size: 32, offset: 736)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PUDR", scope: !972, file: !971, line: 66, baseType: !120, size: 32, offset: 768)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PUER", scope: !972, file: !971, line: 67, baseType: !120, size: 32, offset: 800)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_PUSR", scope: !972, file: !971, line: 68, baseType: !124, size: 32, offset: 832)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !972, file: !971, line: 69, baseType: !135, size: 32, offset: 864)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_ABSR", scope: !972, file: !971, line: 70, baseType: !120, size: 32, offset: 896)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !972, file: !971, line: 71, baseType: !1004, size: 96, offset: 928)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !124, size: 96, elements: !152)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_SCIFSR", scope: !972, file: !971, line: 72, baseType: !120, size: 32, offset: 1024)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_DIFSR", scope: !972, file: !971, line: 73, baseType: !120, size: 32, offset: 1056)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_IFDGSR", scope: !972, file: !971, line: 74, baseType: !124, size: 32, offset: 1088)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_SCDR", scope: !972, file: !971, line: 75, baseType: !120, size: 32, offset: 1120)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !972, file: !971, line: 76, baseType: !921, size: 128, offset: 1152)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "PIO_OWER", scope: !972, file: !971, line: 77, baseType: !120, size: 32, offset: 1280)
