; ModuleID = 'build/adafruit_feather_m0_lora/subsys/portability/cmsis_rtos_v1/philosophers/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv6m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.os_semaphore_def = type { i32 }
%struct.os_semaphore_cb = type opaque
%struct.os_thread_def = type { void (i8*)*, i32, i32, i32, i8*, %struct.k_thread*, %struct.k_poll_signal*, %struct.k_poll_event*, i32, i8* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, %struct.z_poller, %struct.__thread_entry, %struct.k_thread*, [32 x i8], i8*, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }
%struct.z_poller = type { i8, i8 }
%struct.__thread_entry = type { void (i8*, i8*, i8*)*, i8*, i8*, i8* }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.os_semaphore_def }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/portability/cmsis_rtos_v1/philosophers/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/portability/cmsis_rtos_v1/philosophers")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 40, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/portability/cmsis_rtos_v1/philosophers")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1792, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 28)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 896, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "os_semaphore_def_0", scope: !27, file: !140, line: 34, type: !141, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !130, globals: !137, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/portability/cmsis_rtos_v1/philosophers/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/portability/cmsis_rtos_v1/philosophers")
!29 = !{!30, !49, !119}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 99, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/portability/cmsis_os.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48}
!34 = !DIEnumerator(name: "osOK", value: 0)
!35 = !DIEnumerator(name: "osEventSignal", value: 8)
!36 = !DIEnumerator(name: "osEventMessage", value: 16)
!37 = !DIEnumerator(name: "osEventMail", value: 32)
!38 = !DIEnumerator(name: "osEventTimeout", value: 64)
!39 = !DIEnumerator(name: "osErrorParameter", value: 128)
!40 = !DIEnumerator(name: "osErrorResource", value: 129)
!41 = !DIEnumerator(name: "osErrorTimeoutResource", value: 193)
!42 = !DIEnumerator(name: "osErrorISR", value: 130)
!43 = !DIEnumerator(name: "osErrorISRRecursive", value: 131)
!44 = !DIEnumerator(name: "osErrorPriority", value: 132)
!45 = !DIEnumerator(name: "osErrorNoMemory", value: 133)
!46 = !DIEnumerator(name: "osErrorValue", value: 134)
!47 = !DIEnumerator(name: "osErrorOS", value: 255)
!48 = !DIEnumerator(name: "os_status_reserved", value: 2147483647)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !50, line: 27, baseType: !32, size: 32, elements: !51)
!50 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!51 = !{!52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118}
!52 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!53 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!54 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!55 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!56 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!57 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!58 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!59 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!60 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!61 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!62 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!63 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!64 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!65 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!66 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!67 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!68 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!115 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!116 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!117 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!118 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!119 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !31, line: 82, baseType: !120, size: 32, elements: !121)
!120 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129}
!122 = !DIEnumerator(name: "osPriorityIdle", value: -3)
!123 = !DIEnumerator(name: "osPriorityLow", value: -2)
!124 = !DIEnumerator(name: "osPriorityBelowNormal", value: -1)
!125 = !DIEnumerator(name: "osPriorityNormal", value: 0)
!126 = !DIEnumerator(name: "osPriorityAboveNormal", value: 1)
!127 = !DIEnumerator(name: "osPriorityHigh", value: 2)
!128 = !DIEnumerator(name: "osPriorityRealtime", value: 3)
!129 = !DIEnumerator(name: "osPriorityError", value: 132)
!130 = !{!131, !133, !120, !134, !135}
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !132)
!132 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !136)
!136 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!137 = !{!25, !138, !146, !148, !150, !152, !154, !163, !401, !410, !413, !415, !417, !428}
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "os_semaphore_def_1", scope: !27, file: !140, line: 35, type: !141, isLocal: false, isDefinition: true)
!140 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v1/philosophers/src/phil_obj_abstract.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "osSemaphoreDef_t", file: !31, line: 196, baseType: !143)
!143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "os_semaphore_def", file: !31, line: 194, size: 32, elements: !144)
!144 = !{!145}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "dummy", scope: !143, file: !31, line: 195, baseType: !134, size: 32)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "os_semaphore_def_2", scope: !27, file: !140, line: 36, type: !141, isLocal: false, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "os_semaphore_def_3", scope: !27, file: !140, line: 37, type: !141, isLocal: false, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "os_semaphore_def_4", scope: !27, file: !140, line: 38, type: !141, isLocal: false, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "os_semaphore_def_5", scope: !27, file: !140, line: 39, type: !141, isLocal: false, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "forks", scope: !27, file: !156, line: 70, type: !157, isLocal: false, isDefinition: true)
!156 = !DIFile(filename: "zephyr/samples/subsys/portability/cmsis_rtos_v1/philosophers/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !158, size: 192, elements: !161)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "osSemaphoreId", file: !31, line: 149, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "os_semaphore_cb", file: !31, line: 149, flags: DIFlagFwdDecl)
!161 = !{!162}
!162 = !DISubrange(count: 6)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "os_thread_def_philosopher", scope: !27, file: !156, line: 177, type: !165, isLocal: true, isDefinition: true)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "osThreadDef_t", file: !31, line: 178, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "os_thread_def", file: !31, line: 166, size: 320, elements: !167)
!167 = !{!168, !170, !172, !173, !174, !175, !325, !332, !398, !400}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "pthread", scope: !166, file: !31, line: 167, baseType: !169, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "os_pthread", file: !31, line: 127, baseType: !16)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tpriority", scope: !166, file: !31, line: 168, baseType: !171, size: 32, offset: 32)
!171 = !DIDerivedType(tag: DW_TAG_typedef, name: "osPriority", file: !31, line: 91, baseType: !119)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "instances", scope: !166, file: !31, line: 169, baseType: !134, size: 32, offset: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "stacksize", scope: !166, file: !31, line: 170, baseType: !134, size: 32, offset: 96)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "stack_mem", scope: !166, file: !31, line: 171, baseType: !133, size: 32, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "cm_thread", scope: !166, file: !31, line: 172, baseType: !176, size: 32, offset: 160)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !178, line: 245, size: 1472, elements: !179)
!178 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!179 = !{!180, !251, !264, !265, !266, !272, !284, !285, !290, !291, !292, !300, !320}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !177, file: !178, line: 247, baseType: !181, size: 384)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !178, line: 57, size: 384, elements: !182)
!182 = !{!183, !211, !219, !222, !223, !236, !237, !238}
!183 = !DIDerivedType(tag: DW_TAG_member, scope: !181, file: !178, line: 60, baseType: !184, size: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !181, file: !178, line: 60, size: 64, elements: !185)
!185 = !{!186, !202}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !184, file: !178, line: 61, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !188, line: 49, baseType: !189)
!188 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !188, line: 37, size: 64, elements: !190)
!190 = !{!191, !197}
!191 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !188, line: 38, baseType: !192, size: 32)
!192 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !188, line: 38, size: 32, elements: !193)
!193 = !{!194, !196}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !192, file: !188, line: 39, baseType: !195, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !192, file: !188, line: 40, baseType: !195, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !188, line: 42, baseType: !198, size: 32, offset: 32)
!198 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !189, file: !188, line: 42, size: 32, elements: !199)
!199 = !{!200, !201}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !198, file: !188, line: 43, baseType: !195, size: 32)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !198, file: !188, line: 44, baseType: !195, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !184, file: !178, line: 62, baseType: !203, size: 64)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !204, line: 49, size: 64, elements: !205)
!204 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !203, file: !204, line: 50, baseType: !207, size: 64)
!207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !208, size: 64, elements: !209)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!209 = !{!210}
!210 = !DISubrange(count: 2)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !181, file: !178, line: 68, baseType: !212, size: 32, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !214, line: 233, baseType: !215)
!214 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !214, line: 231, size: 64, elements: !216)
!216 = !{!217}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !215, file: !214, line: 232, baseType: !218, size: 64)
!218 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !188, line: 48, baseType: !189)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !181, file: !178, line: 71, baseType: !220, size: 8, offset: 96)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !221)
!221 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !181, file: !178, line: 74, baseType: !220, size: 8, offset: 104)
!223 = !DIDerivedType(tag: DW_TAG_member, scope: !181, file: !178, line: 90, baseType: !224, size: 16, offset: 112)
!224 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !181, file: !178, line: 90, size: 16, elements: !225)
!225 = !{!226, !233}
!226 = !DIDerivedType(tag: DW_TAG_member, scope: !224, file: !178, line: 91, baseType: !227, size: 16)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !224, file: !178, line: 91, size: 16, elements: !228)
!228 = !{!229, !232}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !227, file: !178, line: 96, baseType: !230, size: 8)
!230 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !231)
!231 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !227, file: !178, line: 97, baseType: !220, size: 8, offset: 8)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !224, file: !178, line: 100, baseType: !234, size: 16)
!234 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !235)
!235 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !181, file: !178, line: 107, baseType: !134, size: 32, offset: 128)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !181, file: !178, line: 127, baseType: !133, size: 32, offset: 160)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !181, file: !178, line: 131, baseType: !239, size: 192, offset: 192)
!239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !214, line: 244, size: 192, elements: !240)
!240 = !{!241, !242, !248}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !239, file: !214, line: 245, baseType: !187, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !239, file: !214, line: 246, baseType: !243, size: 32, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !214, line: 242, baseType: !244)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 32)
!245 = !DISubroutineType(types: !246)
!246 = !{null, !247}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !239, file: !214, line: 249, baseType: !249, size: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !250)
!250 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !177, file: !178, line: 250, baseType: !252, size: 288, offset: 384)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !253, line: 25, size: 288, elements: !254)
!253 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!254 = !{!255, !256, !257, !258, !259, !260, !261, !262, !263}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !252, file: !253, line: 26, baseType: !134, size: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !252, file: !253, line: 27, baseType: !134, size: 32, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !252, file: !253, line: 28, baseType: !134, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !252, file: !253, line: 29, baseType: !134, size: 32, offset: 96)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !252, file: !253, line: 30, baseType: !134, size: 32, offset: 128)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !252, file: !253, line: 31, baseType: !134, size: 32, offset: 160)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !252, file: !253, line: 32, baseType: !134, size: 32, offset: 192)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !252, file: !253, line: 33, baseType: !134, size: 32, offset: 224)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !252, file: !253, line: 34, baseType: !134, size: 32, offset: 256)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !177, file: !178, line: 253, baseType: !133, size: 32, offset: 672)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !177, file: !178, line: 256, baseType: !213, size: 64, offset: 704)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !177, file: !178, line: 259, baseType: !267, size: 16, offset: 768)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_poller", file: !178, line: 236, size: 16, elements: !268)
!268 = !{!269, !271}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "is_polling", scope: !267, file: !178, line: 237, baseType: !270, size: 8)
!270 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !267, file: !178, line: 238, baseType: !220, size: 8, offset: 8)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "entry", scope: !177, file: !178, line: 271, baseType: !273, size: 128, offset: 800)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__thread_entry", file: !178, line: 34, size: 128, elements: !274)
!274 = !{!275, !281, !282, !283}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "pEntry", scope: !273, file: !178, line: 35, baseType: !276, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !277, line: 46, baseType: !278)
!277 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DISubroutineType(types: !280)
!280 = !{null, !133, !133, !133}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "parameter1", scope: !273, file: !178, line: 36, baseType: !133, size: 32, offset: 32)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "parameter2", scope: !273, file: !178, line: 37, baseType: !133, size: 32, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "parameter3", scope: !273, file: !178, line: 38, baseType: !133, size: 32, offset: 96)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "next_thread", scope: !177, file: !178, line: 274, baseType: !176, size: 32, offset: 928)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !177, file: !178, line: 279, baseType: !286, size: 256, offset: 960)
!286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 256, elements: !288)
!287 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!288 = !{!289}
!289 = !DISubrange(count: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "custom_data", scope: !177, file: !178, line: 284, baseType: !133, size: 32, offset: 1216)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !177, file: !178, line: 294, baseType: !120, size: 32, offset: 1248)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !177, file: !178, line: 300, baseType: !293, size: 96, offset: 1280)
!293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !178, line: 149, size: 96, elements: !294)
!294 = !{!295, !296, !299}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !293, file: !178, line: 153, baseType: !22, size: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !293, file: !178, line: 162, baseType: !297, size: 32, offset: 32)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !298, line: 214, baseType: !32)
!298 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!299 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !293, file: !178, line: 168, baseType: !297, size: 32, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !177, file: !178, line: 325, baseType: !301, size: 32, offset: 1376)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 32)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !303, line: 5073, size: 192, elements: !304)
!303 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!304 = !{!305, !314, !315}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !302, file: !303, line: 5074, baseType: !306, size: 96)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !307, line: 56, size: 96, elements: !308)
!307 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = !{!309, !312, !313}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !306, file: !307, line: 57, baseType: !310, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !307, line: 57, flags: DIFlagFwdDecl)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !306, file: !307, line: 58, baseType: !133, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !306, file: !307, line: 59, baseType: !297, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !302, file: !303, line: 5075, baseType: !213, size: 64, offset: 96)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !302, file: !303, line: 5076, baseType: !316, size: 32, offset: 160)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !317, line: 43, size: 32, elements: !318)
!317 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!318 = !{!319}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !316, file: !317, line: 52, baseType: !22, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !177, file: !178, line: 343, baseType: !321, size: 64, offset: 1408)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !253, line: 60, size: 64, elements: !322)
!322 = !{!323, !324}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !321, file: !253, line: 63, baseType: !134, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !321, file: !253, line: 66, baseType: !134, size: 32, offset: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "poll_signal", scope: !166, file: !31, line: 173, baseType: !326, size: 32, offset: 192)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !303, line: 5397, size: 128, elements: !328)
!328 = !{!329, !330, !331}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !327, file: !303, line: 5399, baseType: !218, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !327, file: !303, line: 5405, baseType: !32, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !327, file: !303, line: 5408, baseType: !120, size: 32, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "poll_event", scope: !166, file: !31, line: 174, baseType: !333, size: 32, offset: 224)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_event", file: !303, line: 5421, size: 160, elements: !335)
!335 = !{!336, !337, !339, !340, !341, !342, !343, !344}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !334, file: !303, line: 5423, baseType: !187, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "poller", scope: !334, file: !303, line: 5426, baseType: !338, size: 32, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !334, file: !303, line: 5429, baseType: !134, size: 8, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !334, file: !303, line: 5432, baseType: !134, size: 6, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !334, file: !303, line: 5435, baseType: !134, size: 7, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !334, file: !303, line: 5438, baseType: !134, size: 1, offset: 117, flags: DIFlagBitField, extraData: i64 96)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !334, file: !303, line: 5441, baseType: !134, size: 10, offset: 118, flags: DIFlagBitField, extraData: i64 96)
!344 = !DIDerivedType(tag: DW_TAG_member, scope: !334, file: !303, line: 5444, baseType: !345, size: 32, offset: 128)
!345 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !334, file: !303, line: 5444, size: 32, elements: !346)
!346 = !{!347, !348, !349, !357, !380, !382}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "obj", scope: !345, file: !303, line: 5445, baseType: !133, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !345, file: !303, line: 5446, baseType: !326, size: 32)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "sem", scope: !345, file: !303, line: 5447, baseType: !350, size: 32)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !303, line: 2909, size: 192, elements: !352)
!352 = !{!353, !354, !355, !356}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !351, file: !303, line: 2910, baseType: !213, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !351, file: !303, line: 2911, baseType: !32, size: 32, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !351, file: !303, line: 2912, baseType: !32, size: 32, offset: 96)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !351, file: !303, line: 2914, baseType: !218, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "fifo", scope: !345, file: !303, line: 5448, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 32)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_fifo", file: !303, line: 2208, size: 224, elements: !360)
!360 = !{!361}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_queue", scope: !359, file: !303, line: 2209, baseType: !362, size: 224)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !303, line: 1709, size: 224, elements: !363)
!363 = !{!364, !377, !378, !379}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !362, file: !303, line: 1710, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !366, line: 46, baseType: !367)
!366 = !DIFile(filename: "zephyr/include/zephyr/sys/sflist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !366, line: 41, size: 64, elements: !368)
!368 = !{!369, !376}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !367, file: !366, line: 42, baseType: !370, size: 32)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 32)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !366, line: 39, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !366, line: 35, size: 32, elements: !373)
!373 = !{!374}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !372, file: !366, line: 36, baseType: !375, size: 32)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !366, line: 32, baseType: !134)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !367, file: !366, line: 43, baseType: !370, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !362, file: !303, line: 1711, baseType: !316, size: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !362, file: !303, line: 1712, baseType: !213, size: 64, offset: 96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !362, file: !303, line: 1714, baseType: !218, size: 64, offset: 160)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !345, file: !303, line: 5449, baseType: !381, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "msgq", scope: !345, file: !303, line: 5450, baseType: !383, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 32)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !303, line: 4204, size: 416, elements: !385)
!385 = !{!386, !387, !388, !389, !390, !392, !393, !394, !395, !396, !397}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !384, file: !303, line: 4206, baseType: !213, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !384, file: !303, line: 4208, baseType: !316, size: 32, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !384, file: !303, line: 4210, baseType: !297, size: 32, offset: 96)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !384, file: !303, line: 4212, baseType: !134, size: 32, offset: 128)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !384, file: !303, line: 4214, baseType: !391, size: 32, offset: 160)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !384, file: !303, line: 4216, baseType: !391, size: 32, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !384, file: !303, line: 4218, baseType: !391, size: 32, offset: 224)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !384, file: !303, line: 4220, baseType: !391, size: 32, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !384, file: !303, line: 4222, baseType: !134, size: 32, offset: 288)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !384, file: !303, line: 4224, baseType: !218, size: 64, offset: 320)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !384, file: !303, line: 4227, baseType: !220, size: 8, offset: 384)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "signal_results", scope: !166, file: !31, line: 175, baseType: !399, size: 32, offset: 256)
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !120)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "status_mask", scope: !166, file: !31, line: 177, baseType: !133, size: 32, offset: 288)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "stacks_philosopher", scope: !27, file: !156, line: 177, type: !403, isLocal: true, isDefinition: true, align: 64)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 49152, elements: !408)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !405, line: 47, size: 8, elements: !406)
!405 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !404, file: !405, line: 48, baseType: !287, size: 8)
!408 = !{!162, !409}
!409 = !DISubrange(count: 1024)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "cm_thread_philosopher", scope: !27, file: !156, line: 177, type: !412, isLocal: true, isDefinition: true)
!412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 8832, elements: !161)
!413 = !DIGlobalVariableExpression(var: !414, expr: !DIExpression())
!414 = distinct !DIGlobalVariable(name: "wait_signal_philosopher", scope: !27, file: !156, line: 177, type: !327, isLocal: true, isDefinition: true)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "wait_events_philosopher", scope: !27, file: !156, line: 177, type: !334, isLocal: true, isDefinition: true)
!417 = !DIGlobalVariableExpression(var: !418, expr: !DIExpression())
!418 = distinct !DIGlobalVariable(name: "bitarray_philosopher", scope: !27, file: !156, line: 177, type: !419, isLocal: true, isDefinition: true)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_bitarray_t", file: !420, line: 33, baseType: !421)
!420 = !DIFile(filename: "zephyr/include/zephyr/sys/bitarray.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_bitarray", file: !420, line: 19, size: 128, elements: !422)
!422 = !{!423, !424, !425, !427}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "num_bits", scope: !421, file: !420, line: 21, baseType: !134, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "num_bundles", scope: !421, file: !420, line: 24, baseType: !134, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "bundles", scope: !421, file: !420, line: 27, baseType: !426, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !421, file: !420, line: 30, baseType: !316, size: 32, offset: 96)
!428 = !DIGlobalVariableExpression(var: !429, expr: !DIExpression())
!429 = distinct !DIGlobalVariable(name: "_sys_bitarray_bundles_bitarray_philosopher", scope: !27, file: !156, line: 177, type: !430, isLocal: true, isDefinition: true)
!430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 32, elements: !431)
!431 = !{!432}
!432 = !DISubrange(count: 1)
!433 = !DIGlobalVariableExpression(var: !434, expr: !DIExpression())
!434 = distinct !DIGlobalVariable(name: "_char_out", scope: !435, file: !440, line: 54, type: !441, isLocal: false, isDefinition: true)
!435 = distinct !DICompileUnit(language: DW_LANG_C99, file: !436, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !437, retainedTypes: !438, globals: !439, splitDebugInlining: false, nameTableKind: None)
!436 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/portability/cmsis_rtos_v1/philosophers")
!437 = !{!49}
!438 = !{!133, !120}
!439 = !{!433}
!440 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = !DISubroutineType(types: !443)
!443 = !{!120, !120}
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "__init_atmel_samd_init", scope: !446, file: !1175, line: 202, type: !1176, isLocal: true, isDefinition: true, align: 32)
!446 = distinct !DICompileUnit(language: DW_LANG_C99, file: !447, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !437, retainedTypes: !448, globals: !1174, splitDebugInlining: false, nameTableKind: None)
!447 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam0/common/./soc_samd2x.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_m0_lora/subsys/portability/cmsis_rtos_v1/philosophers")
!448 = !{!133, !120, !449, !571, !426, !910, !977}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "Nvmctrl", file: !451, line: 335, baseType: !452)
!451 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/nvmctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !451, line: 320, size: 288, elements: !453)
!453 = !{!454, !465, !471, !485, !496, !507, !511, !522, !523, !534, !535, !550, !551, !561}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLA", scope: !452, file: !451, line: 321, baseType: !455, size: 16)
!455 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLA_Type", file: !451, line: 50, baseType: !457)
!457 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !451, line: 43, size: 16, elements: !458)
!458 = !{!459, !464}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !457, file: !451, line: 48, baseType: !460, size: 16)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !457, file: !451, line: 44, size: 16, elements: !461)
!461 = !{!462, !463}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "CMD", scope: !460, file: !451, line: 45, baseType: !234, size: 7, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "CMDEX", scope: !460, file: !451, line: 47, baseType: !234, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !457, file: !451, line: 49, baseType: !234, size: 16)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !452, file: !451, line: 322, baseType: !466, size: 16, offset: 16)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 16, elements: !209)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "RoReg8", file: !468, line: 52, baseType: !469)
!468 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/samd21g18a.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !220)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "CTRLB", scope: !452, file: !451, line: 323, baseType: !472, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !473)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_CTRLB_Type", file: !451, line: 107, baseType: !474)
!474 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !451, line: 94, size: 32, elements: !475)
!475 = !{!476, !484}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !474, file: !451, line: 105, baseType: !477, size: 32)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !474, file: !451, line: 95, size: 32, elements: !478)
!478 = !{!479, !480, !481, !482, !483}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "RWS", scope: !477, file: !451, line: 97, baseType: !134, size: 4, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "MANW", scope: !477, file: !451, line: 99, baseType: !134, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPPRM", scope: !477, file: !451, line: 100, baseType: !134, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "READMODE", scope: !477, file: !451, line: 102, baseType: !134, size: 2, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "CACHEDIS", scope: !477, file: !451, line: 103, baseType: !134, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !474, file: !451, line: 106, baseType: !134, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "PARAM", scope: !452, file: !451, line: 324, baseType: !486, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !487)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_PARAM_Type", file: !451, line: 155, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !451, line: 148, size: 32, elements: !489)
!489 = !{!490, !495}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !488, file: !451, line: 153, baseType: !491, size: 32)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !488, file: !451, line: 149, size: 32, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "NVMP", scope: !491, file: !451, line: 150, baseType: !134, size: 16, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "PSZ", scope: !491, file: !451, line: 151, baseType: !134, size: 3, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !488, file: !451, line: 154, baseType: !134, size: 32)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !452, file: !451, line: 325, baseType: !497, size: 8, offset: 96)
!497 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !498)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENCLR_Type", file: !451, line: 194, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !451, line: 187, size: 8, elements: !500)
!500 = !{!501, !506}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !499, file: !451, line: 192, baseType: !502, size: 8)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !499, file: !451, line: 188, size: 8, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !502, file: !451, line: 189, baseType: !220, size: 1, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !502, file: !451, line: 190, baseType: !220, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !499, file: !451, line: 193, baseType: !220, size: 8)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !452, file: !451, line: 326, baseType: !508, size: 24, offset: 104)
!508 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 24, elements: !509)
!509 = !{!510}
!510 = !DISubrange(count: 3)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !452, file: !451, line: 327, baseType: !512, size: 8, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTENSET_Type", file: !451, line: 215, baseType: !514)
!514 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !451, line: 208, size: 8, elements: !515)
!515 = !{!516, !521}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !514, file: !451, line: 213, baseType: !517, size: 8)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !514, file: !451, line: 209, size: 8, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !517, file: !451, line: 210, baseType: !220, size: 1, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !517, file: !451, line: 211, baseType: !220, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !514, file: !451, line: 214, baseType: !220, size: 8)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !452, file: !451, line: 328, baseType: !508, size: 24, offset: 136)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !452, file: !451, line: 329, baseType: !524, size: 8, offset: 160)
!524 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_INTFLAG_Type", file: !451, line: 236, baseType: !526)
!526 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !451, line: 229, size: 8, elements: !527)
!527 = !{!528, !533}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !526, file: !451, line: 234, baseType: !529, size: 8)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !526, file: !451, line: 230, size: 8, elements: !530)
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !529, file: !451, line: 231, baseType: !469, size: 1, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "ERROR", scope: !529, file: !451, line: 232, baseType: !469, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !526, file: !451, line: 235, baseType: !220, size: 8)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !452, file: !451, line: 330, baseType: !508, size: 24, offset: 168)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "STATUS", scope: !452, file: !451, line: 331, baseType: !536, size: 16, offset: 192)
!536 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !537)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_STATUS_Type", file: !451, line: 262, baseType: !538)
!538 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !451, line: 250, size: 16, elements: !539)
!539 = !{!540, !549}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !538, file: !451, line: 260, baseType: !541, size: 16)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !538, file: !451, line: 251, size: 16, elements: !542)
!542 = !{!543, !544, !545, !546, !547, !548}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "PRM", scope: !541, file: !451, line: 252, baseType: !234, size: 1, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !541, file: !451, line: 253, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "PROGE", scope: !541, file: !451, line: 254, baseType: !234, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "LOCKE", scope: !541, file: !451, line: 255, baseType: !234, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "NVME", scope: !541, file: !451, line: 256, baseType: !234, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "SB", scope: !541, file: !451, line: 258, baseType: !234, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !538, file: !451, line: 261, baseType: !234, size: 16)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !452, file: !451, line: 332, baseType: !466, size: 16, offset: 208)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !452, file: !451, line: 333, baseType: !552, size: 32, offset: 224)
!552 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_ADDR_Type", file: !451, line: 290, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !451, line: 284, size: 32, elements: !555)
!555 = !{!556, !560}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !554, file: !451, line: 288, baseType: !557, size: 32)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !554, file: !451, line: 285, size: 32, elements: !558)
!558 = !{!559}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "ADDR", scope: !557, file: !451, line: 286, baseType: !134, size: 22, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !554, file: !451, line: 289, baseType: !134, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !452, file: !451, line: 334, baseType: !562, size: 16, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !563)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVMCTRL_LOCK_Type", file: !451, line: 308, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !451, line: 303, size: 16, elements: !565)
!565 = !{!566, !570}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !564, file: !451, line: 306, baseType: !567, size: 16)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !564, file: !451, line: 304, size: 16, elements: !568)
!568 = !{!569}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !567, file: !451, line: 305, baseType: !234, size: 16, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !564, file: !451, line: 307, baseType: !234, size: 16)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 32)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sysctrl", file: !573, line: 928, baseType: !574)
!573 = !DIFile(filename: "modules/hal/atmel/asf/sam0/include/samd21/component/sysctrl.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !573, line: 899, size: 672, elements: !575)
!575 = !{!576, !600, !624, !650, !675, !691, !692, !710, !711, !728, !739, !740, !755, !775, !776, !788, !800, !810, !811, !828, !832, !843, !844, !856, !868, !869, !880, !896}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !574, file: !573, line: 900, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENCLR_Type", file: !573, line: 64, baseType: !579)
!579 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 43, size: 32, elements: !580)
!580 = !{!581, !599}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !579, file: !573, line: 62, baseType: !582, size: 32)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !579, file: !573, line: 44, size: 32, elements: !583)
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !582, file: !573, line: 45, baseType: !134, size: 1, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !582, file: !573, line: 46, baseType: !134, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !582, file: !573, line: 47, baseType: !134, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !582, file: !573, line: 48, baseType: !134, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !582, file: !573, line: 49, baseType: !134, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !582, file: !573, line: 50, baseType: !134, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !582, file: !573, line: 51, baseType: !134, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !582, file: !573, line: 52, baseType: !134, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !582, file: !573, line: 53, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !582, file: !573, line: 54, baseType: !134, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !582, file: !573, line: 55, baseType: !134, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !582, file: !573, line: 56, baseType: !134, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !582, file: !573, line: 58, baseType: !134, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !582, file: !573, line: 59, baseType: !134, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !582, file: !573, line: 60, baseType: !134, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !579, file: !573, line: 63, baseType: !134, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !574, file: !573, line: 901, baseType: !601, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTENSET_Type", file: !573, line: 125, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 104, size: 32, elements: !604)
!604 = !{!605, !623}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !603, file: !573, line: 123, baseType: !606, size: 32)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !603, file: !573, line: 105, size: 32, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !606, file: !573, line: 106, baseType: !134, size: 1, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !606, file: !573, line: 107, baseType: !134, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !606, file: !573, line: 108, baseType: !134, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !606, file: !573, line: 109, baseType: !134, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !606, file: !573, line: 110, baseType: !134, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !606, file: !573, line: 111, baseType: !134, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !606, file: !573, line: 112, baseType: !134, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !606, file: !573, line: 113, baseType: !134, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !606, file: !573, line: 114, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !606, file: !573, line: 115, baseType: !134, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !606, file: !573, line: 116, baseType: !134, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !606, file: !573, line: 117, baseType: !134, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !606, file: !573, line: 119, baseType: !134, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !606, file: !573, line: 120, baseType: !134, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !606, file: !573, line: 121, baseType: !134, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !603, file: !573, line: 124, baseType: !134, size: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "INTFLAG", scope: !574, file: !573, line: 902, baseType: !625, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_INTFLAG_Type", file: !573, line: 186, baseType: !627)
!627 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 165, size: 32, elements: !628)
!628 = !{!629, !649}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !627, file: !573, line: 184, baseType: !630, size: 32)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !627, file: !573, line: 166, size: 32, elements: !631)
!631 = !{!632, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !630, file: !573, line: 167, baseType: !633, size: 1, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !134)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !630, file: !573, line: 168, baseType: !633, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !630, file: !573, line: 169, baseType: !633, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !630, file: !573, line: 170, baseType: !633, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !630, file: !573, line: 171, baseType: !633, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !630, file: !573, line: 172, baseType: !633, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !630, file: !573, line: 173, baseType: !633, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !630, file: !573, line: 174, baseType: !633, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !630, file: !573, line: 175, baseType: !633, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !630, file: !573, line: 176, baseType: !633, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !630, file: !573, line: 177, baseType: !633, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !630, file: !573, line: 178, baseType: !633, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !630, file: !573, line: 180, baseType: !633, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !630, file: !573, line: 181, baseType: !633, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !630, file: !573, line: 182, baseType: !633, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !627, file: !573, line: 185, baseType: !134, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "PCLKSR", scope: !574, file: !573, line: 903, baseType: !651, size: 32, offset: 96)
!651 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_PCLKSR_Type", file: !573, line: 247, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 226, size: 32, elements: !655)
!655 = !{!656, !674}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !654, file: !573, line: 245, baseType: !657, size: 32)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !654, file: !573, line: 227, size: 32, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "XOSCRDY", scope: !657, file: !573, line: 228, baseType: !134, size: 1, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32KRDY", scope: !657, file: !573, line: 229, baseType: !134, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32KRDY", scope: !657, file: !573, line: 230, baseType: !134, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8MRDY", scope: !657, file: !573, line: 231, baseType: !134, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRDY", scope: !657, file: !573, line: 232, baseType: !134, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLOOB", scope: !657, file: !573, line: 233, baseType: !134, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKF", scope: !657, file: !573, line: 234, baseType: !134, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLLCKC", scope: !657, file: !573, line: 235, baseType: !134, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLRCS", scope: !657, file: !573, line: 236, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33RDY", scope: !657, file: !573, line: 237, baseType: !134, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33DET", scope: !657, file: !573, line: 238, baseType: !134, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "B33SRDY", scope: !657, file: !573, line: 239, baseType: !134, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKR", scope: !657, file: !573, line: 241, baseType: !134, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLCKF", scope: !657, file: !573, line: 242, baseType: !134, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLLTO", scope: !657, file: !573, line: 243, baseType: !134, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !654, file: !573, line: 246, baseType: !134, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC", scope: !574, file: !573, line: 904, baseType: !676, size: 16, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !677)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC_Type", file: !573, line: 300, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 287, size: 16, elements: !679)
!679 = !{!680, !690}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !678, file: !573, line: 298, baseType: !681, size: 16)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !678, file: !573, line: 288, size: 16, elements: !682)
!682 = !{!683, !684, !685, !686, !687, !688, !689}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !681, file: !573, line: 290, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !681, file: !573, line: 291, baseType: !234, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !681, file: !573, line: 293, baseType: !234, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !681, file: !573, line: 294, baseType: !234, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "GAIN", scope: !681, file: !573, line: 295, baseType: !234, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "AMPGC", scope: !681, file: !573, line: 296, baseType: !234, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !681, file: !573, line: 297, baseType: !234, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !678, file: !573, line: 299, baseType: !234, size: 16)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !574, file: !573, line: 905, baseType: !466, size: 16, offset: 144)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "XOSC32K", scope: !574, file: !573, line: 906, baseType: !693, size: 16, offset: 160)
!693 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_XOSC32K_Type", file: !573, line: 352, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 336, size: 16, elements: !696)
!696 = !{!697, !709}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !695, file: !573, line: 350, baseType: !698, size: 16)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !695, file: !573, line: 337, size: 16, elements: !699)
!699 = !{!700, !701, !702, !703, !704, !705, !706, !707, !708}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !698, file: !573, line: 339, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "XTALEN", scope: !698, file: !573, line: 340, baseType: !234, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !698, file: !573, line: 341, baseType: !234, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !698, file: !573, line: 342, baseType: !234, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "AAMPEN", scope: !698, file: !573, line: 343, baseType: !234, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !698, file: !573, line: 344, baseType: !234, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !698, file: !573, line: 345, baseType: !234, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !698, file: !573, line: 346, baseType: !234, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !698, file: !573, line: 348, baseType: !234, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !695, file: !573, line: 351, baseType: !234, size: 16)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !574, file: !573, line: 907, baseType: !466, size: 16, offset: 176)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "OSC32K", scope: !574, file: !573, line: 908, baseType: !712, size: 32, offset: 192)
!712 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC32K_Type", file: !573, line: 398, baseType: !714)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 381, size: 32, elements: !715)
!715 = !{!716, !727}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !714, file: !573, line: 396, baseType: !717, size: 32)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !714, file: !573, line: 382, size: 32, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724, !725, !726}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !717, file: !573, line: 384, baseType: !134, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "EN32K", scope: !717, file: !573, line: 385, baseType: !134, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "EN1K", scope: !717, file: !573, line: 386, baseType: !134, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !717, file: !573, line: 388, baseType: !134, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !717, file: !573, line: 389, baseType: !134, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "STARTUP", scope: !717, file: !573, line: 390, baseType: !134, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !717, file: !573, line: 392, baseType: !134, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !717, file: !573, line: 394, baseType: !134, size: 7, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !714, file: !573, line: 397, baseType: !134, size: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "OSCULP32K", scope: !574, file: !573, line: 909, baseType: !729, size: 8, offset: 224)
!729 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSCULP32K_Type", file: !573, line: 433, baseType: !731)
!731 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 426, size: 8, elements: !732)
!732 = !{!733, !738}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !731, file: !573, line: 431, baseType: !734, size: 8)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !731, file: !573, line: 427, size: 8, elements: !735)
!735 = !{!736, !737}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !734, file: !573, line: 428, baseType: !220, size: 5, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "WRTLOCK", scope: !734, file: !573, line: 430, baseType: !220, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !731, file: !573, line: 432, baseType: !220, size: 8)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !574, file: !573, line: 910, baseType: !508, size: 24, offset: 232)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "OSC8M", scope: !574, file: !573, line: 911, baseType: !741, size: 32, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !742)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_OSC8M_Type", file: !573, line: 462, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 448, size: 32, elements: !744)
!744 = !{!745, !754}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !743, file: !573, line: 460, baseType: !746, size: 32)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !743, file: !573, line: 449, size: 32, elements: !747)
!747 = !{!748, !749, !750, !751, !752, !753}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !746, file: !573, line: 451, baseType: !134, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !746, file: !573, line: 453, baseType: !134, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !746, file: !573, line: 454, baseType: !134, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "PRESC", scope: !746, file: !573, line: 455, baseType: !134, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !746, file: !573, line: 457, baseType: !134, size: 12, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "FRANGE", scope: !746, file: !573, line: 459, baseType: !134, size: 2, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !743, file: !573, line: 461, baseType: !134, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLCTRL", scope: !574, file: !573, line: 912, baseType: !756, size: 16, offset: 288)
!756 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLCTRL_Type", file: !573, line: 520, baseType: !758)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 503, size: 16, elements: !759)
!759 = !{!760, !774}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !758, file: !573, line: 518, baseType: !761, size: 16)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !758, file: !573, line: 504, size: 16, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !761, file: !573, line: 506, baseType: !234, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !761, file: !573, line: 507, baseType: !234, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "STABLE", scope: !761, file: !573, line: 508, baseType: !234, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "LLAW", scope: !761, file: !573, line: 509, baseType: !234, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "USBCRM", scope: !761, file: !573, line: 510, baseType: !234, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !761, file: !573, line: 511, baseType: !234, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !761, file: !573, line: 512, baseType: !234, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "CCDIS", scope: !761, file: !573, line: 513, baseType: !234, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "QLDIS", scope: !761, file: !573, line: 514, baseType: !234, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "BPLCKC", scope: !761, file: !573, line: 515, baseType: !234, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "WAITLOCK", scope: !761, file: !573, line: 516, baseType: !234, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !758, file: !573, line: 519, baseType: !234, size: 16)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !574, file: !573, line: 913, baseType: !466, size: 16, offset: 304)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLVAL", scope: !574, file: !573, line: 914, baseType: !777, size: 32, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLVAL_Type", file: !573, line: 559, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 552, size: 32, elements: !780)
!780 = !{!781, !787}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !779, file: !573, line: 557, baseType: !782, size: 32)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !779, file: !573, line: 553, size: 32, elements: !783)
!783 = !{!784, !785, !786}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "FINE", scope: !782, file: !573, line: 554, baseType: !134, size: 10, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "COARSE", scope: !782, file: !573, line: 555, baseType: !134, size: 6, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "DIFF", scope: !782, file: !573, line: 556, baseType: !134, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !779, file: !573, line: 558, baseType: !134, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLMUL", scope: !574, file: !573, line: 915, baseType: !789, size: 32, offset: 352)
!789 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLMUL_Type", file: !573, line: 585, baseType: !791)
!791 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 578, size: 32, elements: !792)
!792 = !{!793, !799}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !791, file: !573, line: 583, baseType: !794, size: 32)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !791, file: !573, line: 579, size: 32, elements: !795)
!795 = !{!796, !797, !798}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "MUL", scope: !794, file: !573, line: 580, baseType: !134, size: 16, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "FSTEP", scope: !794, file: !573, line: 581, baseType: !134, size: 10, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "CSTEP", scope: !794, file: !573, line: 582, baseType: !134, size: 6, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !791, file: !573, line: 584, baseType: !134, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "DFLLSYNC", scope: !574, file: !573, line: 916, baseType: !801, size: 8, offset: 384)
!801 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DFLLSYNC_Type", file: !573, line: 610, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 604, size: 8, elements: !804)
!804 = !{!805, !809}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !803, file: !573, line: 608, baseType: !806, size: 8)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !803, file: !573, line: 605, size: 8, elements: !807)
!807 = !{!808}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "READREQ", scope: !806, file: !573, line: 607, baseType: !220, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !803, file: !573, line: 609, baseType: !220, size: 8)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !574, file: !573, line: 917, baseType: !508, size: 24, offset: 392)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "BOD33", scope: !574, file: !573, line: 918, baseType: !812, size: 32, offset: 416)
!812 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_BOD33_Type", file: !573, line: 639, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 622, size: 32, elements: !815)
!815 = !{!816, !827}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !814, file: !573, line: 637, baseType: !817, size: 32)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !814, file: !573, line: 623, size: 32, elements: !818)
!818 = !{!819, !820, !821, !822, !823, !824, !825, !826}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !817, file: !573, line: 625, baseType: !134, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "HYST", scope: !817, file: !573, line: 626, baseType: !134, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ACTION", scope: !817, file: !573, line: 627, baseType: !134, size: 2, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !817, file: !573, line: 629, baseType: !134, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "MODE", scope: !817, file: !573, line: 631, baseType: !134, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "CEN", scope: !817, file: !573, line: 632, baseType: !134, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "PSEL", scope: !817, file: !573, line: 634, baseType: !134, size: 4, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "LEVEL", scope: !817, file: !573, line: 635, baseType: !134, size: 6, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !814, file: !573, line: 638, baseType: !134, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !574, file: !573, line: 919, baseType: !829, size: 32, offset: 448)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !467, size: 32, elements: !830)
!830 = !{!831}
!831 = !DISubrange(count: 4)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "VREG", scope: !574, file: !573, line: 920, baseType: !833, size: 16, offset: 480)
!833 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREG_Type", file: !573, line: 715, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 706, size: 16, elements: !836)
!836 = !{!837, !842}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !835, file: !573, line: 713, baseType: !838, size: 16)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !835, file: !573, line: 707, size: 16, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !838, file: !573, line: 709, baseType: !234, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "FORCELDO", scope: !838, file: !573, line: 711, baseType: !234, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !835, file: !573, line: 714, baseType: !234, size: 16)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !574, file: !573, line: 921, baseType: !466, size: 16, offset: 496)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "VREF", scope: !574, file: !573, line: 922, baseType: !845, size: 32, offset: 512)
!845 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !846)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_VREF_Type", file: !573, line: 739, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 729, size: 32, elements: !848)
!848 = !{!849, !855}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !847, file: !573, line: 737, baseType: !850, size: 32)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !847, file: !573, line: 730, size: 32, elements: !851)
!851 = !{!852, !853, !854}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "TSEN", scope: !850, file: !573, line: 732, baseType: !134, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "BGOUTEN", scope: !850, file: !573, line: 733, baseType: !134, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !850, file: !573, line: 735, baseType: !134, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !847, file: !573, line: 738, baseType: !134, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLA", scope: !574, file: !573, line: 923, baseType: !857, size: 8, offset: 544)
!857 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLA_Type", file: !573, line: 765, baseType: !859)
!859 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 756, size: 8, elements: !860)
!860 = !{!861, !867}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !859, file: !573, line: 763, baseType: !862, size: 8)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !859, file: !573, line: 757, size: 8, elements: !863)
!863 = !{!864, !865, !866}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !862, file: !573, line: 759, baseType: !220, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "RUNSTDBY", scope: !862, file: !573, line: 761, baseType: !220, size: 1, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "ONDEMAND", scope: !862, file: !573, line: 762, baseType: !220, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !859, file: !573, line: 764, baseType: !220, size: 8)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved8", scope: !574, file: !573, line: 924, baseType: !508, size: 24, offset: 552)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLRATIO", scope: !574, file: !573, line: 925, baseType: !870, size: 32, offset: 576)
!870 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLRATIO_Type", file: !573, line: 789, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 781, size: 32, elements: !873)
!873 = !{!874, !879}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !872, file: !573, line: 787, baseType: !875, size: 32)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !872, file: !573, line: 782, size: 32, elements: !876)
!876 = !{!877, !878}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "LDR", scope: !875, file: !573, line: 783, baseType: !134, size: 12, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "LDRFRAC", scope: !875, file: !573, line: 785, baseType: !134, size: 4, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !872, file: !573, line: 788, baseType: !134, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLCTRLB", scope: !574, file: !573, line: 926, baseType: !881, size: 32, offset: 608)
!881 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLCTRLB_Type", file: !573, line: 820, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 805, size: 32, elements: !884)
!884 = !{!885, !895}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !883, file: !573, line: 818, baseType: !886, size: 32)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !883, file: !573, line: 806, size: 32, elements: !887)
!887 = !{!888, !889, !890, !891, !892, !893, !894}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "FILTER", scope: !886, file: !573, line: 807, baseType: !134, size: 2, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "LPEN", scope: !886, file: !573, line: 808, baseType: !134, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "WUF", scope: !886, file: !573, line: 809, baseType: !134, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "REFCLK", scope: !886, file: !573, line: 810, baseType: !134, size: 2, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "LTIME", scope: !886, file: !573, line: 812, baseType: !134, size: 3, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "LBYPASS", scope: !886, file: !573, line: 814, baseType: !134, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !886, file: !573, line: 816, baseType: !134, size: 11, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !883, file: !573, line: 819, baseType: !134, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "DPLLSTATUS", scope: !574, file: !573, line: 927, baseType: !897, size: 8, offset: 640)
!897 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !899)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCTRL_DPLLSTATUS_Type", file: !573, line: 881, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !573, line: 872, size: 8, elements: !901)
!901 = !{!902, !909}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "bit", scope: !900, file: !573, line: 879, baseType: !903, size: 8)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !900, file: !573, line: 873, size: 8, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "LOCK", scope: !903, file: !573, line: 874, baseType: !220, size: 1, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "CLKRDY", scope: !903, file: !573, line: 875, baseType: !220, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ENABLE", scope: !903, file: !573, line: 876, baseType: !220, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "DIV", scope: !903, file: !573, line: 877, baseType: !220, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
