; ModuleID = 'build/adafruit_feather_stm32f405/basic/minimal/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %union.anon.1, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/minimal/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/minimal")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 94, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/minimal")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 5248, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 82)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2624, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/minimal")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !111, file: !129, line: 56, type: !130, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !128, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/minimal")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !116, line: 369, baseType: !117)
!116 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f405xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 360, size: 224, elements: !118)
!118 = !{!119, !122, !123, !124, !125, !126, !127}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !117, file: !116, line: 362, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !117, file: !116, line: 363, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !117, file: !116, line: 364, baseType: !120, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !117, file: !116, line: 365, baseType: !120, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !117, file: !116, line: 366, baseType: !120, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !117, file: !116, line: 367, baseType: !120, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !117, file: !116, line: 368, baseType: !120, size: 32, offset: 192)
!128 = !{!109}
!129 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !165}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !131, file: !132, line: 60, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DISubroutineType(types: !137)
!137 = !{!103, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !{!143, !147, !148, !149, !158, !159}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !141, line: 380, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !140, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !140, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !140, file: !141, line: 386, baseType: !150, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !152)
!152 = !{!153, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !151, file: !141, line: 359, baseType: !154, size: 8)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !155)
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !151, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!157 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !140, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !141, line: 43, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !164)
!164 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !131, file: !132, line: 65, baseType: !138, size: 32, offset: 32)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !168, file: !171, line: 71, type: !172, isLocal: true, isDefinition: true, align: 32)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !170, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/minimal")
!170 = !{!166}
!171 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !174)
!174 = !{!175, !194}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !173, file: !132, line: 60, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DISubroutineType(types: !178)
!178 = !{!103, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !182)
!182 = !{!183, !184, !185, !186, !192, !193}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !141, line: 380, baseType: !144, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !181, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !181, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !181, file: !141, line: 386, baseType: !187, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !188, file: !141, line: 359, baseType: !154, size: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !188, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !181, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !173, file: !132, line: 65, baseType: !179, size: 32, offset: 32)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "static_regions", scope: !197, file: !206, line: 62, type: !347, isLocal: true, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !199, globals: !202, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/minimal")
!199 = !{!200, !103, !121, !102}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !201, line: 214, baseType: !32)
!201 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!202 = !{!203, !195}
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !205, file: !206, line: 198, type: !333, isLocal: true, isDefinition: true)
!205 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !206, file: !206, line: 175, type: !207, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !197, retainedNodes: !328)
!206 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!207 = !DISubroutineType(types: !208)
!208 = !{null, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !211, line: 245, size: 1024, elements: !212)
!211 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !{!213, !282, !295, !296, !297, !298, !304, !323}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !210, file: !211, line: 247, baseType: !214, size: 384)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !211, line: 57, size: 384, elements: !215)
!215 = !{!216, !244, !252, !253, !254, !267, !268, !269}
!216 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 60, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 60, size: 64, elements: !218)
!218 = !{!219, !235}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !217, file: !211, line: 61, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !221, line: 49, baseType: !222)
!221 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !221, line: 37, size: 64, elements: !223)
!223 = !{!224, !230}
!224 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 38, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 38, size: 32, elements: !226)
!226 = !{!227, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !225, file: !221, line: 39, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !221, line: 40, baseType: !228, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 42, baseType: !231, size: 32, offset: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 42, size: 32, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !231, file: !221, line: 43, baseType: !228, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !231, file: !221, line: 44, baseType: !228, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !217, file: !211, line: 62, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !237, line: 49, size: 64, elements: !238)
!237 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !236, file: !237, line: 50, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 64, elements: !242)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!242 = !{!243}
!243 = !DISubrange(count: 2)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !214, file: !211, line: 68, baseType: !245, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !247, line: 233, baseType: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 231, size: 64, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !248, file: !247, line: 232, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !221, line: 48, baseType: !222)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !214, file: !211, line: 71, baseType: !154, size: 8, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !214, file: !211, line: 74, baseType: !154, size: 8, offset: 104)
!254 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 90, baseType: !255, size: 16, offset: 112)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 90, size: 16, elements: !256)
!256 = !{!257, !264}
!257 = !DIDerivedType(tag: DW_TAG_member, scope: !255, file: !211, line: 91, baseType: !258, size: 16)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !255, file: !211, line: 91, size: 16, elements: !259)
!259 = !{!260, !263}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !258, file: !211, line: 96, baseType: !261, size: 8)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !262)
!262 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !258, file: !211, line: 97, baseType: !154, size: 8, offset: 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !255, file: !211, line: 100, baseType: !265, size: 16)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !266)
!266 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !214, file: !211, line: 107, baseType: !121, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !214, file: !211, line: 127, baseType: !102, size: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !214, file: !211, line: 131, baseType: !270, size: 192, offset: 192)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !247, line: 244, size: 192, elements: !271)
!271 = !{!272, !273, !279}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !270, file: !247, line: 245, baseType: !220, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !270, file: !247, line: 246, baseType: !274, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !247, line: 242, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !278}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !270, file: !247, line: 249, baseType: !280, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !281)
!281 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !210, file: !211, line: 250, baseType: !283, size: 288, offset: 384)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !284, line: 25, size: 288, elements: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !283, file: !284, line: 26, baseType: !121, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !283, file: !284, line: 27, baseType: !121, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !283, file: !284, line: 28, baseType: !121, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !283, file: !284, line: 29, baseType: !121, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !283, file: !284, line: 30, baseType: !121, size: 32, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !283, file: !284, line: 31, baseType: !121, size: 32, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !283, file: !284, line: 32, baseType: !121, size: 32, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !283, file: !284, line: 33, baseType: !121, size: 32, offset: 224)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !283, file: !284, line: 34, baseType: !121, size: 32, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !210, file: !211, line: 253, baseType: !102, size: 32, offset: 672)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !210, file: !211, line: 256, baseType: !246, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !210, file: !211, line: 294, baseType: !103, size: 32, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !210, file: !211, line: 300, baseType: !299, size: 96, offset: 800)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !211, line: 149, size: 96, elements: !300)
!300 = !{!301, !302, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !299, file: !211, line: 153, baseType: !22, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !299, file: !211, line: 162, baseType: !200, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !299, file: !211, line: 168, baseType: !200, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !210, file: !211, line: 325, baseType: !305, size: 32, offset: 896)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !307, line: 5073, size: 160, elements: !308)
!307 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = !{!309, !318, !319}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !306, file: !307, line: 5074, baseType: !310, size: 96)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !311, line: 56, size: 96, elements: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = !{!313, !316, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !310, file: !311, line: 57, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !311, line: 57, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !310, file: !311, line: 58, baseType: !102, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !310, file: !311, line: 59, baseType: !200, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !306, file: !307, line: 5075, baseType: !246, size: 64, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !306, file: !307, line: 5076, baseType: !320, offset: 160)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !321, line: 43, elements: !322)
!321 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = !{}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !210, file: !211, line: 343, baseType: !324, size: 64, offset: 928)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !284, line: 60, size: 64, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !324, file: !284, line: 63, baseType: !121, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !324, file: !284, line: 66, baseType: !121, size: 32, offset: 32)
!328 = !{!329, !330, !331, !332}
!329 = !DILocalVariable(name: "thread", arg: 1, scope: !205, file: !206, line: 175, type: !209)
!330 = !DILocalVariable(name: "region_num", scope: !205, file: !206, line: 200, type: !154)
!331 = !DILocalVariable(name: "guard_start", scope: !205, file: !206, line: 265, type: !22)
!332 = !DILocalVariable(name: "guard_size", scope: !205, file: !206, line: 266, type: !200)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 96, elements: !345)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !335, line: 52, size: 96, elements: !336)
!335 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!336 = !{!337, !338, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !334, file: !335, line: 53, baseType: !22, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !334, file: !335, line: 54, baseType: !200, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !334, file: !335, line: 55, baseType: !340, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !341, line: 151, baseType: !342)
!341 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 149, size: 32, elements: !343)
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !342, file: !341, line: 150, baseType: !121, size: 32)
!345 = !{!346}
!346 = !DISubrange(count: 1)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 96, elements: !345)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !351, file: !384, line: 39, type: !154, isLocal: true, isDefinition: true)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !353, globals: !383, splitDebugInlining: false, nameTableKind: None)
!352 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/minimal")
!353 = !{!354, !102, !103, !371, !154}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !356, line: 1226, baseType: !357)
!356 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !356, line: 1213, size: 352, elements: !358)
!358 = !{!359, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !357, file: !356, line: 1215, baseType: !360, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !357, file: !356, line: 1216, baseType: !120, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !357, file: !356, line: 1217, baseType: !120, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !357, file: !356, line: 1218, baseType: !120, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !357, file: !356, line: 1219, baseType: !120, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !357, file: !356, line: 1220, baseType: !120, size: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !357, file: !356, line: 1221, baseType: !120, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !357, file: !356, line: 1222, baseType: !120, size: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !357, file: !356, line: 1223, baseType: !120, size: 32, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !357, file: !356, line: 1224, baseType: !120, size: 32, offset: 288)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !357, file: !356, line: 1225, baseType: !120, size: 32, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !374, line: 27, size: 96, elements: !375)
!374 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!375 = !{!376, !377, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !373, file: !374, line: 29, baseType: !121, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !373, file: !374, line: 31, baseType: !144, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !373, file: !374, line: 37, baseType: !379, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !341, line: 146, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !341, line: 141, size: 32, elements: !381)
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !380, file: !341, line: 143, baseType: !121, size: 32)
!383 = !{!349}
!384 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !387, file: !394, line: 21, type: !106, isLocal: true, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !389, globals: !393, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/minimal")
!389 = !{!390, !103, !102}
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !392, line: 22, baseType: !103)
!392 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!393 = !{!385}
!394 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!395 = !DIGlobalVariableExpression(var: !396, expr: !DIExpression())
!396 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !397, file: !402, line: 13, type: !419, isLocal: true, isDefinition: true)
!397 = distinct !DICompileUnit(language: DW_LANG_C99, file: !398, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !399, splitDebugInlining: false, nameTableKind: None)
!398 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/minimal")
!399 = !{!400, !395}
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "mpu_config", scope: !397, file: !402, line: 37, type: !403, isLocal: false, isDefinition: true)
!402 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !374, line: 41, size: 64, elements: !405)
!405 = !{!406, !407}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !404, file: !374, line: 43, baseType: !121, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !404, file: !374, line: 45, baseType: !408, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !374, line: 27, size: 96, elements: !411)
!411 = !{!412, !413, !414}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !410, file: !374, line: 29, baseType: !121, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !410, file: !374, line: 31, baseType: !144, size: 32, offset: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !410, file: !374, line: 37, baseType: !415, size: 32, offset: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !341, line: 146, baseType: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !341, line: 141, size: 32, elements: !417)
!417 = !{!418}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !416, file: !341, line: 143, baseType: !121, size: 32)
!419 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 192, elements: !242)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !422, file: !527, line: 72, type: !611, isLocal: true, isDefinition: true)
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !424, retainedTypes: !513, globals: !524, splitDebugInlining: false, nameTableKind: None)
!423 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/minimal")
!424 = !{!30, !425}
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 65, baseType: !103, size: 32, elements: !426)
!426 = !{!427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!427 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!428 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!429 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!430 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!431 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!432 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!433 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!434 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!435 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!436 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!437 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!438 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!439 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!440 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!441 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!442 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!443 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!444 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!445 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!446 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!447 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!448 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!449 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!450 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!451 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!452 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!453 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!454 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!455 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!456 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!457 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!458 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!459 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!460 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!461 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!462 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!463 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!464 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!465 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!466 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!467 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!468 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!469 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!470 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!471 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!472 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!473 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!474 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!475 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!476 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!477 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!478 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!479 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!480 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!481 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!482 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!483 = !DIEnumerator(name: "FSMC_IRQn", value: 48)
!484 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!485 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!486 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!487 = !DIEnumerator(name: "UART4_IRQn", value: 52)
!488 = !DIEnumerator(name: "UART5_IRQn", value: 53)
!489 = !DIEnumerator(name: "TIM6_DAC_IRQn", value: 54)
!490 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!491 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!492 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!493 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!494 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!495 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!496 = !DIEnumerator(name: "CAN2_TX_IRQn", value: 63)
!497 = !DIEnumerator(name: "CAN2_RX0_IRQn", value: 64)
!498 = !DIEnumerator(name: "CAN2_RX1_IRQn", value: 65)
!499 = !DIEnumerator(name: "CAN2_SCE_IRQn", value: 66)
!500 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!501 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!502 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!503 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!504 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!505 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!506 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!507 = !DIEnumerator(name: "OTG_HS_EP1_OUT_IRQn", value: 74)
!508 = !DIEnumerator(name: "OTG_HS_EP1_IN_IRQn", value: 75)
!509 = !DIEnumerator(name: "OTG_HS_WKUP_IRQn", value: 76)
!510 = !DIEnumerator(name: "OTG_HS_IRQn", value: 77)
!511 = !DIEnumerator(name: "RNG_IRQn", value: 80)
!512 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!513 = !{!200, !103, !102, !514}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !116, line: 354, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 346, size: 192, elements: !517)
!517 = !{!518, !519, !520, !521, !522, !523}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !516, file: !116, line: 348, baseType: !120, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !516, file: !116, line: 349, baseType: !120, size: 32, offset: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !516, file: !116, line: 350, baseType: !120, size: 32, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !516, file: !116, line: 351, baseType: !120, size: 32, offset: 96)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !516, file: !116, line: 352, baseType: !120, size: 32, offset: 128)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !516, file: !116, line: 353, baseType: !120, size: 32, offset: 160)
!524 = !{!525, !531, !547, !558, !575, !420, !577, !591, !593, !595, !597, !599, !601, !603, !605, !607, !609}
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_37", scope: !422, file: !527, line: 424, type: !528, isLocal: false, isDefinition: true, align: 16)
!527 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!528 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !529)
!529 = !{!530}
!530 = !DISubrange(count: 4)
!531 = !DIGlobalVariableExpression(var: !532, expr: !DIExpression())
!532 = distinct !DIGlobalVariable(name: "__device_dts_ord_37", scope: !422, file: !527, line: 424, type: !533, isLocal: false, isDefinition: true, align: 32)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !535)
!535 = !{!536, !537, !538, !539, !545, !546}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !534, file: !141, line: 380, baseType: !144, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !534, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !534, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !534, file: !141, line: 386, baseType: !540, size: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !541, file: !141, line: 359, baseType: !154, size: 8)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !541, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !534, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !534, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_37", scope: !422, file: !527, line: 424, type: !549, isLocal: true, isDefinition: true, align: 32)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !551)
!551 = !{!552, !557}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !550, file: !132, line: 60, baseType: !553, size: 32)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 32)
!554 = !DISubroutineType(types: !555)
!555 = !{!103, !556}
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !550, file: !132, line: 65, baseType: !556, size: 32, offset: 32)
!558 = !DIGlobalVariableExpression(var: !559, expr: !DIExpression())
!559 = distinct !DIGlobalVariable(name: "exti_data", scope: !422, file: !527, line: 423, type: !560, isLocal: true, isDefinition: true)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !527, line: 107, size: 1472, elements: !561)
!561 = !{!562}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !560, file: !527, line: 109, baseType: !563, size: 1472)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 1472, elements: !573)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !527, line: 101, size: 64, elements: !565)
!565 = !{!566, !572}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !564, file: !527, line: 102, baseType: !567, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !568, line: 63, baseType: !569)
!568 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 32)
!570 = !DISubroutineType(types: !571)
!571 = !{null, !103, !102}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !564, file: !527, line: 103, baseType: !102, size: 32, offset: 32)
!573 = !{!574}
!574 = !DISubrange(count: 23)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_37", scope: !422, file: !527, line: 424, type: !541, isLocal: true, isDefinition: true, align: 8)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !579, file: !527, line: 493, type: !584, isLocal: true, isDefinition: true, align: 32)
!579 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !527, file: !527, line: 460, type: !580, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !422, retainedNodes: !582)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !556}
!582 = !{!583}
!583 = !DILocalVariable(name: "dev", arg: 1, scope: !579, file: !527, line: 460, type: !556)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !585)
!585 = !{!586, !588, !589, !590}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !584, file: !10, line: 55, baseType: !587, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !584, file: !10, line: 57, baseType: !587, size: 32, offset: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !584, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !584, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!591 = !DIGlobalVariableExpression(var: !592, expr: !DIExpression())
!592 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !579, file: !527, line: 497, type: !584, isLocal: true, isDefinition: true, align: 32)
!593 = !DIGlobalVariableExpression(var: !594, expr: !DIExpression())
!594 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !579, file: !527, line: 507, type: !584, isLocal: true, isDefinition: true, align: 32)
!595 = !DIGlobalVariableExpression(var: !596, expr: !DIExpression())
!596 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !579, file: !527, line: 512, type: !584, isLocal: true, isDefinition: true, align: 32)
!597 = !DIGlobalVariableExpression(var: !598, expr: !DIExpression())
!598 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !579, file: !527, line: 516, type: !584, isLocal: true, isDefinition: true, align: 32)
!599 = !DIGlobalVariableExpression(var: !600, expr: !DIExpression())
!600 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !579, file: !527, line: 523, type: !584, isLocal: true, isDefinition: true, align: 32)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !579, file: !527, line: 527, type: !584, isLocal: true, isDefinition: true, align: 32)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !579, file: !527, line: 581, type: !584, isLocal: true, isDefinition: true, align: 32)
!605 = !DIGlobalVariableExpression(var: !606, expr: !DIExpression())
!606 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !579, file: !527, line: 586, type: !584, isLocal: true, isDefinition: true, align: 32)
!607 = !DIGlobalVariableExpression(var: !608, expr: !DIExpression())
!608 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !579, file: !527, line: 591, type: !584, isLocal: true, isDefinition: true, align: 32)
!609 = !DIGlobalVariableExpression(var: !610, expr: !DIExpression())
!610 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !579, file: !527, line: 595, type: !584, isLocal: true, isDefinition: true, align: 32)
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !612, size: 736, elements: !573)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !116, line: 155, baseType: !425)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_37", scope: !616, file: !621, line: 23, type: !645, isLocal: false, isDefinition: true, align: 16)
!616 = distinct !DICompileUnit(language: DW_LANG_C99, file: !617, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !618, splitDebugInlining: false, nameTableKind: None)
!617 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/minimal/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/minimal")
!618 = !{!619, !614, !625, !627, !629, !631, !633, !635, !637, !639, !641, !643}
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !616, file: !621, line: 18, type: !622, isLocal: false, isDefinition: true, align: 16)
!621 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/minimal")
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 208, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 13)
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_73", scope: !616, file: !621, line: 30, type: !528, isLocal: false, isDefinition: true, align: 16)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_72", scope: !616, file: !621, line: 37, type: !528, isLocal: false, isDefinition: true, align: 16)
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_71", scope: !616, file: !621, line: 44, type: !528, isLocal: false, isDefinition: true, align: 16)
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_70", scope: !616, file: !621, line: 51, type: !528, isLocal: false, isDefinition: true, align: 16)
!633 = !DIGlobalVariableExpression(var: !634, expr: !DIExpression())
!634 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_69", scope: !616, file: !621, line: 58, type: !528, isLocal: false, isDefinition: true, align: 16)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_68", scope: !616, file: !621, line: 65, type: !528, isLocal: false, isDefinition: true, align: 16)
!637 = !DIGlobalVariableExpression(var: !638, expr: !DIExpression())
!638 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !616, file: !621, line: 72, type: !528, isLocal: false, isDefinition: true, align: 16)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_67", scope: !616, file: !621, line: 79, type: !528, isLocal: false, isDefinition: true, align: 16)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_74", scope: !616, file: !621, line: 86, type: !528, isLocal: false, isDefinition: true, align: 16)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_45", scope: !616, file: !621, line: 93, type: !528, isLocal: false, isDefinition: true, align: 16)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 48, elements: !646)
!646 = !{!647}
!647 = !DISubrange(count: 3)
!648 = !DIGlobalVariableExpression(var: !649, expr: !DIExpression())
!649 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !650, file: !711, line: 398, type: !744, isLocal: true, isDefinition: true)
!650 = distinct !DICompileUnit(language: DW_LANG_C99, file: !651, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !652, retainedTypes: !665, globals: !708, splitDebugInlining: false, nameTableKind: None)
!651 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/minimal")
!652 = !{!653, !30, !658}
!653 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !654, line: 197, baseType: !32, size: 32, elements: !655)
!654 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!655 = !{!656, !657}
!656 = !DIEnumerator(name: "SUCCESS", value: 0)
!657 = !DIEnumerator(name: "ERROR", value: 1)
!658 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !659, line: 44, baseType: !32, size: 32, elements: !660)
!659 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!660 = !{!661, !662, !663, !664}
!661 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!662 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!663 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!664 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!665 = !{!102, !103, !121, !666, !701, !707}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 532, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 500, size: 1088, elements: !669)
!669 = !{!670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !668, file: !116, line: 502, baseType: !120, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !668, file: !116, line: 503, baseType: !120, size: 32, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !668, file: !116, line: 504, baseType: !120, size: 32, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !668, file: !116, line: 505, baseType: !120, size: 32, offset: 96)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !668, file: !116, line: 506, baseType: !120, size: 32, offset: 128)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !668, file: !116, line: 507, baseType: !120, size: 32, offset: 160)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3RSTR", scope: !668, file: !116, line: 508, baseType: !120, size: 32, offset: 192)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !668, file: !116, line: 509, baseType: !121, size: 32, offset: 224)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !668, file: !116, line: 510, baseType: !120, size: 32, offset: 256)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !668, file: !116, line: 511, baseType: !120, size: 32, offset: 288)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !668, file: !116, line: 512, baseType: !681, size: 64, offset: 320)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, elements: !242)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !668, file: !116, line: 513, baseType: !120, size: 32, offset: 384)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !668, file: !116, line: 514, baseType: !120, size: 32, offset: 416)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3ENR", scope: !668, file: !116, line: 515, baseType: !120, size: 32, offset: 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !668, file: !116, line: 516, baseType: !121, size: 32, offset: 480)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !668, file: !116, line: 517, baseType: !120, size: 32, offset: 512)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !668, file: !116, line: 518, baseType: !120, size: 32, offset: 544)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !668, file: !116, line: 519, baseType: !681, size: 64, offset: 576)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !668, file: !116, line: 520, baseType: !120, size: 32, offset: 640)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !668, file: !116, line: 521, baseType: !120, size: 32, offset: 672)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "AHB3LPENR", scope: !668, file: !116, line: 522, baseType: !120, size: 32, offset: 704)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !668, file: !116, line: 523, baseType: !121, size: 32, offset: 736)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !668, file: !116, line: 524, baseType: !120, size: 32, offset: 768)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !668, file: !116, line: 525, baseType: !120, size: 32, offset: 800)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !668, file: !116, line: 526, baseType: !681, size: 64, offset: 832)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !668, file: !116, line: 527, baseType: !120, size: 32, offset: 896)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !668, file: !116, line: 528, baseType: !120, size: 32, offset: 928)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !668, file: !116, line: 529, baseType: !681, size: 64, offset: 960)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !668, file: !116, line: 530, baseType: !120, size: 32, offset: 1024)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !668, file: !116, line: 531, baseType: !120, size: 32, offset: 1056)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 32)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !703, line: 343, size: 64, elements: !704)
!703 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!704 = !{!705, !706}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !702, file: !703, line: 344, baseType: !121, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !702, file: !703, line: 345, baseType: !121, size: 32, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!708 = !{!709, !715, !731, !742, !648}
!709 = !DIGlobalVariableExpression(var: !710, expr: !DIExpression())
!710 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !650, file: !711, line: 752, type: !712, isLocal: false, isDefinition: true, align: 16)
!711 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 928, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 58)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !650, file: !711, line: 752, type: !717, isLocal: false, isDefinition: true, align: 32)
!717 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !719)
!719 = !{!720, !721, !722, !723, !729, !730}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !718, file: !141, line: 380, baseType: !144, size: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !718, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !718, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !718, file: !141, line: 386, baseType: !724, size: 32, offset: 96)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !726)
!726 = !{!727, !728}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !725, file: !141, line: 359, baseType: !154, size: 8)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !725, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !718, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !718, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!731 = !DIGlobalVariableExpression(var: !732, expr: !DIExpression())
!732 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !650, file: !711, line: 752, type: !733, isLocal: true, isDefinition: true, align: 32)
!733 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !734)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !735)
!735 = !{!736, !741}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !734, file: !132, line: 60, baseType: !737, size: 32)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 32)
!738 = !DISubroutineType(types: !739)
!739 = !{!103, !740}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !734, file: !132, line: 65, baseType: !740, size: 32, offset: 32)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !650, file: !711, line: 752, type: !725, isLocal: true, isDefinition: true, align: 8)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !659, line: 100, size: 224, elements: !745)
!745 = !{!746, !752, !753, !762, !767, !772, !778}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !744, file: !659, line: 101, baseType: !747, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !659, line: 76, baseType: !748)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!749 = !DISubroutineType(types: !750)
!750 = !{!103, !740, !751}
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !659, line: 56, baseType: !102)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !744, file: !659, line: 102, baseType: !747, size: 32, offset: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !744, file: !659, line: 103, baseType: !754, size: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !659, line: 83, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = !DISubroutineType(types: !757)
!757 = !{!103, !740, !751, !758, !102}
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !659, line: 72, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!760 = !DISubroutineType(types: !761)
!761 = !{null, !740, !751, !102}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !744, file: !659, line: 104, baseType: !763, size: 32, offset: 96)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !659, line: 79, baseType: !764)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = !DISubroutineType(types: !766)
!766 = !{!103, !740, !751, !707}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !744, file: !659, line: 105, baseType: !768, size: 32, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !659, line: 88, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 32)
!770 = !DISubroutineType(types: !771)
!771 = !{!658, !740, !751}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !744, file: !659, line: 106, baseType: !773, size: 32, offset: 160)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !659, line: 92, baseType: !774)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!775 = !DISubroutineType(types: !776)
!776 = !{!103, !740, !751, !777}
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !659, line: 64, baseType: !102)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !744, file: !659, line: 107, baseType: !779, size: 32, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !659, line: 96, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DISubroutineType(types: !782)
!782 = !{!103, !740, !751, !102}
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !785, file: !842, line: 603, type: !844, isLocal: true, isDefinition: true, align: 32)
!785 = distinct !DICompileUnit(language: DW_LANG_C99, file: !786, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !787, globals: !839, splitDebugInlining: false, nameTableKind: None)
!786 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/minimal")
!787 = !{!102, !103, !788}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !791, line: 336, size: 160, elements: !792)
!791 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!792 = !{!793, !813, !817, !821, !834}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !790, file: !791, line: 365, baseType: !794, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 32)
!795 = !DISubroutineType(types: !796)
!796 = !{!103, !797, !812}
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 32)
!798 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !800)
!800 = !{!801, !802, !803, !804, !810, !811}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !799, file: !141, line: 380, baseType: !144, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !799, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !799, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !799, file: !141, line: 386, baseType: !805, size: 32, offset: 96)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 32)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !806, file: !141, line: 359, baseType: !154, size: 8)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !806, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !799, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !799, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !790, file: !791, line: 366, baseType: !814, size: 32, offset: 32)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DISubroutineType(types: !816)
!816 = !{null, !797, !155}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !790, file: !791, line: 374, baseType: !818, size: 32, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DISubroutineType(types: !820)
!820 = !{!103, !797}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !790, file: !791, line: 377, baseType: !822, size: 32, offset: 96)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 32)
!823 = !DISubroutineType(types: !824)
!824 = !{!103, !797, !825}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !791, line: 122, size: 64, elements: !828)
!828 = !{!829, !830, !831, !832, !833}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !827, file: !791, line: 123, baseType: !121, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !827, file: !791, line: 124, baseType: !154, size: 8, offset: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !827, file: !791, line: 125, baseType: !154, size: 8, offset: 40)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !827, file: !791, line: 126, baseType: !154, size: 8, offset: 48)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !827, file: !791, line: 127, baseType: !154, size: 8, offset: 56)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !790, file: !791, line: 379, baseType: !835, size: 32, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 32)
!836 = !DISubroutineType(types: !837)
!837 = !{!103, !797, !838}
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 32)
!839 = !{!783, !840}
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !785, file: !842, line: 38, type: !843, isLocal: true, isDefinition: true)
!842 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !797)
!844 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !845, file: !132, line: 60, baseType: !818, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !845, file: !132, line: 65, baseType: !797, size: 32, offset: 32)
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !851, file: !1021, line: 762, type: !1140, isLocal: true, isDefinition: true)
!851 = distinct !DICompileUnit(language: DW_LANG_C99, file: !852, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !853, retainedTypes: !871, globals: !1018, splitDebugInlining: false, nameTableKind: None)
!852 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/adafruit_feather_stm32f405/basic/minimal")
!853 = !{!30, !854, !860, !865, !658}
!854 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !855, line: 506, baseType: !32, size: 32, elements: !856)
!855 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!856 = !{!857, !858, !859}
!857 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!858 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!859 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!860 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !855, line: 512, baseType: !32, size: 32, elements: !861)
!861 = !{!862, !863, !864}
!862 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!863 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!864 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!865 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !568, line: 43, baseType: !32, size: 32, elements: !866)
!866 = !{!867, !868, !869, !870}
!867 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!868 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!869 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!870 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!871 = !{!102, !103, !872, !942, !947, !907, !860, !854, !952, !953, !121, !967, !922, !977, !978, !979}
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !874)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !855, line: 523, size: 288, elements: !875)
!875 = !{!876, !897, !903, !908, !912, !913, !914, !918, !938}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !874, file: !855, line: 524, baseType: !877, size: 32)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!878 = !DISubroutineType(types: !879)
!879 = !{!103, !880, !895, !896}
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !883)
!883 = !{!884, !885, !886, !887, !893, !894}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !882, file: !141, line: 380, baseType: !144, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !882, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !882, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !882, file: !141, line: 386, baseType: !888, size: 32, offset: 96)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !890)
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !889, file: !141, line: 359, baseType: !154, size: 8)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !889, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !882, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !882, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !855, line: 237, baseType: !154)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !855, line: 257, baseType: !121)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !874, file: !855, line: 530, baseType: !898, size: 32, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 32)
!899 = !DISubroutineType(types: !900)
!900 = !{!103, !880, !901}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !855, line: 229, baseType: !121)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !874, file: !855, line: 532, baseType: !904, size: 32, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = !DISubroutineType(types: !906)
!906 = !{!103, !880, !907, !902}
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !855, line: 216, baseType: !121)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !874, file: !855, line: 535, baseType: !909, size: 32, offset: 96)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 32)
!910 = !DISubroutineType(types: !911)
!911 = !{!103, !880, !907}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !874, file: !855, line: 537, baseType: !909, size: 32, offset: 128)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !874, file: !855, line: 539, baseType: !909, size: 32, offset: 160)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !874, file: !855, line: 541, baseType: !915, size: 32, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 32)
!916 = !DISubroutineType(types: !917)
!917 = !{!103, !880, !895, !854, !860}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !874, file: !855, line: 544, baseType: !919, size: 32, offset: 224)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 32)
!920 = !DISubroutineType(types: !921)
!921 = !{!103, !880, !922, !157}
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !855, line: 478, size: 96, elements: !924)
!924 = !{!925, !932, !937}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !923, file: !855, line: 482, baseType: !926, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !927, line: 33, baseType: !928)
!927 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !927, line: 29, size: 32, elements: !929)
!929 = !{!930}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !928, file: !927, line: 30, baseType: !931, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 32)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !923, file: !855, line: 485, baseType: !933, size: 32, offset: 32)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !855, line: 464, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DISubroutineType(types: !936)
!936 = !{null, !880, !922, !907}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !923, file: !855, line: 493, baseType: !907, size: 32, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !874, file: !855, line: 547, baseType: !939, size: 32, offset: 256)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 32)
!940 = !DISubroutineType(types: !941)
!941 = !{!121, !880}
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !944)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !855, line: 428, size: 32, elements: !945)
!945 = !{!946}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !944, file: !855, line: 434, baseType: !907, size: 32)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !855, line: 441, size: 32, elements: !950)
!950 = !{!951}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !949, file: !855, line: 447, baseType: !907, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !116, line: 441, baseType: !955)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 430, size: 320, elements: !956)
!956 = !{!957, !958, !959, !960, !961, !962, !963, !964, !965}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !955, file: !116, line: 432, baseType: !120, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !955, file: !116, line: 433, baseType: !120, size: 32, offset: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !955, file: !116, line: 434, baseType: !120, size: 32, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !955, file: !116, line: 435, baseType: !120, size: 32, offset: 96)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !955, file: !116, line: 436, baseType: !120, size: 32, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !955, file: !116, line: 437, baseType: !120, size: 32, offset: 160)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !955, file: !116, line: 438, baseType: !120, size: 32, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !955, file: !116, line: 439, baseType: !120, size: 32, offset: 224)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !955, file: !116, line: 440, baseType: !966, size: 64, offset: 256)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !242)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !116, line: 454, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 447, size: 288, elements: !970)
!970 = !{!971, !972, !973, !975, !976}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !969, file: !116, line: 449, baseType: !120, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !969, file: !116, line: 450, baseType: !120, size: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !969, file: !116, line: 451, baseType: !974, size: 128, offset: 64)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !529)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !969, file: !116, line: 452, baseType: !681, size: 64, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !969, file: !116, line: 453, baseType: !120, size: 32, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 32)
!980 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !659, line: 100, size: 224, elements: !982)
!982 = !{!983, !988, !989, !998, !1003, !1008, !1013}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !981, file: !659, line: 101, baseType: !984, size: 32)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !659, line: 76, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 32)
!986 = !DISubroutineType(types: !987)
!987 = !{!103, !880, !751}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !981, file: !659, line: 102, baseType: !984, size: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !981, file: !659, line: 103, baseType: !990, size: 32, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !659, line: 83, baseType: !991)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = !DISubroutineType(types: !993)
!993 = !{!103, !880, !751, !994, !102}
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !659, line: 72, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DISubroutineType(types: !997)
!997 = !{null, !880, !751, !102}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !981, file: !659, line: 104, baseType: !999, size: 32, offset: 96)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !659, line: 79, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!103, !880, !751, !707}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !981, file: !659, line: 105, baseType: !1004, size: 32, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !659, line: 88, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 32)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!658, !880, !751}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !981, file: !659, line: 106, baseType: !1009, size: 32, offset: 160)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !659, line: 92, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 32)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!103, !880, !751, !777}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !981, file: !659, line: 107, baseType: !1014, size: 32, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !659, line: 96, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!103, !880, !751, !102}
!1018 = !{!1019, !1025, !1027, !1037, !1042, !1044, !1046, !1048, !1050, !1052, !1054, !1056, !1058, !1060, !1062, !1064, !1066, !1068, !1070, !1072, !1074, !1076, !1078, !1080, !1082, !1084, !1086, !1088, !1102, !1104, !1106, !1108, !1110, !1112, !1114, !1116, !1118, !1120, !1122, !1124, !1126, !1128, !1130, !1132, !1134, !849, !1136, !1138, !1151, !1153, !1155, !1157, !1159, !1161, !1163}
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_74", scope: !851, file: !1021, line: 762, type: !1022, isLocal: false, isDefinition: true, align: 16)
!1021 = !DIFile(filename: "zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 96, elements: !1023)
!1023 = !{!1024}
!1024 = !DISubrange(count: 6)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(name: "__device_dts_ord_74", scope: !851, file: !1021, line: 762, type: !881, isLocal: false, isDefinition: true, align: 32)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_74", scope: !851, file: !1021, line: 762, type: !1029, isLocal: true, isDefinition: true, align: 32)
!1029 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !1031)
!1031 = !{!1032, !1036}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1030, file: !132, line: 60, baseType: !1033, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 32)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!103, !880}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1030, file: !132, line: 65, baseType: !880, size: 32, offset: 32)
!1037 = !DIGlobalVariableExpression(var: !1038, expr: !DIExpression())
!1038 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_67", scope: !851, file: !1021, line: 766, type: !1039, isLocal: false, isDefinition: true, align: 16)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 80, elements: !1040)
!1040 = !{!1041}
!1041 = !DISubrange(count: 5)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(name: "__device_dts_ord_67", scope: !851, file: !1021, line: 766, type: !881, isLocal: false, isDefinition: true, align: 32)
!1044 = !DIGlobalVariableExpression(var: !1045, expr: !DIExpression())
!1045 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_67", scope: !851, file: !1021, line: 766, type: !1029, isLocal: true, isDefinition: true, align: 32)
!1046 = !DIGlobalVariableExpression(var: !1047, expr: !DIExpression())
!1047 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !851, file: !1021, line: 770, type: !1022, isLocal: false, isDefinition: true, align: 16)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(name: "__device_dts_ord_21", scope: !851, file: !1021, line: 770, type: !881, isLocal: false, isDefinition: true, align: 32)
!1050 = !DIGlobalVariableExpression(var: !1051, expr: !DIExpression())
!1051 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_21", scope: !851, file: !1021, line: 770, type: !1029, isLocal: true, isDefinition: true, align: 32)
!1052 = !DIGlobalVariableExpression(var: !1053, expr: !DIExpression())
