; ModuleID = 'build/96b_argonkey/drivers/ipm/ipm_mcux/remote/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %union.anon.1 }
%union.anon.1 = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %union.anon.1 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.stm32_exti_data = type { [23 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %union.anon.1, i32*, i32, %struct._thread_arch }
%struct._thread_arch = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/drivers/ipm/ipm_mcux/remote/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/drivers/ipm/ipm_mcux/remote")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 109, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/drivers/ipm/ipm_mcux/remote")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 6208, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 97)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 3104, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/drivers/ipm/ipm_mcux/remote")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_st_stm32f4_init", scope: !111, file: !129, line: 56, type: !130, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !128, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/drivers/ipm/ipm_mcux/remote")
!113 = !{!114}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "FLASH_TypeDef", file: !116, line: 379, baseType: !117)
!116 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f412cx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 370, size: 224, elements: !118)
!118 = !{!119, !122, !123, !124, !125, !126, !127}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ACR", scope: !117, file: !116, line: 372, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "KEYR", scope: !117, file: !116, line: 373, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "OPTKEYR", scope: !117, file: !116, line: 374, baseType: !120, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "SR", scope: !117, file: !116, line: 375, baseType: !120, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !117, file: !116, line: 376, baseType: !120, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR", scope: !117, file: !116, line: 377, baseType: !120, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "OPTCR1", scope: !117, file: !116, line: 378, baseType: !120, size: 32, offset: 192)
!128 = !{!109}
!129 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32f4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !165}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !131, file: !132, line: 60, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DISubroutineType(types: !137)
!137 = !{!103, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !140)
!140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !142)
!141 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!142 = !{!143, !147, !148, !149, !158, !159}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !140, file: !141, line: 380, baseType: !144, size: 32)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !146)
!146 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !140, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !140, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !140, file: !141, line: 386, baseType: !150, size: 32, offset: 96)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !152)
!152 = !{!153, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !151, file: !141, line: 359, baseType: !154, size: 8)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !155)
!155 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !151, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!157 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !140, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !140, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !162)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !141, line: 43, baseType: !163)
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !164)
!164 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !131, file: !132, line: 65, baseType: !138, size: 32, offset: 32)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !168, file: !171, line: 71, type: !172, isLocal: true, isDefinition: true, align: 32)
!168 = distinct !DICompileUnit(language: DW_LANG_C99, file: !169, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !170, splitDebugInlining: false, nameTableKind: None)
!169 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/drivers/ipm/ipm_mcux/remote")
!170 = !{!166}
!171 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!172 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !173)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !174)
!174 = !{!175, !194}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !173, file: !132, line: 60, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DISubroutineType(types: !178)
!178 = !{!103, !179}
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !182)
!182 = !{!183, !184, !185, !186, !192, !193}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !141, line: 380, baseType: !144, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !181, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !181, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !181, file: !141, line: 386, baseType: !187, size: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 32)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !189)
!189 = !{!190, !191}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !188, file: !141, line: 359, baseType: !154, size: 8)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !188, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !181, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !181, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !173, file: !132, line: 65, baseType: !179, size: 32, offset: 32)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "static_regions", scope: !197, file: !206, line: 62, type: !347, isLocal: true, isDefinition: true)
!197 = distinct !DICompileUnit(language: DW_LANG_C99, file: !198, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !199, globals: !202, splitDebugInlining: false, nameTableKind: None)
!198 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/drivers/ipm/ipm_mcux/remote")
!199 = !{!200, !103, !121, !102}
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !201, line: 214, baseType: !32)
!201 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!202 = !{!203, !195}
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !205, file: !206, line: 198, type: !333, isLocal: true, isDefinition: true)
!205 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !206, file: !206, line: 175, type: !207, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !197, retainedNodes: !328)
!206 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!207 = !DISubroutineType(types: !208)
!208 = !{null, !209}
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !211, line: 245, size: 1024, elements: !212)
!211 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !{!213, !282, !295, !296, !297, !298, !304, !323}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !210, file: !211, line: 247, baseType: !214, size: 384)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !211, line: 57, size: 384, elements: !215)
!215 = !{!216, !244, !252, !253, !254, !267, !268, !269}
!216 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 60, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 60, size: 64, elements: !218)
!218 = !{!219, !235}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !217, file: !211, line: 61, baseType: !220, size: 64)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !221, line: 49, baseType: !222)
!221 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !221, line: 37, size: 64, elements: !223)
!223 = !{!224, !230}
!224 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 38, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 38, size: 32, elements: !226)
!226 = !{!227, !229}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !225, file: !221, line: 39, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !222, size: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !225, file: !221, line: 40, baseType: !228, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, scope: !222, file: !221, line: 42, baseType: !231, size: 32, offset: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !222, file: !221, line: 42, size: 32, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !231, file: !221, line: 43, baseType: !228, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !231, file: !221, line: 44, baseType: !228, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !217, file: !211, line: 62, baseType: !236, size: 64)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !237, line: 49, size: 64, elements: !238)
!237 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !236, file: !237, line: 50, baseType: !240, size: 64)
!240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !241, size: 64, elements: !242)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 32)
!242 = !{!243}
!243 = !DISubrange(count: 2)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !214, file: !211, line: 68, baseType: !245, size: 32, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !247, line: 233, baseType: !248)
!247 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !247, line: 231, size: 64, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !248, file: !247, line: 232, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !221, line: 48, baseType: !222)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !214, file: !211, line: 71, baseType: !154, size: 8, offset: 96)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !214, file: !211, line: 74, baseType: !154, size: 8, offset: 104)
!254 = !DIDerivedType(tag: DW_TAG_member, scope: !214, file: !211, line: 90, baseType: !255, size: 16, offset: 112)
!255 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !214, file: !211, line: 90, size: 16, elements: !256)
!256 = !{!257, !264}
!257 = !DIDerivedType(tag: DW_TAG_member, scope: !255, file: !211, line: 91, baseType: !258, size: 16)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !255, file: !211, line: 91, size: 16, elements: !259)
!259 = !{!260, !263}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !258, file: !211, line: 96, baseType: !261, size: 8)
!261 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !262)
!262 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !258, file: !211, line: 97, baseType: !154, size: 8, offset: 8)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !255, file: !211, line: 100, baseType: !265, size: 16)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !266)
!266 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !214, file: !211, line: 107, baseType: !121, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !214, file: !211, line: 127, baseType: !102, size: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !214, file: !211, line: 131, baseType: !270, size: 192, offset: 192)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !247, line: 244, size: 192, elements: !271)
!271 = !{!272, !273, !279}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !270, file: !247, line: 245, baseType: !220, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !270, file: !247, line: 246, baseType: !274, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !247, line: 242, baseType: !275)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DISubroutineType(types: !277)
!277 = !{null, !278}
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !270, file: !247, line: 249, baseType: !280, size: 64, offset: 128)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !281)
!281 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !210, file: !211, line: 250, baseType: !283, size: 288, offset: 384)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !284, line: 25, size: 288, elements: !285)
!284 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !{!286, !287, !288, !289, !290, !291, !292, !293, !294}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !283, file: !284, line: 26, baseType: !121, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !283, file: !284, line: 27, baseType: !121, size: 32, offset: 32)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !283, file: !284, line: 28, baseType: !121, size: 32, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !283, file: !284, line: 29, baseType: !121, size: 32, offset: 96)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !283, file: !284, line: 30, baseType: !121, size: 32, offset: 128)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !283, file: !284, line: 31, baseType: !121, size: 32, offset: 160)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !283, file: !284, line: 32, baseType: !121, size: 32, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !283, file: !284, line: 33, baseType: !121, size: 32, offset: 224)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !283, file: !284, line: 34, baseType: !121, size: 32, offset: 256)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !210, file: !211, line: 253, baseType: !102, size: 32, offset: 672)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !210, file: !211, line: 256, baseType: !246, size: 64, offset: 704)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !210, file: !211, line: 294, baseType: !103, size: 32, offset: 768)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !210, file: !211, line: 300, baseType: !299, size: 96, offset: 800)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !211, line: 149, size: 96, elements: !300)
!300 = !{!301, !302, !303}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !299, file: !211, line: 153, baseType: !22, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !299, file: !211, line: 162, baseType: !200, size: 32, offset: 32)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !299, file: !211, line: 168, baseType: !200, size: 32, offset: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !210, file: !211, line: 325, baseType: !305, size: 32, offset: 896)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !307, line: 5073, size: 160, elements: !308)
!307 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = !{!309, !318, !319}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !306, file: !307, line: 5074, baseType: !310, size: 96)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !311, line: 56, size: 96, elements: !312)
!311 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!312 = !{!313, !316, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !310, file: !311, line: 57, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 32)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !311, line: 57, flags: DIFlagFwdDecl)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !310, file: !311, line: 58, baseType: !102, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !310, file: !311, line: 59, baseType: !200, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !306, file: !307, line: 5075, baseType: !246, size: 64, offset: 96)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !306, file: !307, line: 5076, baseType: !320, offset: 160)
!320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !321, line: 43, elements: !322)
!321 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = !{}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !210, file: !211, line: 343, baseType: !324, size: 64, offset: 928)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !284, line: 60, size: 64, elements: !325)
!325 = !{!326, !327}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !324, file: !284, line: 63, baseType: !121, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !324, file: !284, line: 66, baseType: !121, size: 32, offset: 32)
!328 = !{!329, !330, !331, !332}
!329 = !DILocalVariable(name: "thread", arg: 1, scope: !205, file: !206, line: 175, type: !209)
!330 = !DILocalVariable(name: "region_num", scope: !205, file: !206, line: 200, type: !154)
!331 = !DILocalVariable(name: "guard_start", scope: !205, file: !206, line: 265, type: !22)
!332 = !DILocalVariable(name: "guard_size", scope: !205, file: !206, line: 266, type: !200)
!333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 96, elements: !345)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !335, line: 52, size: 96, elements: !336)
!335 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!336 = !{!337, !338, !339}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !334, file: !335, line: 53, baseType: !22, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !334, file: !335, line: 54, baseType: !200, size: 32, offset: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !334, file: !335, line: 55, baseType: !340, size: 32, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !341, line: 151, baseType: !342)
!341 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !341, line: 149, size: 32, elements: !343)
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !342, file: !341, line: 150, baseType: !121, size: 32)
!345 = !{!346}
!346 = !DISubrange(count: 1)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 96, elements: !345)
!348 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !351, file: !384, line: 39, type: !154, isLocal: true, isDefinition: true)
!351 = distinct !DICompileUnit(language: DW_LANG_C99, file: !352, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !353, globals: !383, splitDebugInlining: false, nameTableKind: None)
!352 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/drivers/ipm/ipm_mcux/remote")
!353 = !{!354, !102, !103, !371, !154}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !356, line: 1226, baseType: !357)
!356 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !356, line: 1213, size: 352, elements: !358)
!358 = !{!359, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !357, file: !356, line: 1215, baseType: !360, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !357, file: !356, line: 1216, baseType: !120, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !357, file: !356, line: 1217, baseType: !120, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !357, file: !356, line: 1218, baseType: !120, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !357, file: !356, line: 1219, baseType: !120, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !357, file: !356, line: 1220, baseType: !120, size: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !357, file: !356, line: 1221, baseType: !120, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !357, file: !356, line: 1222, baseType: !120, size: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !357, file: !356, line: 1223, baseType: !120, size: 32, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !357, file: !356, line: 1224, baseType: !120, size: 32, offset: 288)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !357, file: !356, line: 1225, baseType: !120, size: 32, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !374, line: 27, size: 96, elements: !375)
!374 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!375 = !{!376, !377, !378}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !373, file: !374, line: 29, baseType: !121, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !373, file: !374, line: 31, baseType: !144, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !373, file: !374, line: 37, baseType: !379, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !341, line: 146, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !341, line: 141, size: 32, elements: !381)
!381 = !{!382}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !380, file: !341, line: 143, baseType: !121, size: 32)
!383 = !{!349}
!384 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !387, file: !392, line: 13, type: !409, isLocal: true, isDefinition: true)
!387 = distinct !DICompileUnit(language: DW_LANG_C99, file: !388, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !389, splitDebugInlining: false, nameTableKind: None)
!388 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/drivers/ipm/ipm_mcux/remote")
!389 = !{!390, !385}
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "mpu_config", scope: !387, file: !392, line: 37, type: !393, isLocal: false, isDefinition: true)
!392 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!393 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !374, line: 41, size: 64, elements: !395)
!395 = !{!396, !397}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !394, file: !374, line: 43, baseType: !121, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !394, file: !374, line: 45, baseType: !398, size: 32, offset: 32)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !374, line: 27, size: 96, elements: !401)
!401 = !{!402, !403, !404}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !400, file: !374, line: 29, baseType: !121, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !400, file: !374, line: 31, baseType: !144, size: 32, offset: 32)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !400, file: !374, line: 37, baseType: !405, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !341, line: 146, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !341, line: 141, size: 32, elements: !407)
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !406, file: !341, line: 143, baseType: !121, size: 32)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !399, size: 192, elements: !242)
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !412, file: !516, line: 72, type: !600, isLocal: true, isDefinition: true)
!412 = distinct !DICompileUnit(language: DW_LANG_C99, file: !413, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !414, retainedTypes: !502, globals: !513, splitDebugInlining: false, nameTableKind: None)
!413 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/drivers/ipm/ipm_mcux/remote")
!414 = !{!30, !415}
!415 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 65, baseType: !103, size: 32, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501}
!417 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!418 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!419 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!420 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!421 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!422 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!423 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!424 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!425 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!426 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!427 = !DIEnumerator(name: "TAMP_STAMP_IRQn", value: 2)
!428 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!429 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!430 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!431 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!432 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!433 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!434 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!435 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!436 = !DIEnumerator(name: "DMA1_Stream0_IRQn", value: 11)
!437 = !DIEnumerator(name: "DMA1_Stream1_IRQn", value: 12)
!438 = !DIEnumerator(name: "DMA1_Stream2_IRQn", value: 13)
!439 = !DIEnumerator(name: "DMA1_Stream3_IRQn", value: 14)
!440 = !DIEnumerator(name: "DMA1_Stream4_IRQn", value: 15)
!441 = !DIEnumerator(name: "DMA1_Stream5_IRQn", value: 16)
!442 = !DIEnumerator(name: "DMA1_Stream6_IRQn", value: 17)
!443 = !DIEnumerator(name: "ADC_IRQn", value: 18)
!444 = !DIEnumerator(name: "CAN1_TX_IRQn", value: 19)
!445 = !DIEnumerator(name: "CAN1_RX0_IRQn", value: 20)
!446 = !DIEnumerator(name: "CAN1_RX1_IRQn", value: 21)
!447 = !DIEnumerator(name: "CAN1_SCE_IRQn", value: 22)
!448 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!449 = !DIEnumerator(name: "TIM1_BRK_TIM9_IRQn", value: 24)
!450 = !DIEnumerator(name: "TIM1_UP_TIM10_IRQn", value: 25)
!451 = !DIEnumerator(name: "TIM1_TRG_COM_TIM11_IRQn", value: 26)
!452 = !DIEnumerator(name: "TIM1_CC_IRQn", value: 27)
!453 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!454 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!455 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!456 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!457 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!458 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!459 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!460 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!461 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!462 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!463 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!464 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!465 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!466 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!467 = !DIEnumerator(name: "OTG_FS_WKUP_IRQn", value: 42)
!468 = !DIEnumerator(name: "TIM8_BRK_TIM12_IRQn", value: 43)
!469 = !DIEnumerator(name: "TIM8_UP_TIM13_IRQn", value: 44)
!470 = !DIEnumerator(name: "TIM8_TRG_COM_TIM14_IRQn", value: 45)
!471 = !DIEnumerator(name: "TIM8_CC_IRQn", value: 46)
!472 = !DIEnumerator(name: "DMA1_Stream7_IRQn", value: 47)
!473 = !DIEnumerator(name: "SDIO_IRQn", value: 49)
!474 = !DIEnumerator(name: "TIM5_IRQn", value: 50)
!475 = !DIEnumerator(name: "SPI3_IRQn", value: 51)
!476 = !DIEnumerator(name: "TIM6_IRQn", value: 54)
!477 = !DIEnumerator(name: "TIM7_IRQn", value: 55)
!478 = !DIEnumerator(name: "DMA2_Stream0_IRQn", value: 56)
!479 = !DIEnumerator(name: "DMA2_Stream1_IRQn", value: 57)
!480 = !DIEnumerator(name: "DMA2_Stream2_IRQn", value: 58)
!481 = !DIEnumerator(name: "DMA2_Stream3_IRQn", value: 59)
!482 = !DIEnumerator(name: "DMA2_Stream4_IRQn", value: 60)
!483 = !DIEnumerator(name: "DFSDM1_FLT0_IRQn", value: 61)
!484 = !DIEnumerator(name: "DFSDM1_FLT1_IRQn", value: 62)
!485 = !DIEnumerator(name: "CAN2_TX_IRQn", value: 63)
!486 = !DIEnumerator(name: "CAN2_RX0_IRQn", value: 64)
!487 = !DIEnumerator(name: "CAN2_RX1_IRQn", value: 65)
!488 = !DIEnumerator(name: "CAN2_SCE_IRQn", value: 66)
!489 = !DIEnumerator(name: "OTG_FS_IRQn", value: 67)
!490 = !DIEnumerator(name: "DMA2_Stream5_IRQn", value: 68)
!491 = !DIEnumerator(name: "DMA2_Stream6_IRQn", value: 69)
!492 = !DIEnumerator(name: "DMA2_Stream7_IRQn", value: 70)
!493 = !DIEnumerator(name: "USART6_IRQn", value: 71)
!494 = !DIEnumerator(name: "I2C3_EV_IRQn", value: 72)
!495 = !DIEnumerator(name: "I2C3_ER_IRQn", value: 73)
!496 = !DIEnumerator(name: "RNG_IRQn", value: 80)
!497 = !DIEnumerator(name: "FPU_IRQn", value: 81)
!498 = !DIEnumerator(name: "SPI4_IRQn", value: 84)
!499 = !DIEnumerator(name: "SPI5_IRQn", value: 85)
!500 = !DIEnumerator(name: "FMPI2C1_EV_IRQn", value: 95)
!501 = !DIEnumerator(name: "FMPI2C1_ER_IRQn", value: 96)
!502 = !{!200, !103, !102, !503}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !116, line: 364, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 356, size: 192, elements: !506)
!506 = !{!507, !508, !509, !510, !511, !512}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !505, file: !116, line: 358, baseType: !120, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !505, file: !116, line: 359, baseType: !120, size: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !505, file: !116, line: 360, baseType: !120, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !505, file: !116, line: 361, baseType: !120, size: 32, offset: 96)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !505, file: !116, line: 362, baseType: !120, size: 32, offset: 128)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !505, file: !116, line: 363, baseType: !120, size: 32, offset: 160)
!513 = !{!514, !520, !536, !547, !564, !410, !566, !580, !582, !584, !586, !588, !590, !592, !594, !596, !598}
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_35", scope: !412, file: !516, line: 424, type: !517, isLocal: false, isDefinition: true, align: 16)
!516 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 64, elements: !518)
!518 = !{!519}
!519 = !DISubrange(count: 4)
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "__device_dts_ord_35", scope: !412, file: !516, line: 424, type: !522, isLocal: false, isDefinition: true, align: 32)
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !524)
!524 = !{!525, !526, !527, !528, !534, !535}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !523, file: !141, line: 380, baseType: !144, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !523, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !523, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !523, file: !141, line: 386, baseType: !529, size: 32, offset: 96)
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 32)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !531)
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !530, file: !141, line: 359, baseType: !154, size: 8)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !530, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !523, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !523, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_35", scope: !412, file: !516, line: 424, type: !538, isLocal: true, isDefinition: true, align: 32)
!538 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !539)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !540)
!540 = !{!541, !546}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !539, file: !132, line: 60, baseType: !542, size: 32)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!543 = !DISubroutineType(types: !544)
!544 = !{!103, !545}
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !539, file: !132, line: 65, baseType: !545, size: 32, offset: 32)
!547 = !DIGlobalVariableExpression(var: !548, expr: !DIExpression())
!548 = distinct !DIGlobalVariable(name: "exti_data", scope: !412, file: !516, line: 423, type: !549, isLocal: true, isDefinition: true)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !516, line: 107, size: 1472, elements: !550)
!550 = !{!551}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !549, file: !516, line: 109, baseType: !552, size: 1472)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !553, size: 1472, elements: !562)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !516, line: 101, size: 64, elements: !554)
!554 = !{!555, !561}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !553, file: !516, line: 102, baseType: !556, size: 32)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !557, line: 63, baseType: !558)
!557 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 32)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !103, !102}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !553, file: !516, line: 103, baseType: !102, size: 32, offset: 32)
!562 = !{!563}
!563 = !DISubrange(count: 23)
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_35", scope: !412, file: !516, line: 424, type: !530, isLocal: true, isDefinition: true, align: 8)
!566 = !DIGlobalVariableExpression(var: !567, expr: !DIExpression())
!567 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !568, file: !516, line: 493, type: !573, isLocal: true, isDefinition: true, align: 32)
!568 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !516, file: !516, line: 460, type: !569, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !412, retainedNodes: !571)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !545}
!571 = !{!572}
!572 = !DILocalVariable(name: "dev", arg: 1, scope: !568, file: !516, line: 460, type: !545)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !574)
!574 = !{!575, !577, !578, !579}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !573, file: !10, line: 55, baseType: !576, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !573, file: !10, line: 57, baseType: !576, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !573, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !573, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!580 = !DIGlobalVariableExpression(var: !581, expr: !DIExpression())
!581 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !568, file: !516, line: 497, type: !573, isLocal: true, isDefinition: true, align: 32)
!582 = !DIGlobalVariableExpression(var: !583, expr: !DIExpression())
!583 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !568, file: !516, line: 507, type: !573, isLocal: true, isDefinition: true, align: 32)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !568, file: !516, line: 512, type: !573, isLocal: true, isDefinition: true, align: 32)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !568, file: !516, line: 516, type: !573, isLocal: true, isDefinition: true, align: 32)
!588 = !DIGlobalVariableExpression(var: !589, expr: !DIExpression())
!589 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !568, file: !516, line: 523, type: !573, isLocal: true, isDefinition: true, align: 32)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !568, file: !516, line: 527, type: !573, isLocal: true, isDefinition: true, align: 32)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_16_irq_7", scope: !568, file: !516, line: 581, type: !573, isLocal: true, isDefinition: true, align: 32)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_18_irq_8", scope: !568, file: !516, line: 586, type: !573, isLocal: true, isDefinition: true, align: 32)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_21_irq_9", scope: !568, file: !516, line: 591, type: !573, isLocal: true, isDefinition: true, align: 32)
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_22_irq_10", scope: !568, file: !516, line: 595, type: !573, isLocal: true, isDefinition: true, align: 32)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 736, elements: !562)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !116, line: 154, baseType: !415)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_35", scope: !605, file: !610, line: 22, type: !632, isLocal: false, isDefinition: true, align: 16)
!605 = distinct !DICompileUnit(language: DW_LANG_C99, file: !606, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !607, splitDebugInlining: false, nameTableKind: None)
!606 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/drivers/ipm/ipm_mcux/remote/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/drivers/ipm/ipm_mcux/remote")
!607 = !{!608, !603, !614, !616, !618, !620, !622, !624, !626, !628, !630}
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !605, file: !610, line: 17, type: !611, isLocal: false, isDefinition: true, align: 16)
!610 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/drivers/ipm/ipm_mcux/remote")
!611 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 192, elements: !612)
!612 = !{!613}
!613 = !DISubrange(count: 12)
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_79", scope: !605, file: !610, line: 29, type: !517, isLocal: false, isDefinition: true, align: 16)
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_78", scope: !605, file: !610, line: 36, type: !517, isLocal: false, isDefinition: true, align: 16)
!618 = !DIGlobalVariableExpression(var: !619, expr: !DIExpression())
!619 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_77", scope: !605, file: !610, line: 43, type: !517, isLocal: false, isDefinition: true, align: 16)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_76", scope: !605, file: !610, line: 50, type: !517, isLocal: false, isDefinition: true, align: 16)
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_75", scope: !605, file: !610, line: 57, type: !517, isLocal: false, isDefinition: true, align: 16)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_22", scope: !605, file: !610, line: 64, type: !517, isLocal: false, isDefinition: true, align: 16)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_24", scope: !605, file: !610, line: 71, type: !517, isLocal: false, isDefinition: true, align: 16)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !605, file: !610, line: 78, type: !517, isLocal: false, isDefinition: true, align: 16)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_44", scope: !605, file: !610, line: 85, type: !517, isLocal: false, isDefinition: true, align: 16)
!632 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 48, elements: !633)
!633 = !{!634}
!634 = !DISubrange(count: 3)
!635 = !DIGlobalVariableExpression(var: !636, expr: !DIExpression())
!636 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !637, file: !699, line: 398, type: !732, isLocal: true, isDefinition: true)
!637 = distinct !DICompileUnit(language: DW_LANG_C99, file: !638, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !639, retainedTypes: !652, globals: !696, splitDebugInlining: false, nameTableKind: None)
!638 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/drivers/ipm/ipm_mcux/remote")
!639 = !{!640, !30, !645}
!640 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !641, line: 197, baseType: !32, size: 32, elements: !642)
!641 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32f4xx/soc/stm32f4xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!642 = !{!643, !644}
!643 = !DIEnumerator(name: "SUCCESS", value: 0)
!644 = !DIEnumerator(name: "ERROR", value: 1)
!645 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !646, line: 44, baseType: !32, size: 32, elements: !647)
!646 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!647 = !{!648, !649, !650, !651}
!648 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!649 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!650 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!651 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!652 = !{!102, !103, !121, !653, !689, !695}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 510, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 477, size: 1216, elements: !656)
!656 = !{!657, !658, !659, !660, !661, !662, !663, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !655, file: !116, line: 479, baseType: !120, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "PLLCFGR", scope: !655, file: !116, line: 480, baseType: !120, size: 32, offset: 32)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !655, file: !116, line: 481, baseType: !120, size: 32, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !655, file: !116, line: 482, baseType: !120, size: 32, offset: 96)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1RSTR", scope: !655, file: !116, line: 483, baseType: !120, size: 32, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2RSTR", scope: !655, file: !116, line: 484, baseType: !120, size: 32, offset: 160)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !655, file: !116, line: 485, baseType: !664, size: 64, offset: 192)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 64, elements: !242)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !655, file: !116, line: 486, baseType: !120, size: 32, offset: 256)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !655, file: !116, line: 487, baseType: !120, size: 32, offset: 288)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !655, file: !116, line: 488, baseType: !664, size: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1ENR", scope: !655, file: !116, line: 489, baseType: !120, size: 32, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2ENR", scope: !655, file: !116, line: 490, baseType: !120, size: 32, offset: 416)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !655, file: !116, line: 491, baseType: !664, size: 64, offset: 448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !655, file: !116, line: 492, baseType: !120, size: 32, offset: 512)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !655, file: !116, line: 493, baseType: !120, size: 32, offset: 544)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !655, file: !116, line: 494, baseType: !664, size: 64, offset: 576)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "AHB1LPENR", scope: !655, file: !116, line: 495, baseType: !120, size: 32, offset: 640)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "AHB2LPENR", scope: !655, file: !116, line: 496, baseType: !120, size: 32, offset: 672)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !655, file: !116, line: 497, baseType: !664, size: 64, offset: 704)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !655, file: !116, line: 498, baseType: !120, size: 32, offset: 768)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !655, file: !116, line: 499, baseType: !120, size: 32, offset: 800)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !655, file: !116, line: 500, baseType: !664, size: 64, offset: 832)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "BDCR", scope: !655, file: !116, line: 501, baseType: !120, size: 32, offset: 896)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !655, file: !116, line: 502, baseType: !120, size: 32, offset: 928)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !655, file: !116, line: 503, baseType: !664, size: 64, offset: 960)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "SSCGR", scope: !655, file: !116, line: 504, baseType: !120, size: 32, offset: 1024)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "PLLI2SCFGR", scope: !655, file: !116, line: 505, baseType: !120, size: 32, offset: 1056)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !655, file: !116, line: 506, baseType: !121, size: 32, offset: 1088)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR", scope: !655, file: !116, line: 507, baseType: !120, size: 32, offset: 1120)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "CKGATENR", scope: !655, file: !116, line: 508, baseType: !120, size: 32, offset: 1152)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "DCKCFGR2", scope: !655, file: !116, line: 509, baseType: !120, size: 32, offset: 1184)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 32)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !691, line: 343, size: 64, elements: !692)
!691 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !690, file: !691, line: 344, baseType: !121, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !690, file: !691, line: 345, baseType: !121, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!696 = !{!697, !703, !719, !730, !635}
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_8", scope: !637, file: !699, line: 752, type: !700, isLocal: false, isDefinition: true, align: 16)
!699 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 848, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 53)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "__device_dts_ord_8", scope: !637, file: !699, line: 752, type: !705, isLocal: false, isDefinition: true, align: 32)
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !707)
!707 = !{!708, !709, !710, !711, !717, !718}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !706, file: !141, line: 380, baseType: !144, size: 32)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !706, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !706, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !706, file: !141, line: 386, baseType: !712, size: 32, offset: 96)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !713, file: !141, line: 359, baseType: !154, size: 8)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !713, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !706, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !706, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_8", scope: !637, file: !699, line: 752, type: !721, isLocal: true, isDefinition: true, align: 32)
!721 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !723)
!723 = !{!724, !729}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !722, file: !132, line: 60, baseType: !725, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 32)
!726 = !DISubroutineType(types: !727)
!727 = !{!103, !728}
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !722, file: !132, line: 65, baseType: !728, size: 32, offset: 32)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_8", scope: !637, file: !699, line: 752, type: !713, isLocal: true, isDefinition: true, align: 8)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !646, line: 100, size: 224, elements: !733)
!733 = !{!734, !740, !741, !750, !755, !760, !766}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !732, file: !646, line: 101, baseType: !735, size: 32)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !646, line: 76, baseType: !736)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 32)
!737 = !DISubroutineType(types: !738)
!738 = !{!103, !728, !739}
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !646, line: 56, baseType: !102)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !732, file: !646, line: 102, baseType: !735, size: 32, offset: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !732, file: !646, line: 103, baseType: !742, size: 32, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !646, line: 83, baseType: !743)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 32)
!744 = !DISubroutineType(types: !745)
!745 = !{!103, !728, !739, !746, !102}
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !646, line: 72, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = !DISubroutineType(types: !749)
!749 = !{null, !728, !739, !102}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !732, file: !646, line: 104, baseType: !751, size: 32, offset: 96)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !646, line: 79, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = !DISubroutineType(types: !754)
!754 = !{!103, !728, !739, !695}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !732, file: !646, line: 105, baseType: !756, size: 32, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !646, line: 88, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = !DISubroutineType(types: !759)
!759 = !{!645, !728, !739}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !732, file: !646, line: 106, baseType: !761, size: 32, offset: 160)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !646, line: 92, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 32)
!763 = !DISubroutineType(types: !764)
!764 = !{!103, !728, !739, !765}
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !646, line: 64, baseType: !102)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !732, file: !646, line: 107, baseType: !767, size: 32, offset: 192)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !646, line: 96, baseType: !768)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 32)
!769 = !DISubroutineType(types: !770)
!770 = !{!103, !728, !739, !102}
!771 = !DIGlobalVariableExpression(var: !772, expr: !DIExpression())
!772 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !773, file: !830, line: 603, type: !832, isLocal: true, isDefinition: true, align: 32)
!773 = distinct !DICompileUnit(language: DW_LANG_C99, file: !774, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !775, globals: !827, splitDebugInlining: false, nameTableKind: None)
!774 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/drivers/ipm/ipm_mcux/remote")
!775 = !{!102, !103, !776}
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !778)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !779, line: 336, size: 160, elements: !780)
!779 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!780 = !{!781, !801, !805, !809, !822}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !778, file: !779, line: 365, baseType: !782, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 32)
!783 = !DISubroutineType(types: !784)
!784 = !{!103, !785, !800}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !788)
!788 = !{!789, !790, !791, !792, !798, !799}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !787, file: !141, line: 380, baseType: !144, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !787, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !787, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !787, file: !141, line: 386, baseType: !793, size: 32, offset: 96)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 32)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !794, file: !141, line: 359, baseType: !154, size: 8)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !794, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !787, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !787, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !778, file: !779, line: 366, baseType: !802, size: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!803 = !DISubroutineType(types: !804)
!804 = !{null, !785, !155}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !778, file: !779, line: 374, baseType: !806, size: 32, offset: 64)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 32)
!807 = !DISubroutineType(types: !808)
!808 = !{!103, !785}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !778, file: !779, line: 377, baseType: !810, size: 32, offset: 96)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 32)
!811 = !DISubroutineType(types: !812)
!812 = !{!103, !785, !813}
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !779, line: 122, size: 64, elements: !816)
!816 = !{!817, !818, !819, !820, !821}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !815, file: !779, line: 123, baseType: !121, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !815, file: !779, line: 124, baseType: !154, size: 8, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !815, file: !779, line: 125, baseType: !154, size: 8, offset: 40)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !815, file: !779, line: 126, baseType: !154, size: 8, offset: 48)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !815, file: !779, line: 127, baseType: !154, size: 8, offset: 56)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !778, file: !779, line: 379, baseType: !823, size: 32, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 32)
!824 = !DISubroutineType(types: !825)
!825 = !{!103, !785, !826}
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!827 = !{!771, !828}
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !773, file: !830, line: 38, type: !831, isLocal: true, isDefinition: true)
!830 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!831 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !785)
!832 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !833)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !834)
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !833, file: !132, line: 60, baseType: !806, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !833, file: !132, line: 65, baseType: !785, size: 32, offset: 32)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !839, file: !1011, line: 762, type: !1123, isLocal: true, isDefinition: true)
!839 = distinct !DICompileUnit(language: DW_LANG_C99, file: !840, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !841, retainedTypes: !859, globals: !1008, splitDebugInlining: false, nameTableKind: None)
!840 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_argonkey/drivers/ipm/ipm_mcux/remote")
!841 = !{!30, !842, !848, !853, !645}
!842 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !843, line: 506, baseType: !32, size: 32, elements: !844)
!843 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!844 = !{!845, !846, !847}
!845 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!846 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!847 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!848 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !843, line: 512, baseType: !32, size: 32, elements: !849)
!849 = !{!850, !851, !852}
!850 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!851 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!852 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!853 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !557, line: 43, baseType: !32, size: 32, elements: !854)
!854 = !{!855, !856, !857, !858}
!855 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!856 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!857 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!858 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!859 = !{!102, !103, !860, !930, !935, !895, !848, !842, !940, !941, !121, !955, !910, !967, !968, !969}
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !843, line: 523, size: 288, elements: !863)
!863 = !{!864, !885, !891, !896, !900, !901, !902, !906, !926}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !862, file: !843, line: 524, baseType: !865, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 32)
!866 = !DISubroutineType(types: !867)
!867 = !{!103, !868, !883, !884}
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !870)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !141, line: 378, size: 192, elements: !871)
!871 = !{!872, !873, !874, !875, !881, !882}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !870, file: !141, line: 380, baseType: !144, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !870, file: !141, line: 382, baseType: !13, size: 32, offset: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !870, file: !141, line: 384, baseType: !13, size: 32, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !870, file: !141, line: 386, baseType: !876, size: 32, offset: 96)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 32)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !141, line: 351, size: 16, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !877, file: !141, line: 359, baseType: !154, size: 8)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !877, file: !141, line: 364, baseType: !157, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !870, file: !141, line: 388, baseType: !102, size: 32, offset: 128)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !870, file: !141, line: 396, baseType: !160, size: 32, offset: 160)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !843, line: 237, baseType: !154)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !843, line: 257, baseType: !121)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !862, file: !843, line: 530, baseType: !886, size: 32, offset: 32)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 32)
!887 = !DISubroutineType(types: !888)
!888 = !{!103, !868, !889}
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 32)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !843, line: 229, baseType: !121)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !862, file: !843, line: 532, baseType: !892, size: 32, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DISubroutineType(types: !894)
!894 = !{!103, !868, !895, !890}
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !843, line: 216, baseType: !121)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !862, file: !843, line: 535, baseType: !897, size: 32, offset: 96)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DISubroutineType(types: !899)
!899 = !{!103, !868, !895}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !862, file: !843, line: 537, baseType: !897, size: 32, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !862, file: !843, line: 539, baseType: !897, size: 32, offset: 160)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !862, file: !843, line: 541, baseType: !903, size: 32, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 32)
!904 = !DISubroutineType(types: !905)
!905 = !{!103, !868, !883, !842, !848}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !862, file: !843, line: 544, baseType: !907, size: 32, offset: 224)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 32)
!908 = !DISubroutineType(types: !909)
!909 = !{!103, !868, !910, !157}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !843, line: 478, size: 96, elements: !912)
!912 = !{!913, !920, !925}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !911, file: !843, line: 482, baseType: !914, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !915, line: 33, baseType: !916)
!915 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !915, line: 29, size: 32, elements: !917)
!917 = !{!918}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !916, file: !915, line: 30, baseType: !919, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !911, file: !843, line: 485, baseType: !921, size: 32, offset: 32)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !843, line: 464, baseType: !922)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!923 = !DISubroutineType(types: !924)
!924 = !{null, !868, !910, !895}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !911, file: !843, line: 493, baseType: !895, size: 32, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !862, file: !843, line: 547, baseType: !927, size: 32, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 32)
!928 = !DISubroutineType(types: !929)
!929 = !{!121, !868}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 32)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !843, line: 428, size: 32, elements: !933)
!933 = !{!934}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !932, file: !843, line: 434, baseType: !895, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !843, line: 441, size: 32, elements: !938)
!938 = !{!939}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !937, file: !843, line: 447, baseType: !895, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !116, line: 396, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 385, size: 320, elements: !944)
!944 = !{!945, !946, !947, !948, !949, !950, !951, !952, !953}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !943, file: !116, line: 387, baseType: !120, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !943, file: !116, line: 388, baseType: !120, size: 32, offset: 32)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !943, file: !116, line: 389, baseType: !120, size: 32, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !943, file: !116, line: 390, baseType: !120, size: 32, offset: 96)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !943, file: !116, line: 391, baseType: !120, size: 32, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !943, file: !116, line: 392, baseType: !120, size: 32, offset: 160)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !943, file: !116, line: 393, baseType: !120, size: 32, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !943, file: !116, line: 394, baseType: !120, size: 32, offset: 224)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !943, file: !116, line: 395, baseType: !954, size: 64, offset: 256)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !242)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !116, line: 411, baseType: !957)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 402, size: 320, elements: !958)
!958 = !{!959, !960, !961, !963, !964, !965, !966}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !957, file: !116, line: 404, baseType: !120, size: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !957, file: !116, line: 405, baseType: !120, size: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !957, file: !116, line: 406, baseType: !962, size: 128, offset: 64)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !518)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !957, file: !116, line: 407, baseType: !121, size: 32, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR2", scope: !957, file: !116, line: 408, baseType: !120, size: 32, offset: 224)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "CMPCR", scope: !957, file: !116, line: 409, baseType: !120, size: 32, offset: 256)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !957, file: !116, line: 410, baseType: !120, size: 32, offset: 288)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !646, line: 100, size: 224, elements: !972)
!972 = !{!973, !978, !979, !988, !993, !998, !1003}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !971, file: !646, line: 101, baseType: !974, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !646, line: 76, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!976 = !DISubroutineType(types: !977)
!977 = !{!103, !868, !739}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !971, file: !646, line: 102, baseType: !974, size: 32, offset: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !971, file: !646, line: 103, baseType: !980, size: 32, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !646, line: 83, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 32)
!982 = !DISubroutineType(types: !983)
!983 = !{!103, !868, !739, !984, !102}
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !646, line: 72, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 32)
!986 = !DISubroutineType(types: !987)
!987 = !{null, !868, !739, !102}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !971, file: !646, line: 104, baseType: !989, size: 32, offset: 96)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !646, line: 79, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = !DISubroutineType(types: !992)
!992 = !{!103, !868, !739, !695}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !971, file: !646, line: 105, baseType: !994, size: 32, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !646, line: 88, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DISubroutineType(types: !997)
!997 = !{!645, !868, !739}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !971, file: !646, line: 106, baseType: !999, size: 32, offset: 160)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !646, line: 92, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!103, !868, !739, !765}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !971, file: !646, line: 107, baseType: !1004, size: 32, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !646, line: 96, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 32)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!103, !868, !739, !102}
!1008 = !{!1009, !1015, !1017, !1027, !1029, !1031, !1033, !1038, !1040, !1042, !1047, !1049, !1051, !1053, !1055, !1057, !1059, !1061, !1063, !1065, !1067, !1069, !1071, !1073, !1075, !1089, !1091, !1093, !1095, !1097, !1099, !1101, !1103, !1105, !1107, !1109, !1111, !1113, !1115, !1117, !837, !1119, !1121, !1134, !1136, !1138, !1140, !1142, !1144}
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_19", scope: !839, file: !1011, line: 762, type: !1012, isLocal: false, isDefinition: true, align: 16)
!1011 = !DIFile(filename: "zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 112, elements: !1013)
!1013 = !{!1014}
!1014 = !DISubrange(count: 7)
!1015 = !DIGlobalVariableExpression(var: !1016, expr: !DIExpression())
!1016 = distinct !DIGlobalVariable(name: "__device_dts_ord_19", scope: !839, file: !1011, line: 762, type: !869, isLocal: false, isDefinition: true, align: 32)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_19", scope: !839, file: !1011, line: 762, type: !1019, isLocal: true, isDefinition: true, align: 32)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !132, line: 51, size: 64, elements: !1021)
!1021 = !{!1022, !1026}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1020, file: !132, line: 60, baseType: !1023, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 32)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!103, !868}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1020, file: !132, line: 65, baseType: !868, size: 32, offset: 32)
!1027 = !DIGlobalVariableExpression(var: !1028, expr: !DIExpression())
!1028 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_24", scope: !839, file: !1011, line: 766, type: !1012, isLocal: false, isDefinition: true, align: 16)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(name: "__device_dts_ord_24", scope: !839, file: !1011, line: 766, type: !869, isLocal: false, isDefinition: true, align: 32)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_24", scope: !839, file: !1011, line: 766, type: !1019, isLocal: true, isDefinition: true, align: 32)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_22", scope: !839, file: !1011, line: 770, type: !1035, isLocal: false, isDefinition: true, align: 16)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 96, elements: !1036)
!1036 = !{!1037}
!1037 = !DISubrange(count: 6)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(name: "__device_dts_ord_22", scope: !839, file: !1011, line: 770, type: !869, isLocal: false, isDefinition: true, align: 32)
!1040 = !DIGlobalVariableExpression(var: !1041, expr: !DIExpression())
!1041 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_22", scope: !839, file: !1011, line: 770, type: !1019, isLocal: true, isDefinition: true, align: 32)
!1042 = !DIGlobalVariableExpression(var: !1043, expr: !DIExpression())
!1043 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_75", scope: !839, file: !1011, line: 774, type: !1044, isLocal: false, isDefinition: true, align: 16)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 80, elements: !1045)
!1045 = !{!1046}
!1046 = !DISubrange(count: 5)
!1047 = !DIGlobalVariableExpression(var: !1048, expr: !DIExpression())
!1048 = distinct !DIGlobalVariable(name: "__device_dts_ord_75", scope: !839, file: !1011, line: 774, type: !869, isLocal: false, isDefinition: true, align: 32)
!1049 = !DIGlobalVariableExpression(var: !1050, expr: !DIExpression())
!1050 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_75", scope: !839, file: !1011, line: 774, type: !1019, isLocal: true, isDefinition: true, align: 32)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_76", scope: !839, file: !1011, line: 778, type: !1044, isLocal: false, isDefinition: true, align: 16)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
