; ModuleID = 'build/96b_meerkat96/crypto/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.mode_test = type { i8*, void (%struct.device*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.crypto_driver_api = type { i32 (%struct.device*)*, i32 (%struct.device*, %struct.cipher_ctx*, i32, i32, i32)*, i32 (%struct.device*, %struct.cipher_ctx*)*, i32 (%struct.device*, void (%struct.cipher_pkt*, i32)*)*, i32 (%struct.device*, %struct.hash_ctx*, i32)*, i32 (%struct.device*, %struct.hash_ctx*)*, i32 (%struct.device*, void (%struct.hash_pkt*, i32)*)* }
%struct.cipher_ctx = type { %struct.cipher_ops, %union.anon.4, %struct.device*, i8*, i8*, %union.anon.5, i16, i16 }
%struct.cipher_ops = type { i32, %union.anon.3 }
%union.anon.3 = type { i32 (%struct.cipher_ctx*, %struct.cipher_pkt*)* }
%struct.cipher_pkt = type { i8*, i32, i8*, i32, i32, %struct.cipher_ctx* }
%union.anon.4 = type { i8* }
%union.anon.5 = type { %struct.ctr_params }
%struct.ctr_params = type { i32 }
%struct.hash_ctx = type { %struct.device*, i8*, i32 (%struct.hash_ctx*, %struct.hash_pkt*, i1)*, i8, i16 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/crypto/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/crypto")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/crypto")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !294, line: 18, type: !371, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !123, globals: !290, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/crypto/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/crypto")
!29 = !{!30, !39, !42, !46, !116}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_mode", file: !31, line: 44, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/crypto/cipher.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38}
!34 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_ECB", value: 1)
!35 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CBC", value: 2)
!36 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CTR", value: 3)
!37 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CCM", value: 4)
!38 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_GCM", value: 5)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_algo", file: !31, line: 29, baseType: !32, size: 32, elements: !40)
!40 = !{!41}
!41 = !DIEnumerator(name: "CRYPTO_CIPHER_ALGO_AES", value: 1)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_op", file: !31, line: 34, baseType: !32, size: 32, elements: !43)
!43 = !{!44, !45}
!44 = !DIEnumerator(name: "CRYPTO_CIPHER_OP_DECRYPT", value: 0)
!45 = !DIEnumerator(name: "CRYPTO_CIPHER_OP_ENCRYPT", value: 1)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !47, line: 27, baseType: !32, size: 32, elements: !48)
!47 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!49 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!50 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!51 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!52 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!53 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!54 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!55 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!56 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!57 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!58 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!59 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!60 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!61 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!62 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!63 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!64 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!65 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!115 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hash_algo", file: !117, line: 26, baseType: !32, size: 32, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/crypto/hash.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !120, !121, !122}
!119 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA224", value: 1)
!120 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA256", value: 2)
!121 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA384", value: 3)
!122 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA512", value: 4)
!123 = !{!124, !125, !126}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!125 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_driver_api", file: !128, line: 65, size: 224, elements: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/crypto/crypto.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = !{!130, !161, !241, !245, !253, !278, !282}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "query_hw_caps", scope: !127, file: !128, line: 66, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!132 = !DISubroutineType(types: !133)
!133 = !{!125, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = !{!139, !143, !144, !145, !154, !155}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !136, file: !137, line: 380, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !136, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !136, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !136, file: !137, line: 386, baseType: !146, size: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !137, line: 351, size: 16, elements: !148)
!148 = !{!149, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !147, file: !137, line: 359, baseType: !150, size: 8)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !151)
!151 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !147, file: !137, line: 364, baseType: !153, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!153 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !136, file: !137, line: 388, baseType: !124, size: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !136, file: !137, line: 396, baseType: !156, size: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !137, line: 43, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !160)
!160 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_begin_session", scope: !127, file: !128, line: 69, baseType: !162, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DISubroutineType(types: !164)
!164 = !{!125, !134, !165, !39, !30, !42}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ctx", file: !31, line: 110, size: 256, elements: !167)
!167 = !{!168, !212, !217, !218, !219, !220, !239, !240}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !166, file: !31, line: 116, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ops", file: !31, line: 74, size: 64, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_mode", scope: !169, file: !31, line: 76, baseType: !30, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !169, file: !31, line: 78, baseType: !173, size: 32, offset: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !31, line: 78, size: 32, elements: !174)
!174 = !{!175, !190, !195, !197, !210}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "block_crypt_hndlr", scope: !173, file: !31, line: 79, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_op_t", file: !31, line: 57, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DISubroutineType(types: !179)
!179 = !{!125, !165, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_pkt", file: !31, line: 180, size: 192, elements: !182)
!182 = !{!183, !185, !186, !187, !188, !189}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !181, file: !31, line: 183, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !181, file: !31, line: 186, baseType: !125, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !181, file: !31, line: 192, baseType: !184, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf_max", scope: !181, file: !31, line: 197, baseType: !125, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "out_len", scope: !181, file: !31, line: 202, baseType: !125, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !181, file: !31, line: 208, baseType: !165, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cbc_crypt_hndlr", scope: !173, file: !31, line: 80, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "cbc_op_t", file: !31, line: 62, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DISubroutineType(types: !194)
!194 = !{!125, !165, !180, !184}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_crypt_hndlr", scope: !173, file: !31, line: 81, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ctr_op_t", file: !31, line: 65, baseType: !192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_crypt_hndlr", scope: !173, file: !31, line: 82, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ccm_op_t", file: !31, line: 68, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!125, !165, !202, !184}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_aead_pkt", file: !31, line: 217, size: 128, elements: !204)
!204 = !{!205, !206, !207, !209}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pkt", scope: !203, file: !31, line: 219, baseType: !180, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !203, file: !31, line: 224, baseType: !184, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ad_len", scope: !203, file: !31, line: 227, baseType: !208, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !203, file: !31, line: 233, baseType: !184, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_crypt_hndlr", scope: !173, file: !31, line: 83, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcm_op_t", file: !31, line: 71, baseType: !199)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !166, file: !31, line: 126, baseType: !213, size: 32, offset: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !31, line: 119, size: 32, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "bit_stream", scope: !213, file: !31, line: 121, baseType: !184, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !213, file: !31, line: 125, baseType: !124, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !166, file: !31, line: 131, baseType: !134, size: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !166, file: !31, line: 140, baseType: !124, size: 32, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "app_sessn_state", scope: !166, file: !31, line: 146, baseType: !124, size: 32, offset: 160)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mode_params", scope: !166, file: !31, line: 156, baseType: !221, size: 32, offset: 192)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !31, line: 152, size: 32, elements: !222)
!222 = !{!223, !230, !234}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_info", scope: !221, file: !31, line: 153, baseType: !224, size: 32)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ccm_params", file: !31, line: 87, size: 32, elements: !225)
!225 = !{!226, !229}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !224, file: !31, line: 88, baseType: !227, size: 16)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !228)
!228 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !224, file: !31, line: 89, baseType: !227, size: 16, offset: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_info", scope: !221, file: !31, line: 154, baseType: !231, size: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctr_params", file: !31, line: 92, size: 32, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_len", scope: !231, file: !31, line: 96, baseType: !208, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_info", scope: !221, file: !31, line: 155, baseType: !235, size: 32)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gcm_params", file: !31, line: 99, size: 32, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !235, file: !31, line: 100, baseType: !227, size: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !235, file: !31, line: 101, baseType: !227, size: 16, offset: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !166, file: !31, line: 161, baseType: !227, size: 16, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !166, file: !31, line: 169, baseType: !227, size: 16, offset: 240)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_free_session", scope: !127, file: !128, line: 74, baseType: !242, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DISubroutineType(types: !244)
!244 = !{!125, !134, !165}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_async_callback_set", scope: !127, file: !128, line: 77, baseType: !246, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DISubroutineType(types: !248)
!248 = !{!125, !134, !249}
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "cipher_completion_cb", file: !31, line: 242, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !180, !125}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "hash_begin_session", scope: !127, file: !128, line: 81, baseType: !254, size: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DISubroutineType(types: !256)
!256 = !{!125, !134, !257, !116}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_ctx", file: !117, line: 47, size: 128, elements: !259)
!259 = !{!260, !261, !262, !276, !277}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !258, file: !117, line: 51, baseType: !134, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !258, file: !117, line: 60, baseType: !124, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "hash_hndlr", scope: !258, file: !117, line: 65, baseType: !263, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_op_t", file: !117, line: 38, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DISubroutineType(types: !266)
!266 = !{!125, !257, !267, !153}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_pkt", file: !117, line: 88, size: 128, elements: !269)
!269 = !{!270, !271, !274, !275}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !268, file: !117, line: 91, baseType: !184, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !268, file: !117, line: 94, baseType: !272, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !273, line: 214, baseType: !32)
!273 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !268, file: !117, line: 101, baseType: !184, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !268, file: !117, line: 107, baseType: !257, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "started", scope: !258, file: !117, line: 70, baseType: !153, size: 8, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !258, file: !117, line: 78, baseType: !227, size: 16, offset: 112)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "hash_free_session", scope: !127, file: !128, line: 84, baseType: !279, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DISubroutineType(types: !281)
!281 = !{!125, !134, !257}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "hash_async_callback_set", scope: !127, file: !128, line: 86, baseType: !283, size: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DISubroutineType(types: !285)
!285 = !{!125, !134, !286}
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_completion_cb", file: !117, line: 114, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !267, !125}
!290 = !{!25, !291, !314, !316, !318, !320, !324, !327, !329, !334, !339, !344, !349, !351, !356, !361, !366}
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "iv", scope: !293, file: !294, line: 227, type: !311, isLocal: true, isDefinition: true)
!293 = distinct !DISubprogram(name: "cbc_mode", scope: !294, file: !294, line: 205, type: !295, scopeLine: 206, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !297)
!294 = !DIFile(filename: "zephyr/samples/drivers/crypto/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!295 = !DISubroutineType(types: !296)
!296 = !{null, !134}
!297 = !{!298, !299, !303, !307, !308, !309, !310}
!298 = !DILocalVariable(name: "dev", arg: 1, scope: !293, file: !294, line: 205, type: !134)
!299 = !DILocalVariable(name: "encrypted", scope: !293, file: !294, line: 207, type: !300)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 640, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 80)
!303 = !DILocalVariable(name: "decrypted", scope: !293, file: !294, line: 208, type: !304)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 512, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 64)
!307 = !DILocalVariable(name: "ini", scope: !293, file: !294, line: 209, type: !166)
!308 = !DILocalVariable(name: "encrypt", scope: !293, file: !294, line: 214, type: !181)
!309 = !DILocalVariable(name: "decrypt", scope: !293, file: !294, line: 220, type: !181)
!310 = !DILabel(scope: !293, name: "out", file: !294, line: 279)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 128, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 16)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "cap_flags", scope: !27, file: !294, line: 48, type: !208, isLocal: false, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "key", scope: !27, file: !294, line: 34, type: !311, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "plaintext", scope: !27, file: !294, line: 39, type: !304, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "cbc_ciphertext", scope: !27, file: !294, line: 195, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 640, elements: !301)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "ctr_ciphertext", scope: !27, file: !294, line: 283, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 512, elements: !305)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "ccm_key", scope: !27, file: !294, line: 373, type: !311, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "ccm_data", scope: !27, file: !294, line: 384, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 184, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 23)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "ccm_hdr", scope: !27, file: !294, line: 381, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 64, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 8)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "ccm_nonce", scope: !27, file: !294, line: 377, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 104, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 13)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "ccm_expected", scope: !27, file: !294, line: 388, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 248, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 31)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "gcm_key", scope: !27, file: !294, line: 485, type: !311, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "gcm_data", scope: !27, file: !294, line: 496, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 336, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 42)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "gcm_hdr", scope: !27, file: !294, line: 492, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 160, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 20)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "gcm_nonce", scope: !27, file: !294, line: 489, type: !363, isLocal: true, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 96, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 12)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "gcm_expected", scope: !27, file: !294, line: 502, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 464, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 58)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !374)
!373 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !372, file: !373, line: 17, baseType: !140, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !372, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !379, file: !395, line: 18, type: !396, isLocal: false, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !381, globals: !394, splitDebugInlining: false, nameTableKind: None)
!380 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/crypto")
!381 = !{!22, !124, !24, !382, !384, !386, !272, !125, !387, !388, !390, !392, !393, !184, !227, !140}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!394 = !{!377}
!395 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !397, file: !373, line: 17, baseType: !140, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !397, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "_char_out", scope: !403, file: !408, line: 54, type: !409, isLocal: false, isDefinition: true)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !406, globals: !407, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/crypto")
!405 = !{!46}
!406 = !{!124, !125}
!407 = !{!401}
!408 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DISubroutineType(types: !411)
!411 = !{!125, !125}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !414, file: !828, line: 258, type: !829, isLocal: true, isDefinition: true, align: 32)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !416, retainedTypes: !699, globals: !827, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/crypto")
!416 = !{!417, !449, !459, !508, !514, !635, !670}
!417 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !418, line: 54, baseType: !32, size: 32, elements: !419)
!418 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!419 = !{!420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448}
!420 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!421 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!422 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!423 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!424 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!425 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!426 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!427 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!428 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!429 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!430 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!431 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!432 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!433 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!434 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!435 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!436 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!437 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!438 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!439 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!440 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!441 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!442 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!443 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!444 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!445 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!446 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!447 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!448 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!449 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !418, line: 224, baseType: !32, size: 32, elements: !450)
!450 = !{!451, !452, !453, !454, !455, !456, !457, !458}
!451 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!452 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!453 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!454 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!455 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!456 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!457 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!458 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!459 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !418, line: 275, baseType: !32, size: 32, elements: !460)
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507}
!461 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!462 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!463 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!464 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!465 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!466 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!467 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!468 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!469 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!470 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!471 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!472 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!473 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!474 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!475 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!476 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!477 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!478 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!479 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!480 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!481 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!482 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!483 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!484 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!485 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!486 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!487 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!488 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!489 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!490 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!491 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!492 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!493 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!494 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!495 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!496 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!497 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!498 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!499 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!500 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!501 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!502 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!503 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!504 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!505 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!506 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!507 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!508 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !418, line: 327, baseType: !32, size: 32, elements: !509)
!509 = !{!510, !511, !512, !513}
!510 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!511 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!512 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!513 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!514 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !515, line: 76, baseType: !32, size: 32, elements: !516)
!515 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634}
!517 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!518 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!519 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!520 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!521 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!522 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!523 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!524 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!525 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!526 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!527 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!528 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!529 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!530 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!531 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!532 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!533 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!534 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!535 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!536 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!537 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!538 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!539 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!540 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!541 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!542 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!543 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!544 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!545 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!546 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!547 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!548 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!549 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!550 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!551 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!552 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!553 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!554 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!555 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!556 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!557 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!558 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!559 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!560 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!561 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!562 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!563 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!564 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!565 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!566 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!567 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!568 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!569 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!570 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!571 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!572 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!573 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!574 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!575 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!576 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!577 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!578 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!579 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!580 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!581 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!582 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!583 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!584 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!585 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!586 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!587 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!588 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!589 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!590 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!591 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!592 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!593 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!594 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!595 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!596 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!597 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!598 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!599 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!600 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!601 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!602 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!603 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!604 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!605 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!606 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!607 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!608 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!609 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!610 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!611 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!612 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!613 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!614 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!615 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!616 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!617 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!618 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!619 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!620 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!621 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!622 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!623 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!624 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!625 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!626 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!627 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!628 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!629 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!630 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!631 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!632 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!633 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!634 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!635 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !418, line: 237, baseType: !32, size: 32, elements: !636)
!636 = !{!637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!637 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!638 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!639 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!640 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!641 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!642 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!643 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!644 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!645 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!646 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!647 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!648 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!649 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!650 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!651 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!652 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!653 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!654 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!655 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!656 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!657 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!658 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!659 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!660 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!661 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!662 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!663 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!664 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!665 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!666 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!667 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!668 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!669 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!670 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !515, line: 44, baseType: !32, size: 32, elements: !671)
!671 = !{!672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698}
!672 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!673 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!674 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!675 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!676 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!677 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!678 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!679 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!680 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!681 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!682 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!683 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!684 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!685 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!686 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!687 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!688 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!689 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!690 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!691 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!692 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!693 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!694 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!695 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!696 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!697 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!698 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!699 = !{!700, !772, !815, !826, !208}
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !702, line: 4575, baseType: !703)
!702 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !702, line: 4532, size: 390144, elements: !704)
!704 = !{!705, !707, !708, !709, !710, !714, !724, !728, !738, !742}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !703, file: !702, line: 4533, baseType: !706, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !208)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !703, file: !702, line: 4534, baseType: !706, size: 32, offset: 32)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !703, file: !702, line: 4535, baseType: !706, size: 32, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !703, file: !702, line: 4536, baseType: !706, size: 32, offset: 96)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !703, file: !702, line: 4537, baseType: !711, size: 16256, offset: 128)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 16256, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 2032)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !703, file: !702, line: 4543, baseType: !715, size: 4224, offset: 16384)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 4224, elements: !722)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !703, file: !702, line: 4538, size: 128, elements: !717)
!717 = !{!718, !719, !720, !721}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !716, file: !702, line: 4539, baseType: !706, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_SET", scope: !716, file: !702, line: 4540, baseType: !706, size: 32, offset: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_CLR", scope: !716, file: !702, line: 4541, baseType: !706, size: 32, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_TOG", scope: !716, file: !702, line: 4542, baseType: !706, size: 32, offset: 96)
!722 = !{!723}
!723 = !DISubrange(count: 33)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !703, file: !702, line: 4544, baseType: !725, size: 110464, offset: 20608)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 110464, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 13808)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !703, file: !702, line: 4550, baseType: !729, size: 24448, offset: 131072)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 24448, elements: !736)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !703, file: !702, line: 4545, size: 128, elements: !731)
!731 = !{!732, !733, !734, !735}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !730, file: !702, line: 4546, baseType: !706, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_SET", scope: !730, file: !702, line: 4547, baseType: !706, size: 32, offset: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_CLR", scope: !730, file: !702, line: 4548, baseType: !706, size: 32, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_TOG", scope: !730, file: !702, line: 4549, baseType: !706, size: 32, offset: 96)
!736 = !{!737}
!737 = !DISubrange(count: 191)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !703, file: !702, line: 4551, baseType: !739, size: 106624, offset: 155520)
!739 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 106624, elements: !740)
!740 = !{!741}
!741 = !DISubrange(count: 13328)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !703, file: !702, line: 4574, baseType: !743, size: 128000, offset: 262144)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !744, size: 128000, elements: !770)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !703, file: !702, line: 4552, size: 1024, elements: !745)
!745 = !{!746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !766, !767, !768, !769}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT", scope: !744, file: !702, line: 4553, baseType: !706, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_SET", scope: !744, file: !702, line: 4554, baseType: !706, size: 32, offset: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_CLR", scope: !744, file: !702, line: 4555, baseType: !706, size: 32, offset: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_TOG", scope: !744, file: !702, line: 4556, baseType: !706, size: 32, offset: 96)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "MISC", scope: !744, file: !702, line: 4557, baseType: !706, size: 32, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_SET", scope: !744, file: !702, line: 4558, baseType: !706, size: 32, offset: 160)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_CLR", scope: !744, file: !702, line: 4559, baseType: !706, size: 32, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_TOG", scope: !744, file: !702, line: 4560, baseType: !706, size: 32, offset: 224)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "POST", scope: !744, file: !702, line: 4561, baseType: !706, size: 32, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_SET", scope: !744, file: !702, line: 4562, baseType: !706, size: 32, offset: 288)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_CLR", scope: !744, file: !702, line: 4563, baseType: !706, size: 32, offset: 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_TOG", scope: !744, file: !702, line: 4564, baseType: !706, size: 32, offset: 352)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "PRE", scope: !744, file: !702, line: 4565, baseType: !706, size: 32, offset: 384)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_SET", scope: !744, file: !702, line: 4566, baseType: !706, size: 32, offset: 416)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_CLR", scope: !744, file: !702, line: 4567, baseType: !706, size: 32, offset: 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_TOG", scope: !744, file: !702, line: 4568, baseType: !706, size: 32, offset: 480)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !744, file: !702, line: 4569, baseType: !763, size: 384, offset: 512)
!763 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 384, elements: !764)
!764 = !{!765}
!765 = !DISubrange(count: 48)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL", scope: !744, file: !702, line: 4570, baseType: !706, size: 32, offset: 896)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_SET", scope: !744, file: !702, line: 4571, baseType: !706, size: 32, offset: 928)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_CLR", scope: !744, file: !702, line: 4572, baseType: !706, size: 32, offset: 960)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !744, file: !702, line: 4573, baseType: !706, size: 32, offset: 992)
!770 = !{!771}
!771 = !DISubrange(count: 125)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDC_Type", file: !702, line: 38320, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !702, line: 38303, size: 23040, elements: !775)
!775 = !{!776, !778, !782, !783, !784, !785, !789, !793, !797, !801, !805}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "VIR", scope: !774, file: !702, line: 38304, baseType: !777, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !706)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !774, file: !702, line: 38305, baseType: !779, size: 256, offset: 32)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 256, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 32)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "STAT", scope: !774, file: !702, line: 38306, baseType: !706, size: 32, offset: 288)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "INTCTRL", scope: !774, file: !702, line: 38307, baseType: !706, size: 32, offset: 320)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "INTSTAT", scope: !774, file: !702, line: 38308, baseType: !706, size: 32, offset: 352)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !774, file: !702, line: 38309, baseType: !786, size: 3712, offset: 384)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 3712, elements: !787)
!787 = !{!788}
!788 = !DISubrange(count: 464)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "MDA", scope: !774, file: !702, line: 38310, baseType: !790, size: 864, offset: 4096)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 864, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 27)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !774, file: !702, line: 38311, baseType: !794, size: 3232, offset: 4960)
!794 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 3232, elements: !795)
!795 = !{!796}
!796 = !DISubrange(count: 404)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "PDAP", scope: !774, file: !702, line: 38312, baseType: !798, size: 3776, offset: 8192)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 3776, elements: !799)
!799 = !{!800}
!800 = !DISubrange(count: 118)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_3", scope: !774, file: !702, line: 38313, baseType: !802, size: 4416, offset: 11968)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 4416, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 552)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "MR", scope: !774, file: !702, line: 38319, baseType: !806, size: 6656, offset: 16384)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 6656, elements: !813)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !774, file: !702, line: 38314, size: 128, elements: !808)
!808 = !{!809, !810, !811, !812}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "MRSA", scope: !807, file: !702, line: 38315, baseType: !706, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "MREA", scope: !807, file: !702, line: 38316, baseType: !706, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "MRC", scope: !807, file: !702, line: 38317, baseType: !706, size: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "MRVS", scope: !807, file: !702, line: 38318, baseType: !706, size: 32, offset: 96)
!813 = !{!814}
!814 = !DISubrange(count: 52)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "WDOG_Type", file: !702, line: 43319, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !702, line: 43313, size: 80, elements: !818)
!818 = !{!819, !821, !822, !824, !825}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "WCR", scope: !817, file: !702, line: 43314, baseType: !820, size: 16)
!820 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !227)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "WSR", scope: !817, file: !702, line: 43315, baseType: !820, size: 16, offset: 16)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "WRSR", scope: !817, file: !702, line: 43316, baseType: !823, size: 16, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !820)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "WICR", scope: !817, file: !702, line: 43317, baseType: !820, size: 16, offset: 48)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "WMCR", scope: !817, file: !702, line: 43318, baseType: !820, size: 16, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 32)
!827 = !{!412}
!828 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!829 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !831, line: 51, size: 64, elements: !832)
!831 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!832 = !{!833, !840}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !830, file: !831, line: 60, baseType: !834, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 32)
!835 = !DISubroutineType(types: !836)
!836 = !{!125, !837}
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !839)
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !831, line: 48, flags: DIFlagFwdDecl)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !830, file: !831, line: 65, baseType: !837, size: 32, offset: 32)
!841 = !DIGlobalVariableExpression(var: !842, expr: !DIExpression())
!842 = distinct !DIGlobalVariable(name: "inv_sbox", scope: !843, file: !857, line: 37, type: !858, isLocal: true, isDefinition: true)
!843 = distinct !DICompileUnit(language: DW_LANG_C99, file: !844, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !845, globals: !856, splitDebugInlining: false, nameTableKind: None)
!844 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/modules/crypto/tinycrypt/lib/source/aes_decrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/crypto")
!845 = !{!184, !846, !847, !150}
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCAesKeySched_t", file: !848, line: 66, baseType: !849)
!848 = !DIFile(filename: "modules/crypto/tinycrypt/lib/include/tinycrypt/aes.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 32)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tc_aes_key_sched_struct", file: !848, line: 64, size: 1408, elements: !851)
!851 = !{!852}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !850, file: !848, line: 65, baseType: !853, size: 1408)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1408, elements: !854)
!854 = !{!855}
!855 = !DISubrange(count: 44)
!856 = !{!841}
!857 = !DIFile(filename: "modules/crypto/tinycrypt/lib/source/aes_decrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 2048, elements: !859)
!859 = !{!860}
!860 = !DISubrange(count: 256)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "sbox", scope: !863, file: !872, line: 37, type: !858, isLocal: true, isDefinition: true)
!863 = distinct !DICompileUnit(language: DW_LANG_C99, file: !864, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !865, globals: !871, splitDebugInlining: false, nameTableKind: None)
!864 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/modules/crypto/tinycrypt/lib/source/aes_encrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/crypto")
!865 = !{!866, !846, !184, !150}
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCAesKeySched_t", file: !848, line: 66, baseType: !867)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 32)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tc_aes_key_sched_struct", file: !848, line: 64, size: 1408, elements: !869)
!869 = !{!870}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !868, file: !848, line: 65, baseType: !853, size: 1408)
!871 = !{!861}
!872 = !DIFile(filename: "modules/crypto/tinycrypt/lib/source/aes_encrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !875, file: !882, line: 21, type: !409, isLocal: true, isDefinition: true)
!875 = distinct !DICompileUnit(language: DW_LANG_C99, file: !876, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !877, globals: !881, splitDebugInlining: false, nameTableKind: None)
!876 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/crypto")
!877 = !{!878, !125, !124}
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !880, line: 22, baseType: !125)
!880 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!881 = !{!873}
!882 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!883 = !DIGlobalVariableExpression(var: !884, expr: !DIExpression())
!884 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !885, file: !973, line: 603, type: !975, isLocal: true, isDefinition: true, align: 32)
!885 = distinct !DICompileUnit(language: DW_LANG_C99, file: !886, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !887, globals: !970, splitDebugInlining: false, nameTableKind: None)
!886 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/crypto")
!887 = !{!124, !125, !888}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !891, line: 336, size: 608, elements: !892)
!891 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!892 = !{!893, !913, !917, !921, !934, !939, !943, !948, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !890, file: !891, line: 365, baseType: !894, size: 32)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 32)
!895 = !DISubroutineType(types: !896)
!896 = !{!125, !897, !912}
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !899)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !900)
!900 = !{!901, !902, !903, !904, !910, !911}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !899, file: !137, line: 380, baseType: !140, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !899, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !899, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !899, file: !137, line: 386, baseType: !905, size: 32, offset: 96)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 32)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !137, line: 351, size: 16, elements: !907)
!907 = !{!908, !909}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !906, file: !137, line: 359, baseType: !150, size: 8)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !906, file: !137, line: 364, baseType: !153, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !899, file: !137, line: 388, baseType: !124, size: 32, offset: 128)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !899, file: !137, line: 396, baseType: !156, size: 32, offset: 160)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !890, file: !891, line: 366, baseType: !914, size: 32, offset: 32)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!915 = !DISubroutineType(types: !916)
!916 = !{null, !897, !151}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !890, file: !891, line: 374, baseType: !918, size: 32, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 32)
!919 = !DISubroutineType(types: !920)
!920 = !{!125, !897}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !890, file: !891, line: 377, baseType: !922, size: 32, offset: 96)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!923 = !DISubroutineType(types: !924)
!924 = !{!125, !897, !925}
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !891, line: 122, size: 64, elements: !928)
!928 = !{!929, !930, !931, !932, !933}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !927, file: !891, line: 123, baseType: !208, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !927, file: !891, line: 124, baseType: !150, size: 8, offset: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !927, file: !891, line: 125, baseType: !150, size: 8, offset: 40)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !927, file: !891, line: 126, baseType: !150, size: 8, offset: 48)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !927, file: !891, line: 127, baseType: !150, size: 8, offset: 56)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !890, file: !891, line: 379, baseType: !935, size: 32, offset: 128)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = !DISubroutineType(types: !937)
!937 = !{!125, !897, !938}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !890, file: !891, line: 384, baseType: !940, size: 32, offset: 160)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 32)
!941 = !DISubroutineType(types: !942)
!942 = !{!125, !897, !846, !125}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !890, file: !891, line: 393, baseType: !944, size: 32, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = !DISubroutineType(types: !946)
!946 = !{!125, !897, !184, !947}
!947 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !890, file: !891, line: 402, baseType: !949, size: 32, offset: 224)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 32)
!950 = !DISubroutineType(types: !951)
!951 = !{null, !897}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !890, file: !891, line: 405, baseType: !949, size: 32, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !890, file: !891, line: 408, baseType: !918, size: 32, offset: 288)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !890, file: !891, line: 411, baseType: !949, size: 32, offset: 320)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !890, file: !891, line: 414, baseType: !949, size: 32, offset: 352)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !890, file: !891, line: 417, baseType: !918, size: 32, offset: 384)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !890, file: !891, line: 420, baseType: !918, size: 32, offset: 416)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !890, file: !891, line: 423, baseType: !949, size: 32, offset: 448)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !890, file: !891, line: 426, baseType: !949, size: 32, offset: 480)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !890, file: !891, line: 429, baseType: !918, size: 32, offset: 512)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !890, file: !891, line: 432, baseType: !918, size: 32, offset: 544)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !890, file: !891, line: 435, baseType: !963, size: 32, offset: 576)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 32)
!964 = !DISubroutineType(types: !965)
!965 = !{null, !897, !966, !124}
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !891, line: 142, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = !DISubroutineType(types: !969)
!969 = !{null, !897, !124}
!970 = !{!883, !971}
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !885, file: !973, line: 38, type: !974, isLocal: true, isDefinition: true)
!973 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!974 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !897)
!975 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !976)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !831, line: 51, size: 64, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !976, file: !831, line: 60, baseType: !918, size: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !976, file: !831, line: 65, baseType: !897, size: 32, offset: 32)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(name: "log_const_tinycrypt", scope: !982, file: !988, line: 22, type: !1162, isLocal: false, isDefinition: true)
!982 = distinct !DICompileUnit(language: DW_LANG_C99, file: !983, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !984, globals: !985, splitDebugInlining: false, nameTableKind: None)
!983 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/crypto/crypto_tc_shim.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_meerkat96/crypto")
!984 = !{!30, !39, !42, !116}
!985 = !{!980, !986, !992, !1008, !1019, !1021, !1149}
!986 = !DIGlobalVariableExpression(var: !987, expr: !DIExpression())
!987 = distinct !DIGlobalVariable(name: "__devicehdl_crypto_tinycrypt", scope: !982, file: !988, line: 324, type: !989, isLocal: false, isDefinition: true, align: 16)
!988 = !DIFile(filename: "zephyr/drivers/crypto/crypto_tc_shim.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 48, elements: !990)
!990 = !{!991}
!991 = !DISubrange(count: 3)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "__device_crypto_tinycrypt", scope: !982, file: !988, line: 324, type: !994, isLocal: true, isDefinition: true, align: 32)
!994 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !996)
!996 = !{!997, !998, !999, !1000, !1006, !1007}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !995, file: !137, line: 380, baseType: !140, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !995, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !995, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !995, file: !137, line: 386, baseType: !1001, size: 32, offset: 96)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 32)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !137, line: 351, size: 16, elements: !1003)
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1002, file: !137, line: 359, baseType: !150, size: 8)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1002, file: !137, line: 364, baseType: !153, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !995, file: !137, line: 388, baseType: !124, size: 32, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !995, file: !137, line: 396, baseType: !156, size: 32, offset: 160)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(name: "__init___device_crypto_tinycrypt", scope: !982, file: !988, line: 324, type: !1010, isLocal: true, isDefinition: true, align: 32)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !831, line: 51, size: 64, elements: !1012)
!1012 = !{!1013, !1018}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1011, file: !831, line: 60, baseType: !1014, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 32)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!125, !1017}
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1011, file: !831, line: 65, baseType: !1017, size: 32, offset: 32)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "__devstate_crypto_tinycrypt", scope: !982, file: !988, line: 324, type: !1002, isLocal: true, isDefinition: true, align: 8)
!1021 = !DIGlobalVariableExpression(var: !1022, expr: !DIExpression())
!1022 = distinct !DIGlobalVariable(name: "crypto_enc_funcs", scope: !982, file: !988, line: 317, type: !1023, isLocal: true, isDefinition: true)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_driver_api", file: !128, line: 65, size: 224, elements: !1024)
!1024 = !{!1025, !1026, !1102, !1106, !1114, !1137, !1141}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "query_hw_caps", scope: !1023, file: !128, line: 66, baseType: !1014, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_begin_session", scope: !1023, file: !128, line: 69, baseType: !1027, size: 32, offset: 32)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 32)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!125, !1017, !1030, !39, !30, !42}
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 32)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ctx", file: !31, line: 110, size: 256, elements: !1032)
!1032 = !{!1033, !1075, !1080, !1081, !1082, !1083, !1100, !1101}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1031, file: !31, line: 116, baseType: !1034, size: 64)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ops", file: !31, line: 74, size: 64, elements: !1035)
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_mode", scope: !1034, file: !31, line: 76, baseType: !30, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, scope: !1034, file: !31, line: 78, baseType: !1038, size: 32, offset: 32)
!1038 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1034, file: !31, line: 78, size: 32, elements: !1039)
!1039 = !{!1040, !1054, !1059, !1061, !1073}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "block_crypt_hndlr", scope: !1038, file: !31, line: 79, baseType: !1041, size: 32)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_op_t", file: !31, line: 57, baseType: !1042)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 32)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!125, !1030, !1045}
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 32)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_pkt", file: !31, line: 180, size: 192, elements: !1047)
!1047 = !{!1048, !1049, !1050, !1051, !1052, !1053}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !1046, file: !31, line: 183, baseType: !184, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !1046, file: !31, line: 186, baseType: !125, size: 32, offset: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !1046, file: !31, line: 192, baseType: !184, size: 32, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf_max", scope: !1046, file: !31, line: 197, baseType: !125, size: 32, offset: 96)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "out_len", scope: !1046, file: !31, line: 202, baseType: !125, size: 32, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1046, file: !31, line: 208, baseType: !1030, size: 32, offset: 160)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "cbc_crypt_hndlr", scope: !1038, file: !31, line: 80, baseType: !1055, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "cbc_op_t", file: !31, line: 62, baseType: !1056)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 32)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!125, !1030, !1045, !184}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_crypt_hndlr", scope: !1038, file: !31, line: 81, baseType: !1060, size: 32)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "ctr_op_t", file: !31, line: 65, baseType: !1056)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_crypt_hndlr", scope: !1038, file: !31, line: 82, baseType: !1062, size: 32)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "ccm_op_t", file: !31, line: 68, baseType: !1063)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 32)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!125, !1030, !1066, !184}
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 32)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_aead_pkt", file: !31, line: 217, size: 128, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "pkt", scope: !1067, file: !31, line: 219, baseType: !1045, size: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !1067, file: !31, line: 224, baseType: !184, size: 32, offset: 32)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ad_len", scope: !1067, file: !31, line: 227, baseType: !208, size: 32, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !1067, file: !31, line: 233, baseType: !184, size: 32, offset: 96)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_crypt_hndlr", scope: !1038, file: !31, line: 83, baseType: !1074, size: 32)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcm_op_t", file: !31, line: 71, baseType: !1063)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !1031, file: !31, line: 126, baseType: !1076, size: 32, offset: 64)
!1076 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1031, file: !31, line: 119, size: 32, elements: !1077)
!1077 = !{!1078, !1079}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "bit_stream", scope: !1076, file: !31, line: 121, baseType: !184, size: 32)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !1076, file: !31, line: 125, baseType: !124, size: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !1031, file: !31, line: 131, baseType: !1017, size: 32, offset: 96)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !1031, file: !31, line: 140, baseType: !124, size: 32, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "app_sessn_state", scope: !1031, file: !31, line: 146, baseType: !124, size: 32, offset: 160)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "mode_params", scope: !1031, file: !31, line: 156, baseType: !1084, size: 32, offset: 192)
!1084 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1031, file: !31, line: 152, size: 32, elements: !1085)
!1085 = !{!1086, !1091, !1095}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_info", scope: !1084, file: !31, line: 153, baseType: !1087, size: 32)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ccm_params", file: !31, line: 87, size: 32, elements: !1088)
!1088 = !{!1089, !1090}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !1087, file: !31, line: 88, baseType: !227, size: 16)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !1087, file: !31, line: 89, baseType: !227, size: 16, offset: 16)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_info", scope: !1084, file: !31, line: 154, baseType: !1092, size: 32)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctr_params", file: !31, line: 92, size: 32, elements: !1093)
!1093 = !{!1094}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_len", scope: !1092, file: !31, line: 96, baseType: !208, size: 32)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_info", scope: !1084, file: !31, line: 155, baseType: !1096, size: 32)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gcm_params", file: !31, line: 99, size: 32, elements: !1097)
!1097 = !{!1098, !1099}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !1096, file: !31, line: 100, baseType: !227, size: 16)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !1096, file: !31, line: 101, baseType: !227, size: 16, offset: 16)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !1031, file: !31, line: 161, baseType: !227, size: 16, offset: 224)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1031, file: !31, line: 169, baseType: !227, size: 16, offset: 240)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_free_session", scope: !1023, file: !128, line: 74, baseType: !1103, size: 32, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 32)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!125, !1017, !1030}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_async_callback_set", scope: !1023, file: !128, line: 77, baseType: !1107, size: 32, offset: 96)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 32)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!125, !1017, !1110}
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "cipher_completion_cb", file: !31, line: 242, baseType: !1111)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 32)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{null, !1045, !125}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "hash_begin_session", scope: !1023, file: !128, line: 81, baseType: !1115, size: 32, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 32)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!125, !1017, !1118, !116}
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 32)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_ctx", file: !117, line: 47, size: 128, elements: !1120)
!1120 = !{!1121, !1122, !1123, !1135, !1136}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !1119, file: !117, line: 51, baseType: !1017, size: 32)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !1119, file: !117, line: 60, baseType: !124, size: 32, offset: 32)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "hash_hndlr", scope: !1119, file: !117, line: 65, baseType: !1124, size: 32, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_op_t", file: !117, line: 38, baseType: !1125)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 32)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!125, !1118, !1128, !153}
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 32)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_pkt", file: !117, line: 88, size: 128, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1134}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !1129, file: !117, line: 91, baseType: !184, size: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !1129, file: !117, line: 94, baseType: !272, size: 32, offset: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !1129, file: !117, line: 101, baseType: !184, size: 32, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !1129, file: !117, line: 107, baseType: !1118, size: 32, offset: 96)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "started", scope: !1119, file: !117, line: 70, baseType: !153, size: 8, offset: 96)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1119, file: !117, line: 78, baseType: !227, size: 16, offset: 112)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "hash_free_session", scope: !1023, file: !128, line: 84, baseType: !1138, size: 32, offset: 160)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 32)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!125, !1017, !1118}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "hash_async_callback_set", scope: !1023, file: !128, line: 86, baseType: !1142, size: 32, offset: 192)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 32)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!125, !1017, !1145}
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_completion_cb", file: !117, line: 114, baseType: !1146)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 32)
!1147 = !DISubroutineType(types: !1148)
!1148 = !{null, !1128, !125}
!1149 = !DIGlobalVariableExpression(var: !1150, expr: !DIExpression())
!1150 = distinct !DIGlobalVariable(name: "tc_driver_state", scope: !982, file: !988, line: 26, type: !1151, isLocal: true, isDefinition: true)
!1151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1152, size: 2880, elements: !1160)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tc_shim_drv_state", file: !1153, line: 22, size: 1440, elements: !1154)
!1153 = !DIFile(filename: "zephyr/drivers/crypto/crypto_tc_shim_priv.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1154 = !{!1155, !1156}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "in_use", scope: !1152, file: !1153, line: 23, baseType: !125, size: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "session_key", scope: !1152, file: !1153, line: 24, baseType: !1157, size: 1408, offset: 32)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tc_aes_key_sched_struct", file: !848, line: 64, size: 1408, elements: !1158)
!1158 = !{!1159}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !1157, file: !848, line: 65, baseType: !853, size: 1408)
!1160 = !{!1161}
!1161 = !DISubrange(count: 2)
!1162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !1164)
!1164 = !{!1165, !1166}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1163, file: !373, line: 17, baseType: !140, size: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1163, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!1167 = !DIGlobalVariableExpression(var: !1168, expr: !DIExpression())
