; ModuleID = 'build/96b_nitrogen/out_of_tree_driver/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_spinlock_key }
%struct.z_spinlock_key = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_spinlock_key }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/out_of_tree_driver/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/out_of_tree_driver")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 51, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/out_of_tree_driver")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2496, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 39)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1248, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "dev", scope: !27, file: !106, line: 11, type: !107, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !102, globals: !105, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/application_development/out_of_tree_driver/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/out_of_tree_driver")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_HELLO_WORLD", value: 66)
!101 = !DIEnumerator(name: "K_OBJ_LAST", value: 67)
!102 = !{!103, !104}
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!104 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!105 = !{!25}
!106 = !DIFile(filename: "zephyr/samples/application_development/out_of_tree_driver/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !111)
!110 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!111 = !{!112, !116, !117, !118, !127, !128}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !109, file: !110, line: 380, baseType: !113, size: 32)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !115)
!115 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !109, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !109, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !109, file: !110, line: 386, baseType: !119, size: 32, offset: 96)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 32)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !121)
!121 = !{!122, !125}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !120, file: !110, line: 359, baseType: !123, size: 8)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !124)
!124 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !120, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!126 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !109, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !109, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!131 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !110, line: 43, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !133)
!133 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "_char_out", scope: !136, file: !139, line: 54, type: !140, isLocal: false, isDefinition: true)
!136 = distinct !DICompileUnit(language: DW_LANG_C99, file: !137, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !102, globals: !138, splitDebugInlining: false, nameTableKind: None)
!137 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/out_of_tree_driver")
!138 = !{!134}
!139 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DISubroutineType(types: !142)
!142 = !{!104, !104}
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !145, file: !187, line: 27, type: !214, isLocal: true, isDefinition: true)
!145 = distinct !DICompileUnit(language: DW_LANG_C99, file: !146, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !147, retainedTypes: !159, globals: !184, splitDebugInlining: false, nameTableKind: None)
!146 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/out_of_tree_driver")
!147 = !{!148, !30}
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !149, line: 27, baseType: !32, size: 32, elements: !150)
!149 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!150 = !{!151, !152, !153, !154, !155, !156, !157, !158}
!151 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!152 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!153 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!154 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!155 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!156 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!157 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!158 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!159 = !{!103, !160, !104, !24, !164, !180, !181, !182}
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !161, line: 46, baseType: !162)
!161 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !163)
!163 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 32)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !166, line: 54, size: 96, elements: !167)
!166 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!167 = !{!168, !175, !179}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !165, file: !166, line: 55, baseType: !169, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !170, line: 33, baseType: !171)
!170 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !170, line: 29, size: 32, elements: !172)
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !171, file: !170, line: 30, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !165, file: !166, line: 60, baseType: !176, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DISubroutineType(types: !178)
!178 = !{null, !148}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !165, file: !166, line: 65, baseType: !176, size: 32, offset: 64)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !183)
!183 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!184 = !{!143, !185, !191, !193, !204, !206}
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !145, file: !187, line: 44, type: !188, isLocal: true, isDefinition: true)
!187 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !189, line: 43, elements: !190)
!189 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!190 = !{}
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !145, file: !187, line: 49, type: !188, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !145, file: !187, line: 36, type: !195, isLocal: true, isDefinition: true)
!195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !196, size: 128, elements: !202)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !149, line: 114, size: 128, elements: !197)
!197 = !{!198, !199, !200, !201}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !196, file: !149, line: 115, baseType: !148, size: 32)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !196, file: !149, line: 141, baseType: !123, size: 8, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !196, file: !149, line: 149, baseType: !181, size: 32, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !196, file: !149, line: 156, baseType: !181, size: 32, offset: 96)
!202 = !{!203}
!203 = !DISubrange(count: 1)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !145, file: !187, line: 40, type: !195, isLocal: true, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !145, file: !187, line: 28, type: !208, isLocal: true, isDefinition: true)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !170, line: 40, baseType: !209)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !170, line: 35, size: 64, elements: !210)
!210 = !{!211, !213}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !209, file: !170, line: 36, baseType: !212, size: 32)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !209, file: !170, line: 37, baseType: !212, size: 32, offset: 32)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 32, elements: !202)
!215 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !216, line: 22, baseType: !217)
!216 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!217 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!218 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!219 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !222, file: !251, line: 50, type: !238, isLocal: true, isDefinition: true)
!222 = distinct !DICompileUnit(language: DW_LANG_C99, file: !223, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !147, retainedTypes: !224, globals: !248, splitDebugInlining: false, nameTableKind: None)
!223 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/out_of_tree_driver")
!224 = !{!132, !160, !225, !104, !103, !181, !182, !227, !180, !238, !239}
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !226, line: 214, baseType: !32)
!226 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 32)
!228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !229, line: 45, size: 64, elements: !230)
!229 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!230 = !{!231, !237}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !228, file: !229, line: 46, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !170, line: 33, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !170, line: 29, size: 32, elements: !234)
!234 = !{!235}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !233, file: !170, line: 30, baseType: !236, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !228, file: !229, line: 48, baseType: !181, size: 32, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !104)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !229, line: 38, size: 64, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !240, file: !229, line: 39, baseType: !232, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !240, file: !229, line: 41, baseType: !244, size: 32, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !229, line: 35, baseType: !245)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 32)
!246 = !DISubroutineType(types: !247)
!247 = !{null, !238}
!248 = !{!249, !253, !261, !220, !263, !273}
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "latency_lock", scope: !222, file: !251, line: 44, type: !252, isLocal: true, isDefinition: true)
!251 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !189, line: 43, elements: !190)
!253 = !DIGlobalVariableExpression(var: !254, expr: !DIExpression())
!254 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !222, file: !251, line: 46, type: !255, isLocal: true, isDefinition: true)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !170, line: 40, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !170, line: 35, size: 64, elements: !257)
!257 = !{!258, !260}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !256, file: !170, line: 36, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !256, file: !170, line: 37, baseType: !259, size: 32, offset: 32)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "latency_subs", scope: !222, file: !251, line: 52, type: !255, isLocal: true, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !222, file: !251, line: 39, type: !265, isLocal: true, isDefinition: true)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, elements: !271)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !251, line: 35, size: 96, elements: !267)
!267 = !{!268, !269, !270}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !266, file: !251, line: 36, baseType: !148, size: 32)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !266, file: !251, line: 37, baseType: !123, size: 8, offset: 32)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !266, file: !251, line: 38, baseType: !215, size: 32, offset: 64)
!271 = !{!272}
!272 = !DISubrange(count: 0)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !222, file: !251, line: 48, type: !238, isLocal: true, isDefinition: true)
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !277, file: !284, line: 47, type: !298, isLocal: true, isDefinition: true)
!277 = distinct !DICompileUnit(language: DW_LANG_C99, file: !278, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !279, retainedTypes: !280, globals: !281, splitDebugInlining: false, nameTableKind: None)
!278 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/out_of_tree_driver")
!279 = !{!148}
!280 = !{!225, !104}
!281 = !{!282, !275, !294}
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "cpus_states", scope: !277, file: !284, line: 50, type: !285, isLocal: true, isDefinition: true)
!284 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!285 = !DICompositeType(tag: DW_TAG_array_type, baseType: !286, size: 32, elements: !202)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !149, line: 114, size: 128, elements: !289)
!289 = !{!290, !291, !292, !293}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !288, file: !149, line: 115, baseType: !148, size: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !288, file: !149, line: 141, baseType: !123, size: 8, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !288, file: !149, line: 149, baseType: !181, size: 32, offset: 64)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !288, file: !149, line: 156, baseType: !181, size: 32, offset: 96)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !277, file: !284, line: 55, type: !296, isLocal: true, isDefinition: true)
!296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !297, size: 8, elements: !202)
!297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !123)
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, elements: !271)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "static_regions", scope: !301, file: !308, line: 62, type: !441, isLocal: true, isDefinition: true)
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !303, globals: !304, splitDebugInlining: false, nameTableKind: None)
!302 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/out_of_tree_driver")
!303 = !{!225, !104, !181, !103}
!304 = !{!305, !299}
!305 = !DIGlobalVariableExpression(var: !306, expr: !DIExpression())
!306 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !307, file: !308, line: 198, type: !429, isLocal: true, isDefinition: true)
!307 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !308, file: !308, line: 175, type: !309, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !301, retainedNodes: !426)
!308 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!309 = !DISubroutineType(types: !310)
!310 = !{null, !311}
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !313, line: 245, size: 1024, elements: !314)
!313 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!314 = !{!315, !382, !395, !396, !397, !398, !404, !421}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !312, file: !313, line: 247, baseType: !316, size: 384)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !313, line: 57, size: 384, elements: !317)
!317 = !{!318, !346, !354, !355, !356, !369, !370, !371}
!318 = !DIDerivedType(tag: DW_TAG_member, scope: !316, file: !313, line: 60, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !316, file: !313, line: 60, size: 64, elements: !320)
!320 = !{!321, !337}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !319, file: !313, line: 61, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !323, line: 49, baseType: !324)
!323 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !323, line: 37, size: 64, elements: !325)
!325 = !{!326, !332}
!326 = !DIDerivedType(tag: DW_TAG_member, scope: !324, file: !323, line: 38, baseType: !327, size: 32)
!327 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !324, file: !323, line: 38, size: 32, elements: !328)
!328 = !{!329, !331}
!329 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !327, file: !323, line: 39, baseType: !330, size: 32)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !327, file: !323, line: 40, baseType: !330, size: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, scope: !324, file: !323, line: 42, baseType: !333, size: 32, offset: 32)
!333 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !324, file: !323, line: 42, size: 32, elements: !334)
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !333, file: !323, line: 43, baseType: !330, size: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !333, file: !323, line: 44, baseType: !330, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !319, file: !313, line: 62, baseType: !338, size: 64)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !339, line: 49, size: 64, elements: !340)
!339 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!340 = !{!341}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !338, file: !339, line: 50, baseType: !342, size: 64)
!342 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 64, elements: !344)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 32)
!344 = !{!345}
!345 = !DISubrange(count: 2)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !316, file: !313, line: 68, baseType: !347, size: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !349, line: 233, baseType: !350)
!349 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !349, line: 231, size: 64, elements: !351)
!351 = !{!352}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !350, file: !349, line: 232, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !323, line: 48, baseType: !324)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !316, file: !313, line: 71, baseType: !123, size: 8, offset: 96)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !316, file: !313, line: 74, baseType: !123, size: 8, offset: 104)
!356 = !DIDerivedType(tag: DW_TAG_member, scope: !316, file: !313, line: 90, baseType: !357, size: 16, offset: 112)
!357 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !316, file: !313, line: 90, size: 16, elements: !358)
!358 = !{!359, !366}
!359 = !DIDerivedType(tag: DW_TAG_member, scope: !357, file: !313, line: 91, baseType: !360, size: 16)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !357, file: !313, line: 91, size: 16, elements: !361)
!361 = !{!362, !365}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !360, file: !313, line: 96, baseType: !363, size: 8)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !364)
!364 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !360, file: !313, line: 97, baseType: !123, size: 8, offset: 8)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !357, file: !313, line: 100, baseType: !367, size: 16)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !368)
!368 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !316, file: !313, line: 107, baseType: !181, size: 32, offset: 128)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !316, file: !313, line: 127, baseType: !103, size: 32, offset: 160)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !316, file: !313, line: 131, baseType: !372, size: 192, offset: 192)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !349, line: 244, size: 192, elements: !373)
!373 = !{!374, !375, !381}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !372, file: !349, line: 245, baseType: !322, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !372, file: !349, line: 246, baseType: !376, size: 32, offset: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !349, line: 242, baseType: !377)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !372, file: !349, line: 249, baseType: !162, size: 64, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !312, file: !313, line: 250, baseType: !383, size: 288, offset: 384)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !384, line: 25, size: 288, elements: !385)
!384 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!385 = !{!386, !387, !388, !389, !390, !391, !392, !393, !394}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !383, file: !384, line: 26, baseType: !181, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !383, file: !384, line: 27, baseType: !181, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !383, file: !384, line: 28, baseType: !181, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !383, file: !384, line: 29, baseType: !181, size: 32, offset: 96)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !383, file: !384, line: 30, baseType: !181, size: 32, offset: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !383, file: !384, line: 31, baseType: !181, size: 32, offset: 160)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !383, file: !384, line: 32, baseType: !181, size: 32, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !383, file: !384, line: 33, baseType: !181, size: 32, offset: 224)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !383, file: !384, line: 34, baseType: !181, size: 32, offset: 256)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !312, file: !313, line: 253, baseType: !103, size: 32, offset: 672)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !312, file: !313, line: 256, baseType: !348, size: 64, offset: 704)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !312, file: !313, line: 294, baseType: !104, size: 32, offset: 768)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !312, file: !313, line: 300, baseType: !399, size: 96, offset: 800)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !313, line: 149, size: 96, elements: !400)
!400 = !{!401, !402, !403}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !399, file: !313, line: 153, baseType: !22, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !399, file: !313, line: 162, baseType: !225, size: 32, offset: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !399, file: !313, line: 168, baseType: !225, size: 32, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !312, file: !313, line: 325, baseType: !405, size: 32, offset: 896)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !407, line: 5073, size: 160, elements: !408)
!407 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!408 = !{!409, !418, !419}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !406, file: !407, line: 5074, baseType: !410, size: 96)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !411, line: 56, size: 96, elements: !412)
!411 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!412 = !{!413, !416, !417}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !410, file: !411, line: 57, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 32)
!415 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !411, line: 57, flags: DIFlagFwdDecl)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !410, file: !411, line: 58, baseType: !103, size: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !410, file: !411, line: 59, baseType: !225, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !406, file: !407, line: 5075, baseType: !348, size: 64, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !406, file: !407, line: 5076, baseType: !420, offset: 160)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !189, line: 43, elements: !190)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !312, file: !313, line: 343, baseType: !422, size: 64, offset: 928)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !384, line: 60, size: 64, elements: !423)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !422, file: !384, line: 63, baseType: !181, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !422, file: !384, line: 66, baseType: !181, size: 32, offset: 32)
!426 = !{!427, !428}
!427 = !DILocalVariable(name: "thread", arg: 1, scope: !307, file: !308, line: 175, type: !311)
!428 = !DILocalVariable(name: "region_num", scope: !307, file: !308, line: 200, type: !123)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, elements: !271)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !431, line: 52, size: 96, elements: !432)
!431 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!432 = !{!433, !434, !435}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !430, file: !431, line: 53, baseType: !22, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !430, file: !431, line: 54, baseType: !225, size: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !430, file: !431, line: 55, baseType: !436, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !437, line: 151, baseType: !438)
!437 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !437, line: 149, size: 32, elements: !439)
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !438, file: !437, line: 150, baseType: !181, size: 32)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 96, elements: !202)
!442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !430)
!443 = !DIGlobalVariableExpression(var: !444, expr: !DIExpression())
!444 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !445, file: !479, line: 39, type: !123, isLocal: true, isDefinition: true)
!445 = distinct !DICompileUnit(language: DW_LANG_C99, file: !446, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !447, globals: !478, splitDebugInlining: false, nameTableKind: None)
!446 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/out_of_tree_driver")
!447 = !{!448, !103, !104, !466, !123}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !450, line: 1226, baseType: !451)
!450 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !450, line: 1213, size: 352, elements: !452)
!452 = !{!453, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !451, file: !450, line: 1215, baseType: !454, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !181)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !451, file: !450, line: 1216, baseType: !455, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !451, file: !450, line: 1217, baseType: !455, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !451, file: !450, line: 1218, baseType: !455, size: 32, offset: 96)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !451, file: !450, line: 1219, baseType: !455, size: 32, offset: 128)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !451, file: !450, line: 1220, baseType: !455, size: 32, offset: 160)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !451, file: !450, line: 1221, baseType: !455, size: 32, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !451, file: !450, line: 1222, baseType: !455, size: 32, offset: 224)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !451, file: !450, line: 1223, baseType: !455, size: 32, offset: 256)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !451, file: !450, line: 1224, baseType: !455, size: 32, offset: 288)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !451, file: !450, line: 1225, baseType: !455, size: 32, offset: 320)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !469, line: 27, size: 96, elements: !470)
!469 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!470 = !{!471, !472, !473}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !468, file: !469, line: 29, baseType: !181, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !468, file: !469, line: 31, baseType: !113, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !468, file: !469, line: 37, baseType: !474, size: 32, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !437, line: 146, baseType: !475)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !437, line: 141, size: 32, elements: !476)
!476 = !{!477}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !475, file: !437, line: 143, baseType: !181, size: 32)
!478 = !{!443}
!479 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!480 = !DIGlobalVariableExpression(var: !481, expr: !DIExpression())
!481 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !482, file: !489, line: 21, type: !140, isLocal: true, isDefinition: true)
!482 = distinct !DICompileUnit(language: DW_LANG_C99, file: !483, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !484, globals: !488, splitDebugInlining: false, nameTableKind: None)
!483 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/out_of_tree_driver")
!484 = !{!485, !104, !103}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !487, line: 22, baseType: !104)
!487 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!488 = !{!480}
!489 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !492, file: !497, line: 13, type: !514, isLocal: true, isDefinition: true)
!492 = distinct !DICompileUnit(language: DW_LANG_C99, file: !493, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !494, splitDebugInlining: false, nameTableKind: None)
!493 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/out_of_tree_driver")
!494 = !{!495, !490}
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "mpu_config", scope: !492, file: !497, line: 37, type: !498, isLocal: false, isDefinition: true)
!497 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!498 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !499)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !469, line: 41, size: 64, elements: !500)
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !499, file: !469, line: 43, baseType: !181, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !499, file: !469, line: 45, baseType: !503, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !505)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !469, line: 27, size: 96, elements: !506)
!506 = !{!507, !508, !509}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !505, file: !469, line: 29, baseType: !181, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !505, file: !469, line: 31, baseType: !113, size: 32, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !505, file: !469, line: 37, baseType: !510, size: 32, offset: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !437, line: 146, baseType: !511)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !437, line: 141, size: 32, elements: !512)
!512 = !{!513}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !511, file: !437, line: 143, baseType: !181, size: 32)
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !504, size: 192, elements: !344)
!515 = !DIGlobalVariableExpression(var: !516, expr: !DIExpression())
!516 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !517, file: !677, line: 93, type: !678, isLocal: true, isDefinition: true, align: 32)
!517 = distinct !DICompileUnit(language: DW_LANG_C99, file: !518, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !519, globals: !672, splitDebugInlining: false, nameTableKind: None)
!518 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/out_of_tree_driver")
!519 = !{!520, !123, !103, !104, !594, !181, !595, !631, !642}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !522, line: 882, baseType: !523)
!522 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 850, size: 19456, elements: !524)
!524 = !{!525, !529, !530, !531, !535, !536, !538, !539, !540, !544, !545, !546, !550, !551, !555, !556, !560, !561, !565, !566, !567, !568, !569, !570, !574, !575, !579, !580, !584}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !523, file: !522, line: 851, baseType: !526, size: 960)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 960, elements: !527)
!527 = !{!528}
!528 = !DISubrange(count: 30)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !523, file: !522, line: 852, baseType: !455, size: 32, offset: 960)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !523, file: !522, line: 853, baseType: !455, size: 32, offset: 992)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !523, file: !522, line: 854, baseType: !532, size: 1088, offset: 1024)
!532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 1088, elements: !533)
!533 = !{!534}
!534 = !DISubrange(count: 34)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !523, file: !522, line: 855, baseType: !455, size: 32, offset: 2112)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !523, file: !522, line: 856, baseType: !537, size: 64, offset: 2144)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 64, elements: !344)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !523, file: !522, line: 857, baseType: !455, size: 32, offset: 2208)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !523, file: !522, line: 858, baseType: !455, size: 32, offset: 2240)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !523, file: !522, line: 859, baseType: !541, size: 3904, offset: 2272)
!541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 3904, elements: !542)
!542 = !{!543}
!543 = !DISubrange(count: 122)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !523, file: !522, line: 860, baseType: !455, size: 32, offset: 6176)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !523, file: !522, line: 861, baseType: !455, size: 32, offset: 6208)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !523, file: !522, line: 862, baseType: !547, size: 1952, offset: 6240)
!547 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 1952, elements: !548)
!548 = !{!549}
!549 = !DISubrange(count: 61)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !523, file: !522, line: 863, baseType: !455, size: 32, offset: 8192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !523, file: !522, line: 864, baseType: !552, size: 288, offset: 8224)
!552 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 288, elements: !553)
!553 = !{!554}
!554 = !DISubrange(count: 9)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !523, file: !522, line: 865, baseType: !454, size: 32, offset: 8512)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !523, file: !522, line: 866, baseType: !557, size: 1696, offset: 8544)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 1696, elements: !558)
!558 = !{!559}
!559 = !DISubrange(count: 53)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !523, file: !522, line: 867, baseType: !455, size: 32, offset: 10240)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !523, file: !522, line: 868, baseType: !562, size: 96, offset: 10272)
!562 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 96, elements: !563)
!563 = !{!564}
!564 = !DISubrange(count: 3)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !523, file: !522, line: 869, baseType: !455, size: 32, offset: 10368)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !523, file: !522, line: 870, baseType: !537, size: 64, offset: 10400)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !523, file: !522, line: 871, baseType: !455, size: 32, offset: 10464)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !523, file: !522, line: 872, baseType: !455, size: 32, offset: 10496)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !523, file: !522, line: 873, baseType: !455, size: 32, offset: 10528)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !523, file: !522, line: 875, baseType: !571, size: 352, offset: 10560)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 352, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 11)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !523, file: !522, line: 876, baseType: !455, size: 32, offset: 10912)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !523, file: !522, line: 878, baseType: !576, size: 256, offset: 10944)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 256, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 8)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !523, file: !522, line: 879, baseType: !455, size: 32, offset: 11200)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !523, file: !522, line: 880, baseType: !581, size: 7200, offset: 11232)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 7200, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 225)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !523, file: !522, line: 881, baseType: !585, size: 1024, offset: 18432)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !586, size: 1024, elements: !577)
!586 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !587)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !522, line: 258, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 252, size: 128, elements: !589)
!589 = !{!590, !591, !592, !593}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !588, file: !522, line: 253, baseType: !455, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !588, file: !522, line: 254, baseType: !455, size: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !588, file: !522, line: 255, baseType: !455, size: 32, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !588, file: !522, line: 257, baseType: !454, size: 32, offset: 96)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !450, line: 468, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !450, line: 445, size: 1120, elements: !598)
!598 = !{!599, !600, !601, !602, !603, !604, !605, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !624, !628, !630}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !597, file: !450, line: 447, baseType: !454, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !597, file: !450, line: 448, baseType: !455, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !597, file: !450, line: 449, baseType: !455, size: 32, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !597, file: !450, line: 450, baseType: !455, size: 32, offset: 96)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !597, file: !450, line: 451, baseType: !455, size: 32, offset: 128)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !597, file: !450, line: 452, baseType: !455, size: 32, offset: 160)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !597, file: !450, line: 453, baseType: !606, size: 96, offset: 192)
!606 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 96, elements: !608)
!607 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !123)
!608 = !{!609}
!609 = !DISubrange(count: 12)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !597, file: !450, line: 454, baseType: !455, size: 32, offset: 288)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !597, file: !450, line: 455, baseType: !455, size: 32, offset: 320)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !597, file: !450, line: 456, baseType: !455, size: 32, offset: 352)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !597, file: !450, line: 457, baseType: !455, size: 32, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !597, file: !450, line: 458, baseType: !455, size: 32, offset: 416)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !597, file: !450, line: 459, baseType: !455, size: 32, offset: 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !597, file: !450, line: 460, baseType: !455, size: 32, offset: 480)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !597, file: !450, line: 461, baseType: !537, size: 64, offset: 512)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !597, file: !450, line: 462, baseType: !454, size: 32, offset: 576)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !597, file: !450, line: 463, baseType: !454, size: 32, offset: 608)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !597, file: !450, line: 464, baseType: !621, size: 128, offset: 640)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 128, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 4)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !597, file: !450, line: 465, baseType: !625, size: 160, offset: 768)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 160, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 5)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !597, file: !450, line: 466, baseType: !629, size: 160, offset: 928)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 160, elements: !626)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !597, file: !450, line: 467, baseType: !455, size: 32, offset: 1088)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !633, file: !632, line: 167, baseType: !641)
!632 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!633 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !632, file: !632, line: 134, type: !634, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !517, retainedNodes: !636)
!634 = !DISubroutineType(types: !635)
!635 = !{null, !181}
!636 = !{!637, !638, !640}
!637 = !DILocalVariable(name: "time_us", arg: 1, scope: !633, file: !632, line: 134, type: !181)
!638 = !DILocalVariable(name: "delay_cycles", scope: !633, file: !632, line: 168, type: !639)
!639 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!640 = !DILocalVariable(name: "cycles", scope: !633, file: !632, line: 171, type: !181)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !522, line: 2140, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 2119, size: 10880, elements: !645)
!645 = !{!646, !650, !651, !655, !656, !661, !662, !663, !664, !668, !669, !670, !671}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !644, file: !522, line: 2120, baseType: !647, size: 8192)
!647 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 8192, elements: !648)
!648 = !{!649}
!649 = !DISubrange(count: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !644, file: !522, line: 2121, baseType: !454, size: 32, offset: 8192)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !644, file: !522, line: 2122, baseType: !652, size: 2048, offset: 8224)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 2048, elements: !653)
!653 = !{!654}
!654 = !DISubrange(count: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !644, file: !522, line: 2123, baseType: !455, size: 32, offset: 10272)
!656 = !DIDerivedType(tag: DW_TAG_member, scope: !644, file: !522, line: 2125, baseType: !657, size: 32, offset: 10304)
!657 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !644, file: !522, line: 2125, size: 32, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !657, file: !522, line: 2126, baseType: !455, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !657, file: !522, line: 2127, baseType: !455, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !644, file: !522, line: 2130, baseType: !455, size: 32, offset: 10336)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !644, file: !522, line: 2131, baseType: !455, size: 32, offset: 10368)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !644, file: !522, line: 2133, baseType: !455, size: 32, offset: 10400)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !644, file: !522, line: 2135, baseType: !665, size: 320, offset: 10432)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 320, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 10)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !644, file: !522, line: 2136, baseType: !455, size: 32, offset: 10752)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !644, file: !522, line: 2137, baseType: !454, size: 32, offset: 10784)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !644, file: !522, line: 2138, baseType: !455, size: 32, offset: 10816)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !644, file: !522, line: 2139, baseType: !455, size: 32, offset: 10848)
!672 = !{!515, !673}
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !633, file: !632, line: 161, type: !675, isLocal: true, isDefinition: true, align: 128)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 48, elements: !563)
!676 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !367)
!677 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !680, line: 51, size: 64, elements: !681)
!680 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!681 = !{!682, !689}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !679, file: !680, line: 60, baseType: !683, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 32)
!684 = !DISubroutineType(types: !685)
!685 = !{!104, !686}
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !688)
!688 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !680, line: 48, flags: DIFlagFwdDecl)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !679, file: !680, line: 65, baseType: !686, size: 32, offset: 32)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "__device_dts_ord_34", scope: !692, file: !916, line: 733, type: !1017, isLocal: false, isDefinition: true, align: 32)
!692 = distinct !DICompileUnit(language: DW_LANG_C99, file: !693, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !694, retainedTypes: !827, globals: !912, splitDebugInlining: false, nameTableKind: None)
!693 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/out_of_tree_driver")
!694 = !{!695, !701, !30, !706, !711, !718, !724, !730, !739, !743, !792, !799, !818}
!695 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !696, line: 23, baseType: !32, size: 32, elements: !697)
!696 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!697 = !{!698, !699, !700}
!698 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!699 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!700 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!701 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !696, line: 48, baseType: !32, size: 32, elements: !702)
!702 = !{!703, !704, !705}
!703 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!704 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!705 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!706 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !707, line: 167, baseType: !32, size: 32, elements: !708)
!707 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!708 = !{!709, !710}
!709 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!710 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!711 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !707, line: 107, baseType: !32, size: 32, elements: !712)
!712 = !{!713, !714, !715, !716, !717}
!713 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!714 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!715 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!716 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!717 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!718 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !707, line: 208, baseType: !32, size: 32, elements: !719)
!719 = !{!720, !721, !722, !723}
!720 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!721 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!722 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!723 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!724 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !707, line: 261, baseType: !32, size: 32, elements: !725)
!725 = !{!726, !727, !728, !729}
!726 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!727 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!728 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!729 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!730 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !707, line: 237, baseType: !32, size: 32, elements: !731)
!731 = !{!732, !733, !734, !735, !736, !737, !738}
!732 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!733 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!734 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!735 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!736 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!737 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!738 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!739 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !707, line: 152, baseType: !32, size: 32, elements: !740)
!740 = !{!741, !742}
!741 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!742 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!743 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !522, line: 71, baseType: !104, size: 32, elements: !744)
!744 = !{!745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791}
!745 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!746 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!747 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!748 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!749 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!750 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!751 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!752 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!753 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!754 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!755 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!756 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!757 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!758 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!759 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!760 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!761 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!762 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!763 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!764 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!765 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!766 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!767 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!768 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!769 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!770 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!771 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!772 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!773 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!774 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!775 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!776 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!777 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!778 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!779 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!780 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!781 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!782 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!783 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!784 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!785 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!786 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!787 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!788 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!789 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!790 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!791 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!792 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !793, line: 44, baseType: !32, size: 32, elements: !794)
!793 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!794 = !{!795, !796, !797, !798}
!795 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!796 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!797 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!798 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!799 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !800, line: 54, baseType: !32, size: 32, elements: !801)
!800 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!801 = !{!802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817}
!802 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!803 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!804 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!805 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!806 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!807 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!808 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!809 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!810 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!811 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!812 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!813 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!814 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!815 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!816 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!817 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!818 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !819, line: 53, baseType: !32, size: 32, elements: !820)
!819 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!820 = !{!821, !822, !823, !824, !825, !826}
!821 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!822 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!823 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!824 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!825 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!826 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!827 = !{!695, !103, !104, !828, !876, !877, !878, !879, !160, !181, !182, !126, !594, !880, !238, !881, !911, !225}
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !522, line: 837, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 804, size: 11008, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837, !838, !839, !843, !844, !845, !846, !847, !848, !852, !853, !854, !858, !859, !860, !861, !862, !863, !864, !868, !869, !873, !874, !875}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !830, file: !522, line: 805, baseType: !455, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !830, file: !522, line: 806, baseType: !455, size: 32, offset: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !830, file: !522, line: 807, baseType: !455, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !830, file: !522, line: 808, baseType: !455, size: 32, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !830, file: !522, line: 809, baseType: !455, size: 32, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !830, file: !522, line: 810, baseType: !455, size: 32, offset: 160)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !830, file: !522, line: 811, baseType: !455, size: 32, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !830, file: !522, line: 812, baseType: !840, size: 1824, offset: 224)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 1824, elements: !841)
!841 = !{!842}
!842 = !DISubrange(count: 57)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !830, file: !522, line: 813, baseType: !455, size: 32, offset: 2048)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !830, file: !522, line: 814, baseType: !455, size: 32, offset: 2080)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !830, file: !522, line: 815, baseType: !454, size: 32, offset: 2112)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !830, file: !522, line: 816, baseType: !455, size: 32, offset: 2144)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !830, file: !522, line: 817, baseType: !455, size: 32, offset: 2176)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !830, file: !522, line: 818, baseType: !849, size: 3968, offset: 2208)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 3968, elements: !850)
!850 = !{!851}
!851 = !DISubrange(count: 124)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !830, file: !522, line: 819, baseType: !455, size: 32, offset: 6176)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !830, file: !522, line: 820, baseType: !455, size: 32, offset: 6208)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !830, file: !522, line: 821, baseType: !855, size: 2016, offset: 6240)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 2016, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 63)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !830, file: !522, line: 822, baseType: !454, size: 32, offset: 8256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !830, file: !522, line: 824, baseType: !454, size: 32, offset: 8288)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !830, file: !522, line: 825, baseType: !454, size: 32, offset: 8320)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !830, file: !522, line: 826, baseType: !454, size: 32, offset: 8352)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !830, file: !522, line: 828, baseType: !454, size: 32, offset: 8384)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !830, file: !522, line: 829, baseType: !454, size: 32, offset: 8416)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !830, file: !522, line: 831, baseType: !865, size: 1984, offset: 8448)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 1984, elements: !866)
!866 = !{!867}
!867 = !DISubrange(count: 62)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !830, file: !522, line: 832, baseType: !455, size: 32, offset: 10432)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !830, file: !522, line: 833, baseType: !870, size: 224, offset: 10464)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 224, elements: !871)
!871 = !{!872}
!872 = !DISubrange(count: 7)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !830, file: !522, line: 834, baseType: !455, size: 32, offset: 10688)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !830, file: !522, line: 835, baseType: !576, size: 256, offset: 10720)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !830, file: !522, line: 836, baseType: !455, size: 32, offset: 10976)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !707, line: 146, baseType: !711)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 32)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !707, line: 164, baseType: !739)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !450, line: 426, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !450, line: 411, size: 28704, elements: !884)
!884 = !{!885, !887, !891, !892, !893, !894, !895, !896, !897, !898, !902, !906, !910}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !883, file: !450, line: 413, baseType: !886, size: 256)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 256, elements: !577)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !883, file: !450, line: 414, baseType: !888, size: 768, offset: 256)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 768, elements: !889)
!889 = !{!890}
!890 = !DISubrange(count: 24)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !883, file: !450, line: 415, baseType: !886, size: 256, offset: 1024)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !883, file: !450, line: 416, baseType: !888, size: 768, offset: 1280)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !883, file: !450, line: 417, baseType: !886, size: 256, offset: 2048)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !883, file: !450, line: 418, baseType: !888, size: 768, offset: 2304)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !883, file: !450, line: 419, baseType: !886, size: 256, offset: 3072)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !883, file: !450, line: 420, baseType: !888, size: 768, offset: 3328)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !883, file: !450, line: 421, baseType: !886, size: 256, offset: 4096)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !883, file: !450, line: 422, baseType: !899, size: 1792, offset: 4352)
!899 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 1792, elements: !900)
!900 = !{!901}
!901 = !DISubrange(count: 56)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !883, file: !450, line: 423, baseType: !903, size: 1920, offset: 6144)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 1920, elements: !904)
!904 = !{!905}
!905 = !DISubrange(count: 240)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !883, file: !450, line: 424, baseType: !907, size: 20608, offset: 8064)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 20608, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 644)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !883, file: !450, line: 425, baseType: !455, size: 32, offset: 28672)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !793, line: 56, baseType: !103)
!912 = !{!913, !963, !1004, !690, !1007, !1032, !1034, !1051, !1053, !1063, !1066, !1081, !1084, !1122, !1136}
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "on", scope: !915, file: !916, line: 549, type: !215, isLocal: true, isDefinition: true)
!915 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !916, file: !916, line: 547, type: !917, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !692, retainedNodes: !919)
!916 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!917 = !DISubroutineType(types: !918)
!918 = !{null, !701}
!919 = !{!920, !921, !924}
!920 = !DILocalVariable(name: "start_mode", arg: 1, scope: !915, file: !916, line: 547, type: !701)
!921 = !DILocalVariable(name: "err", scope: !922, file: !916, line: 553, type: !104)
!922 = distinct !DILexicalBlock(scope: !923, file: !916, line: 552, column: 31)
!923 = distinct !DILexicalBlock(scope: !915, file: !916, line: 552, column: 6)
!924 = !DILocalVariable(name: "mgr", scope: !922, file: !916, line: 554, type: !925)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !927, line: 154, size: 224, elements: !928)
!927 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!928 = !{!929, !941, !942, !958, !960, !961, !962}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !926, file: !927, line: 158, baseType: !930, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !170, line: 40, baseType: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !170, line: 35, size: 64, elements: !932)
!932 = !{!933, !940}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !931, file: !170, line: 36, baseType: !934, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !170, line: 33, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !170, line: 29, size: 32, elements: !937)
!937 = !{!938}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !936, file: !170, line: 30, baseType: !939, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !931, file: !170, line: 37, baseType: !934, size: 32, offset: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !926, file: !927, line: 163, baseType: !930, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !926, file: !927, line: 166, baseType: !943, size: 32, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !927, line: 133, size: 96, elements: !946)
!946 = !{!947, !956, !957}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !945, file: !927, line: 135, baseType: !948, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !927, line: 129, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 32)
!950 = !DISubroutineType(types: !951)
!951 = !{null, !925, !952}
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !927, line: 101, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 32)
!954 = !DISubroutineType(types: !955)
!955 = !{null, !925, !104}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !945, file: !927, line: 138, baseType: !948, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !945, file: !927, line: 143, baseType: !948, size: 32, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !926, file: !927, line: 169, baseType: !959, offset: 160)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !189, line: 43, elements: !190)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !926, file: !927, line: 172, baseType: !104, size: 32, offset: 160)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !926, file: !927, line: 175, baseType: !367, size: 16, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !926, file: !927, line: 178, baseType: !367, size: 16, offset: 208)
!963 = !DIGlobalVariableExpression(var: !964, expr: !DIExpression())
!964 = distinct !DIGlobalVariable(name: "cli", scope: !915, file: !916, line: 550, type: !965, isLocal: true, isDefinition: true)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !927, line: 273, size: 128, elements: !966)
!966 = !{!967, !968}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !965, file: !927, line: 280, baseType: !935, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !965, file: !927, line: 283, baseType: !969, size: 96, offset: 32)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !970, line: 138, size: 96, elements: !971)
!970 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!971 = !{!972, !1001, !1002}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !969, file: !970, line: 149, baseType: !973, size: 32)
!973 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !970, line: 139, size: 32, elements: !974)
!974 = !{!975, !996}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !973, file: !970, line: 145, baseType: !976, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 32)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !407, line: 5397, size: 128, elements: !978)
!978 = !{!979, !994, !995}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !977, file: !407, line: 5399, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !323, line: 48, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !323, line: 37, size: 64, elements: !982)
!982 = !{!983, !989}
!983 = !DIDerivedType(tag: DW_TAG_member, scope: !981, file: !323, line: 38, baseType: !984, size: 32)
!984 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !981, file: !323, line: 38, size: 32, elements: !985)
!985 = !{!986, !988}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !984, file: !323, line: 39, baseType: !987, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !984, file: !323, line: 40, baseType: !987, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, scope: !981, file: !323, line: 42, baseType: !990, size: 32, offset: 32)
!990 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !981, file: !323, line: 42, size: 32, elements: !991)
!991 = !{!992, !993}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !990, file: !323, line: 43, baseType: !987, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !990, file: !323, line: 44, baseType: !987, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !977, file: !407, line: 5405, baseType: !32, size: 32, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !977, file: !407, line: 5408, baseType: !104, size: 32, offset: 96)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !973, file: !970, line: 148, baseType: !997, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !970, line: 98, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!999 = !DISubroutineType(types: !1000)
!1000 = !{null, null}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !969, file: !970, line: 165, baseType: !455, size: 32, offset: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !969, file: !970, line: 174, baseType: !1003, size: 32, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !104)
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_34", scope: !692, file: !916, line: 733, type: !1006, isLocal: false, isDefinition: true, align: 16)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !130, size: 80, elements: !626)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_34", scope: !692, file: !916, line: 733, type: !1009, isLocal: true, isDefinition: true, align: 32)
!1009 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !680, line: 51, size: 64, elements: !1011)
!1011 = !{!1012, !1031}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1010, file: !680, line: 60, baseType: !1013, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!104, !1016}
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 32)
!1017 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !110, line: 378, size: 192, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1029, !1030}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1018, file: !110, line: 380, baseType: !113, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1018, file: !110, line: 382, baseType: !13, size: 32, offset: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1018, file: !110, line: 384, baseType: !13, size: 32, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1018, file: !110, line: 386, baseType: !1024, size: 32, offset: 96)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 32)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !110, line: 351, size: 16, elements: !1026)
!1026 = !{!1027, !1028}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1025, file: !110, line: 359, baseType: !123, size: 8)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1025, file: !110, line: 364, baseType: !126, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1018, file: !110, line: 388, baseType: !103, size: 32, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1018, file: !110, line: 396, baseType: !129, size: 32, offset: 160)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1010, file: !680, line: 65, baseType: !1016, size: 32, offset: 32)
!1032 = !DIGlobalVariableExpression(var: !1033, expr: !DIExpression())
!1033 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !692, file: !916, line: 79, type: !215, isLocal: true, isDefinition: true)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(name: "data", scope: !692, file: !916, line: 702, type: !1036, isLocal: true, isDefinition: true)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !916, line: 69, size: 640, elements: !1037)
!1037 = !{!1038, !1040}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !1036, file: !916, line: 70, baseType: !1039, size: 448)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 448, elements: !344)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !1036, file: !916, line: 71, baseType: !1041, size: 192, offset: 448)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 192, elements: !344)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !916, line: 52, size: 96, elements: !1043)
!1043 = !{!1044, !1049, !1050}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !1042, file: !916, line: 53, baseType: !1045, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !793, line: 72, baseType: !1046)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 32)
!1047 = !DISubroutineType(types: !1048)
!1048 = !{null, !1016, !911, !103}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !1042, file: !916, line: 54, baseType: !103, size: 32, offset: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1042, file: !916, line: 55, baseType: !181, size: 32, offset: 64)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_34", scope: !692, file: !916, line: 733, type: !1025, isLocal: true, isDefinition: true, align: 8)
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
!1054 = distinct !DIGlobalVariable(name: "d", scope: !1055, file: !916, line: 476, type: !1061, isLocal: true, isDefinition: true)
