; ModuleID = 'build/96b_nitrogen/tmp108/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct.k_spinlock = type { i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_spinlock }
%struct.arm_mpu_region = type { i32, i8*, %struct.k_spinlock }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }
%struct.nrf_clock_control_sub_config = type { void ()*, void ()* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/tmp108/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/tmp108")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 51, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/tmp108")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2496, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 39)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1248, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/tmp108")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !111, file: !154, line: 27, type: !184, isLocal: true, isDefinition: true)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !125, globals: !151, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/tmp108")
!113 = !{!114, !30}
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !115, line: 27, baseType: !32, size: 32, elements: !116)
!115 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!118 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!119 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!120 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!121 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!122 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!123 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!124 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!125 = !{!102, !126, !103, !24, !130, !146, !148, !149}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !127, line: 46, baseType: !128)
!127 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !129)
!129 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 32)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !132, line: 54, size: 96, elements: !133)
!132 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!133 = !{!134, !141, !145}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !131, file: !132, line: 55, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !137)
!136 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !138)
!138 = !{!139}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !137, file: !136, line: 30, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !131, file: !132, line: 60, baseType: !142, size: 32, offset: 32)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 32)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !114}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !131, file: !132, line: 65, baseType: !142, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !150)
!150 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!151 = !{!109, !152, !159, !161, !174, !176}
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !111, file: !154, line: 44, type: !155, isLocal: true, isDefinition: true)
!154 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, size: 32, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{!158}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !155, file: !156, line: 52, baseType: !22, size: 32)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !111, file: !154, line: 49, type: !155, isLocal: true, isDefinition: true)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !111, file: !154, line: 36, type: !163, isLocal: true, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !164, size: 128, elements: !172)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !115, line: 114, size: 128, elements: !165)
!165 = !{!166, !167, !170, !171}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !164, file: !115, line: 115, baseType: !114, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !164, file: !115, line: 141, baseType: !168, size: 8, offset: 32)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !169)
!169 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !164, file: !115, line: 149, baseType: !148, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !164, file: !115, line: 156, baseType: !148, size: 32, offset: 96)
!172 = !{!173}
!173 = !DISubrange(count: 1)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !111, file: !154, line: 40, type: !163, isLocal: true, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !111, file: !154, line: 28, type: !178, isLocal: true, isDefinition: true)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !179)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !180)
!180 = !{!181, !183}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !179, file: !136, line: 36, baseType: !182, size: 32)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !179, file: !136, line: 37, baseType: !182, size: 32, offset: 32)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !185, size: 32, elements: !172)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !186, line: 22, baseType: !187)
!186 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!187 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!188 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!189 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !192, file: !223, line: 50, type: !210, isLocal: true, isDefinition: true)
!192 = distinct !DICompileUnit(language: DW_LANG_C99, file: !193, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !194, globals: !220, splitDebugInlining: false, nameTableKind: None)
!193 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/tmp108")
!194 = !{!195, !126, !197, !103, !102, !148, !149, !199, !146, !210, !211}
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !196)
!196 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !198, line: 214, baseType: !32)
!198 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !201, line: 45, size: 64, elements: !202)
!201 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!202 = !{!203, !209}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !200, file: !201, line: 46, baseType: !204, size: 32)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !205)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !206)
!206 = !{!207}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !136, line: 30, baseType: !208, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !200, file: !201, line: 48, baseType: !148, size: 32, offset: 32)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !212, size: 32)
!212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !201, line: 38, size: 64, elements: !213)
!213 = !{!214, !215}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !212, file: !201, line: 39, baseType: !204, size: 32)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !212, file: !201, line: 41, baseType: !216, size: 32, offset: 32)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !201, line: 35, baseType: !217)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!218 = !DISubroutineType(types: !219)
!219 = !{null, !210}
!220 = !{!221, !227, !235, !190, !237, !247}
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "latency_lock", scope: !192, file: !223, line: 44, type: !224, isLocal: true, isDefinition: true)
!223 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, size: 32, elements: !225)
!225 = !{!226}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !224, file: !156, line: 52, baseType: !22, size: 32)
!227 = !DIGlobalVariableExpression(var: !228, expr: !DIExpression())
!228 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !192, file: !223, line: 46, type: !229, isLocal: true, isDefinition: true)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !230)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !231)
!231 = !{!232, !234}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !230, file: !136, line: 36, baseType: !233, size: 32)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !230, file: !136, line: 37, baseType: !233, size: 32, offset: 32)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "latency_subs", scope: !192, file: !223, line: 52, type: !229, isLocal: true, isDefinition: true)
!237 = !DIGlobalVariableExpression(var: !238, expr: !DIExpression())
!238 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !192, file: !223, line: 39, type: !239, isLocal: true, isDefinition: true)
!239 = !DICompositeType(tag: DW_TAG_array_type, baseType: !240, elements: !245)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !223, line: 35, size: 96, elements: !241)
!241 = !{!242, !243, !244}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !240, file: !223, line: 36, baseType: !114, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !240, file: !223, line: 37, baseType: !168, size: 8, offset: 32)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !240, file: !223, line: 38, baseType: !185, size: 32, offset: 64)
!245 = !{!246}
!246 = !DISubrange(count: 0)
!247 = !DIGlobalVariableExpression(var: !248, expr: !DIExpression())
!248 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !192, file: !223, line: 48, type: !210, isLocal: true, isDefinition: true)
!249 = !DIGlobalVariableExpression(var: !250, expr: !DIExpression())
!250 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !251, file: !258, line: 47, type: !272, isLocal: true, isDefinition: true)
!251 = distinct !DICompileUnit(language: DW_LANG_C99, file: !252, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !253, retainedTypes: !254, globals: !255, splitDebugInlining: false, nameTableKind: None)
!252 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/tmp108")
!253 = !{!114}
!254 = !{!197, !103}
!255 = !{!256, !249, !268}
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "cpus_states", scope: !251, file: !258, line: 50, type: !259, isLocal: true, isDefinition: true)
!258 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!259 = !DICompositeType(tag: DW_TAG_array_type, baseType: !260, size: 32, elements: !172)
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !262)
!262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !115, line: 114, size: 128, elements: !263)
!263 = !{!264, !265, !266, !267}
!264 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !262, file: !115, line: 115, baseType: !114, size: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !262, file: !115, line: 141, baseType: !168, size: 8, offset: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !262, file: !115, line: 149, baseType: !148, size: 32, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !262, file: !115, line: 156, baseType: !148, size: 32, offset: 96)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !251, file: !258, line: 55, type: !270, isLocal: true, isDefinition: true)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 8, elements: !172)
!271 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !168)
!272 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, elements: !245)
!273 = !DIGlobalVariableExpression(var: !274, expr: !DIExpression())
!274 = distinct !DIGlobalVariable(name: "static_regions", scope: !275, file: !282, line: 62, type: !417, isLocal: true, isDefinition: true)
!275 = distinct !DICompileUnit(language: DW_LANG_C99, file: !276, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !277, globals: !278, splitDebugInlining: false, nameTableKind: None)
!276 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/tmp108")
!277 = !{!197, !103, !148, !102}
!278 = !{!279, !273}
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !281, file: !282, line: 198, type: !405, isLocal: true, isDefinition: true)
!281 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !282, file: !282, line: 175, type: !283, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !275, retainedNodes: !402)
!282 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!283 = !DISubroutineType(types: !284)
!284 = !{null, !285}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 32)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !287, line: 245, size: 1024, elements: !288)
!287 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!288 = !{!289, !356, !369, !370, !371, !372, !378, !397}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !286, file: !287, line: 247, baseType: !290, size: 384)
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !287, line: 57, size: 384, elements: !291)
!291 = !{!292, !320, !328, !329, !330, !343, !344, !345}
!292 = !DIDerivedType(tag: DW_TAG_member, scope: !290, file: !287, line: 60, baseType: !293, size: 64)
!293 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !290, file: !287, line: 60, size: 64, elements: !294)
!294 = !{!295, !311}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !293, file: !287, line: 61, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !297, line: 49, baseType: !298)
!297 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !297, line: 37, size: 64, elements: !299)
!299 = !{!300, !306}
!300 = !DIDerivedType(tag: DW_TAG_member, scope: !298, file: !297, line: 38, baseType: !301, size: 32)
!301 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !298, file: !297, line: 38, size: 32, elements: !302)
!302 = !{!303, !305}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !301, file: !297, line: 39, baseType: !304, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !301, file: !297, line: 40, baseType: !304, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, scope: !298, file: !297, line: 42, baseType: !307, size: 32, offset: 32)
!307 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !298, file: !297, line: 42, size: 32, elements: !308)
!308 = !{!309, !310}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !307, file: !297, line: 43, baseType: !304, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !307, file: !297, line: 44, baseType: !304, size: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !293, file: !287, line: 62, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !313, line: 49, size: 64, elements: !314)
!313 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!314 = !{!315}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !312, file: !313, line: 50, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 64, elements: !318)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 32)
!318 = !{!319}
!319 = !DISubrange(count: 2)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !290, file: !287, line: 68, baseType: !321, size: 32, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !323, line: 233, baseType: !324)
!323 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !323, line: 231, size: 64, elements: !325)
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !324, file: !323, line: 232, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !297, line: 48, baseType: !298)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !290, file: !287, line: 71, baseType: !168, size: 8, offset: 96)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !290, file: !287, line: 74, baseType: !168, size: 8, offset: 104)
!330 = !DIDerivedType(tag: DW_TAG_member, scope: !290, file: !287, line: 90, baseType: !331, size: 16, offset: 112)
!331 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !290, file: !287, line: 90, size: 16, elements: !332)
!332 = !{!333, !340}
!333 = !DIDerivedType(tag: DW_TAG_member, scope: !331, file: !287, line: 91, baseType: !334, size: 16)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !331, file: !287, line: 91, size: 16, elements: !335)
!335 = !{!336, !339}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !334, file: !287, line: 96, baseType: !337, size: 8)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !338)
!338 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !334, file: !287, line: 97, baseType: !168, size: 8, offset: 8)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !331, file: !287, line: 100, baseType: !341, size: 16)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !342)
!342 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !290, file: !287, line: 107, baseType: !148, size: 32, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !290, file: !287, line: 127, baseType: !102, size: 32, offset: 160)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !290, file: !287, line: 131, baseType: !346, size: 192, offset: 192)
!346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !323, line: 244, size: 192, elements: !347)
!347 = !{!348, !349, !355}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !346, file: !323, line: 245, baseType: !296, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !346, file: !323, line: 246, baseType: !350, size: 32, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !323, line: 242, baseType: !351)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 32)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !354}
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !346, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !346, file: !323, line: 249, baseType: !128, size: 64, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !286, file: !287, line: 250, baseType: !357, size: 288, offset: 384)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !358, line: 25, size: 288, elements: !359)
!358 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!359 = !{!360, !361, !362, !363, !364, !365, !366, !367, !368}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !357, file: !358, line: 26, baseType: !148, size: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !357, file: !358, line: 27, baseType: !148, size: 32, offset: 32)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !357, file: !358, line: 28, baseType: !148, size: 32, offset: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !357, file: !358, line: 29, baseType: !148, size: 32, offset: 96)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !357, file: !358, line: 30, baseType: !148, size: 32, offset: 128)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !357, file: !358, line: 31, baseType: !148, size: 32, offset: 160)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !357, file: !358, line: 32, baseType: !148, size: 32, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !357, file: !358, line: 33, baseType: !148, size: 32, offset: 224)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !357, file: !358, line: 34, baseType: !148, size: 32, offset: 256)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !286, file: !287, line: 253, baseType: !102, size: 32, offset: 672)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !286, file: !287, line: 256, baseType: !322, size: 64, offset: 704)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !286, file: !287, line: 294, baseType: !103, size: 32, offset: 768)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !286, file: !287, line: 300, baseType: !373, size: 96, offset: 800)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !287, line: 149, size: 96, elements: !374)
!374 = !{!375, !376, !377}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !373, file: !287, line: 153, baseType: !22, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !373, file: !287, line: 162, baseType: !197, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !373, file: !287, line: 168, baseType: !197, size: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !286, file: !287, line: 325, baseType: !379, size: 32, offset: 896)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 32)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !381, line: 5073, size: 192, elements: !382)
!381 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!382 = !{!383, !392, !393}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !380, file: !381, line: 5074, baseType: !384, size: 96)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !385, line: 56, size: 96, elements: !386)
!385 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!386 = !{!387, !390, !391}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !384, file: !385, line: 57, baseType: !388, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !385, line: 57, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !384, file: !385, line: 58, baseType: !102, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !384, file: !385, line: 59, baseType: !197, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !380, file: !381, line: 5075, baseType: !322, size: 64, offset: 96)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !380, file: !381, line: 5076, baseType: !394, size: 32, offset: 160)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, size: 32, elements: !395)
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !394, file: !156, line: 52, baseType: !22, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !286, file: !287, line: 343, baseType: !398, size: 64, offset: 928)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !358, line: 60, size: 64, elements: !399)
!399 = !{!400, !401}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !398, file: !358, line: 63, baseType: !148, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !398, file: !358, line: 66, baseType: !148, size: 32, offset: 32)
!402 = !{!403, !404}
!403 = !DILocalVariable(name: "thread", arg: 1, scope: !281, file: !282, line: 175, type: !285)
!404 = !DILocalVariable(name: "region_num", scope: !281, file: !282, line: 200, type: !168)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, elements: !245)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !407, line: 52, size: 96, elements: !408)
!407 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!408 = !{!409, !410, !411}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !406, file: !407, line: 53, baseType: !22, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !406, file: !407, line: 54, baseType: !197, size: 32, offset: 32)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !406, file: !407, line: 55, baseType: !412, size: 32, offset: 64)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !413, line: 151, baseType: !414)
!413 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!414 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !413, line: 149, size: 32, elements: !415)
!415 = !{!416}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !414, file: !413, line: 150, baseType: !148, size: 32)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 96, elements: !172)
!418 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !421, file: !457, line: 39, type: !168, isLocal: true, isDefinition: true)
!421 = distinct !DICompileUnit(language: DW_LANG_C99, file: !422, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !423, globals: !456, splitDebugInlining: false, nameTableKind: None)
!422 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/tmp108")
!423 = !{!424, !102, !103, !442, !168}
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !425, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !426, line: 1226, baseType: !427)
!426 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 1213, size: 352, elements: !428)
!428 = !{!429, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !427, file: !426, line: 1215, baseType: !430, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !431)
!431 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !148)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !427, file: !426, line: 1216, baseType: !431, size: 32, offset: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !427, file: !426, line: 1217, baseType: !431, size: 32, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !427, file: !426, line: 1218, baseType: !431, size: 32, offset: 96)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !427, file: !426, line: 1219, baseType: !431, size: 32, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !427, file: !426, line: 1220, baseType: !431, size: 32, offset: 160)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !427, file: !426, line: 1221, baseType: !431, size: 32, offset: 192)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !427, file: !426, line: 1222, baseType: !431, size: 32, offset: 224)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !427, file: !426, line: 1223, baseType: !431, size: 32, offset: 256)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !427, file: !426, line: 1224, baseType: !431, size: 32, offset: 288)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !427, file: !426, line: 1225, baseType: !431, size: 32, offset: 320)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !445, line: 27, size: 96, elements: !446)
!445 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!446 = !{!447, !448, !451}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !444, file: !445, line: 29, baseType: !148, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !444, file: !445, line: 31, baseType: !449, size: 32, offset: 32)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 32)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !444, file: !445, line: 37, baseType: !452, size: 32, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !413, line: 146, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !413, line: 141, size: 32, elements: !454)
!454 = !{!455}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !453, file: !413, line: 143, baseType: !148, size: 32)
!456 = !{!419}
!457 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!458 = !DIGlobalVariableExpression(var: !459, expr: !DIExpression())
!459 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !460, file: !467, line: 21, type: !106, isLocal: true, isDefinition: true)
!460 = distinct !DICompileUnit(language: DW_LANG_C99, file: !461, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !462, globals: !466, splitDebugInlining: false, nameTableKind: None)
!461 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/tmp108")
!462 = !{!463, !103, !102}
!463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !465, line: 22, baseType: !103)
!465 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!466 = !{!458}
!467 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!468 = !DIGlobalVariableExpression(var: !469, expr: !DIExpression())
!469 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !470, file: !475, line: 13, type: !492, isLocal: true, isDefinition: true)
!470 = distinct !DICompileUnit(language: DW_LANG_C99, file: !471, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !472, splitDebugInlining: false, nameTableKind: None)
!471 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/tmp108")
!472 = !{!473, !468}
!473 = !DIGlobalVariableExpression(var: !474, expr: !DIExpression())
!474 = distinct !DIGlobalVariable(name: "mpu_config", scope: !470, file: !475, line: 37, type: !476, isLocal: false, isDefinition: true)
!475 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !445, line: 41, size: 64, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !477, file: !445, line: 43, baseType: !148, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !477, file: !445, line: 45, baseType: !481, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 32)
!482 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !483)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !445, line: 27, size: 96, elements: !484)
!484 = !{!485, !486, !487}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !483, file: !445, line: 29, baseType: !148, size: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !483, file: !445, line: 31, baseType: !449, size: 32, offset: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !483, file: !445, line: 37, baseType: !488, size: 32, offset: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !413, line: 146, baseType: !489)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !413, line: 141, size: 32, elements: !490)
!490 = !{!491}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !489, file: !413, line: 143, baseType: !148, size: 32)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 192, elements: !318)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !495, file: !655, line: 93, type: !656, isLocal: true, isDefinition: true, align: 32)
!495 = distinct !DICompileUnit(language: DW_LANG_C99, file: !496, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !497, globals: !650, splitDebugInlining: false, nameTableKind: None)
!496 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/tmp108")
!497 = !{!498, !168, !102, !103, !572, !148, !573, !609, !620}
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !500, line: 882, baseType: !501)
!500 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !500, line: 850, size: 19456, elements: !502)
!502 = !{!503, !507, !508, !509, !513, !514, !516, !517, !518, !522, !523, !524, !528, !529, !533, !534, !538, !539, !543, !544, !545, !546, !547, !548, !552, !553, !557, !558, !562}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !501, file: !500, line: 851, baseType: !504, size: 960)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 960, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 30)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !501, file: !500, line: 852, baseType: !431, size: 32, offset: 960)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !501, file: !500, line: 853, baseType: !431, size: 32, offset: 992)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !501, file: !500, line: 854, baseType: !510, size: 1088, offset: 1024)
!510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 1088, elements: !511)
!511 = !{!512}
!512 = !DISubrange(count: 34)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !501, file: !500, line: 855, baseType: !431, size: 32, offset: 2112)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !501, file: !500, line: 856, baseType: !515, size: 64, offset: 2144)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 64, elements: !318)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !501, file: !500, line: 857, baseType: !431, size: 32, offset: 2208)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !501, file: !500, line: 858, baseType: !431, size: 32, offset: 2240)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !501, file: !500, line: 859, baseType: !519, size: 3904, offset: 2272)
!519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 3904, elements: !520)
!520 = !{!521}
!521 = !DISubrange(count: 122)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !501, file: !500, line: 860, baseType: !431, size: 32, offset: 6176)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !501, file: !500, line: 861, baseType: !431, size: 32, offset: 6208)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !501, file: !500, line: 862, baseType: !525, size: 1952, offset: 6240)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 1952, elements: !526)
!526 = !{!527}
!527 = !DISubrange(count: 61)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !501, file: !500, line: 863, baseType: !431, size: 32, offset: 8192)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !501, file: !500, line: 864, baseType: !530, size: 288, offset: 8224)
!530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 288, elements: !531)
!531 = !{!532}
!532 = !DISubrange(count: 9)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !501, file: !500, line: 865, baseType: !430, size: 32, offset: 8512)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !501, file: !500, line: 866, baseType: !535, size: 1696, offset: 8544)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 1696, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 53)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !501, file: !500, line: 867, baseType: !431, size: 32, offset: 10240)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !501, file: !500, line: 868, baseType: !540, size: 96, offset: 10272)
!540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 96, elements: !541)
!541 = !{!542}
!542 = !DISubrange(count: 3)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !501, file: !500, line: 869, baseType: !431, size: 32, offset: 10368)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !501, file: !500, line: 870, baseType: !515, size: 64, offset: 10400)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !501, file: !500, line: 871, baseType: !431, size: 32, offset: 10464)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !501, file: !500, line: 872, baseType: !431, size: 32, offset: 10496)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "RAMON", scope: !501, file: !500, line: 873, baseType: !431, size: 32, offset: 10528)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !501, file: !500, line: 875, baseType: !549, size: 352, offset: 10560)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 352, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 11)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "RAMONB", scope: !501, file: !500, line: 876, baseType: !431, size: 32, offset: 10912)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !501, file: !500, line: 878, baseType: !554, size: 256, offset: 10944)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 256, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 8)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !501, file: !500, line: 879, baseType: !431, size: 32, offset: 11200)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !501, file: !500, line: 880, baseType: !559, size: 7200, offset: 11232)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 7200, elements: !560)
!560 = !{!561}
!561 = !DISubrange(count: 225)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !501, file: !500, line: 881, baseType: !563, size: 1024, offset: 18432)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 1024, elements: !555)
!564 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !500, line: 258, baseType: !566)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !500, line: 252, size: 128, elements: !567)
!567 = !{!568, !569, !570, !571}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !566, file: !500, line: 253, baseType: !431, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !566, file: !500, line: 254, baseType: !431, size: 32, offset: 32)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !566, file: !500, line: 255, baseType: !431, size: 32, offset: 64)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !566, file: !500, line: 257, baseType: !430, size: 32, offset: 96)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !431, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !426, line: 468, baseType: !575)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 445, size: 1120, elements: !576)
!576 = !{!577, !578, !579, !580, !581, !582, !583, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !602, !606, !608}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !575, file: !426, line: 447, baseType: !430, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !575, file: !426, line: 448, baseType: !431, size: 32, offset: 32)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !575, file: !426, line: 449, baseType: !431, size: 32, offset: 64)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !575, file: !426, line: 450, baseType: !431, size: 32, offset: 96)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !575, file: !426, line: 451, baseType: !431, size: 32, offset: 128)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !575, file: !426, line: 452, baseType: !431, size: 32, offset: 160)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !575, file: !426, line: 453, baseType: !584, size: 96, offset: 192)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 96, elements: !586)
!585 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !168)
!586 = !{!587}
!587 = !DISubrange(count: 12)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !575, file: !426, line: 454, baseType: !431, size: 32, offset: 288)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !575, file: !426, line: 455, baseType: !431, size: 32, offset: 320)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !575, file: !426, line: 456, baseType: !431, size: 32, offset: 352)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !575, file: !426, line: 457, baseType: !431, size: 32, offset: 384)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !575, file: !426, line: 458, baseType: !431, size: 32, offset: 416)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !575, file: !426, line: 459, baseType: !431, size: 32, offset: 448)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !575, file: !426, line: 460, baseType: !431, size: 32, offset: 480)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !575, file: !426, line: 461, baseType: !515, size: 64, offset: 512)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !575, file: !426, line: 462, baseType: !430, size: 32, offset: 576)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !575, file: !426, line: 463, baseType: !430, size: 32, offset: 608)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !575, file: !426, line: 464, baseType: !599, size: 128, offset: 640)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 128, elements: !600)
!600 = !{!601}
!601 = !DISubrange(count: 4)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !575, file: !426, line: 465, baseType: !603, size: 160, offset: 768)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 160, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 5)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !575, file: !426, line: 466, baseType: !607, size: 160, offset: 928)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 160, elements: !604)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !575, file: !426, line: 467, baseType: !431, size: 32, offset: 1088)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !611, file: !610, line: 167, baseType: !619)
!610 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!611 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !610, file: !610, line: 134, type: !612, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !495, retainedNodes: !614)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !148}
!614 = !{!615, !616, !618}
!615 = !DILocalVariable(name: "time_us", arg: 1, scope: !611, file: !610, line: 134, type: !148)
!616 = !DILocalVariable(name: "delay_cycles", scope: !611, file: !610, line: 168, type: !617)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !609)
!618 = !DILocalVariable(name: "cycles", scope: !611, file: !610, line: 171, type: !148)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !500, line: 2140, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !500, line: 2119, size: 10880, elements: !623)
!623 = !{!624, !628, !629, !633, !634, !639, !640, !641, !642, !646, !647, !648, !649}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !622, file: !500, line: 2120, baseType: !625, size: 8192)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 8192, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 256)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !622, file: !500, line: 2121, baseType: !430, size: 32, offset: 8192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !622, file: !500, line: 2122, baseType: !630, size: 2048, offset: 8224)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 2048, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !622, file: !500, line: 2123, baseType: !431, size: 32, offset: 10272)
!634 = !DIDerivedType(tag: DW_TAG_member, scope: !622, file: !500, line: 2125, baseType: !635, size: 32, offset: 10304)
!635 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !622, file: !500, line: 2125, size: 32, elements: !636)
!636 = !{!637, !638}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !635, file: !500, line: 2126, baseType: !431, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !635, file: !500, line: 2127, baseType: !431, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !622, file: !500, line: 2130, baseType: !431, size: 32, offset: 10336)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !622, file: !500, line: 2131, baseType: !431, size: 32, offset: 10368)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !622, file: !500, line: 2133, baseType: !431, size: 32, offset: 10400)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !622, file: !500, line: 2135, baseType: !643, size: 320, offset: 10432)
!643 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 320, elements: !644)
!644 = !{!645}
!645 = !DISubrange(count: 10)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !622, file: !500, line: 2136, baseType: !431, size: 32, offset: 10752)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !622, file: !500, line: 2137, baseType: !430, size: 32, offset: 10784)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !622, file: !500, line: 2138, baseType: !431, size: 32, offset: 10816)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !622, file: !500, line: 2139, baseType: !431, size: 32, offset: 10848)
!650 = !{!493, !651}
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !611, file: !610, line: 161, type: !653, isLocal: true, isDefinition: true, align: 128)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 48, elements: !541)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !341)
!655 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!656 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !658, line: 51, size: 64, elements: !659)
!658 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!659 = !{!660, !667}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !657, file: !658, line: 60, baseType: !661, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!662 = !DISubroutineType(types: !663)
!663 = !{!103, !664}
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 32)
!665 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !666)
!666 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !658, line: 48, flags: DIFlagFwdDecl)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !657, file: !658, line: 65, baseType: !664, size: 32, offset: 32)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "__device_dts_ord_34", scope: !670, file: !895, line: 733, type: !1001, isLocal: false, isDefinition: true, align: 32)
!670 = distinct !DICompileUnit(language: DW_LANG_C99, file: !671, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !672, retainedTypes: !805, globals: !891, splitDebugInlining: false, nameTableKind: None)
!671 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_nitrogen/tmp108")
!672 = !{!673, !679, !30, !684, !689, !696, !702, !708, !717, !721, !770, !777, !796}
!673 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !674, line: 23, baseType: !32, size: 32, elements: !675)
!674 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!675 = !{!676, !677, !678}
!676 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!677 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!678 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!679 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !674, line: 48, baseType: !32, size: 32, elements: !680)
!680 = !{!681, !682, !683}
!681 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!682 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!683 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!684 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !685, line: 167, baseType: !32, size: 32, elements: !686)
!685 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!686 = !{!687, !688}
!687 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!688 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!689 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !685, line: 107, baseType: !32, size: 32, elements: !690)
!690 = !{!691, !692, !693, !694, !695}
!691 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!692 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!693 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!694 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!695 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!696 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !685, line: 208, baseType: !32, size: 32, elements: !697)
!697 = !{!698, !699, !700, !701}
!698 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!699 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!700 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!701 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!702 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !685, line: 261, baseType: !32, size: 32, elements: !703)
!703 = !{!704, !705, !706, !707}
!704 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!705 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!706 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!707 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!708 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !685, line: 237, baseType: !32, size: 32, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !716}
!710 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!711 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!712 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!713 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!714 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!715 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!716 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!717 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !685, line: 152, baseType: !32, size: 32, elements: !718)
!718 = !{!719, !720}
!719 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!720 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!721 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !500, line: 71, baseType: !103, size: 32, elements: !722)
!722 = !{!723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769}
!723 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!724 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!725 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!726 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!727 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!728 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!729 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!730 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!731 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!732 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!733 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!734 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!735 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!736 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!737 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!738 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!739 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!740 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!741 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!742 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!743 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!744 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!745 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!746 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!747 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!748 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!749 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!750 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!751 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!752 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!753 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!754 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!755 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!756 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!757 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!758 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!759 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!760 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!761 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!762 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!763 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!764 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!765 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!766 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!767 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!768 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!769 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!770 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !771, line: 44, baseType: !32, size: 32, elements: !772)
!771 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!772 = !{!773, !774, !775, !776}
!773 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!774 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!775 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!776 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!777 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !778, line: 54, baseType: !32, size: 32, elements: !779)
!778 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795}
!780 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!781 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!782 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!783 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!784 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!785 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!786 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!787 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!788 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!789 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!790 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!791 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!792 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!793 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!794 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!795 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!796 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !797, line: 53, baseType: !32, size: 32, elements: !798)
!797 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!798 = !{!799, !800, !801, !802, !803, !804}
!799 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!800 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!801 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!802 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!803 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!804 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!805 = !{!673, !102, !103, !806, !854, !855, !856, !857, !126, !148, !149, !858, !572, !859, !210, !860, !890, !197}
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !500, line: 837, baseType: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !500, line: 804, size: 11008, elements: !809)
!809 = !{!810, !811, !812, !813, !814, !815, !816, !817, !821, !822, !823, !824, !825, !826, !830, !831, !832, !836, !837, !838, !839, !840, !841, !842, !846, !847, !851, !852, !853}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !808, file: !500, line: 805, baseType: !431, size: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !808, file: !500, line: 806, baseType: !431, size: 32, offset: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !808, file: !500, line: 807, baseType: !431, size: 32, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !808, file: !500, line: 808, baseType: !431, size: 32, offset: 96)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !808, file: !500, line: 809, baseType: !431, size: 32, offset: 128)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !808, file: !500, line: 810, baseType: !431, size: 32, offset: 160)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !808, file: !500, line: 811, baseType: !431, size: 32, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !808, file: !500, line: 812, baseType: !818, size: 1824, offset: 224)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 1824, elements: !819)
!819 = !{!820}
!820 = !DISubrange(count: 57)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !808, file: !500, line: 813, baseType: !431, size: 32, offset: 2048)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !808, file: !500, line: 814, baseType: !431, size: 32, offset: 2080)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !808, file: !500, line: 815, baseType: !430, size: 32, offset: 2112)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !808, file: !500, line: 816, baseType: !431, size: 32, offset: 2144)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !808, file: !500, line: 817, baseType: !431, size: 32, offset: 2176)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !808, file: !500, line: 818, baseType: !827, size: 3968, offset: 2208)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 3968, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 124)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !808, file: !500, line: 819, baseType: !431, size: 32, offset: 6176)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !808, file: !500, line: 820, baseType: !431, size: 32, offset: 6208)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !808, file: !500, line: 821, baseType: !833, size: 2016, offset: 6240)
!833 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 2016, elements: !834)
!834 = !{!835}
!835 = !DISubrange(count: 63)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !808, file: !500, line: 822, baseType: !430, size: 32, offset: 8256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !808, file: !500, line: 824, baseType: !430, size: 32, offset: 8288)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !808, file: !500, line: 825, baseType: !430, size: 32, offset: 8320)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !808, file: !500, line: 826, baseType: !430, size: 32, offset: 8352)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !808, file: !500, line: 828, baseType: !430, size: 32, offset: 8384)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !808, file: !500, line: 829, baseType: !430, size: 32, offset: 8416)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !808, file: !500, line: 831, baseType: !843, size: 1984, offset: 8448)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 1984, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 62)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !808, file: !500, line: 832, baseType: !431, size: 32, offset: 10432)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !808, file: !500, line: 833, baseType: !848, size: 224, offset: 10464)
!848 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 224, elements: !849)
!849 = !{!850}
!850 = !DISubrange(count: 7)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !808, file: !500, line: 834, baseType: !431, size: 32, offset: 10688)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !808, file: !500, line: 835, baseType: !554, size: 256, offset: 10720)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !808, file: !500, line: 836, baseType: !431, size: 32, offset: 10976)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !685, line: 146, baseType: !689)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !685, line: 164, baseType: !717)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 32)
!858 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !426, line: 426, baseType: !862)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !426, line: 411, size: 28704, elements: !863)
!863 = !{!864, !866, !870, !871, !872, !873, !874, !875, !876, !877, !881, !885, !889}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !862, file: !426, line: 413, baseType: !865, size: 256)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 256, elements: !555)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !862, file: !426, line: 414, baseType: !867, size: 768, offset: 256)
!867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 768, elements: !868)
!868 = !{!869}
!869 = !DISubrange(count: 24)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !862, file: !426, line: 415, baseType: !865, size: 256, offset: 1024)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !862, file: !426, line: 416, baseType: !867, size: 768, offset: 1280)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !862, file: !426, line: 417, baseType: !865, size: 256, offset: 2048)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !862, file: !426, line: 418, baseType: !867, size: 768, offset: 2304)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !862, file: !426, line: 419, baseType: !865, size: 256, offset: 3072)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !862, file: !426, line: 420, baseType: !867, size: 768, offset: 3328)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !862, file: !426, line: 421, baseType: !865, size: 256, offset: 4096)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !862, file: !426, line: 422, baseType: !878, size: 1792, offset: 4352)
!878 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 1792, elements: !879)
!879 = !{!880}
!880 = !DISubrange(count: 56)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !862, file: !426, line: 423, baseType: !882, size: 1920, offset: 6144)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !585, size: 1920, elements: !883)
!883 = !{!884}
!884 = !DISubrange(count: 240)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !862, file: !426, line: 424, baseType: !886, size: 20608, offset: 8064)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !148, size: 20608, elements: !887)
!887 = !{!888}
!888 = !DISubrange(count: 644)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !862, file: !426, line: 425, baseType: !431, size: 32, offset: 28672)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !771, line: 56, baseType: !102)
!891 = !{!892, !944, !985, !668, !991, !1017, !1019, !1036, !1038, !1048, !1051, !1066, !1070, !1108, !1122}
!892 = !DIGlobalVariableExpression(var: !893, expr: !DIExpression())
!893 = distinct !DIGlobalVariable(name: "on", scope: !894, file: !895, line: 549, type: !185, isLocal: true, isDefinition: true)
!894 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !895, file: !895, line: 547, type: !896, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !670, retainedNodes: !898)
!895 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!896 = !DISubroutineType(types: !897)
!897 = !{null, !679}
!898 = !{!899, !900, !903}
!899 = !DILocalVariable(name: "start_mode", arg: 1, scope: !894, file: !895, line: 547, type: !679)
!900 = !DILocalVariable(name: "err", scope: !901, file: !895, line: 553, type: !103)
!901 = distinct !DILexicalBlock(scope: !902, file: !895, line: 552, column: 31)
!902 = distinct !DILexicalBlock(scope: !894, file: !895, line: 552, column: 6)
!903 = !DILocalVariable(name: "mgr", scope: !901, file: !895, line: 554, type: !904)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 32)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !906, line: 154, size: 256, elements: !907)
!906 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!907 = !{!908, !920, !921, !937, !941, !942, !943}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !905, file: !906, line: 158, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !136, line: 40, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !136, line: 35, size: 64, elements: !911)
!911 = !{!912, !919}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !910, file: !136, line: 36, baseType: !913, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !136, line: 33, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !136, line: 29, size: 32, elements: !916)
!916 = !{!917}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !915, file: !136, line: 30, baseType: !918, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !910, file: !136, line: 37, baseType: !913, size: 32, offset: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !905, file: !906, line: 163, baseType: !909, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !905, file: !906, line: 166, baseType: !922, size: 32, offset: 128)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !924)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !906, line: 133, size: 96, elements: !925)
!925 = !{!926, !935, !936}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !924, file: !906, line: 135, baseType: !927, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !906, line: 129, baseType: !928)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 32)
!929 = !DISubroutineType(types: !930)
!930 = !{null, !904, !931}
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !906, line: 101, baseType: !932)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 32)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !904, !103}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !924, file: !906, line: 138, baseType: !927, size: 32, offset: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !924, file: !906, line: 143, baseType: !927, size: 32, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !905, file: !906, line: 169, baseType: !938, size: 32, offset: 160)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !156, line: 43, size: 32, elements: !939)
!939 = !{!940}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !938, file: !156, line: 52, baseType: !22, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !905, file: !906, line: 172, baseType: !103, size: 32, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !905, file: !906, line: 175, baseType: !341, size: 16, offset: 224)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !905, file: !906, line: 178, baseType: !341, size: 16, offset: 240)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "cli", scope: !894, file: !895, line: 550, type: !946, isLocal: true, isDefinition: true)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !906, line: 273, size: 128, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !946, file: !906, line: 280, baseType: !914, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !946, file: !906, line: 283, baseType: !950, size: 96, offset: 32)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !951, line: 138, size: 96, elements: !952)
!951 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!952 = !{!953, !982, !983}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !950, file: !951, line: 149, baseType: !954, size: 32)
!954 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !951, line: 139, size: 32, elements: !955)
!955 = !{!956, !977}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !954, file: !951, line: 145, baseType: !957, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !381, line: 5397, size: 128, elements: !959)
!959 = !{!960, !975, !976}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "poll_events", scope: !958, file: !381, line: 5399, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !297, line: 48, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !297, line: 37, size: 64, elements: !963)
!963 = !{!964, !970}
!964 = !DIDerivedType(tag: DW_TAG_member, scope: !962, file: !297, line: 38, baseType: !965, size: 32)
!965 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !962, file: !297, line: 38, size: 32, elements: !966)
!966 = !{!967, !969}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !965, file: !297, line: 39, baseType: !968, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !965, file: !297, line: 40, baseType: !968, size: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, scope: !962, file: !297, line: 42, baseType: !971, size: 32, offset: 32)
!971 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !962, file: !297, line: 42, size: 32, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !971, file: !297, line: 43, baseType: !968, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !971, file: !297, line: 44, baseType: !968, size: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "signaled", scope: !958, file: !381, line: 5405, baseType: !32, size: 32, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !958, file: !381, line: 5408, baseType: !103, size: 32, offset: 96)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !954, file: !951, line: 148, baseType: !978, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_notify_generic_callback", file: !951, line: 98, baseType: !979)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 32)
!980 = !DISubroutineType(types: !981)
!981 = !{null, null}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !950, file: !951, line: 165, baseType: !431, size: 32, offset: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !950, file: !951, line: 174, baseType: !984, size: 32, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !103)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_34", scope: !670, file: !895, line: 733, type: !987, isLocal: false, isDefinition: true, align: 16)
!987 = !DICompositeType(tag: DW_TAG_array_type, baseType: !988, size: 80, elements: !604)
!988 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !990, line: 43, baseType: !195)
!990 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!991 = !DIGlobalVariableExpression(var: !992, expr: !DIExpression())
!992 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_34", scope: !670, file: !895, line: 733, type: !993, isLocal: true, isDefinition: true, align: 32)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !658, line: 51, size: 64, elements: !995)
!995 = !{!996, !1016}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !994, file: !658, line: 60, baseType: !997, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 32)
!998 = !DISubroutineType(types: !999)
!999 = !{!103, !1000}
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !990, line: 378, size: 192, elements: !1003)
!1003 = !{!1004, !1005, !1006, !1007, !1013, !1014}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1002, file: !990, line: 380, baseType: !449, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1002, file: !990, line: 382, baseType: !13, size: 32, offset: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1002, file: !990, line: 384, baseType: !13, size: 32, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1002, file: !990, line: 386, baseType: !1008, size: 32, offset: 96)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 32)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !990, line: 351, size: 16, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1009, file: !990, line: 359, baseType: !168, size: 8)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1009, file: !990, line: 364, baseType: !858, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1002, file: !990, line: 388, baseType: !102, size: 32, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1002, file: !990, line: 396, baseType: !1015, size: 32, offset: 160)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !994, file: !658, line: 65, baseType: !1000, size: 32, offset: 32)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "hfclk_users", scope: !670, file: !895, line: 79, type: !185, isLocal: true, isDefinition: true)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "data", scope: !670, file: !895, line: 702, type: !1021, isLocal: true, isDefinition: true)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_data", file: !895, line: 69, size: 704, elements: !1022)
!1022 = !{!1023, !1025}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "mgr", scope: !1021, file: !895, line: 70, baseType: !1024, size: 512)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !905, size: 512, elements: !318)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !1021, file: !895, line: 71, baseType: !1026, size: 192, offset: 512)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1027, size: 192, elements: !318)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_data", file: !895, line: 52, size: 96, elements: !1028)
!1028 = !{!1029, !1034, !1035}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !1027, file: !895, line: 53, baseType: !1030, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !771, line: 72, baseType: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 32)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{null, !1000, !890, !102}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !1027, file: !895, line: 54, baseType: !102, size: 32, offset: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1027, file: !895, line: 55, baseType: !148, size: 32, offset: 64)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_34", scope: !670, file: !895, line: 733, type: !1009, isLocal: true, isDefinition: true, align: 8)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(name: "d", scope: !1040, file: !895, line: 476, type: !1046, isLocal: true, isDefinition: true)
!1040 = distinct !DISubprogram(name: "lfclk_spinwait", scope: !895, file: !895, line: 474, type: !896, scopeLine: 475, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !670, retainedNodes: !1041)
!1041 = !{!1042, !1043, !1044, !1045}
!1042 = !DILocalVariable(name: "mode", arg: 1, scope: !1040, file: !895, line: 474, type: !679)
!1043 = !DILocalVariable(name: "type", scope: !1040, file: !895, line: 486, type: !854)
!1044 = !DILocalVariable(name: "isr_mode", scope: !1040, file: !895, line: 500, type: !858)
!1045 = !DILocalVariable(name: "key", scope: !1040, file: !895, line: 501, type: !103)
!1046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1047)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_domain_t", file: !685, line: 177, baseType: !684)
!1048 = !DIGlobalVariableExpression(var: !1049, expr: !DIExpression())
!1049 = distinct !DIGlobalVariable(name: "target_type", scope: !1040, file: !895, line: 477, type: !1050, isLocal: true, isDefinition: true)
!1050 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !854)
!1051 = !DIGlobalVariableExpression(var: !1052, expr: !DIExpression())
!1052 = distinct !DIGlobalVariable(name: "config", scope: !670, file: !895, line: 704, type: !1053, isLocal: true, isDefinition: true)
!1053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_config", file: !895, line: 74, size: 128, elements: !1055)
!1055 = !{!1056}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "subsys", scope: !1054, file: !895, line: 76, baseType: !1057, size: 128)
!1057 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1058, size: 128, elements: !318)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nrf_clock_control_sub_config", file: !895, line: 61, size: 64, elements: !1059)
!1059 = !{!1060, !1065}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1058, file: !895, line: 62, baseType: !1061, size: 32)
