; ModuleID = 'build/96b_wistrio/tmp108/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_spinlock }
%struct.k_spinlock = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.k_spinlock }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.stm32_exti_data = type { [16 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }
%struct.gpio_stm32_config = type { %struct.k_spinlock, i32*, i32, %struct.sensor_trigger }
%struct.sensor_trigger = type { i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/tmp108/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/tmp108")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/tmp108")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/tmp108")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "__init_stm32l1_init", scope: !111, file: !142, line: 60, type: !143, isLocal: true, isDefinition: true, align: 32)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !113, globals: !141, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/tmp108")
!113 = !{!114, !135}
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 386, baseType: !117)
!116 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l151xba.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 370, size: 448, elements: !118)
!118 = !{!119, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !117, file: !116, line: 372, baseType: !120, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !121)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !117, file: !116, line: 373, baseType: !120, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !117, file: !116, line: 374, baseType: !120, size: 32, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !117, file: !116, line: 375, baseType: !120, size: 32, offset: 96)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !117, file: !116, line: 376, baseType: !120, size: 32, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !117, file: !116, line: 377, baseType: !120, size: 32, offset: 160)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !117, file: !116, line: 378, baseType: !120, size: 32, offset: 192)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !117, file: !116, line: 379, baseType: !120, size: 32, offset: 224)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !117, file: !116, line: 380, baseType: !120, size: 32, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !117, file: !116, line: 381, baseType: !120, size: 32, offset: 288)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !117, file: !116, line: 382, baseType: !120, size: 32, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !117, file: !116, line: 383, baseType: !120, size: 32, offset: 352)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !117, file: !116, line: 384, baseType: !120, size: 32, offset: 384)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !117, file: !116, line: 385, baseType: !120, size: 32, offset: 416)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !136, size: 32)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !116, line: 364, baseType: !137)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 360, size: 64, elements: !138)
!138 = !{!139, !140}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !137, file: !116, line: 362, baseType: !120, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !137, file: !116, line: 363, baseType: !120, size: 32, offset: 32)
!141 = !{!109}
!142 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!143 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !144)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = !{!147, !178}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !144, file: !145, line: 60, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 32)
!149 = !DISubroutineType(types: !150)
!150 = !{!103, !151}
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 32)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !155)
!154 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!155 = !{!156, !160, !161, !162, !171, !172}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !153, file: !154, line: 380, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !153, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !153, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !153, file: !154, line: 386, baseType: !163, size: 32, offset: 96)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !165)
!165 = !{!166, !169}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !164, file: !154, line: 359, baseType: !167, size: 8)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !168)
!168 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !164, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!170 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !153, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !153, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !175)
!175 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !154, line: 43, baseType: !176)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !177)
!177 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !144, file: !145, line: 65, baseType: !151, size: 32, offset: 32)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !181, file: !184, line: 71, type: !185, isLocal: true, isDefinition: true, align: 32)
!181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !182, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !183, splitDebugInlining: false, nameTableKind: None)
!182 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/tmp108")
!183 = !{!179}
!184 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!185 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !187)
!187 = !{!188, !207}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !186, file: !145, line: 60, baseType: !189, size: 32)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 32)
!190 = !DISubroutineType(types: !191)
!191 = !{!103, !192}
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !195)
!195 = !{!196, !197, !198, !199, !205, !206}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !194, file: !154, line: 380, baseType: !157, size: 32)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !194, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !194, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !194, file: !154, line: 386, baseType: !200, size: 32, offset: 96)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 32)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !202)
!202 = !{!203, !204}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !201, file: !154, line: 359, baseType: !167, size: 8)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !201, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !194, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !194, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !186, file: !145, line: 65, baseType: !192, size: 32, offset: 32)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "static_regions", scope: !210, file: !219, line: 62, type: !361, isLocal: true, isDefinition: true)
!210 = distinct !DICompileUnit(language: DW_LANG_C99, file: !211, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !212, globals: !215, splitDebugInlining: false, nameTableKind: None)
!211 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/tmp108")
!212 = !{!213, !103, !121, !102}
!213 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !214, line: 214, baseType: !32)
!214 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = !{!216, !208}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !218, file: !219, line: 198, type: !347, isLocal: true, isDefinition: true)
!218 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !219, file: !219, line: 175, type: !220, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !210, retainedNodes: !342)
!219 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!220 = !DISubroutineType(types: !221)
!221 = !{null, !222}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !224, line: 245, size: 1024, elements: !225)
!224 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!225 = !{!226, !295, !308, !309, !310, !311, !317, !337}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !223, file: !224, line: 247, baseType: !227, size: 384)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !224, line: 57, size: 384, elements: !228)
!228 = !{!229, !257, !265, !266, !267, !280, !281, !282}
!229 = !DIDerivedType(tag: DW_TAG_member, scope: !227, file: !224, line: 60, baseType: !230, size: 64)
!230 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !227, file: !224, line: 60, size: 64, elements: !231)
!231 = !{!232, !248}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !230, file: !224, line: 61, baseType: !233, size: 64)
!233 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !234, line: 49, baseType: !235)
!234 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !234, line: 37, size: 64, elements: !236)
!236 = !{!237, !243}
!237 = !DIDerivedType(tag: DW_TAG_member, scope: !235, file: !234, line: 38, baseType: !238, size: 32)
!238 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !235, file: !234, line: 38, size: 32, elements: !239)
!239 = !{!240, !242}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !238, file: !234, line: 39, baseType: !241, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !238, file: !234, line: 40, baseType: !241, size: 32)
!243 = !DIDerivedType(tag: DW_TAG_member, scope: !235, file: !234, line: 42, baseType: !244, size: 32, offset: 32)
!244 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !235, file: !234, line: 42, size: 32, elements: !245)
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !244, file: !234, line: 43, baseType: !241, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !244, file: !234, line: 44, baseType: !241, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !230, file: !224, line: 62, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !250, line: 49, size: 64, elements: !251)
!250 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !249, file: !250, line: 50, baseType: !253, size: 64)
!253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !254, size: 64, elements: !255)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!255 = !{!256}
!256 = !DISubrange(count: 2)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !227, file: !224, line: 68, baseType: !258, size: 32, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !260, line: 233, baseType: !261)
!260 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !260, line: 231, size: 64, elements: !262)
!262 = !{!263}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !261, file: !260, line: 232, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !234, line: 48, baseType: !235)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !227, file: !224, line: 71, baseType: !167, size: 8, offset: 96)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !227, file: !224, line: 74, baseType: !167, size: 8, offset: 104)
!267 = !DIDerivedType(tag: DW_TAG_member, scope: !227, file: !224, line: 90, baseType: !268, size: 16, offset: 112)
!268 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !227, file: !224, line: 90, size: 16, elements: !269)
!269 = !{!270, !277}
!270 = !DIDerivedType(tag: DW_TAG_member, scope: !268, file: !224, line: 91, baseType: !271, size: 16)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !268, file: !224, line: 91, size: 16, elements: !272)
!272 = !{!273, !276}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !271, file: !224, line: 96, baseType: !274, size: 8)
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !275)
!275 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !271, file: !224, line: 97, baseType: !167, size: 8, offset: 8)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !268, file: !224, line: 100, baseType: !278, size: 16)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !279)
!279 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !227, file: !224, line: 107, baseType: !121, size: 32, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !227, file: !224, line: 127, baseType: !102, size: 32, offset: 160)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !227, file: !224, line: 131, baseType: !283, size: 192, offset: 192)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !260, line: 244, size: 192, elements: !284)
!284 = !{!285, !286, !292}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !283, file: !260, line: 245, baseType: !233, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !283, file: !260, line: 246, baseType: !287, size: 32, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !260, line: 242, baseType: !288)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 32)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !291}
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !283, file: !260, line: 249, baseType: !293, size: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !294)
!294 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !223, file: !224, line: 250, baseType: !296, size: 288, offset: 384)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !297, line: 25, size: 288, elements: !298)
!297 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!298 = !{!299, !300, !301, !302, !303, !304, !305, !306, !307}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !296, file: !297, line: 26, baseType: !121, size: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !296, file: !297, line: 27, baseType: !121, size: 32, offset: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !296, file: !297, line: 28, baseType: !121, size: 32, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !296, file: !297, line: 29, baseType: !121, size: 32, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !296, file: !297, line: 30, baseType: !121, size: 32, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !296, file: !297, line: 31, baseType: !121, size: 32, offset: 160)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !296, file: !297, line: 32, baseType: !121, size: 32, offset: 192)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !296, file: !297, line: 33, baseType: !121, size: 32, offset: 224)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !296, file: !297, line: 34, baseType: !121, size: 32, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !223, file: !224, line: 253, baseType: !102, size: 32, offset: 672)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !223, file: !224, line: 256, baseType: !259, size: 64, offset: 704)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !223, file: !224, line: 294, baseType: !103, size: 32, offset: 768)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !223, file: !224, line: 300, baseType: !312, size: 96, offset: 800)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !224, line: 149, size: 96, elements: !313)
!313 = !{!314, !315, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !312, file: !224, line: 153, baseType: !22, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !312, file: !224, line: 162, baseType: !213, size: 32, offset: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !312, file: !224, line: 168, baseType: !213, size: 32, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !223, file: !224, line: 325, baseType: !318, size: 32, offset: 896)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 32)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !320, line: 5073, size: 192, elements: !321)
!320 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!321 = !{!322, !331, !332}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !319, file: !320, line: 5074, baseType: !323, size: 96)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !324, line: 56, size: 96, elements: !325)
!324 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!325 = !{!326, !329, !330}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !323, file: !324, line: 57, baseType: !327, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 32)
!328 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !324, line: 57, flags: DIFlagFwdDecl)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !323, file: !324, line: 58, baseType: !102, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !323, file: !324, line: 59, baseType: !213, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !319, file: !320, line: 5075, baseType: !259, size: 64, offset: 96)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !319, file: !320, line: 5076, baseType: !333, size: 32, offset: 160)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !334, line: 43, size: 32, elements: !335)
!334 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = !{!336}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !333, file: !334, line: 52, baseType: !22, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !223, file: !224, line: 343, baseType: !338, size: 64, offset: 928)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !297, line: 60, size: 64, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !338, file: !297, line: 63, baseType: !121, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !338, file: !297, line: 66, baseType: !121, size: 32, offset: 32)
!342 = !{!343, !344, !345, !346}
!343 = !DILocalVariable(name: "thread", arg: 1, scope: !218, file: !219, line: 175, type: !222)
!344 = !DILocalVariable(name: "region_num", scope: !218, file: !219, line: 200, type: !167)
!345 = !DILocalVariable(name: "guard_start", scope: !218, file: !219, line: 265, type: !22)
!346 = !DILocalVariable(name: "guard_size", scope: !218, file: !219, line: 266, type: !213)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 96, elements: !359)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !349, line: 52, size: 96, elements: !350)
!349 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!350 = !{!351, !352, !353}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !348, file: !349, line: 53, baseType: !22, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !348, file: !349, line: 54, baseType: !213, size: 32, offset: 32)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !348, file: !349, line: 55, baseType: !354, size: 32, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !355, line: 151, baseType: !356)
!355 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !355, line: 149, size: 32, elements: !357)
!357 = !{!358}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !356, file: !355, line: 150, baseType: !121, size: 32)
!359 = !{!360}
!360 = !DISubrange(count: 1)
!361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 96, elements: !359)
!362 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!363 = !DIGlobalVariableExpression(var: !364, expr: !DIExpression())
!364 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !365, file: !398, line: 39, type: !167, isLocal: true, isDefinition: true)
!365 = distinct !DICompileUnit(language: DW_LANG_C99, file: !366, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !367, globals: !397, splitDebugInlining: false, nameTableKind: None)
!366 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/tmp108")
!367 = !{!368, !102, !103, !385, !167}
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 32)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !370, line: 1168, baseType: !371)
!370 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !370, line: 1155, size: 352, elements: !372)
!372 = !{!373, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !371, file: !370, line: 1157, baseType: !374, size: 32)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !120)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !371, file: !370, line: 1158, baseType: !120, size: 32, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !371, file: !370, line: 1159, baseType: !120, size: 32, offset: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !371, file: !370, line: 1160, baseType: !120, size: 32, offset: 96)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !371, file: !370, line: 1161, baseType: !120, size: 32, offset: 128)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !371, file: !370, line: 1162, baseType: !120, size: 32, offset: 160)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !371, file: !370, line: 1163, baseType: !120, size: 32, offset: 192)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !371, file: !370, line: 1164, baseType: !120, size: 32, offset: 224)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !371, file: !370, line: 1165, baseType: !120, size: 32, offset: 256)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !371, file: !370, line: 1166, baseType: !120, size: 32, offset: 288)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !371, file: !370, line: 1167, baseType: !120, size: 32, offset: 320)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !388, line: 27, size: 96, elements: !389)
!388 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!389 = !{!390, !391, !392}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !387, file: !388, line: 29, baseType: !121, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !387, file: !388, line: 31, baseType: !157, size: 32, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !387, file: !388, line: 37, baseType: !393, size: 32, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !355, line: 146, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !355, line: 141, size: 32, elements: !395)
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !394, file: !355, line: 143, baseType: !121, size: 32)
!397 = !{!363}
!398 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!399 = !DIGlobalVariableExpression(var: !400, expr: !DIExpression())
!400 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !401, file: !408, line: 21, type: !106, isLocal: true, isDefinition: true)
!401 = distinct !DICompileUnit(language: DW_LANG_C99, file: !402, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !403, globals: !407, splitDebugInlining: false, nameTableKind: None)
!402 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/tmp108")
!403 = !{!404, !103, !102}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 32)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !406, line: 22, baseType: !103)
!406 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!407 = !{!399}
!408 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = !DIGlobalVariableExpression(var: !410, expr: !DIExpression())
!410 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !411, file: !416, line: 13, type: !433, isLocal: true, isDefinition: true)
!411 = distinct !DICompileUnit(language: DW_LANG_C99, file: !412, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !413, splitDebugInlining: false, nameTableKind: None)
!412 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/tmp108")
!413 = !{!414, !409}
!414 = !DIGlobalVariableExpression(var: !415, expr: !DIExpression())
!415 = distinct !DIGlobalVariable(name: "mpu_config", scope: !411, file: !416, line: 37, type: !417, isLocal: false, isDefinition: true)
!416 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!417 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !418)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !388, line: 41, size: 64, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !418, file: !388, line: 43, baseType: !121, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !418, file: !388, line: 45, baseType: !422, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !424)
!424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !388, line: 27, size: 96, elements: !425)
!425 = !{!426, !427, !428}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !424, file: !388, line: 29, baseType: !121, size: 32)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !424, file: !388, line: 31, baseType: !157, size: 32, offset: 32)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !424, file: !388, line: 37, baseType: !429, size: 32, offset: 64)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !355, line: 146, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !355, line: 141, size: 32, elements: !431)
!431 = !{!432}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !430, file: !355, line: 143, baseType: !121, size: 32)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 192, elements: !255)
!434 = !DIGlobalVariableExpression(var: !435, expr: !DIExpression())
!435 = distinct !DIGlobalVariable(name: "__init_rf_init", scope: !436, file: !533, line: 36, type: !534, isLocal: true, isDefinition: true, align: 32)
!436 = distinct !DICompileUnit(language: DW_LANG_C99, file: !437, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !438, retainedTypes: !450, globals: !532, splitDebugInlining: false, nameTableKind: None)
!437 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/tmp108")
!438 = !{!439, !445}
!439 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !440, line: 506, baseType: !32, size: 32, elements: !441)
!440 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!441 = !{!442, !443, !444}
!442 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!443 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!444 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!445 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !440, line: 512, baseType: !32, size: 32, elements: !446)
!446 = !{!447, !448, !449}
!447 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!448 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!449 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!450 = !{!451, !521, !526, !486, !445, !439, !531, !102}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !440, line: 523, size: 288, elements: !454)
!454 = !{!455, !476, !482, !487, !491, !492, !493, !497, !517}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !453, file: !440, line: 524, baseType: !456, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 32)
!457 = !DISubroutineType(types: !458)
!458 = !{!103, !459, !474, !475}
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !461)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !462)
!462 = !{!463, !464, !465, !466, !472, !473}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !461, file: !154, line: 380, baseType: !157, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !461, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !461, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !461, file: !154, line: 386, baseType: !467, size: 32, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 32)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !469)
!469 = !{!470, !471}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !468, file: !154, line: 359, baseType: !167, size: 8)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !468, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !461, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !461, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!474 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !440, line: 237, baseType: !167)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !440, line: 257, baseType: !121)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !453, file: !440, line: 530, baseType: !477, size: 32, offset: 32)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 32)
!478 = !DISubroutineType(types: !479)
!479 = !{!103, !459, !480}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !440, line: 229, baseType: !121)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !453, file: !440, line: 532, baseType: !483, size: 32, offset: 64)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = !DISubroutineType(types: !485)
!485 = !{!103, !459, !486, !481}
!486 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !440, line: 216, baseType: !121)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !453, file: !440, line: 535, baseType: !488, size: 32, offset: 96)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = !DISubroutineType(types: !490)
!490 = !{!103, !459, !486}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !453, file: !440, line: 537, baseType: !488, size: 32, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !453, file: !440, line: 539, baseType: !488, size: 32, offset: 160)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !453, file: !440, line: 541, baseType: !494, size: 32, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 32)
!495 = !DISubroutineType(types: !496)
!496 = !{!103, !459, !474, !439, !445}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !453, file: !440, line: 544, baseType: !498, size: 32, offset: 224)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 32)
!499 = !DISubroutineType(types: !500)
!500 = !{!103, !459, !501, !170}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 32)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !440, line: 478, size: 96, elements: !503)
!503 = !{!504, !511, !516}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !502, file: !440, line: 482, baseType: !505, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !506, line: 33, baseType: !507)
!506 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !506, line: 29, size: 32, elements: !508)
!508 = !{!509}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !507, file: !506, line: 30, baseType: !510, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 32)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !502, file: !440, line: 485, baseType: !512, size: 32, offset: 32)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !440, line: 464, baseType: !513)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 32)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !459, !501, !486}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !502, file: !440, line: 493, baseType: !486, size: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !453, file: !440, line: 547, baseType: !518, size: 32, offset: 256)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 32)
!519 = !DISubroutineType(types: !520)
!520 = !{!121, !459}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 32)
!522 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !523)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !440, line: 428, size: 32, elements: !524)
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !523, file: !440, line: 434, baseType: !486, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !440, line: 441, size: 32, elements: !529)
!529 = !{!530}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !528, file: !440, line: 447, baseType: !486, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !528, size: 32)
!532 = !{!434}
!533 = !DIFile(filename: "zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !536)
!536 = !{!537, !541}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !535, file: !145, line: 60, baseType: !538, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 32)
!539 = !DISubroutineType(types: !540)
!540 = !{!103, !459}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !535, file: !145, line: 65, baseType: !459, size: 32, offset: 32)
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !544, file: !616, line: 48, type: !692, isLocal: true, isDefinition: true)
!544 = distinct !DICompileUnit(language: DW_LANG_C99, file: !545, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !546, retainedTypes: !602, globals: !613, splitDebugInlining: false, nameTableKind: None)
!545 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/tmp108")
!546 = !{!30, !547}
!547 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !116, line: 69, baseType: !103, size: 32, elements: !548)
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601}
!549 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!550 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!551 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!552 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!553 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!554 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!555 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!556 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!557 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!558 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!559 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!560 = !DIEnumerator(name: "TAMPER_STAMP_IRQn", value: 2)
!561 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!562 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!563 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!564 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!565 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!566 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!567 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!568 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!569 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!570 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!571 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!572 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!573 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!574 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!575 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!576 = !DIEnumerator(name: "ADC1_IRQn", value: 18)
!577 = !DIEnumerator(name: "USB_HP_IRQn", value: 19)
!578 = !DIEnumerator(name: "USB_LP_IRQn", value: 20)
!579 = !DIEnumerator(name: "DAC_IRQn", value: 21)
!580 = !DIEnumerator(name: "COMP_IRQn", value: 22)
!581 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!582 = !DIEnumerator(name: "TIM9_IRQn", value: 25)
!583 = !DIEnumerator(name: "TIM10_IRQn", value: 26)
!584 = !DIEnumerator(name: "TIM11_IRQn", value: 27)
!585 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!586 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!587 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!588 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!589 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!590 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!591 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!592 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!593 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!594 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!595 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!596 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!597 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!598 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!599 = !DIEnumerator(name: "USB_FS_WKUP_IRQn", value: 42)
!600 = !DIEnumerator(name: "TIM6_IRQn", value: 43)
!601 = !DIEnumerator(name: "TIM7_IRQn", value: 44)
!602 = !{!213, !103, !102, !603}
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !116, line: 270, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 262, size: 192, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !612}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !605, file: !116, line: 264, baseType: !120, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !605, file: !116, line: 265, baseType: !120, size: 32, offset: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !605, file: !116, line: 266, baseType: !120, size: 32, offset: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !605, file: !116, line: 267, baseType: !120, size: 32, offset: 96)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !605, file: !116, line: 268, baseType: !120, size: 32, offset: 128)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !605, file: !116, line: 269, baseType: !120, size: 32, offset: 160)
!613 = !{!614, !620, !636, !647, !664, !542, !666, !680, !682, !684, !686, !688, !690}
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !544, file: !616, line: 424, type: !617, isLocal: false, isDefinition: true, align: 16)
!616 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 64, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 4)
!620 = !DIGlobalVariableExpression(var: !621, expr: !DIExpression())
!621 = distinct !DIGlobalVariable(name: "__device_dts_ord_32", scope: !544, file: !616, line: 424, type: !622, isLocal: false, isDefinition: true, align: 32)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !623)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !624)
!624 = !{!625, !626, !627, !628, !634, !635}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !623, file: !154, line: 380, baseType: !157, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !623, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !623, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !623, file: !154, line: 386, baseType: !629, size: 32, offset: 96)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 32)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !631)
!631 = !{!632, !633}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !630, file: !154, line: 359, baseType: !167, size: 8)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !630, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !623, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !623, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_32", scope: !544, file: !616, line: 424, type: !638, isLocal: true, isDefinition: true, align: 32)
!638 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !640)
!640 = !{!641, !646}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !639, file: !145, line: 60, baseType: !642, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 32)
!643 = !DISubroutineType(types: !644)
!644 = !{!103, !645}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !639, file: !145, line: 65, baseType: !645, size: 32, offset: 32)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "exti_data", scope: !544, file: !616, line: 423, type: !649, isLocal: true, isDefinition: true)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !616, line: 107, size: 1024, elements: !650)
!650 = !{!651}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !649, file: !616, line: 109, baseType: !652, size: 1024)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !653, size: 1024, elements: !662)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !616, line: 101, size: 64, elements: !654)
!654 = !{!655, !661}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !653, file: !616, line: 102, baseType: !656, size: 32)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !657, line: 63, baseType: !658)
!657 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 32)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !103, !102}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !653, file: !616, line: 103, baseType: !102, size: 32, offset: 32)
!662 = !{!663}
!663 = !DISubrange(count: 16)
!664 = !DIGlobalVariableExpression(var: !665, expr: !DIExpression())
!665 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_32", scope: !544, file: !616, line: 424, type: !630, isLocal: true, isDefinition: true, align: 8)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !668, file: !616, line: 493, type: !673, isLocal: true, isDefinition: true, align: 32)
!668 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !616, file: !616, line: 460, type: !669, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !544, retainedNodes: !671)
!669 = !DISubroutineType(types: !670)
!670 = !{null, !645}
!671 = !{!672}
!672 = !DILocalVariable(name: "dev", arg: 1, scope: !668, file: !616, line: 460, type: !645)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !674)
!674 = !{!675, !677, !678, !679}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !673, file: !10, line: 55, baseType: !676, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !673, file: !10, line: 57, baseType: !676, size: 32, offset: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !673, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !673, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!680 = !DIGlobalVariableExpression(var: !681, expr: !DIExpression())
!681 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !668, file: !616, line: 497, type: !673, isLocal: true, isDefinition: true, align: 32)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !668, file: !616, line: 507, type: !673, isLocal: true, isDefinition: true, align: 32)
!684 = !DIGlobalVariableExpression(var: !685, expr: !DIExpression())
!685 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !668, file: !616, line: 512, type: !673, isLocal: true, isDefinition: true, align: 32)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !668, file: !616, line: 516, type: !673, isLocal: true, isDefinition: true, align: 32)
!688 = !DIGlobalVariableExpression(var: !689, expr: !DIExpression())
!689 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !668, file: !616, line: 523, type: !673, isLocal: true, isDefinition: true, align: 32)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !668, file: !616, line: 527, type: !673, isLocal: true, isDefinition: true, align: 32)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 512, elements: !662)
!693 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !116, line: 127, baseType: !547)
!695 = !DIGlobalVariableExpression(var: !696, expr: !DIExpression())
!696 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !697, file: !702, line: 22, type: !729, isLocal: false, isDefinition: true, align: 16)
!697 = distinct !DICompileUnit(language: DW_LANG_C99, file: !698, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !699, splitDebugInlining: false, nameTableKind: None)
!698 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/tmp108/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/tmp108")
!699 = !{!700, !695, !706, !708, !710, !712, !714, !716, !718, !720, !722, !727}
!700 = !DIGlobalVariableExpression(var: !701, expr: !DIExpression())
!701 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !697, file: !702, line: 17, type: !703, isLocal: false, isDefinition: true, align: 16)
!702 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/tmp108")
!703 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 192, elements: !704)
!704 = !{!705}
!705 = !DISubrange(count: 12)
!706 = !DIGlobalVariableExpression(var: !707, expr: !DIExpression())
!707 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_17", scope: !697, file: !702, line: 29, type: !617, isLocal: false, isDefinition: true, align: 16)
!708 = !DIGlobalVariableExpression(var: !709, expr: !DIExpression())
!709 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !697, file: !702, line: 36, type: !617, isLocal: false, isDefinition: true, align: 16)
!710 = !DIGlobalVariableExpression(var: !711, expr: !DIExpression())
!711 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_53", scope: !697, file: !702, line: 43, type: !617, isLocal: false, isDefinition: true, align: 16)
!712 = !DIGlobalVariableExpression(var: !713, expr: !DIExpression())
!713 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_59", scope: !697, file: !702, line: 50, type: !617, isLocal: false, isDefinition: true, align: 16)
!714 = !DIGlobalVariableExpression(var: !715, expr: !DIExpression())
!715 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_15", scope: !697, file: !702, line: 57, type: !617, isLocal: false, isDefinition: true, align: 16)
!716 = !DIGlobalVariableExpression(var: !717, expr: !DIExpression())
!717 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !697, file: !702, line: 64, type: !617, isLocal: false, isDefinition: true, align: 16)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !697, file: !702, line: 71, type: !617, isLocal: false, isDefinition: true, align: 16)
!720 = !DIGlobalVariableExpression(var: !721, expr: !DIExpression())
!721 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !697, file: !702, line: 78, type: !617, isLocal: false, isDefinition: true, align: 16)
!722 = !DIGlobalVariableExpression(var: !723, expr: !DIExpression())
!723 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_51", scope: !697, file: !702, line: 87, type: !724, isLocal: false, isDefinition: true, align: 16)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 80, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 5)
!727 = !DIGlobalVariableExpression(var: !728, expr: !DIExpression())
!728 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_52", scope: !697, file: !702, line: 94, type: !617, isLocal: false, isDefinition: true, align: 16)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 48, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 3)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !734, file: !778, line: 398, type: !811, isLocal: true, isDefinition: true)
!734 = distinct !DICompileUnit(language: DW_LANG_C99, file: !735, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !736, retainedTypes: !749, globals: !775, splitDebugInlining: false, nameTableKind: None)
!735 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/tmp108")
!736 = !{!737, !30, !742}
!737 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !738, line: 190, baseType: !32, size: 32, elements: !739)
!738 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l1xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!739 = !{!740, !741}
!740 = !DIEnumerator(name: "SUCCESS", value: 0)
!741 = !DIEnumerator(name: "ERROR", value: 1)
!742 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !743, line: 44, baseType: !32, size: 32, elements: !744)
!743 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!744 = !{!745, !746, !747, !748}
!745 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!746 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!747 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!748 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!749 = !{!102, !103, !121, !750, !768, !774}
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !116, line: 386, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 370, size: 448, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !752, file: !116, line: 372, baseType: !120, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !752, file: !116, line: 373, baseType: !120, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !752, file: !116, line: 374, baseType: !120, size: 32, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !752, file: !116, line: 375, baseType: !120, size: 32, offset: 96)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !752, file: !116, line: 376, baseType: !120, size: 32, offset: 128)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !752, file: !116, line: 377, baseType: !120, size: 32, offset: 160)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !752, file: !116, line: 378, baseType: !120, size: 32, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !752, file: !116, line: 379, baseType: !120, size: 32, offset: 224)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !752, file: !116, line: 380, baseType: !120, size: 32, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !752, file: !116, line: 381, baseType: !120, size: 32, offset: 288)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !752, file: !116, line: 382, baseType: !120, size: 32, offset: 320)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !752, file: !116, line: 383, baseType: !120, size: 32, offset: 352)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !752, file: !116, line: 384, baseType: !120, size: 32, offset: 384)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !752, file: !116, line: 385, baseType: !120, size: 32, offset: 416)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 32)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !770, line: 343, size: 64, elements: !771)
!770 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !769, file: !770, line: 344, baseType: !121, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !769, file: !770, line: 345, baseType: !121, size: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 32)
!775 = !{!776, !782, !798, !809, !732}
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !734, file: !778, line: 752, type: !779, isLocal: false, isDefinition: true, align: 16)
!778 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !174, size: 512, elements: !780)
!780 = !{!781}
!781 = !DISubrange(count: 32)
!782 = !DIGlobalVariableExpression(var: !783, expr: !DIExpression())
!783 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !734, file: !778, line: 752, type: !784, isLocal: false, isDefinition: true, align: 32)
!784 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !786)
!786 = !{!787, !788, !789, !790, !796, !797}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !785, file: !154, line: 380, baseType: !157, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !785, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !785, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !785, file: !154, line: 386, baseType: !791, size: 32, offset: 96)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !792, file: !154, line: 359, baseType: !167, size: 8)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !792, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !785, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !785, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!798 = !DIGlobalVariableExpression(var: !799, expr: !DIExpression())
!799 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !734, file: !778, line: 752, type: !800, isLocal: true, isDefinition: true, align: 32)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !802)
!802 = !{!803, !808}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !801, file: !145, line: 60, baseType: !804, size: 32)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 32)
!805 = !DISubroutineType(types: !806)
!806 = !{!103, !807}
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !801, file: !145, line: 65, baseType: !807, size: 32, offset: 32)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !734, file: !778, line: 752, type: !792, isLocal: true, isDefinition: true, align: 8)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !743, line: 100, size: 224, elements: !812)
!812 = !{!813, !819, !820, !829, !834, !839, !845}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !811, file: !743, line: 101, baseType: !814, size: 32)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !743, line: 76, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 32)
!816 = !DISubroutineType(types: !817)
!817 = !{!103, !807, !818}
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !743, line: 56, baseType: !102)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !811, file: !743, line: 102, baseType: !814, size: 32, offset: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !811, file: !743, line: 103, baseType: !821, size: 32, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !743, line: 83, baseType: !822)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 32)
!823 = !DISubroutineType(types: !824)
!824 = !{!103, !807, !818, !825, !102}
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !743, line: 72, baseType: !826)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 32)
!827 = !DISubroutineType(types: !828)
!828 = !{null, !807, !818, !102}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !811, file: !743, line: 104, baseType: !830, size: 32, offset: 96)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !743, line: 79, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 32)
!832 = !DISubroutineType(types: !833)
!833 = !{!103, !807, !818, !774}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !811, file: !743, line: 105, baseType: !835, size: 32, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !743, line: 88, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!837 = !DISubroutineType(types: !838)
!838 = !{!742, !807, !818}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !811, file: !743, line: 106, baseType: !840, size: 32, offset: 160)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !743, line: 92, baseType: !841)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 32)
!842 = !DISubroutineType(types: !843)
!843 = !{!103, !807, !818, !844}
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !743, line: 64, baseType: !102)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !811, file: !743, line: 107, baseType: !846, size: 32, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !743, line: 96, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!848 = !DISubroutineType(types: !849)
!849 = !{!103, !807, !818, !102}
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !852, file: !909, line: 603, type: !911, isLocal: true, isDefinition: true, align: 32)
!852 = distinct !DICompileUnit(language: DW_LANG_C99, file: !853, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !854, globals: !906, splitDebugInlining: false, nameTableKind: None)
!853 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/tmp108")
!854 = !{!102, !103, !855}
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !857)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !858, line: 336, size: 160, elements: !859)
!858 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!859 = !{!860, !880, !884, !888, !901}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !857, file: !858, line: 365, baseType: !861, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 32)
!862 = !DISubroutineType(types: !863)
!863 = !{!103, !864, !879}
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !867)
!867 = !{!868, !869, !870, !871, !877, !878}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !866, file: !154, line: 380, baseType: !157, size: 32)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !866, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !866, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !866, file: !154, line: 386, baseType: !872, size: 32, offset: 96)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !873, file: !154, line: 359, baseType: !167, size: 8)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !873, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !866, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !866, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !857, file: !858, line: 366, baseType: !881, size: 32, offset: 32)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 32)
!882 = !DISubroutineType(types: !883)
!883 = !{null, !864, !168}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !857, file: !858, line: 374, baseType: !885, size: 32, offset: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 32)
!886 = !DISubroutineType(types: !887)
!887 = !{!103, !864}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !857, file: !858, line: 377, baseType: !889, size: 32, offset: 96)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 32)
!890 = !DISubroutineType(types: !891)
!891 = !{!103, !864, !892}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !858, line: 122, size: 64, elements: !895)
!895 = !{!896, !897, !898, !899, !900}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !894, file: !858, line: 123, baseType: !121, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !894, file: !858, line: 124, baseType: !167, size: 8, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !894, file: !858, line: 125, baseType: !167, size: 8, offset: 40)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !894, file: !858, line: 126, baseType: !167, size: 8, offset: 48)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !894, file: !858, line: 127, baseType: !167, size: 8, offset: 56)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !857, file: !858, line: 379, baseType: !902, size: 32, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 32)
!903 = !DISubroutineType(types: !904)
!904 = !{!103, !864, !905}
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!906 = !{!850, !907}
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !852, file: !909, line: 38, type: !910, isLocal: true, isDefinition: true)
!909 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!910 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !864)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !145, line: 51, size: 64, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !912, file: !145, line: 60, baseType: !885, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !912, file: !145, line: 65, baseType: !864, size: 32, offset: 32)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(name: "gpio_stm32_cfg_a", scope: !918, file: !1069, line: 762, type: !1164, isLocal: true, isDefinition: true)
!918 = distinct !DICompileUnit(language: DW_LANG_C99, file: !919, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !920, retainedTypes: !927, globals: !1066, splitDebugInlining: false, nameTableKind: None)
!919 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/tmp108")
!920 = !{!30, !439, !445, !921, !742}
!921 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "stm32_exti_trigger", file: !657, line: 43, baseType: !32, size: 32, elements: !922)
!922 = !{!923, !924, !925, !926}
!923 = !DIEnumerator(name: "STM32_EXTI_TRIG_NONE", value: 0)
!924 = !DIEnumerator(name: "STM32_EXTI_TRIG_RISING", value: 1)
!925 = !DIEnumerator(name: "STM32_EXTI_TRIG_FALLING", value: 2)
!926 = !DIEnumerator(name: "STM32_EXTI_TRIG_BOTH", value: 3)
!927 = !{!102, !103, !928, !992, !997, !486, !445, !439, !1002, !1003, !121, !1017, !973, !1025, !1026, !1027}
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 32)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !440, line: 523, size: 288, elements: !931)
!931 = !{!932, !951, !955, !959, !963, !964, !965, !969, !988}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !930, file: !440, line: 524, baseType: !933, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 32)
!934 = !DISubroutineType(types: !935)
!935 = !{!103, !936, !474, !475}
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!937 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !154, line: 378, size: 192, elements: !939)
!939 = !{!940, !941, !942, !943, !949, !950}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !938, file: !154, line: 380, baseType: !157, size: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !938, file: !154, line: 382, baseType: !13, size: 32, offset: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !938, file: !154, line: 384, baseType: !13, size: 32, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !938, file: !154, line: 386, baseType: !944, size: 32, offset: 96)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 32)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !154, line: 351, size: 16, elements: !946)
!946 = !{!947, !948}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !945, file: !154, line: 359, baseType: !167, size: 8)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !945, file: !154, line: 364, baseType: !170, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !938, file: !154, line: 388, baseType: !102, size: 32, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !938, file: !154, line: 396, baseType: !173, size: 32, offset: 160)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !930, file: !440, line: 530, baseType: !952, size: 32, offset: 32)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 32)
!953 = !DISubroutineType(types: !954)
!954 = !{!103, !936, !480}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !930, file: !440, line: 532, baseType: !956, size: 32, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 32)
!957 = !DISubroutineType(types: !958)
!958 = !{!103, !936, !486, !481}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !930, file: !440, line: 535, baseType: !960, size: 32, offset: 96)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 32)
!961 = !DISubroutineType(types: !962)
!962 = !{!103, !936, !486}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !930, file: !440, line: 537, baseType: !960, size: 32, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !930, file: !440, line: 539, baseType: !960, size: 32, offset: 160)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !930, file: !440, line: 541, baseType: !966, size: 32, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 32)
!967 = !DISubroutineType(types: !968)
!968 = !{!103, !936, !474, !439, !445}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !930, file: !440, line: 544, baseType: !970, size: 32, offset: 224)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 32)
!971 = !DISubroutineType(types: !972)
!972 = !{!103, !936, !973, !170}
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 32)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !440, line: 478, size: 96, elements: !975)
!975 = !{!976, !982, !987}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !974, file: !440, line: 482, baseType: !977, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !506, line: 33, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !506, line: 29, size: 32, elements: !979)
!979 = !{!980}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !978, file: !506, line: 30, baseType: !981, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !974, file: !440, line: 485, baseType: !983, size: 32, offset: 32)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !440, line: 464, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 32)
!985 = !DISubroutineType(types: !986)
!986 = !{null, !936, !973, !486}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !974, file: !440, line: 493, baseType: !486, size: 32, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !930, file: !440, line: 547, baseType: !989, size: 32, offset: 256)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 32)
!990 = !DISubroutineType(types: !991)
!991 = !{!121, !936}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 32)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !440, line: 428, size: 32, elements: !995)
!995 = !{!996}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !994, file: !440, line: 434, baseType: !486, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !440, line: 441, size: 32, elements: !1000)
!1000 = !{!1001}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !999, file: !440, line: 447, baseType: !486, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_TypeDef", file: !116, line: 314, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 303, size: 320, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "MODER", scope: !1005, file: !116, line: 305, baseType: !120, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "OTYPER", scope: !1005, file: !116, line: 306, baseType: !120, size: 32, offset: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "OSPEEDR", scope: !1005, file: !116, line: 307, baseType: !120, size: 32, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "PUPDR", scope: !1005, file: !116, line: 308, baseType: !120, size: 32, offset: 96)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "IDR", scope: !1005, file: !116, line: 309, baseType: !120, size: 32, offset: 128)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ODR", scope: !1005, file: !116, line: 310, baseType: !120, size: 32, offset: 160)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "BSRR", scope: !1005, file: !116, line: 311, baseType: !120, size: 32, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "LCKR", scope: !1005, file: !116, line: 312, baseType: !120, size: 32, offset: 224)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "AFR", scope: !1005, file: !116, line: 313, baseType: !1016, size: 64, offset: 256)
!1016 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 64, elements: !255)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "SYSCFG_TypeDef", file: !116, line: 325, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !116, line: 320, size: 192, elements: !1020)
!1020 = !{!1021, !1022, !1023}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "MEMRMP", scope: !1019, file: !116, line: 322, baseType: !120, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "PMC", scope: !1019, file: !116, line: 323, baseType: !120, size: 32, offset: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "EXTICR", scope: !1019, file: !116, line: 324, baseType: !1024, size: 128, offset: 64)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !120, size: 128, elements: !618)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 32)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 32)
!1028 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !743, line: 100, size: 224, elements: !1030)
!1030 = !{!1031, !1036, !1037, !1046, !1051, !1056, !1061}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !1029, file: !743, line: 101, baseType: !1032, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !743, line: 76, baseType: !1033)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 32)
!1034 = !DISubroutineType(types: !1035)
!1035 = !{!103, !936, !818}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !1029, file: !743, line: 102, baseType: !1032, size: 32, offset: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !1029, file: !743, line: 103, baseType: !1038, size: 32, offset: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !743, line: 83, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 32)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!103, !936, !818, !1042, !102}
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !743, line: 72, baseType: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 32)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{null, !936, !818, !102}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !1029, file: !743, line: 104, baseType: !1047, size: 32, offset: 96)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !743, line: 79, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 32)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!103, !936, !818, !774}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !1029, file: !743, line: 105, baseType: !1052, size: 32, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !743, line: 88, baseType: !1053)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 32)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{!742, !936, !818}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !1029, file: !743, line: 106, baseType: !1057, size: 32, offset: 160)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !743, line: 92, baseType: !1058)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 32)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!103, !936, !818, !844}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !1029, file: !743, line: 107, baseType: !1062, size: 32, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !743, line: 96, baseType: !1063)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 32)
!1064 = !DISubroutineType(types: !1065)
