; ModuleID = 'build/96b_wistrio/echo_bot/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_msgq = type { %struct._wait_q_t, %struct.k_spinlock, i32, i32, i8*, i8*, i8*, i8*, i32, i8 }
%struct._wait_q_t = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_spinlock = type {}
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.z_heap_bucket = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.stm32_exti_data = type { [16 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }
%struct.clock_control_driver_api = type { i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, void (%struct.device*, i8*, i8*)*, i8*)*, i32 (%struct.device*, i8*, i32*)*, i32 (%struct.device*, i8*)*, i32 (%struct.device*, i8*, i8*)*, i32 (%struct.device*, i8*, i8*)* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/echo_bot/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/echo_bot")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/echo_bot")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "uart_msgq", scope: !27, file: !209, line: 19, type: !223, isLocal: false, isDefinition: true, align: 32)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !206, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/uart/echo_bot/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/echo_bot")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103, !107, !108}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !106)
!106 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!107 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32)
!109 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !111, line: 336, size: 608, elements: !112)
!111 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!112 = !{!113, !145, !149, !153, !167, !172, !178, !184, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !110, file: !111, line: 365, baseType: !114, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 32)
!115 = !DISubroutineType(types: !116)
!116 = !{!107, !117, !144}
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !120, line: 378, size: 192, elements: !121)
!120 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!121 = !{!122, !126, !127, !128, !137, !138}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !119, file: !120, line: 380, baseType: !123, size: 32)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 32)
!124 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !125)
!125 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !119, file: !120, line: 382, baseType: !13, size: 32, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !119, file: !120, line: 384, baseType: !13, size: 32, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !119, file: !120, line: 386, baseType: !129, size: 32, offset: 96)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 32)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !120, line: 351, size: 16, elements: !131)
!131 = !{!132, !135}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !130, file: !120, line: 359, baseType: !133, size: 8)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !134)
!134 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !130, file: !120, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!136 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !119, file: !120, line: 388, baseType: !102, size: 32, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !119, file: !120, line: 396, baseType: !139, size: 32, offset: 160)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !120, line: 43, baseType: !142)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !143)
!143 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !110, file: !111, line: 366, baseType: !146, size: 32, offset: 32)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !117, !134}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !110, file: !111, line: 374, baseType: !150, size: 32, offset: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!151 = !DISubroutineType(types: !152)
!152 = !{!107, !117}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !110, file: !111, line: 377, baseType: !154, size: 32, offset: 96)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 32)
!155 = !DISubroutineType(types: !156)
!156 = !{!107, !117, !157}
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 32)
!158 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !111, line: 122, size: 64, elements: !160)
!160 = !{!161, !163, !164, !165, !166}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !159, file: !111, line: 123, baseType: !162, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !159, file: !111, line: 124, baseType: !133, size: 8, offset: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !159, file: !111, line: 125, baseType: !133, size: 8, offset: 40)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !159, file: !111, line: 126, baseType: !133, size: 8, offset: 48)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !159, file: !111, line: 127, baseType: !133, size: 8, offset: 56)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !110, file: !111, line: 379, baseType: !168, size: 32, offset: 128)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 32)
!169 = !DISubroutineType(types: !170)
!170 = !{!107, !117, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !110, file: !111, line: 384, baseType: !173, size: 32, offset: 160)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 32)
!174 = !DISubroutineType(types: !175)
!175 = !{!107, !117, !176, !107}
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!177 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !133)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !110, file: !111, line: 393, baseType: !179, size: 32, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!180 = !DISubroutineType(types: !181)
!181 = !{!107, !117, !182, !183}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !110, file: !111, line: 402, baseType: !185, size: 32, offset: 224)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 32)
!186 = !DISubroutineType(types: !187)
!187 = !{null, !117}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !110, file: !111, line: 405, baseType: !185, size: 32, offset: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !110, file: !111, line: 408, baseType: !150, size: 32, offset: 288)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !110, file: !111, line: 411, baseType: !185, size: 32, offset: 320)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !110, file: !111, line: 414, baseType: !185, size: 32, offset: 352)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !110, file: !111, line: 417, baseType: !150, size: 32, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !110, file: !111, line: 420, baseType: !150, size: 32, offset: 416)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !110, file: !111, line: 423, baseType: !185, size: 32, offset: 448)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !110, file: !111, line: 426, baseType: !185, size: 32, offset: 480)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !110, file: !111, line: 429, baseType: !150, size: 32, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !110, file: !111, line: 432, baseType: !150, size: 32, offset: 544)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !110, file: !111, line: 435, baseType: !199, size: 32, offset: 576)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{null, !117, !202, !102}
!202 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !111, line: 142, baseType: !203)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!204 = !DISubroutineType(types: !205)
!205 = !{null, !117, !102}
!206 = !{!25, !207, !211, !216, !221}
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "uart_dev", scope: !27, file: !209, line: 21, type: !210, isLocal: true, isDefinition: true)
!209 = !DIFile(filename: "zephyr/samples/drivers/uart/echo_bot/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!210 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "_k_fifo_buf_uart_msgq", scope: !27, file: !209, line: 19, type: !213, isLocal: true, isDefinition: true, align: 32)
!213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 2560, elements: !214)
!214 = !{!215}
!215 = !DISubrange(count: 320)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "rx_buf", scope: !27, file: !209, line: 24, type: !218, isLocal: true, isDefinition: true)
!218 = !DICompositeType(tag: DW_TAG_array_type, baseType: !125, size: 256, elements: !219)
!219 = !{!220}
!220 = !DISubrange(count: 32)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "rx_buf_pos", scope: !27, file: !209, line: 25, type: !107, isLocal: true, isDefinition: true)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_msgq", file: !224, line: 4204, size: 320, elements: !225)
!224 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!225 = !{!226, !247, !251, !254, !255, !257, !258, !259, !260, !261}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !223, file: !224, line: 4206, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !228, line: 233, baseType: !229)
!228 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !228, line: 231, size: 64, elements: !230)
!230 = !{!231}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !229, file: !228, line: 232, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !233, line: 48, baseType: !234)
!233 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !233, line: 37, size: 64, elements: !235)
!235 = !{!236, !242}
!236 = !DIDerivedType(tag: DW_TAG_member, scope: !234, file: !233, line: 38, baseType: !237, size: 32)
!237 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !234, file: !233, line: 38, size: 32, elements: !238)
!238 = !{!239, !241}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !237, file: !233, line: 39, baseType: !240, size: 32)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !237, file: !233, line: 40, baseType: !240, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, scope: !234, file: !233, line: 42, baseType: !243, size: 32, offset: 32)
!243 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !234, file: !233, line: 42, size: 32, elements: !244)
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !243, file: !233, line: 43, baseType: !240, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !243, file: !233, line: 44, baseType: !240, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !223, file: !224, line: 4208, baseType: !248, offset: 64)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!249 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!250 = !{}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "msg_size", scope: !223, file: !224, line: 4210, baseType: !252, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !253, line: 214, baseType: !32)
!253 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!254 = !DIDerivedType(tag: DW_TAG_member, name: "max_msgs", scope: !223, file: !224, line: 4212, baseType: !162, size: 32, offset: 96)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_start", scope: !223, file: !224, line: 4214, baseType: !256, size: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "buffer_end", scope: !223, file: !224, line: 4216, baseType: !256, size: 32, offset: 160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "read_ptr", scope: !223, file: !224, line: 4218, baseType: !256, size: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "write_ptr", scope: !223, file: !224, line: 4220, baseType: !256, size: 32, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "used_msgs", scope: !223, file: !224, line: 4222, baseType: !162, size: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !223, file: !224, line: 4227, baseType: !133, size: 8, offset: 288)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "_char_out", scope: !264, file: !268, line: 54, type: !269, isLocal: false, isDefinition: true)
!264 = distinct !DICompileUnit(language: DW_LANG_C99, file: !265, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !266, globals: !267, splitDebugInlining: false, nameTableKind: None)
!265 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/echo_bot")
!266 = !{!102, !107}
!267 = !{!262}
!268 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DISubroutineType(types: !271)
!271 = !{!107, !107}
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "__init_stm32l1_init", scope: !274, file: !304, line: 60, type: !305, isLocal: true, isDefinition: true, align: 32)
!274 = distinct !DICompileUnit(language: DW_LANG_C99, file: !275, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !276, globals: !303, splitDebugInlining: false, nameTableKind: None)
!275 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/echo_bot")
!276 = !{!277, !297}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !279, line: 386, baseType: !280)
!279 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l151xba.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !279, line: 370, size: 448, elements: !281)
!281 = !{!282, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !280, file: !279, line: 372, baseType: !283, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !162)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !280, file: !279, line: 373, baseType: !283, size: 32, offset: 32)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !280, file: !279, line: 374, baseType: !283, size: 32, offset: 64)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !280, file: !279, line: 375, baseType: !283, size: 32, offset: 96)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !280, file: !279, line: 376, baseType: !283, size: 32, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !280, file: !279, line: 377, baseType: !283, size: 32, offset: 160)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !280, file: !279, line: 378, baseType: !283, size: 32, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !280, file: !279, line: 379, baseType: !283, size: 32, offset: 224)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !280, file: !279, line: 380, baseType: !283, size: 32, offset: 256)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !280, file: !279, line: 381, baseType: !283, size: 32, offset: 288)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !280, file: !279, line: 382, baseType: !283, size: 32, offset: 320)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !280, file: !279, line: 383, baseType: !283, size: 32, offset: 352)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !280, file: !279, line: 384, baseType: !283, size: 32, offset: 384)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !280, file: !279, line: 385, baseType: !283, size: 32, offset: 416)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 32)
!298 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !279, line: 364, baseType: !299)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !279, line: 360, size: 64, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !299, file: !279, line: 362, baseType: !283, size: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !299, file: !279, line: 363, baseType: !283, size: 32, offset: 32)
!303 = !{!272}
!304 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !307, line: 51, size: 64, elements: !308)
!307 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!308 = !{!309, !328}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !306, file: !307, line: 60, baseType: !310, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!311 = !DISubroutineType(types: !312)
!312 = !{!107, !313}
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !314, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !120, line: 378, size: 192, elements: !316)
!316 = !{!317, !318, !319, !320, !326, !327}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !315, file: !120, line: 380, baseType: !123, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !315, file: !120, line: 382, baseType: !13, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !315, file: !120, line: 384, baseType: !13, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !315, file: !120, line: 386, baseType: !321, size: 32, offset: 96)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 32)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !120, line: 351, size: 16, elements: !323)
!323 = !{!324, !325}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !322, file: !120, line: 359, baseType: !133, size: 8)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !322, file: !120, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !315, file: !120, line: 388, baseType: !102, size: 32, offset: 128)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !315, file: !120, line: 396, baseType: !139, size: 32, offset: 160)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !306, file: !307, line: 65, baseType: !313, size: 32, offset: 32)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !331, file: !334, line: 71, type: !335, isLocal: true, isDefinition: true, align: 32)
!331 = distinct !DICompileUnit(language: DW_LANG_C99, file: !332, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !333, splitDebugInlining: false, nameTableKind: None)
!332 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/echo_bot")
!333 = !{!329}
!334 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !336)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !307, line: 51, size: 64, elements: !337)
!337 = !{!338, !357}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !336, file: !307, line: 60, baseType: !339, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 32)
!340 = !DISubroutineType(types: !341)
!341 = !{!107, !342}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !344)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !120, line: 378, size: 192, elements: !345)
!345 = !{!346, !347, !348, !349, !355, !356}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !344, file: !120, line: 380, baseType: !123, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !344, file: !120, line: 382, baseType: !13, size: 32, offset: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !344, file: !120, line: 384, baseType: !13, size: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !344, file: !120, line: 386, baseType: !350, size: 32, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 32)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !120, line: 351, size: 16, elements: !352)
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !351, file: !120, line: 359, baseType: !133, size: 8)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !351, file: !120, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !344, file: !120, line: 388, baseType: !102, size: 32, offset: 128)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !344, file: !120, line: 396, baseType: !139, size: 32, offset: 160)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !336, file: !307, line: 65, baseType: !342, size: 32, offset: 32)
!358 = !DIGlobalVariableExpression(var: !359, expr: !DIExpression())
!359 = distinct !DIGlobalVariable(name: "static_regions", scope: !360, file: !367, line: 62, type: !501, isLocal: true, isDefinition: true)
!360 = distinct !DICompileUnit(language: DW_LANG_C99, file: !361, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !362, globals: !363, splitDebugInlining: false, nameTableKind: None)
!361 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/echo_bot")
!362 = !{!252, !107, !162, !102}
!363 = !{!364, !358}
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !366, file: !367, line: 198, type: !487, isLocal: true, isDefinition: true)
!366 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !367, file: !367, line: 175, type: !368, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !360, retainedNodes: !482)
!367 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!368 = !DISubroutineType(types: !369)
!369 = !{null, !370}
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !371, size: 32)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !372, line: 245, size: 1024, elements: !373)
!372 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!373 = !{!374, !439, !452, !453, !454, !455, !461, !477}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !371, file: !372, line: 247, baseType: !375, size: 384)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !372, line: 57, size: 384, elements: !376)
!376 = !{!377, !404, !411, !412, !413, !426, !427, !428}
!377 = !DIDerivedType(tag: DW_TAG_member, scope: !375, file: !372, line: 60, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !375, file: !372, line: 60, size: 64, elements: !379)
!379 = !{!380, !395}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !378, file: !372, line: 61, baseType: !381, size: 64)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !233, line: 49, baseType: !382)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !233, line: 37, size: 64, elements: !383)
!383 = !{!384, !390}
!384 = !DIDerivedType(tag: DW_TAG_member, scope: !382, file: !233, line: 38, baseType: !385, size: 32)
!385 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !382, file: !233, line: 38, size: 32, elements: !386)
!386 = !{!387, !389}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !385, file: !233, line: 39, baseType: !388, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !385, file: !233, line: 40, baseType: !388, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, scope: !382, file: !233, line: 42, baseType: !391, size: 32, offset: 32)
!391 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !382, file: !233, line: 42, size: 32, elements: !392)
!392 = !{!393, !394}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !391, file: !233, line: 43, baseType: !388, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !391, file: !233, line: 44, baseType: !388, size: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !378, file: !372, line: 62, baseType: !396, size: 64)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !397, line: 49, size: 64, elements: !398)
!397 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !396, file: !397, line: 50, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_array_type, baseType: !401, size: 64, elements: !402)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 32)
!402 = !{!403}
!403 = !DISubrange(count: 2)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !375, file: !372, line: 68, baseType: !405, size: 32, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !228, line: 233, baseType: !407)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !228, line: 231, size: 64, elements: !408)
!408 = !{!409}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !407, file: !228, line: 232, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !233, line: 48, baseType: !382)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !375, file: !372, line: 71, baseType: !133, size: 8, offset: 96)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !375, file: !372, line: 74, baseType: !133, size: 8, offset: 104)
!413 = !DIDerivedType(tag: DW_TAG_member, scope: !375, file: !372, line: 90, baseType: !414, size: 16, offset: 112)
!414 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !375, file: !372, line: 90, size: 16, elements: !415)
!415 = !{!416, !423}
!416 = !DIDerivedType(tag: DW_TAG_member, scope: !414, file: !372, line: 91, baseType: !417, size: 16)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !414, file: !372, line: 91, size: 16, elements: !418)
!418 = !{!419, !422}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !417, file: !372, line: 96, baseType: !420, size: 8)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !421)
!421 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !417, file: !372, line: 97, baseType: !133, size: 8, offset: 8)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !414, file: !372, line: 100, baseType: !424, size: 16)
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !425)
!425 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !375, file: !372, line: 107, baseType: !162, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !375, file: !372, line: 127, baseType: !102, size: 32, offset: 160)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !375, file: !372, line: 131, baseType: !429, size: 192, offset: 192)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !228, line: 244, size: 192, elements: !430)
!430 = !{!431, !432, !438}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !429, file: !228, line: 245, baseType: !381, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !429, file: !228, line: 246, baseType: !433, size: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !228, line: 242, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 32)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !437}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !429, file: !228, line: 249, baseType: !105, size: 64, offset: 128)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !371, file: !372, line: 250, baseType: !440, size: 288, offset: 384)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !441, line: 25, size: 288, elements: !442)
!441 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!442 = !{!443, !444, !445, !446, !447, !448, !449, !450, !451}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !440, file: !441, line: 26, baseType: !162, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !440, file: !441, line: 27, baseType: !162, size: 32, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !440, file: !441, line: 28, baseType: !162, size: 32, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !440, file: !441, line: 29, baseType: !162, size: 32, offset: 96)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !440, file: !441, line: 30, baseType: !162, size: 32, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !440, file: !441, line: 31, baseType: !162, size: 32, offset: 160)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !440, file: !441, line: 32, baseType: !162, size: 32, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !440, file: !441, line: 33, baseType: !162, size: 32, offset: 224)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !440, file: !441, line: 34, baseType: !162, size: 32, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !371, file: !372, line: 253, baseType: !102, size: 32, offset: 672)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !371, file: !372, line: 256, baseType: !406, size: 64, offset: 704)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !371, file: !372, line: 294, baseType: !107, size: 32, offset: 768)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !371, file: !372, line: 300, baseType: !456, size: 96, offset: 800)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !372, line: 149, size: 96, elements: !457)
!457 = !{!458, !459, !460}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !456, file: !372, line: 153, baseType: !22, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !456, file: !372, line: 162, baseType: !252, size: 32, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !456, file: !372, line: 168, baseType: !252, size: 32, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !371, file: !372, line: 325, baseType: !462, size: 32, offset: 896)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 32)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !224, line: 5073, size: 160, elements: !464)
!464 = !{!465, !474, !475}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !463, file: !224, line: 5074, baseType: !466, size: 96)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !467, line: 56, size: 96, elements: !468)
!467 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!468 = !{!469, !472, !473}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !466, file: !467, line: 57, baseType: !470, size: 32)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 32)
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !467, line: 57, flags: DIFlagFwdDecl)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !466, file: !467, line: 58, baseType: !102, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !466, file: !467, line: 59, baseType: !252, size: 32, offset: 64)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !463, file: !224, line: 5075, baseType: !406, size: 64, offset: 96)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !463, file: !224, line: 5076, baseType: !476, offset: 160)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !249, line: 43, elements: !250)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !371, file: !372, line: 343, baseType: !478, size: 64, offset: 928)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !441, line: 60, size: 64, elements: !479)
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !478, file: !441, line: 63, baseType: !162, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !478, file: !441, line: 66, baseType: !162, size: 32, offset: 32)
!482 = !{!483, !484, !485, !486}
!483 = !DILocalVariable(name: "thread", arg: 1, scope: !366, file: !367, line: 175, type: !370)
!484 = !DILocalVariable(name: "region_num", scope: !366, file: !367, line: 200, type: !133)
!485 = !DILocalVariable(name: "guard_start", scope: !366, file: !367, line: 265, type: !22)
!486 = !DILocalVariable(name: "guard_size", scope: !366, file: !367, line: 266, type: !252)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 96, elements: !499)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !489, line: 52, size: 96, elements: !490)
!489 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!490 = !{!491, !492, !493}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !488, file: !489, line: 53, baseType: !22, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !488, file: !489, line: 54, baseType: !252, size: 32, offset: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !488, file: !489, line: 55, baseType: !494, size: 32, offset: 64)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !495, line: 151, baseType: !496)
!495 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !495, line: 149, size: 32, elements: !497)
!497 = !{!498}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !496, file: !495, line: 150, baseType: !162, size: 32)
!499 = !{!500}
!500 = !DISubrange(count: 1)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 96, elements: !499)
!502 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!503 = !DIGlobalVariableExpression(var: !504, expr: !DIExpression())
!504 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !505, file: !538, line: 39, type: !133, isLocal: true, isDefinition: true)
!505 = distinct !DICompileUnit(language: DW_LANG_C99, file: !506, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !507, globals: !537, splitDebugInlining: false, nameTableKind: None)
!506 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/echo_bot")
!507 = !{!508, !102, !107, !525, !133}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !510, line: 1168, baseType: !511)
!510 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !510, line: 1155, size: 352, elements: !512)
!512 = !{!513, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !511, file: !510, line: 1157, baseType: !514, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !283)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !511, file: !510, line: 1158, baseType: !283, size: 32, offset: 32)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !511, file: !510, line: 1159, baseType: !283, size: 32, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !511, file: !510, line: 1160, baseType: !283, size: 32, offset: 96)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !511, file: !510, line: 1161, baseType: !283, size: 32, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !511, file: !510, line: 1162, baseType: !283, size: 32, offset: 160)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !511, file: !510, line: 1163, baseType: !283, size: 32, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !511, file: !510, line: 1164, baseType: !283, size: 32, offset: 224)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !511, file: !510, line: 1165, baseType: !283, size: 32, offset: 256)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !511, file: !510, line: 1166, baseType: !283, size: 32, offset: 288)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !511, file: !510, line: 1167, baseType: !283, size: 32, offset: 320)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !528, line: 27, size: 96, elements: !529)
!528 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!529 = !{!530, !531, !532}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !527, file: !528, line: 29, baseType: !162, size: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !527, file: !528, line: 31, baseType: !123, size: 32, offset: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !527, file: !528, line: 37, baseType: !533, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !495, line: 146, baseType: !534)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !495, line: 141, size: 32, elements: !535)
!535 = !{!536}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !534, file: !495, line: 143, baseType: !162, size: 32)
!537 = !{!503}
!538 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!539 = !DIGlobalVariableExpression(var: !540, expr: !DIExpression())
!540 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !541, file: !548, line: 21, type: !269, isLocal: true, isDefinition: true)
!541 = distinct !DICompileUnit(language: DW_LANG_C99, file: !542, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !543, globals: !547, splitDebugInlining: false, nameTableKind: None)
!542 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/echo_bot")
!543 = !{!544, !107, !102}
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 32)
!545 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !546, line: 22, baseType: !107)
!546 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!547 = !{!539}
!548 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !551, file: !556, line: 13, type: !573, isLocal: true, isDefinition: true)
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !552, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !553, splitDebugInlining: false, nameTableKind: None)
!552 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/echo_bot")
!553 = !{!554, !549}
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "mpu_config", scope: !551, file: !556, line: 37, type: !557, isLocal: false, isDefinition: true)
!556 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !558)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !528, line: 41, size: 64, elements: !559)
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !558, file: !528, line: 43, baseType: !162, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !558, file: !528, line: 45, baseType: !562, size: 32, offset: 32)
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 32)
!563 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !564)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !528, line: 27, size: 96, elements: !565)
!565 = !{!566, !567, !568}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !564, file: !528, line: 29, baseType: !162, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !564, file: !528, line: 31, baseType: !123, size: 32, offset: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !564, file: !528, line: 37, baseType: !569, size: 32, offset: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !495, line: 146, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !495, line: 141, size: 32, elements: !571)
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !570, file: !495, line: 143, baseType: !162, size: 32)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 192, elements: !402)
!574 = !DIGlobalVariableExpression(var: !575, expr: !DIExpression())
!575 = distinct !DIGlobalVariable(name: "__init_rf_init", scope: !576, file: !673, line: 36, type: !674, isLocal: true, isDefinition: true, align: 32)
!576 = distinct !DICompileUnit(language: DW_LANG_C99, file: !577, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !578, retainedTypes: !590, globals: !672, splitDebugInlining: false, nameTableKind: None)
!577 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/echo_bot")
!578 = !{!579, !585}
!579 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !580, line: 506, baseType: !32, size: 32, elements: !581)
!580 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!581 = !{!582, !583, !584}
!582 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!583 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!584 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!585 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !580, line: 512, baseType: !32, size: 32, elements: !586)
!586 = !{!587, !588, !589}
!587 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!588 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!589 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!590 = !{!591, !661, !666, !626, !585, !579, !671, !102}
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !580, line: 523, size: 288, elements: !594)
!594 = !{!595, !616, !622, !627, !631, !632, !633, !637, !657}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !593, file: !580, line: 524, baseType: !596, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 32)
!597 = !DISubroutineType(types: !598)
!598 = !{!107, !599, !614, !615}
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !120, line: 378, size: 192, elements: !602)
!602 = !{!603, !604, !605, !606, !612, !613}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !601, file: !120, line: 380, baseType: !123, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !601, file: !120, line: 382, baseType: !13, size: 32, offset: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !601, file: !120, line: 384, baseType: !13, size: 32, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !601, file: !120, line: 386, baseType: !607, size: 32, offset: 96)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 32)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !120, line: 351, size: 16, elements: !609)
!609 = !{!610, !611}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !608, file: !120, line: 359, baseType: !133, size: 8)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !608, file: !120, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !601, file: !120, line: 388, baseType: !102, size: 32, offset: 128)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !601, file: !120, line: 396, baseType: !139, size: 32, offset: 160)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !580, line: 237, baseType: !133)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !580, line: 257, baseType: !162)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !593, file: !580, line: 530, baseType: !617, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = !DISubroutineType(types: !619)
!619 = !{!107, !599, !620}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !580, line: 229, baseType: !162)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !593, file: !580, line: 532, baseType: !623, size: 32, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 32)
!624 = !DISubroutineType(types: !625)
!625 = !{!107, !599, !626, !621}
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !580, line: 216, baseType: !162)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !593, file: !580, line: 535, baseType: !628, size: 32, offset: 96)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 32)
!629 = !DISubroutineType(types: !630)
!630 = !{!107, !599, !626}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !593, file: !580, line: 537, baseType: !628, size: 32, offset: 128)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !593, file: !580, line: 539, baseType: !628, size: 32, offset: 160)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !593, file: !580, line: 541, baseType: !634, size: 32, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!635 = !DISubroutineType(types: !636)
!636 = !{!107, !599, !614, !579, !585}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !593, file: !580, line: 544, baseType: !638, size: 32, offset: 224)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = !DISubroutineType(types: !640)
!640 = !{!107, !599, !641, !136}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !580, line: 478, size: 96, elements: !643)
!643 = !{!644, !651, !656}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !642, file: !580, line: 482, baseType: !645, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !646, line: 33, baseType: !647)
!646 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !646, line: 29, size: 32, elements: !648)
!648 = !{!649}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !647, file: !646, line: 30, baseType: !650, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !642, file: !580, line: 485, baseType: !652, size: 32, offset: 32)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !580, line: 464, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 32)
!654 = !DISubroutineType(types: !655)
!655 = !{null, !599, !641, !626}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !642, file: !580, line: 493, baseType: !626, size: 32, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !593, file: !580, line: 547, baseType: !658, size: 32, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 32)
!659 = !DISubroutineType(types: !660)
!660 = !{!162, !599}
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !580, line: 428, size: 32, elements: !664)
!664 = !{!665}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !663, file: !580, line: 434, baseType: !626, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !580, line: 441, size: 32, elements: !669)
!669 = !{!670}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !668, file: !580, line: 447, baseType: !626, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 32)
!672 = !{!574}
!673 = !DIFile(filename: "zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!674 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !307, line: 51, size: 64, elements: !676)
!676 = !{!677, !681}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !675, file: !307, line: 60, baseType: !678, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 32)
!679 = !DISubroutineType(types: !680)
!680 = !{!107, !599}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !675, file: !307, line: 65, baseType: !599, size: 32, offset: 32)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !684, file: !756, line: 48, type: !832, isLocal: true, isDefinition: true)
!684 = distinct !DICompileUnit(language: DW_LANG_C99, file: !685, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !686, retainedTypes: !742, globals: !753, splitDebugInlining: false, nameTableKind: None)
!685 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/echo_bot")
!686 = !{!30, !687}
!687 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !279, line: 69, baseType: !107, size: 32, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!689 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!690 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!691 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!692 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!693 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!694 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!695 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!696 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!697 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!698 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!699 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!700 = !DIEnumerator(name: "TAMPER_STAMP_IRQn", value: 2)
!701 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!702 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!703 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!704 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!705 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!706 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!707 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!708 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!709 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!710 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!711 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!712 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!713 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!714 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!715 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!716 = !DIEnumerator(name: "ADC1_IRQn", value: 18)
!717 = !DIEnumerator(name: "USB_HP_IRQn", value: 19)
!718 = !DIEnumerator(name: "USB_LP_IRQn", value: 20)
!719 = !DIEnumerator(name: "DAC_IRQn", value: 21)
!720 = !DIEnumerator(name: "COMP_IRQn", value: 22)
!721 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!722 = !DIEnumerator(name: "TIM9_IRQn", value: 25)
!723 = !DIEnumerator(name: "TIM10_IRQn", value: 26)
!724 = !DIEnumerator(name: "TIM11_IRQn", value: 27)
!725 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!726 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!727 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!728 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!729 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!730 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!731 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!732 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!733 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!734 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!735 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!736 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!737 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!738 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!739 = !DIEnumerator(name: "USB_FS_WKUP_IRQn", value: 42)
!740 = !DIEnumerator(name: "TIM6_IRQn", value: 43)
!741 = !DIEnumerator(name: "TIM7_IRQn", value: 44)
!742 = !{!252, !107, !102, !743}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !279, line: 270, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !279, line: 262, size: 192, elements: !746)
!746 = !{!747, !748, !749, !750, !751, !752}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !745, file: !279, line: 264, baseType: !283, size: 32)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !745, file: !279, line: 265, baseType: !283, size: 32, offset: 32)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !745, file: !279, line: 266, baseType: !283, size: 32, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !745, file: !279, line: 267, baseType: !283, size: 32, offset: 96)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !745, file: !279, line: 268, baseType: !283, size: 32, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !745, file: !279, line: 269, baseType: !283, size: 32, offset: 160)
!753 = !{!754, !760, !776, !787, !804, !682, !806, !820, !822, !824, !826, !828, !830}
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !684, file: !756, line: 424, type: !757, isLocal: false, isDefinition: true, align: 16)
!756 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !758)
!758 = !{!759}
!759 = !DISubrange(count: 4)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "__device_dts_ord_32", scope: !684, file: !756, line: 424, type: !762, isLocal: false, isDefinition: true, align: 32)
!762 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !120, line: 378, size: 192, elements: !764)
!764 = !{!765, !766, !767, !768, !774, !775}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !763, file: !120, line: 380, baseType: !123, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !763, file: !120, line: 382, baseType: !13, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !763, file: !120, line: 384, baseType: !13, size: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !763, file: !120, line: 386, baseType: !769, size: 32, offset: 96)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 32)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !120, line: 351, size: 16, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !770, file: !120, line: 359, baseType: !133, size: 8)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !770, file: !120, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !763, file: !120, line: 388, baseType: !102, size: 32, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !763, file: !120, line: 396, baseType: !139, size: 32, offset: 160)
!776 = !DIGlobalVariableExpression(var: !777, expr: !DIExpression())
!777 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_32", scope: !684, file: !756, line: 424, type: !778, isLocal: true, isDefinition: true, align: 32)
!778 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !307, line: 51, size: 64, elements: !780)
!780 = !{!781, !786}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !779, file: !307, line: 60, baseType: !782, size: 32)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 32)
!783 = !DISubroutineType(types: !784)
!784 = !{!107, !785}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !779, file: !307, line: 65, baseType: !785, size: 32, offset: 32)
!787 = !DIGlobalVariableExpression(var: !788, expr: !DIExpression())
!788 = distinct !DIGlobalVariable(name: "exti_data", scope: !684, file: !756, line: 423, type: !789, isLocal: true, isDefinition: true)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !756, line: 107, size: 1024, elements: !790)
!790 = !{!791}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !789, file: !756, line: 109, baseType: !792, size: 1024)
!792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !793, size: 1024, elements: !802)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !756, line: 101, size: 64, elements: !794)
!794 = !{!795, !801}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !793, file: !756, line: 102, baseType: !796, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !797, line: 63, baseType: !798)
!797 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!799 = !DISubroutineType(types: !800)
!800 = !{null, !107, !102}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !793, file: !756, line: 103, baseType: !102, size: 32, offset: 32)
!802 = !{!803}
!803 = !DISubrange(count: 16)
!804 = !DIGlobalVariableExpression(var: !805, expr: !DIExpression())
!805 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_32", scope: !684, file: !756, line: 424, type: !770, isLocal: true, isDefinition: true, align: 8)
!806 = !DIGlobalVariableExpression(var: !807, expr: !DIExpression())
!807 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !808, file: !756, line: 493, type: !813, isLocal: true, isDefinition: true, align: 32)
!808 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !756, file: !756, line: 460, type: !809, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !684, retainedNodes: !811)
!809 = !DISubroutineType(types: !810)
!810 = !{null, !785}
!811 = !{!812}
!812 = !DILocalVariable(name: "dev", arg: 1, scope: !808, file: !756, line: 460, type: !785)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !814)
!814 = !{!815, !817, !818, !819}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !813, file: !10, line: 55, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !107)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !813, file: !10, line: 57, baseType: !816, size: 32, offset: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !813, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !813, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !808, file: !756, line: 497, type: !813, isLocal: true, isDefinition: true, align: 32)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !808, file: !756, line: 507, type: !813, isLocal: true, isDefinition: true, align: 32)
!824 = !DIGlobalVariableExpression(var: !825, expr: !DIExpression())
!825 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !808, file: !756, line: 512, type: !813, isLocal: true, isDefinition: true, align: 32)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !808, file: !756, line: 516, type: !813, isLocal: true, isDefinition: true, align: 32)
!828 = !DIGlobalVariableExpression(var: !829, expr: !DIExpression())
!829 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !808, file: !756, line: 523, type: !813, isLocal: true, isDefinition: true, align: 32)
!830 = !DIGlobalVariableExpression(var: !831, expr: !DIExpression())
!831 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !808, file: !756, line: 527, type: !813, isLocal: true, isDefinition: true, align: 32)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !833, size: 512, elements: !802)
!833 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !834)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !279, line: 127, baseType: !687)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !837, file: !842, line: 21, type: !862, isLocal: false, isDefinition: true, align: 16)
!837 = distinct !DICompileUnit(language: DW_LANG_C99, file: !838, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !839, splitDebugInlining: false, nameTableKind: None)
!838 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/echo_bot/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/echo_bot")
!839 = !{!840, !835, !846, !848, !850, !852, !854, !856, !858, !860}
!840 = !DIGlobalVariableExpression(var: !841, expr: !DIExpression())
!841 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !837, file: !842, line: 16, type: !843, isLocal: false, isDefinition: true, align: 16)
!842 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/echo_bot")
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 176, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 11)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_17", scope: !837, file: !842, line: 28, type: !757, isLocal: false, isDefinition: true, align: 16)
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !837, file: !842, line: 35, type: !757, isLocal: false, isDefinition: true, align: 16)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_53", scope: !837, file: !842, line: 42, type: !757, isLocal: false, isDefinition: true, align: 16)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_59", scope: !837, file: !842, line: 49, type: !757, isLocal: false, isDefinition: true, align: 16)
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_15", scope: !837, file: !842, line: 56, type: !757, isLocal: false, isDefinition: true, align: 16)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !837, file: !842, line: 63, type: !757, isLocal: false, isDefinition: true, align: 16)
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !837, file: !842, line: 70, type: !757, isLocal: false, isDefinition: true, align: 16)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !837, file: !842, line: 77, type: !757, isLocal: false, isDefinition: true, align: 16)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 48, elements: !863)
!863 = !{!864}
!864 = !DISubrange(count: 3)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !867, file: !911, line: 398, type: !942, isLocal: true, isDefinition: true)
!867 = distinct !DICompileUnit(language: DW_LANG_C99, file: !868, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !869, retainedTypes: !882, globals: !908, splitDebugInlining: false, nameTableKind: None)
!868 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/echo_bot")
!869 = !{!870, !30, !875}
!870 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !871, line: 190, baseType: !32, size: 32, elements: !872)
!871 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l1xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!872 = !{!873, !874}
!873 = !DIEnumerator(name: "SUCCESS", value: 0)
!874 = !DIEnumerator(name: "ERROR", value: 1)
!875 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !876, line: 44, baseType: !32, size: 32, elements: !877)
!876 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!877 = !{!878, !879, !880, !881}
!878 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!879 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!880 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!881 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!882 = !{!102, !107, !162, !883, !901, !907}
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 32)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !279, line: 386, baseType: !885)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !279, line: 370, size: 448, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !885, file: !279, line: 372, baseType: !283, size: 32)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !885, file: !279, line: 373, baseType: !283, size: 32, offset: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !885, file: !279, line: 374, baseType: !283, size: 32, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !885, file: !279, line: 375, baseType: !283, size: 32, offset: 96)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !885, file: !279, line: 376, baseType: !283, size: 32, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !885, file: !279, line: 377, baseType: !283, size: 32, offset: 160)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !885, file: !279, line: 378, baseType: !283, size: 32, offset: 192)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !885, file: !279, line: 379, baseType: !283, size: 32, offset: 224)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !885, file: !279, line: 380, baseType: !283, size: 32, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !885, file: !279, line: 381, baseType: !283, size: 32, offset: 288)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !885, file: !279, line: 382, baseType: !283, size: 32, offset: 320)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !885, file: !279, line: 383, baseType: !283, size: 32, offset: 352)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !885, file: !279, line: 384, baseType: !283, size: 32, offset: 384)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !885, file: !279, line: 385, baseType: !283, size: 32, offset: 416)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !903, line: 343, size: 64, elements: !904)
!903 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !902, file: !903, line: 344, baseType: !162, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !902, file: !903, line: 345, baseType: !162, size: 32, offset: 32)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 32)
!908 = !{!909, !913, !929, !940, !865}
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !867, file: !911, line: 752, type: !912, isLocal: false, isDefinition: true, align: 16)
!911 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 512, elements: !219)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !867, file: !911, line: 752, type: !915, isLocal: false, isDefinition: true, align: 32)
!915 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !120, line: 378, size: 192, elements: !917)
!917 = !{!918, !919, !920, !921, !927, !928}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !916, file: !120, line: 380, baseType: !123, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !916, file: !120, line: 382, baseType: !13, size: 32, offset: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !916, file: !120, line: 384, baseType: !13, size: 32, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !916, file: !120, line: 386, baseType: !922, size: 32, offset: 96)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 32)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !120, line: 351, size: 16, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !923, file: !120, line: 359, baseType: !133, size: 8)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !923, file: !120, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !916, file: !120, line: 388, baseType: !102, size: 32, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !916, file: !120, line: 396, baseType: !139, size: 32, offset: 160)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !867, file: !911, line: 752, type: !931, isLocal: true, isDefinition: true, align: 32)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !307, line: 51, size: 64, elements: !933)
!933 = !{!934, !939}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !932, file: !307, line: 60, baseType: !935, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 32)
!936 = !DISubroutineType(types: !937)
!937 = !{!107, !938}
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !932, file: !307, line: 65, baseType: !938, size: 32, offset: 32)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !867, file: !911, line: 752, type: !923, isLocal: true, isDefinition: true, align: 8)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !876, line: 100, size: 224, elements: !943)
!943 = !{!944, !950, !951, !960, !965, !970, !976}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !942, file: !876, line: 101, baseType: !945, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !876, line: 76, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 32)
!947 = !DISubroutineType(types: !948)
!948 = !{!107, !938, !949}
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !876, line: 56, baseType: !102)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !942, file: !876, line: 102, baseType: !945, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !942, file: !876, line: 103, baseType: !952, size: 32, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !876, line: 83, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 32)
!954 = !DISubroutineType(types: !955)
!955 = !{!107, !938, !949, !956, !102}
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !876, line: 72, baseType: !957)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!958 = !DISubroutineType(types: !959)
!959 = !{null, !938, !949, !102}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !942, file: !876, line: 104, baseType: !961, size: 32, offset: 96)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !876, line: 79, baseType: !962)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!963 = !DISubroutineType(types: !964)
!964 = !{!107, !938, !949, !907}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !942, file: !876, line: 105, baseType: !966, size: 32, offset: 128)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !876, line: 88, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = !DISubroutineType(types: !969)
!969 = !{!875, !938, !949}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !942, file: !876, line: 106, baseType: !971, size: 32, offset: 160)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !876, line: 92, baseType: !972)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = !DISubroutineType(types: !974)
!974 = !{!107, !938, !949, !975}
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !876, line: 64, baseType: !102)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !942, file: !876, line: 107, baseType: !977, size: 32, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !876, line: 96, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = !DISubroutineType(types: !980)
!980 = !{!107, !938, !949, !102}
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !983, file: !1068, line: 603, type: !1070, isLocal: true, isDefinition: true, align: 32)
!983 = distinct !DICompileUnit(language: DW_LANG_C99, file: !984, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !985, globals: !1065, splitDebugInlining: false, nameTableKind: None)
!984 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/96b_wistrio/echo_bot")
!985 = !{!102, !107, !986}
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !111, line: 336, size: 608, elements: !989)
!989 = !{!990, !1009, !1013, !1017, !1030, !1035, !1039, !1043, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !988, file: !111, line: 365, baseType: !991, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 32)
!992 = !DISubroutineType(types: !993)
!993 = !{!107, !994, !144}
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !120, line: 378, size: 192, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1007, !1008}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !996, file: !120, line: 380, baseType: !123, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !996, file: !120, line: 382, baseType: !13, size: 32, offset: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !996, file: !120, line: 384, baseType: !13, size: 32, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !996, file: !120, line: 386, baseType: !1002, size: 32, offset: 96)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 32)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !120, line: 351, size: 16, elements: !1004)
!1004 = !{!1005, !1006}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1003, file: !120, line: 359, baseType: !133, size: 8)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1003, file: !120, line: 364, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !996, file: !120, line: 388, baseType: !102, size: 32, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !996, file: !120, line: 396, baseType: !139, size: 32, offset: 160)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !988, file: !111, line: 366, baseType: !1010, size: 32, offset: 32)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 32)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{null, !994, !134}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !988, file: !111, line: 374, baseType: !1014, size: 32, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 32)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!107, !994}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !988, file: !111, line: 377, baseType: !1018, size: 32, offset: 96)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 32)
!1019 = !DISubroutineType(types: !1020)
!1020 = !{!107, !994, !1021}
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !111, line: 122, size: 64, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !1023, file: !111, line: 123, baseType: !162, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !1023, file: !111, line: 124, baseType: !133, size: 8, offset: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !1023, file: !111, line: 125, baseType: !133, size: 8, offset: 40)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !1023, file: !111, line: 126, baseType: !133, size: 8, offset: 48)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !1023, file: !111, line: 127, baseType: !133, size: 8, offset: 56)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !988, file: !111, line: 379, baseType: !1031, size: 32, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 32)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!107, !994, !1034}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !988, file: !111, line: 384, baseType: !1036, size: 32, offset: 160)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 32)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!107, !994, !176, !107}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !988, file: !111, line: 393, baseType: !1040, size: 32, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 32)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!107, !994, !182, !183}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !988, file: !111, line: 402, baseType: !1044, size: 32, offset: 224)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 32)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{null, !994}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !988, file: !111, line: 405, baseType: !1044, size: 32, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !988, file: !111, line: 408, baseType: !1014, size: 32, offset: 288)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !988, file: !111, line: 411, baseType: !1044, size: 32, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !988, file: !111, line: 414, baseType: !1044, size: 32, offset: 352)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !988, file: !111, line: 417, baseType: !1014, size: 32, offset: 384)
