; ModuleID = './Build/minicli.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct.flash_info_t = type { i8*, i8, i32, i32, i32, i8, i8, i8 }
%struct.log_control_block_t = type { i8*, i32, i32, void (i8*, i8*, i32, i32, i8*, ...)*, void (i8*, i8*, i32, i32, i8*, i32, i8*, ...)* }
%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.hal_gpt_context_t = type { i32, %struct.hal_gpt_callback_context, i8 }
%struct.hal_gpt_callback_context = type { void (i8*)*, i8* }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.cli_s = type { i8, %struct.cmd_s*, i8, i32 ()*, i32 (i32)*, i8 (i8*, i8*)*, [20 x i8*], %struct.cli_history_s }
%struct.cmd_s = type { i8*, i8*, i8 (i8, i8**)*, %struct.cmd_s* }
%struct.cli_history_s = type { i8**, i8*, i8*, i16, i16, i16, i16, i8 }
%struct.DMA_SWCOPYMENU = type { i32, i32 }

!37 = !DIEnumerator(name: "DMA_HWRX", value: 1)
!38 = !DIEnumerator(name: "DMA_SWCOPY", value: 2)
!39 = !DIEnumerator(name: "DMA_HWTX_RINGBUFF", value: 3)
!40 = !DIEnumerator(name: "DMA_HWRX_RINGBUFF", value: 4)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 110, baseType: !7, size: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "DMA_BYTE", value: 0)
!44 = !DIEnumerator(name: "DMA_SHORT", value: 1)
!45 = !DIEnumerator(name: "DMA_LONG", value: 2)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 121, baseType: !7, size: 32, elements: !48)
!47 = !DIFile(filename: "../../../../..//driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!50 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !52, line: 47, baseType: !53, size: 32, elements: !54)
!52 = !DIFile(filename: "../../../../..//driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!55 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!56 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!57 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!58 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!59 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!60 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!61 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!62 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!63 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!64 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!65 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!66 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!67 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!68 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!69 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!70 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!71 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!72 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!73 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!74 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!75 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!76 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!77 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!78 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!79 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!80 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!81 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!82 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!83 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!84 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!85 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!86 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!87 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!88 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!89 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!90 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!91 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!92 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!93 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!94 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!95 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!96 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 129, baseType: !7, size: 32, elements: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!99 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!100 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!101 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!102 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!103 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!104 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!105 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!106 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!107 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!108 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!109 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!110 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!111 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!112 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!113 = !{!114, !115, !117, !139, !146, !152, !163, !172, !161, !173, !174}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !47, line: 116, baseType: !7)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !114)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_FULLSIZE_HWMENU", file: !6, line: 174, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 128, elements: !120)
!120 = !{!121, !133, !135, !138}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !119, file: !6, line: 170, baseType: !122, size: 16)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_TMODE", file: !6, line: 127, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 124, size: 16, elements: !124)
!124 = !{!125, !127}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "burst_mode", scope: !123, file: !6, line: 125, baseType: !126, size: 8)
!126 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !123, file: !6, line: 126, baseType: !128, size: 8, offset: 8)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !129, line: 24, baseType: !130)
!129 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !131, line: 43, baseType: !132)
!131 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!132 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !119, file: !6, line: 171, baseType: !134, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_Master", file: !6, line: 108, baseType: !5)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !119, file: !6, line: 172, baseType: !136, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !129, line: 48, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !131, line: 79, baseType: !7)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !119, file: !6, line: 173, baseType: !136, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_HWMENU", file: !6, line: 158, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 154, size: 96, elements: !142)
!142 = !{!143, !144, !145}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !141, file: !6, line: 155, baseType: !122, size: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !141, file: !6, line: 156, baseType: !134, size: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !141, file: !6, line: 157, baseType: !136, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_SWCOPYMENU", file: !6, line: 179, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 176, size: 64, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "srcaddr", scope: !148, file: !6, line: 177, baseType: !136, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "dstaddr", scope: !148, file: !6, line: 178, baseType: !136, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_FULLSIZE_HWRINGBUFF_MENU", file: !6, line: 167, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 160, size: 192, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !162}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !154, file: !6, line: 161, baseType: !122, size: 16)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !154, file: !6, line: 162, baseType: !134, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !154, file: !6, line: 163, baseType: !136, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !154, file: !6, line: 164, baseType: !136, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "WPPT", scope: !154, file: !6, line: 165, baseType: !161, size: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "WPTO", scope: !154, file: !6, line: 166, baseType: !161, size: 32, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_HWRINGBUFF_MENU", file: !6, line: 152, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 146, size: 160, elements: !166)
!166 = !{!167, !168, !169, !170, !171}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !165, file: !6, line: 147, baseType: !122, size: 16)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !165, file: !6, line: 148, baseType: !134, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !165, file: !6, line: 149, baseType: !136, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "WPPT", scope: !165, file: !6, line: 150, baseType: !161, size: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "WPTO", scope: !165, file: !6, line: 151, baseType: !161, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !52, line: 95, baseType: !51)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint8", file: !47, line: 108, baseType: !132)
!175 = !{!0, !176, !185, !187, !192, !194}
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "DMA_VFIFO_LISR_FUNC", scope: !2, file: !3, line: 60, type: !178, isLocal: false, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 448, elements: !183)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !6, line: 197, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DISubroutineType(types: !182)
!182 = !{null}
!183 = !{!184}
!184 = !DISubrange(count: 14)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "DMA_VFIFO_TO_LISR_FUNC", scope: !2, file: !3, line: 64, type: !178, isLocal: false, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "DMA_Owner", scope: !2, file: !3, line: 71, type: !189, isLocal: false, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 352, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 11)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "DMA_Channel_Status", scope: !2, file: !3, line: 68, type: !114, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "DMA_used_channel", scope: !2, file: !3, line: 69, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 88, elements: !190)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 352, elements: !190)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "NOR_FLASH_BUSY", scope: !200, file: !201, line: 74, type: !126, isLocal: false, isDefinition: true)
!200 = distinct !DICompileUnit(language: DW_LANG_C99, file: !201, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !202, retainedTypes: !246, globals: !251, splitDebugInlining: false, nameTableKind: None)
!201 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/flash_sfc.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!202 = !{!203, !217, !225, !231, !240}
!203 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !204, line: 52, baseType: !53, size: 32, elements: !205)
!204 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/include/spi_flash.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!205 = !{!206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216}
!206 = !DIEnumerator(name: "SF_DRV_NOT_READY", value: -1)
!207 = !DIEnumerator(name: "SF_DRV_READY", value: 0)
!208 = !DIEnumerator(name: "SF_DRV_READING", value: 1)
!209 = !DIEnumerator(name: "SF_DRV_DIRECT_READING", value: 2)
!210 = !DIEnumerator(name: "SF_DRV_PROGRAMMING", value: 3)
!211 = !DIEnumerator(name: "SF_DRV_ERASE_WRITE", value: 4)
!212 = !DIEnumerator(name: "SF_DRV_ERASE_WRITE_CRC", value: 5)
!213 = !DIEnumerator(name: "SF_DRV_SECTOR_4K_ERASING", value: 6)
!214 = !DIEnumerator(name: "SF_DRV_SECTOR_32K_ERASING", value: 7)
!215 = !DIEnumerator(name: "SF_DRV_SECTOR_64K_ERASING", value: 8)
!216 = !DIEnumerator(name: "SF_DRV_CHIP_ERASING", value: 9)
!217 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !218, line: 387, baseType: !53, size: 32, elements: !219)
!218 = !DIFile(filename: "../../../../..//driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!219 = !{!220, !221, !222, !223, !224}
!220 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT_USED", value: -4)
!221 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR", value: -3)
!222 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT", value: -2)
!223 = !DIEnumerator(name: "HAL_GPT_STATUS_INVALID_PARAMETER", value: -1)
!224 = !DIEnumerator(name: "HAL_GPT_STATUS_OK", value: 0)
!225 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !226, line: 666, baseType: !7, size: 32, elements: !227)
!226 = !DIFile(filename: "../../../../..//driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!227 = !{!228, !229, !230}
!228 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_32K", value: 0)
!229 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_1M", value: 1)
!230 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_BUS", value: 2)
!231 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !204, line: 73, baseType: !7, size: 32, elements: !232)
!232 = !{!233, !234, !235, !236, !237, !238, !239}
!233 = !DIEnumerator(name: "SF_TYPE_NONE", value: 0)
!234 = !DIEnumerator(name: "SF_TYPE_MXIC", value: 194)
!235 = !DIEnumerator(name: "SF_TYPE_WINBOND", value: 239)
!236 = !DIEnumerator(name: "SF_TYPE_GD", value: 200)
!237 = !DIEnumerator(name: "SF_TYPE_MICRON", value: 32)
!238 = !DIEnumerator(name: "SF_TYPE_CUSTOMER", value: 255)
!239 = !DIEnumerator(name: "SF_TYPE_COUNT", value: 65535)
!240 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !241, line: 123, baseType: !7, size: 32, elements: !242)
!241 = !DIFile(filename: "../../../../..//driver/chip/inc/hal_flash.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!242 = !{!243, !244, !245}
!243 = !DIEnumerator(name: "HAL_FLASH_BLOCK_4K", value: 0)
!244 = !DIEnumerator(name: "HAL_FLASH_BLOCK_32K", value: 1)
!245 = !DIEnumerator(name: "HAL_FLASH_BLOCK_64K", value: 2)
!246 = !{!161, !247, !249}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !128)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !136)
!251 = !{!252, !198, !255, !257, !259, !261, !263, !265}
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "sf_drvier_status", scope: !200, file: !201, line: 72, type: !254, isLocal: false, isDefinition: true)
!254 = !DIDerivedType(tag: DW_TAG_typedef, name: "SF_DRV_STATE", file: !204, line: 64, baseType: !203)
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "NOR_FLASH_SUSPENDED", scope: !200, file: !201, line: 75, type: !126, isLocal: false, isDefinition: true)
!257 = !DIGlobalVariableExpression(var: !258, expr: !DIExpression())
!258 = distinct !DIGlobalVariable(name: "gucFlashSFCMode", scope: !200, file: !201, line: 77, type: !136, isLocal: false, isDefinition: true)
!259 = !DIGlobalVariableExpression(var: !260, expr: !DIExpression())
!260 = distinct !DIGlobalVariable(name: "suspend_time", scope: !200, file: !201, line: 82, type: !136, isLocal: false, isDefinition: true)
!261 = !DIGlobalVariableExpression(var: !262, expr: !DIExpression())
!262 = distinct !DIGlobalVariable(name: "resume_suspend_on_ready", scope: !200, file: !201, line: 83, type: !136, isLocal: false, isDefinition: true)
!263 = !DIGlobalVariableExpression(var: !264, expr: !DIExpression())
!264 = distinct !DIGlobalVariable(name: "resume_suspend_on_checkready", scope: !200, file: !201, line: 84, type: !136, isLocal: false, isDefinition: true)
!265 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression())
!266 = distinct !DIGlobalVariable(name: "sf_Mutex", scope: !200, file: !201, line: 78, type: !53, isLocal: true, isDefinition: true)
!267 = !DIGlobalVariableExpression(var: !266, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 18446744073709551615, DW_OP_mul, DW_OP_constu, 1, DW_OP_plus, DW_OP_stack_value))
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "g_u4ClkCnt1ms", scope: !270, file: !271, line: 71, type: !288, isLocal: false, isDefinition: true)
!270 = distinct !DICompileUnit(language: DW_LANG_C99, file: !271, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !272, retainedTypes: !273, globals: !274, splitDebugInlining: false, nameTableKind: None)
!271 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!272 = !{!46, !51}
!273 = !{!115, !173}
!274 = !{!268, !275}
!275 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression())
!276 = distinct !DIGlobalVariable(name: "GPTTimer", scope: !270, file: !271, line: 67, type: !277, isLocal: true, isDefinition: true)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPTStruct", file: !278, line: 111, baseType: !279)
!278 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/include/gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 109, size: 96, elements: !280)
!280 = !{!281}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_FUNC", scope: !279, file: !278, line: 110, baseType: !282, size: 96)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_func", file: !278, line: 106, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !278, line: 102, size: 96, elements: !284)
!284 = !{!285, !286, !287}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "gpt0_func", scope: !283, file: !278, line: 103, baseType: !180, size: 32)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "gpt1_func", scope: !283, file: !278, line: 104, baseType: !180, size: 32, offset: 32)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "gpt3_func", scope: !283, file: !278, line: 105, baseType: !180, size: 32, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !289)
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !47, line: 62, baseType: !7)
!290 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!291 = !DIGlobalVariableExpression(var: !276, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "g_sfc_security_enable", scope: !294, file: !295, line: 58, type: !7, isLocal: false, isDefinition: true)
!294 = distinct !DICompileUnit(language: DW_LANG_C99, file: !295, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !296, retainedTypes: !303, globals: !310, splitDebugInlining: false, nameTableKind: None)
!295 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/sfc.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!296 = !{!297}
!297 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !204, line: 45, baseType: !7, size: 32, elements: !298)
!298 = !{!299, !300, !301, !302}
!299 = !DIEnumerator(name: "SF_UNDEF", value: 0)
!300 = !DIEnumerator(name: "SPI", value: 1)
!301 = !DIEnumerator(name: "SPIQ", value: 2)
!302 = !DIEnumerator(name: "QPI", value: 3)
!303 = !{!115, !304, !7, !305, !307, !308}
!304 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !132)
!310 = !{!292}
!311 = !DIGlobalVariableExpression(var: !312, expr: !DIExpression())
!312 = distinct !DIGlobalVariable(name: "gSFC_max_data_size", scope: !313, file: !314, line: 67, type: !7, isLocal: false, isDefinition: true)
!313 = distinct !DICompileUnit(language: DW_LANG_C99, file: !314, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !315, retainedTypes: !322, globals: !341, splitDebugInlining: false, nameTableKind: None)
!314 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/spi_flash.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!315 = !{!231, !203, !297, !316}
!316 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !204, line: 66, baseType: !53, size: 32, elements: !317)
!317 = !{!318, !319, !320, !321}
!318 = !DIEnumerator(name: "FLASH_NOT_READY", value: -1)
!319 = !DIEnumerator(name: "FLASH_READY", value: 0)
!320 = !DIEnumerator(name: "FLASH_PROGRAMMING", value: 1)
!321 = !DIEnumerator(name: "FLASH_ERASING", value: 2)
!322 = !{!323, !325, !326, !7, !161, !340, !136, !114}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !132)
!325 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !328)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chip_info", file: !204, line: 137, size: 192, elements: !329)
!329 = !{!330, !333, !334, !335, !336, !337, !338, !339}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !328, file: !204, line: 138, baseType: !331, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 32)
!332 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !328, file: !204, line: 139, baseType: !132, size: 8, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "jedec_id", scope: !328, file: !204, line: 140, baseType: !325, size: 32, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !328, file: !204, line: 141, baseType: !325, size: 32, offset: 96)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "n_pages", scope: !328, file: !204, line: 142, baseType: !7, size: 32, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "quad_program_cmd", scope: !328, file: !204, line: 144, baseType: !132, size: 8, offset: 160)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "quad_read_cmd", scope: !328, file: !204, line: 145, baseType: !132, size: 8, offset: 168)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "qpi_read_cmd", scope: !328, file: !204, line: 146, baseType: !132, size: 8, offset: 176)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!341 = !{!311, !342, !347, !352, !357, !360, !362, !367, !369, !371, !373, !375, !377, !379, !381, !383, !385, !387, !389, !394, !396, !398, !400, !403}
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_winbond", scope: !313, file: !314, line: 70, type: !344, isLocal: false, isDefinition: true)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 96, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 12)
!347 = !DIGlobalVariableExpression(var: !348, expr: !DIExpression())
!348 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_winbond", scope: !313, file: !314, line: 73, type: !349, isLocal: false, isDefinition: true)
!349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 32, elements: !350)
!350 = !{!351}
!351 = !DISubrange(count: 4)
!352 = !DIGlobalVariableExpression(var: !353, expr: !DIExpression())
!353 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_winbond", scope: !313, file: !314, line: 76, type: !354, isLocal: false, isDefinition: true)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 72, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 9)
!357 = !DIGlobalVariableExpression(var: !358, expr: !DIExpression())
!358 = distinct !DIGlobalVariable(name: "cmdlist_suspend_winbond", scope: !313, file: !314, line: 79, type: !359, isLocal: false, isDefinition: true)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 32, elements: !350)
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "cmdlist_resume_winbond", scope: !313, file: !314, line: 82, type: !359, isLocal: false, isDefinition: true)
!362 = !DIGlobalVariableExpression(var: !363, expr: !DIExpression())
!363 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_mxic", scope: !313, file: !314, line: 87, type: !364, isLocal: false, isDefinition: true)
!364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 64, elements: !365)
!365 = !{!366}
!366 = !DISubrange(count: 8)
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_mxic", scope: !313, file: !314, line: 91, type: !364, isLocal: false, isDefinition: true)
!369 = !DIGlobalVariableExpression(var: !370, expr: !DIExpression())
!370 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_mxic", scope: !313, file: !314, line: 95, type: !364, isLocal: false, isDefinition: true)
!371 = !DIGlobalVariableExpression(var: !372, expr: !DIExpression())
!372 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_gd", scope: !313, file: !314, line: 100, type: !354, isLocal: false, isDefinition: true)
!373 = !DIGlobalVariableExpression(var: !374, expr: !DIExpression())
!374 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_gd", scope: !313, file: !314, line: 104, type: !354, isLocal: false, isDefinition: true)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_gd", scope: !313, file: !314, line: 108, type: !354, isLocal: false, isDefinition: true)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_gd25q32c", scope: !313, file: !314, line: 112, type: !364, isLocal: false, isDefinition: true)
!379 = !DIGlobalVariableExpression(var: !380, expr: !DIExpression())
!380 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_gd25q32c", scope: !313, file: !314, line: 115, type: !364, isLocal: false, isDefinition: true)
!381 = !DIGlobalVariableExpression(var: !382, expr: !DIExpression())
!382 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_gd25q32c", scope: !313, file: !314, line: 119, type: !364, isLocal: false, isDefinition: true)
!383 = !DIGlobalVariableExpression(var: !384, expr: !DIExpression())
!384 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_micron", scope: !313, file: !314, line: 123, type: !364, isLocal: false, isDefinition: true)
!385 = !DIGlobalVariableExpression(var: !386, expr: !DIExpression())
!386 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_micron", scope: !313, file: !314, line: 126, type: !364, isLocal: false, isDefinition: true)
!387 = !DIGlobalVariableExpression(var: !388, expr: !DIExpression())
!388 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_micron", scope: !313, file: !314, line: 130, type: !364, isLocal: false, isDefinition: true)
!389 = !DIGlobalVariableExpression(var: !390, expr: !DIExpression())
!390 = distinct !DIGlobalVariable(name: "cmdlist_flash_reset_spimode", scope: !313, file: !314, line: 135, type: !391, isLocal: false, isDefinition: true)
!391 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 56, elements: !392)
!392 = !{!393}
!393 = !DISubrange(count: 7)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "cmdlist_flash_reset_qpimode", scope: !313, file: !314, line: 138, type: !391, isLocal: false, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "spi_chip_info", scope: !313, file: !314, line: 142, type: !326, isLocal: false, isDefinition: true)
!398 = !DIGlobalVariableExpression(var: !399, expr: !DIExpression())
!399 = distinct !DIGlobalVariable(name: "gd_write_sr2_1", scope: !313, file: !314, line: 161, type: !53, isLocal: false, isDefinition: true)
!400 = !DIGlobalVariableExpression(var: !401, expr: !DIExpression())
!401 = distinct !DIGlobalVariable(name: "support_flash_id", scope: !313, file: !314, line: 162, type: !402, isLocal: false, isDefinition: true)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "SF_TYPT", file: !204, line: 81, baseType: !231)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "chips_data", scope: !313, file: !314, line: 144, type: !405, isLocal: true, isDefinition: true)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 2496, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 13)
!408 = !DIGlobalVariableExpression(var: !409, expr: !DIExpression())
!409 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !410, file: !411, line: 43, type: !136, isLocal: true, isDefinition: true)
!410 = distinct !DICompileUnit(language: DW_LANG_C99, file: !411, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !412, globals: !417, splitDebugInlining: false, nameTableKind: None)
!411 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!412 = !{!305, !289, !249, !413, !414, !416}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32", file: !47, line: 133, baseType: !7)
!417 = !{!408, !418}
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !410, file: !411, line: 44, type: !136, isLocal: true, isDefinition: true)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !422, file: !423, line: 54, type: !136, isLocal: false, isDefinition: true)
!422 = distinct !DICompileUnit(language: DW_LANG_C99, file: !423, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !424, retainedTypes: !431, globals: !439, splitDebugInlining: false, nameTableKind: None)
!423 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!424 = !{!51, !425, !97}
!425 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !426, line: 71, baseType: !7, size: 32, elements: !427)
!426 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!427 = !{!428, !429, !430}
!428 = !DIEnumerator(name: "UART_PORT0", value: 0)
!429 = !DIEnumerator(name: "UART_PORT1", value: 1)
!430 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!431 = !{!305, !136, !432, !434, !436, !437, !289}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !434)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !47, line: 113, baseType: !435)
!435 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !47, line: 59, baseType: !132)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 32)
!438 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !436)
!439 = !{!440, !448, !420}
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler_name", scope: !422, file: !423, line: 57, type: !442, isLocal: false, isDefinition: true)
!442 = !DICompositeType(tag: DW_TAG_array_type, baseType: !443, size: 64, elements: !446)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !332)
!446 = !{!447}
!447 = !DISubrange(count: 2)
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "g_uart_port_to_irq_num", scope: !422, file: !423, line: 58, type: !450, isLocal: false, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 64, elements: !446)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !52, line: 97, baseType: !173)
!453 = !DIGlobalVariableExpression(var: !454, expr: !DIExpression())
!454 = distinct !DIGlobalVariable(name: "log_control_block_hal", scope: !455, file: !456, line: 127, type: !470, isLocal: false, isDefinition: true)
!455 = distinct !DICompileUnit(language: DW_LANG_C99, file: !456, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !457, globals: !469, splitDebugInlining: false, nameTableKind: None)
!456 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/hal_log.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!457 = !{!458, !463}
!458 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !459, line: 65, baseType: !7, size: 32, elements: !460)
!459 = !DIFile(filename: "../../../../..//kernel/service/inc/syslog.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!460 = !{!461, !462}
!461 = !DIEnumerator(name: "DEBUG_LOG_ON", value: 0)
!462 = !DIEnumerator(name: "DEBUG_LOG_OFF", value: 1)
!463 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !459, line: 74, baseType: !7, size: 32, elements: !464)
!464 = !{!465, !466, !467, !468}
!465 = !DIEnumerator(name: "PRINT_LEVEL_DEBUG", value: 0)
!466 = !DIEnumerator(name: "PRINT_LEVEL_INFO", value: 1)
!467 = !DIEnumerator(name: "PRINT_LEVEL_WARNING", value: 2)
!468 = !DIEnumerator(name: "PRINT_LEVEL_ERROR", value: 3)
!469 = !{!453}
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_control_block_t", file: !459, line: 95, baseType: !471)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !459, line: 89, size: 160, elements: !472)
!472 = !{!473, !474, !476, !478, !483}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "module_name", scope: !471, file: !459, line: 90, baseType: !444, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "log_switch", scope: !471, file: !459, line: 91, baseType: !475, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "log_switch_t", file: !459, line: 68, baseType: !458)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "print_level", scope: !471, file: !459, line: 92, baseType: !477, size: 32, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_typedef, name: "print_level_t", file: !459, line: 79, baseType: !463)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "print_handle", scope: !471, file: !459, line: 93, baseType: !479, size: 32, offset: 96)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "f_print_t", file: !459, line: 82, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 32)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !161, !444, !53, !477, !444, null}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "dump_handle", scope: !471, file: !459, line: 94, baseType: !484, size: 32, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "f_dump_buffer_t", file: !459, line: 83, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 32)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !161, !444, !53, !477, !488, !53, !444, null}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !492, file: !493, line: 51, type: !572, isLocal: false, isDefinition: true)
!492 = distinct !DICompileUnit(language: DW_LANG_C99, file: !493, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !494, retainedTypes: !541, globals: !571, splitDebugInlining: false, nameTableKind: None)
!493 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!494 = !{!495, !506, !525, !532}
!495 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !496, line: 163, baseType: !53, size: 32, elements: !497)
!496 = !DIFile(filename: "../../../../..//driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!497 = !{!498, !499, !500, !501, !502, !503, !504, !505}
!498 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!499 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!500 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!501 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!502 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!503 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!504 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!505 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!506 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !496, line: 186, baseType: !7, size: 32, elements: !507)
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524}
!508 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!509 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!510 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!511 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!512 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!513 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!514 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!515 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!516 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!517 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!518 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!519 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!520 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!521 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!522 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!523 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!524 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!525 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !496, line: 176, baseType: !7, size: 32, elements: !526)
!526 = !{!527, !528, !529, !530, !531}
!527 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!528 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!529 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!530 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!531 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!532 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !533, line: 99, baseType: !7, size: 32, elements: !534)
!533 = !DIFile(filename: "../../../../..//driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!534 = !{!535, !536, !537, !538, !539, !540}
!535 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!536 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!537 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!538 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!539 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!540 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!541 = !{!542, !161}
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 32)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !544, line: 72, baseType: !545)
!544 = !DIFile(filename: "../../../../..//driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !544, line: 56, size: 525312, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !561, !562, !566, !570}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !545, file: !544, line: 57, baseType: !250, size: 32)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !545, file: !544, line: 58, baseType: !250, size: 32, offset: 32)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !545, file: !544, line: 59, baseType: !250, size: 32, offset: 64)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !545, file: !544, line: 60, baseType: !250, size: 32, offset: 96)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !545, file: !544, line: 61, baseType: !250, size: 32, offset: 128)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !545, file: !544, line: 62, baseType: !250, size: 32, offset: 160)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !545, file: !544, line: 63, baseType: !250, size: 32, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !545, file: !544, line: 64, baseType: !250, size: 32, offset: 224)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !545, file: !544, line: 65, baseType: !250, size: 32, offset: 256)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !545, file: !544, line: 66, baseType: !250, size: 32, offset: 288)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !545, file: !544, line: 67, baseType: !558, size: 32, offset: 320)
!558 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 32, elements: !559)
!559 = !{!560}
!560 = !DISubrange(count: 1)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !545, file: !544, line: 68, baseType: !250, size: 32, offset: 352)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !545, file: !544, line: 69, baseType: !563, size: 523904, offset: 384)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 523904, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 16372)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !545, file: !544, line: 70, baseType: !567, size: 512, offset: 524288)
!567 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 512, elements: !568)
!568 = !{!569}
!569 = !DISubrange(count: 16)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !545, file: !544, line: 71, baseType: !567, size: 512, offset: 524800)
!571 = !{!490}
!572 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !126)
!573 = !DIGlobalVariableExpression(var: !574, expr: !DIExpression())
!574 = distinct !DIGlobalVariable(name: "g_cache_con", scope: !575, file: !576, line: 48, type: !610, isLocal: false, isDefinition: true)
!575 = distinct !DICompileUnit(language: DW_LANG_C99, file: !576, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !577, splitDebugInlining: false, nameTableKind: None)
!576 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/hal_cache_internal.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!577 = !{!573, !578, !581}
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "g_cache_region_en", scope: !575, file: !576, line: 49, type: !580, isLocal: false, isDefinition: true)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGION_EN_Type", file: !533, line: 66, baseType: !136)
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "g_cache_entry", scope: !575, file: !576, line: 50, type: !583, isLocal: false, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 1024, elements: !568)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_ENTRY_Type", file: !533, line: 90, baseType: !585)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !533, line: 87, size: 64, elements: !586)
!586 = !{!587, !600}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "cache_entry_n", scope: !585, file: !533, line: 88, baseType: !588, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_ENTRY_N_Type", file: !533, line: 77, baseType: !589)
!589 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !533, line: 68, size: 32, elements: !590)
!590 = !{!591, !599}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !589, file: !533, line: 75, baseType: !592, size: 32)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !589, file: !533, line: 69, size: 32, elements: !593)
!593 = !{!594, !595, !596, !597, !598}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !592, file: !533, line: 70, baseType: !136, size: 5, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ATTR", scope: !592, file: !533, line: 71, baseType: !136, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !592, file: !533, line: 72, baseType: !136, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved1", scope: !592, file: !533, line: 73, baseType: !136, size: 3, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "BASEADDR", scope: !592, file: !533, line: 74, baseType: !136, size: 20, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !589, file: !533, line: 76, baseType: !136, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "cache_end_entry_n", scope: !585, file: !533, line: 89, baseType: !601, size: 32, offset: 32)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_END_ENTRY_N_Type", file: !533, line: 85, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !533, line: 79, size: 32, elements: !603)
!603 = !{!604, !609}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !602, file: !533, line: 83, baseType: !605, size: 32)
!605 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !602, file: !533, line: 80, size: 32, elements: !606)
!606 = !{!607, !608}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !605, file: !533, line: 81, baseType: !136, size: 12, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "BASEADDR", scope: !605, file: !533, line: 82, baseType: !136, size: 20, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !602, file: !533, line: 84, baseType: !136, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_CON_Type", file: !533, line: 64, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !533, line: 51, size: 32, elements: !612)
!612 = !{!613, !625}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !611, file: !533, line: 62, baseType: !614, size: 32)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !611, file: !533, line: 52, size: 32, elements: !615)
!615 = !{!616, !617, !618, !619, !620, !621, !622, !623, !624}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "MCEN", scope: !614, file: !533, line: 53, baseType: !136, size: 1, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "MPEN", scope: !614, file: !533, line: 54, baseType: !136, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "CNTEN0", scope: !614, file: !533, line: 55, baseType: !136, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "CNTEN1", scope: !614, file: !533, line: 56, baseType: !136, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "MPDEFEN", scope: !614, file: !533, line: 57, baseType: !136, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved0", scope: !614, file: !533, line: 58, baseType: !136, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "MDRF", scope: !614, file: !533, line: 59, baseType: !136, size: 1, offset: 7, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "CACHESIZE", scope: !614, file: !533, line: 60, baseType: !136, size: 2, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "_reserved1", scope: !614, file: !533, line: 61, baseType: !136, size: 22, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !611, file: !533, line: 63, baseType: !136, size: 32)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !628, file: !629, line: 53, type: !707, isLocal: false, isDefinition: true)
!628 = distinct !DICompileUnit(language: DW_LANG_C99, file: !629, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !630, retainedTypes: !639, globals: !706, splitDebugInlining: false, nameTableKind: None)
!629 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!630 = !{!631, !51}
!631 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !632, line: 152, baseType: !53, size: 32, elements: !633)
!632 = !DIFile(filename: "../../../../..//driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!633 = !{!634, !635, !636, !637, !638}
!634 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!635 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!636 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!637 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!638 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!639 = !{!452, !161, !136, !640, !642, !673}
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !129, line: 44, baseType: !641)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !131, line: 77, baseType: !53)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 32)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !644, line: 378, baseType: !645)
!644 = !DIFile(filename: "../../../../..//driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !644, line: 363, size: 28704, elements: !646)
!646 = !{!647, !649, !653, !654, !655, !656, !657, !658, !659, !660, !664, !668, !672}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !645, file: !644, line: 365, baseType: !648, size: 256)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 256, elements: !365)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !645, file: !644, line: 366, baseType: !650, size: 768, offset: 256)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 768, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 24)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !645, file: !644, line: 367, baseType: !648, size: 256, offset: 1024)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !645, file: !644, line: 368, baseType: !650, size: 768, offset: 1280)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !645, file: !644, line: 369, baseType: !648, size: 256, offset: 2048)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !645, file: !644, line: 370, baseType: !650, size: 768, offset: 2304)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !645, file: !644, line: 371, baseType: !648, size: 256, offset: 3072)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !645, file: !644, line: 372, baseType: !650, size: 768, offset: 3328)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !645, file: !644, line: 373, baseType: !648, size: 256, offset: 4096)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !645, file: !644, line: 374, baseType: !661, size: 1792, offset: 4352)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1792, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 56)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !645, file: !644, line: 375, baseType: !665, size: 1920, offset: 6144)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 1920, elements: !666)
!666 = !{!667}
!667 = !DISubrange(count: 240)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !645, file: !644, line: 376, baseType: !669, size: 20608, offset: 8064)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 20608, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 644)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !645, file: !644, line: 377, baseType: !250, size: 32, offset: 28672)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !644, line: 418, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !644, line: 395, size: 1120, elements: !676)
!676 = !{!677, !679, !680, !681, !682, !683, !684, !686, !687, !688, !689, !690, !691, !692, !693, !695, !696, !697, !699, !703, !705}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !675, file: !644, line: 397, baseType: !678, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !250)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !675, file: !644, line: 398, baseType: !250, size: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !675, file: !644, line: 399, baseType: !250, size: 32, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !675, file: !644, line: 400, baseType: !250, size: 32, offset: 96)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !675, file: !644, line: 401, baseType: !250, size: 32, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !675, file: !644, line: 402, baseType: !250, size: 32, offset: 160)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !675, file: !644, line: 403, baseType: !685, size: 96, offset: 192)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 96, elements: !345)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !675, file: !644, line: 404, baseType: !250, size: 32, offset: 288)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !675, file: !644, line: 405, baseType: !250, size: 32, offset: 320)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !675, file: !644, line: 406, baseType: !250, size: 32, offset: 352)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !675, file: !644, line: 407, baseType: !250, size: 32, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !675, file: !644, line: 408, baseType: !250, size: 32, offset: 416)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !675, file: !644, line: 409, baseType: !250, size: 32, offset: 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !675, file: !644, line: 410, baseType: !250, size: 32, offset: 480)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !675, file: !644, line: 411, baseType: !694, size: 64, offset: 512)
!694 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 64, elements: !446)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !675, file: !644, line: 412, baseType: !678, size: 32, offset: 576)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !675, file: !644, line: 413, baseType: !678, size: 32, offset: 608)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !675, file: !644, line: 414, baseType: !698, size: 128, offset: 640)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 128, elements: !350)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !675, file: !644, line: 415, baseType: !700, size: 160, offset: 768)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 160, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 5)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !675, file: !644, line: 416, baseType: !704, size: 160, offset: 928)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 160, elements: !701)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !675, file: !644, line: 417, baseType: !250, size: 32, offset: 1088)
!706 = !{!626}
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 6144, elements: !716)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !629, line: 50, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !629, line: 47, size: 64, elements: !710)
!710 = !{!711, !715}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !709, file: !629, line: 48, baseType: !712, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!713 = !DISubroutineType(types: !714)
!714 = !{null, !452}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !709, file: !629, line: 49, baseType: !136, size: 32, offset: 32)
!716 = !{!717}
!717 = !DISubrange(count: 96)
!718 = !DIGlobalVariableExpression(var: !719, expr: !DIExpression())
!719 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !720, file: !721, line: 61, type: !740, isLocal: true, isDefinition: true)
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !722, retainedTypes: !738, globals: !739, splitDebugInlining: false, nameTableKind: None)
!721 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!722 = !{!217, !723, !730, !225, !734}
!723 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !226, line: 657, baseType: !7, size: 32, elements: !724)
!724 = !{!725, !726, !727, !728, !729}
!725 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!726 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!727 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!728 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!729 = !DIEnumerator(name: "HAL_GPT_MAX", value: 5)
!730 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !218, line: 397, baseType: !7, size: 32, elements: !731)
!731 = !{!732, !733}
!732 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!733 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!734 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !218, line: 380, baseType: !7, size: 32, elements: !735)
!735 = !{!736, !737}
!736 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!737 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!738 = !{!161, !136}
!739 = !{!718}
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !741, size: 640, elements: !701)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_context_t", file: !721, line: 55, baseType: !742)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !721, line: 51, size: 128, elements: !743)
!743 = !{!744, !746, !756}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !742, file: !721, line: 52, baseType: !745, size: 32)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !218, line: 400, baseType: !730)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !742, file: !721, line: 53, baseType: !747, size: 64, offset: 32)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_context", file: !721, line: 49, baseType: !748)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !721, line: 46, size: 64, elements: !749)
!749 = !{!750, !755}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !748, file: !721, line: 47, baseType: !751, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !218, line: 371, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 32)
!753 = !DISubroutineType(types: !754)
!754 = !{null, !161}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !748, file: !721, line: 48, baseType: !161, size: 32, offset: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "has_initlized", scope: !742, file: !721, line: 54, baseType: !126, size: 8, offset: 96)
!757 = !DIGlobalVariableExpression(var: !758, expr: !DIExpression())
!758 = distinct !DIGlobalVariable(name: "g_uart_frist_send_complete_interrupt", scope: !759, file: !760, line: 80, type: !861, isLocal: true, isDefinition: true)
!759 = distinct !DICompileUnit(language: DW_LANG_C99, file: !760, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !761, retainedTypes: !811, globals: !812, splitDebugInlining: false, nameTableKind: None)
!760 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!761 = !{!425, !762, !770, !775, !791, !797, !801, !97, !806}
!762 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !763, line: 345, baseType: !53, size: 32, elements: !764)
!763 = !DIFile(filename: "../../../../..//driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!764 = !{!765, !766, !767, !768, !769}
!765 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!766 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!767 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!768 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!769 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!770 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !226, line: 109, baseType: !7, size: 32, elements: !771)
!771 = !{!772, !773, !774}
!772 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!773 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!774 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!775 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !763, line: 302, baseType: !7, size: 32, elements: !776)
!776 = !{!777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790}
!777 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!778 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!779 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!780 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!781 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!782 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!783 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!784 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!785 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!786 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!787 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!788 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!789 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!790 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!791 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !763, line: 321, baseType: !7, size: 32, elements: !792)
!792 = !{!793, !794, !795, !796}
!793 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!794 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!795 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!796 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!797 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !763, line: 330, baseType: !7, size: 32, elements: !798)
!798 = !{!799, !800}
!799 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!800 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!801 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !763, line: 337, baseType: !7, size: 32, elements: !802)
!802 = !{!803, !804, !805}
!803 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!804 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!805 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!806 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !763, line: 355, baseType: !53, size: 32, elements: !807)
!807 = !{!808, !809, !810}
!808 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!809 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!810 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!811 = !{!331, !7, !161, !132, !332, !128}
!812 = !{!813, !856, !757, !859, !862}
!813 = !DIGlobalVariableExpression(var: !814, expr: !DIExpression())
!814 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !759, file: !760, line: 77, type: !815, isLocal: true, isDefinition: true)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !816, size: 1024, elements: !446)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !760, line: 75, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !760, line: 68, size: 512, elements: !818)
!818 = !{!819, !820, !832, !833, !844, !845}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !817, file: !760, line: 69, baseType: !126, size: 8)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !817, file: !760, line: 70, baseType: !821, size: 128, offset: 32)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !763, line: 378, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !763, line: 373, size: 128, elements: !823)
!823 = !{!824, !826, !828, !830}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !822, file: !763, line: 374, baseType: !825, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !763, line: 317, baseType: !775)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !822, file: !763, line: 375, baseType: !827, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !763, line: 326, baseType: !791)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !822, file: !763, line: 376, baseType: !829, size: 32, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !763, line: 333, baseType: !797)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !822, file: !763, line: 377, baseType: !831, size: 32, offset: 96)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !763, line: 341, baseType: !801)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !817, file: !760, line: 71, baseType: !126, size: 8, offset: 160)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !817, file: !760, line: 72, baseType: !834, size: 64, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !760, line: 66, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !760, line: 63, size: 64, elements: !836)
!836 = !{!837, !843}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !835, file: !760, line: 64, baseType: !838, size: 32)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !763, line: 410, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 32)
!840 = !DISubroutineType(types: !841)
!841 = !{null, !842, !161}
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !763, line: 359, baseType: !806)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !835, file: !760, line: 65, baseType: !161, size: 32, offset: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !817, file: !760, line: 73, baseType: !126, size: 8, offset: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !817, file: !760, line: 74, baseType: !846, size: 224, offset: 288)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !763, line: 390, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !763, line: 382, size: 224, elements: !848)
!848 = !{!849, !850, !851, !852, !853, !854, !855}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !847, file: !763, line: 383, baseType: !340, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !847, file: !763, line: 384, baseType: !136, size: 32, offset: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !847, file: !763, line: 385, baseType: !136, size: 32, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !847, file: !763, line: 386, baseType: !340, size: 32, offset: 96)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !847, file: !763, line: 387, baseType: !136, size: 32, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !847, file: !763, line: 388, baseType: !136, size: 32, offset: 160)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !847, file: !763, line: 389, baseType: !136, size: 32, offset: 192)
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "g_uart_sleep_handler", scope: !759, file: !760, line: 82, type: !858, isLocal: true, isDefinition: true)
!858 = !DICompositeType(tag: DW_TAG_array_type, baseType: !128, size: 16, elements: !446)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "g_uart_send_lock_status", scope: !759, file: !760, line: 81, type: !861, isLocal: true, isDefinition: true)
!861 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 16, elements: !446)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "func_tbl", scope: !864, file: !760, line: 536, type: !870, isLocal: true, isDefinition: true)
!864 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !760, file: !760, line: 534, type: !865, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !759, retainedNodes: !868)
!865 = !DISubroutineType(types: !866)
!866 = !{!179, !867}
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !226, line: 113, baseType: !770)
!868 = !{!869}
!869 = !DILocalVariable(name: "uart_port", arg: 1, scope: !864, file: !760, line: 534, type: !867)
!870 = !DICompositeType(tag: DW_TAG_array_type, baseType: !871, size: 64, elements: !446)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "DWT_NUMCOMP", scope: !874, file: !875, line: 44, type: !53, isLocal: true, isDefinition: true)
!874 = distinct !DICompileUnit(language: DW_LANG_C99, file: !875, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !876, retainedTypes: !885, globals: !921, splitDebugInlining: false, nameTableKind: None)
!875 = !DIFile(filename: "../../../../..//driver/chip/mt7687/src/hal_dwt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!876 = !{!877}
!877 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !878, line: 42, baseType: !7, size: 32, elements: !879)
!878 = !DIFile(filename: "../../../../..//driver/chip/mt7687/inc/hal_dwt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!879 = !{!880, !881, !882, !883, !884}
!880 = !DIEnumerator(name: "COMP_DISABLE", value: 0)
!881 = !DIEnumerator(name: "WDE_INST", value: 4)
!882 = !DIEnumerator(name: "WDE_DATA_RO", value: 5)
!883 = !DIEnumerator(name: "WDE_DATA_WO", value: 6)
!884 = !DIEnumerator(name: "WDE_DATA_RW", value: 7)
!885 = !{!886, !913}
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "DWT_Type", file: !644, line: 826, baseType: !888)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !644, line: 801, size: 736, elements: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !888, file: !644, line: 803, baseType: !250, size: 32)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "CYCCNT", scope: !888, file: !644, line: 804, baseType: !250, size: 32, offset: 32)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "CPICNT", scope: !888, file: !644, line: 805, baseType: !250, size: 32, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "EXCCNT", scope: !888, file: !644, line: 806, baseType: !250, size: 32, offset: 96)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "SLEEPCNT", scope: !888, file: !644, line: 807, baseType: !250, size: 32, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "LSUCNT", scope: !888, file: !644, line: 808, baseType: !250, size: 32, offset: 160)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "FOLDCNT", scope: !888, file: !644, line: 809, baseType: !250, size: 32, offset: 192)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "PCSR", scope: !888, file: !644, line: 810, baseType: !678, size: 32, offset: 224)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "COMP0", scope: !888, file: !644, line: 811, baseType: !250, size: 32, offset: 256)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "MASK0", scope: !888, file: !644, line: 812, baseType: !250, size: 32, offset: 288)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "FUNCTION0", scope: !888, file: !644, line: 813, baseType: !250, size: 32, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !888, file: !644, line: 814, baseType: !558, size: 32, offset: 352)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "COMP1", scope: !888, file: !644, line: 815, baseType: !250, size: 32, offset: 384)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "MASK1", scope: !888, file: !644, line: 816, baseType: !250, size: 32, offset: 416)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "FUNCTION1", scope: !888, file: !644, line: 817, baseType: !250, size: 32, offset: 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !888, file: !644, line: 818, baseType: !558, size: 32, offset: 480)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "COMP2", scope: !888, file: !644, line: 819, baseType: !250, size: 32, offset: 512)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "MASK2", scope: !888, file: !644, line: 820, baseType: !250, size: 32, offset: 544)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "FUNCTION2", scope: !888, file: !644, line: 821, baseType: !250, size: 32, offset: 576)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !888, file: !644, line: 822, baseType: !558, size: 32, offset: 608)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "COMP3", scope: !888, file: !644, line: 823, baseType: !250, size: 32, offset: 640)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "MASK3", scope: !888, file: !644, line: 824, baseType: !250, size: 32, offset: 672)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "FUNCTION3", scope: !888, file: !644, line: 825, baseType: !250, size: 32, offset: 704)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "CoreDebug_Type", file: !644, line: 1304, baseType: !915)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !644, line: 1298, size: 128, elements: !916)
!916 = !{!917, !918, !919, !920}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "DHCSR", scope: !915, file: !644, line: 1300, baseType: !250, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "DCRSR", scope: !915, file: !644, line: 1301, baseType: !250, size: 32, offset: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "DCRDR", scope: !915, file: !644, line: 1302, baseType: !250, size: 32, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "DEMCR", scope: !915, file: !644, line: 1303, baseType: !250, size: 32, offset: 96)
!921 = !{!872}
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(name: "cmdlist_switchqpi_default", scope: !924, file: !925, line: 164, type: !344, isLocal: false, isDefinition: true)
!924 = distinct !DICompileUnit(language: DW_LANG_C99, file: !925, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !926, globals: !941, splitDebugInlining: false, nameTableKind: None)
!925 = !DIFile(filename: "../../../../..//driver/board/mt76x7_hdk/external_flash/src/bsp_flash_config.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!926 = !{!927, !161}
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !929)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "flash_info_t", file: !930, line: 48, baseType: !931)
!930 = !DIFile(filename: "../../../../..//driver/board/mt76x7_hdk/external_flash/inc/bsp_flash_config.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !930, line: 38, size: 192, elements: !932)
!932 = !{!933, !934, !935, !936, !937, !938, !939, !940}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !931, file: !930, line: 39, baseType: !331, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !931, file: !930, line: 40, baseType: !132, size: 8, offset: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "jedec_id", scope: !931, file: !930, line: 41, baseType: !325, size: 32, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "page_size", scope: !931, file: !930, line: 42, baseType: !325, size: 32, offset: 96)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "n_pages", scope: !931, file: !930, line: 43, baseType: !7, size: 32, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "quad_program_cmd", scope: !931, file: !930, line: 45, baseType: !132, size: 8, offset: 160)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "quad_read_cmd", scope: !931, file: !930, line: 46, baseType: !132, size: 8, offset: 168)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "qpi_read_cmd", scope: !931, file: !930, line: 47, baseType: !132, size: 8, offset: 176)
!941 = !{!922, !942, !944, !946}
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(name: "cmdlist_switchspi_default", scope: !924, file: !925, line: 167, type: !349, isLocal: false, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(name: "cmdlist_switchspiq_default", scope: !924, file: !925, line: 170, type: !354, isLocal: false, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(name: "customer_flash_info", scope: !924, file: !925, line: 174, type: !928, isLocal: false, isDefinition: true)
!948 = !DIGlobalVariableExpression(var: !949, expr: !DIExpression())
!949 = distinct !DIGlobalVariable(name: "_cli_cb", scope: !950, file: !951, line: 92, type: !987, isLocal: true, isDefinition: true)
!950 = distinct !DICompileUnit(language: DW_LANG_C99, file: !951, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !952, globals: !953, splitDebugInlining: false, nameTableKind: None)
!951 = !DIFile(filename: "../../../../..//project/mt7687_hdk/apps/minicli/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!952 = !{!161}
!953 = !{!954, !960, !964, !968, !948, !970}
!954 = !DIGlobalVariableExpression(var: !955, expr: !DIExpression())
!955 = distinct !DIGlobalVariable(name: "s_history_lines", scope: !950, file: !951, line: 64, type: !956, isLocal: true, isDefinition: true)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 20480, elements: !957)
!957 = !{!958, !959}
!958 = !DISubrange(count: 20)
!959 = !DISubrange(count: 128)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(name: "s_history_ptrs", scope: !950, file: !951, line: 65, type: !962, isLocal: true, isDefinition: true)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 640, elements: !963)
!963 = !{!958}
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "s_history_input", scope: !950, file: !951, line: 67, type: !966, isLocal: true, isDefinition: true)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !332, size: 1024, elements: !967)
!967 = !{!959}
!968 = !DIGlobalVariableExpression(var: !969, expr: !DIExpression())
!969 = distinct !DIGlobalVariable(name: "s_history_parse_token", scope: !950, file: !951, line: 68, type: !966, isLocal: true, isDefinition: true)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "_cmds_normal", scope: !950, file: !951, line: 85, type: !972, isLocal: true, isDefinition: true)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !973, size: 256, elements: !446)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "cmd_t", file: !974, line: 299, baseType: !975)
!974 = !DIFile(filename: "../../../../..//middleware/MTK/minicli/inc/cli.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmd_s", file: !974, line: 312, size: 128, elements: !976)
!976 = !{!977, !978, !979, !985}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !975, file: !974, line: 313, baseType: !331, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !975, file: !974, line: 314, baseType: !331, size: 32, offset: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "fptr", scope: !975, file: !974, line: 315, baseType: !980, size: 32, offset: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_cmd_handler_t", file: !974, line: 280, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 32)
!982 = !DISubroutineType(types: !983)
!983 = !{!128, !128, !984}
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !975, file: !974, line: 316, baseType: !986, size: 32, offset: 96)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_t", file: !974, line: 357, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cli_s", file: !974, line: 365, size: 1024, elements: !989)
!989 = !{!990, !991, !992, !993, !998, !1003, !1008, !1009}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !988, file: !974, line: 366, baseType: !128, size: 8)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !988, file: !974, line: 367, baseType: !986, size: 32, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "echo", scope: !988, file: !974, line: 368, baseType: !332, size: 8, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "get", scope: !988, file: !974, line: 369, baseType: !994, size: 32, offset: 96)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "getchar_fptr_t", file: !974, line: 246, baseType: !995)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DISubroutineType(types: !997)
!997 = !{!53}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "put", scope: !988, file: !974, line: 370, baseType: !999, size: 32, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "putchar_fptr_t", file: !974, line: 259, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 32)
!1001 = !DISubroutineType(types: !1002)
!1002 = !{!53, !53}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "knock", scope: !988, file: !974, line: 371, baseType: !1004, size: 32, offset: 160)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "knock_fptr_t", file: !974, line: 268, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 32)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{!128, !331, !331}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "tok", scope: !988, file: !974, line: 372, baseType: !962, size: 640, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !988, file: !974, line: 375, baseType: !1010, size: 192, offset: 832)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "cli_history_t", file: !974, line: 326, baseType: !1011)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cli_history_s", file: !974, line: 334, size: 192, elements: !1012)
!1012 = !{!1013, !1014, !1015, !1016, !1019, !1020, !1021, !1022}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "history", scope: !1011, file: !974, line: 335, baseType: !984, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !1011, file: !974, line: 336, baseType: !331, size: 32, offset: 32)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "parse_token", scope: !1011, file: !974, line: 337, baseType: !331, size: 32, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "history_max", scope: !1011, file: !974, line: 340, baseType: !1017, size: 16, offset: 96)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !129, line: 36, baseType: !1018)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !131, line: 57, baseType: !435)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "line_max", scope: !1011, file: !974, line: 341, baseType: !1017, size: 16, offset: 112)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1011, file: !974, line: 342, baseType: !1017, size: 16, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !1011, file: !974, line: 344, baseType: !1017, size: 16, offset: 144)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "full", scope: !1011, file: !974, line: 346, baseType: !128, size: 8, offset: 160)
!1023 = !DIGlobalVariableExpression(var: !1024, expr: !DIExpression())
!1024 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !1025, file: !1026, line: 61, type: !250, isLocal: true, isDefinition: true)
!1025 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1026, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1027, globals: !1080, splitDebugInlining: false, nameTableKind: None)
!1026 = !DIFile(filename: "../../../../..//project/mt7687_hdk/apps/minicli/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/apps/minicli/GCC")
!1027 = !{!1028, !1036, !1061}
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !644, line: 656, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !644, line: 650, size: 128, elements: !1031)
!1031 = !{!1032, !1033, !1034, !1035}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !1030, file: !644, line: 652, baseType: !250, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !1030, file: !644, line: 653, baseType: !250, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !1030, file: !644, line: 654, baseType: !250, size: 32, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !1030, file: !644, line: 655, baseType: !678, size: 32, offset: 96)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 32)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !644, line: 418, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !644, line: 395, size: 1120, elements: !1039)
!1039 = !{!1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !1038, file: !644, line: 397, baseType: !678, size: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !1038, file: !644, line: 398, baseType: !250, size: 32, offset: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !1038, file: !644, line: 399, baseType: !250, size: 32, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !1038, file: !644, line: 400, baseType: !250, size: 32, offset: 96)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !1038, file: !644, line: 401, baseType: !250, size: 32, offset: 128)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !1038, file: !644, line: 402, baseType: !250, size: 32, offset: 160)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !1038, file: !644, line: 403, baseType: !685, size: 96, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !1038, file: !644, line: 404, baseType: !250, size: 32, offset: 288)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !1038, file: !644, line: 405, baseType: !250, size: 32, offset: 320)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !1038, file: !644, line: 406, baseType: !250, size: 32, offset: 352)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !1038, file: !644, line: 407, baseType: !250, size: 32, offset: 384)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !1038, file: !644, line: 408, baseType: !250, size: 32, offset: 416)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !1038, file: !644, line: 409, baseType: !250, size: 32, offset: 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !1038, file: !644, line: 410, baseType: !250, size: 32, offset: 480)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !1038, file: !644, line: 411, baseType: !694, size: 64, offset: 512)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !1038, file: !644, line: 412, baseType: !678, size: 32, offset: 576)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !1038, file: !644, line: 413, baseType: !678, size: 32, offset: 608)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !1038, file: !644, line: 414, baseType: !698, size: 128, offset: 640)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !1038, file: !644, line: 415, baseType: !700, size: 160, offset: 768)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1038, file: !644, line: 416, baseType: !704, size: 160, offset: 928)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !1038, file: !644, line: 417, baseType: !250, size: 32, offset: 1088)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 32)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !544, line: 72, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !544, line: 56, size: 525312, elements: !1064)
!1064 = !{!1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !1063, file: !544, line: 57, baseType: !250, size: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !1063, file: !544, line: 58, baseType: !250, size: 32, offset: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !1063, file: !544, line: 59, baseType: !250, size: 32, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !1063, file: !544, line: 60, baseType: !250, size: 32, offset: 96)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !1063, file: !544, line: 61, baseType: !250, size: 32, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !1063, file: !544, line: 62, baseType: !250, size: 32, offset: 160)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !1063, file: !544, line: 63, baseType: !250, size: 32, offset: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !1063, file: !544, line: 64, baseType: !250, size: 32, offset: 224)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !1063, file: !544, line: 65, baseType: !250, size: 32, offset: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !1063, file: !544, line: 66, baseType: !250, size: 32, offset: 288)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1063, file: !544, line: 67, baseType: !558, size: 32, offset: 320)
