; ModuleID = './build/adc_get_data_polling.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%struct._ADC_INFO_T = type { %struct._ADC_FSM_PARAM_T, i8 }
%struct._ADC_FSM_PARAM_T = type { i32, i32, i16, i32, i32, i32*, i32, i32 }
%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.hal_gpt_context_t = type { i32, %struct.hal_gpt_callback_context, i8 }
%struct.hal_gpt_callback_context = type { void (i8*)*, i8* }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.DMA_INPUT = type { i32, i32, i32, i8*, void ()* }
%struct.DMA_FULLSIZE_HWMENU = type { %struct.DMA_TMODE, i32, i32, i32 }
%struct.DMA_TMODE = type { i8, i8 }
%struct.DMA_HWMENU = type { %struct.DMA_TMODE, i32, i32 }
%struct.DMA_SWCOPYMENU = type { i32, i32 }
%struct.DMA_FULLSIZE_HWRINGBUFF_MENU = type { %struct.DMA_TMODE, i32, i32, i32, i8*, i8* }
%struct.DMA_HWRINGBUFF_MENU = type { %struct.DMA_TMODE, i32, i32, i8*, i8* }
%struct.__va_list = type { i8* }

!38 = !DIEnumerator(name: "DMA_SWCOPY", value: 2)
!39 = !DIEnumerator(name: "DMA_HWTX_RINGBUFF", value: 3)
!40 = !DIEnumerator(name: "DMA_HWRX_RINGBUFF", value: 4)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 110, baseType: !7, size: 32, elements: !42)
!42 = !{!43, !44, !45}
!43 = !DIEnumerator(name: "DMA_BYTE", value: 0)
!44 = !DIEnumerator(name: "DMA_SHORT", value: 1)
!45 = !DIEnumerator(name: "DMA_LONG", value: 2)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !47, line: 121, baseType: !7, size: 32, elements: !48)
!47 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/type_def.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!48 = !{!49, !50}
!49 = !DIEnumerator(name: "KAL_FALSE", value: 0)
!50 = !DIEnumerator(name: "KAL_TRUE", value: 1)
!51 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "IRQn", file: !52, line: 47, baseType: !53, size: 32, elements: !54)
!52 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!53 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96}
!55 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!56 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!57 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!58 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!59 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!60 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!61 = !DIEnumerator(name: "SVC_IRQn", value: -5)
!62 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!63 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!64 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!65 = !DIEnumerator(name: "CM4_UART1_IRQ", value: 0)
!66 = !DIEnumerator(name: "CM4_DMA_IRQ", value: 1)
!67 = !DIEnumerator(name: "CM4_HIF_IRQ", value: 2)
!68 = !DIEnumerator(name: "CM4_I2C1_IRQ", value: 3)
!69 = !DIEnumerator(name: "CM4_I2C2_IRQ", value: 4)
!70 = !DIEnumerator(name: "CM4_UART2_IRQ", value: 5)
!71 = !DIEnumerator(name: "CM4_MTK_CRYPTO_IRQ", value: 6)
!72 = !DIEnumerator(name: "CM4_SF_IRQ", value: 7)
!73 = !DIEnumerator(name: "CM4_EINT_IRQ", value: 8)
!74 = !DIEnumerator(name: "CM4_BTIF_IRQ", value: 9)
!75 = !DIEnumerator(name: "CM4_WDT_IRQ", value: 10)
!76 = !DIEnumerator(name: "CM4_AHB_MON_IRQ", value: 11)
!77 = !DIEnumerator(name: "CM4_SPI_SLAVE_IRQ", value: 12)
!78 = !DIEnumerator(name: "CM4_N9_WDT_IRQ", value: 13)
!79 = !DIEnumerator(name: "CM4_ADC_IRQ", value: 14)
!80 = !DIEnumerator(name: "CM4_IRDA_TX_IRQ", value: 15)
!81 = !DIEnumerator(name: "CM4_IRDA_RX_IRQ", value: 16)
!82 = !DIEnumerator(name: "CM4_USB_VBUS_ON_IRQ", value: 17)
!83 = !DIEnumerator(name: "CM4_USB_VBUS_OFF_IRQ", value: 18)
!84 = !DIEnumerator(name: "CM4_SPIS_CS_WAKEUP_IRQ", value: 19)
!85 = !DIEnumerator(name: "CM4_GPT3_IRQ", value: 20)
!86 = !DIEnumerator(name: "CM4_IRQ21_IRQ", value: 21)
!87 = !DIEnumerator(name: "CM4_AUDIO_IRQ", value: 22)
!88 = !DIEnumerator(name: "CM4_HIF_DMA_IRQ", value: 23)
!89 = !DIEnumerator(name: "CM4_GPT_IRQ", value: 24)
!90 = !DIEnumerator(name: "CM4_ADC_COMP_IRQ", value: 25)
!91 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!92 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!93 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!94 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!95 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!96 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!97 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 129, baseType: !7, size: 32, elements: !98)
!98 = !{!99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112}
!99 = !DIEnumerator(name: "VDMA_I2S_TX_CH", value: 12)
!100 = !DIEnumerator(name: "VDMA_I2S_RX_CH", value: 13)
!101 = !DIEnumerator(name: "VDMA_UART1TX_CH", value: 14)
!102 = !DIEnumerator(name: "VDMA_UART1RX_CH", value: 15)
!103 = !DIEnumerator(name: "VDMA_UART2TX_CH", value: 16)
!104 = !DIEnumerator(name: "VDMA_UART2RX_CH", value: 17)
!105 = !DIEnumerator(name: "VDMA_BTIF_TX_CH", value: 18)
!106 = !DIEnumerator(name: "VDMA_BTIF_RX_CH", value: 19)
!107 = !DIEnumerator(name: "VDMA_USB_EP2O_CH", value: 20)
!108 = !DIEnumerator(name: "VDMA_USB_EP3I_CH", value: 21)
!109 = !DIEnumerator(name: "VDMA_USB_EP3O_CH", value: 22)
!110 = !DIEnumerator(name: "VDMA_USB_EP4I_CH", value: 23)
!111 = !DIEnumerator(name: "VDMA_USB_EP4O_CH", value: 24)
!112 = !DIEnumerator(name: "VDMA_ADC_RX_CH", value: 25)
!113 = !{!114, !115, !117, !139, !146, !152, !163, !172, !161, !173, !174}
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !47, line: 116, baseType: !7)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 32)
!116 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !114)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_FULLSIZE_HWMENU", file: !6, line: 174, baseType: !119)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 169, size: 128, elements: !120)
!120 = !{!121, !133, !135, !138}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !119, file: !6, line: 170, baseType: !122, size: 16)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_TMODE", file: !6, line: 127, baseType: !123)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 124, size: 16, elements: !124)
!124 = !{!125, !127}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "burst_mode", scope: !123, file: !6, line: 125, baseType: !126, size: 8)
!126 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "cycle", scope: !123, file: !6, line: 126, baseType: !128, size: 8, offset: 8)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !129, line: 24, baseType: !130)
!129 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_stdint.h", directory: "/home/mjshen/RTOSExploration")
!130 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !131, line: 43, baseType: !132)
!131 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/machine/_default_types.h", directory: "/home/mjshen/RTOSExploration")
!132 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !119, file: !6, line: 171, baseType: !134, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_Master", file: !6, line: 108, baseType: !5)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !119, file: !6, line: 172, baseType: !136, size: 32, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !129, line: 48, baseType: !137)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !131, line: 79, baseType: !7)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !119, file: !6, line: 173, baseType: !136, size: 32, offset: 96)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_HWMENU", file: !6, line: 158, baseType: !141)
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 154, size: 96, elements: !142)
!142 = !{!143, !144, !145}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !141, file: !6, line: 155, baseType: !122, size: 16)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !141, file: !6, line: 156, baseType: !134, size: 32, offset: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !141, file: !6, line: 157, baseType: !136, size: 32, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_SWCOPYMENU", file: !6, line: 179, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 176, size: 64, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "srcaddr", scope: !148, file: !6, line: 177, baseType: !136, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "dstaddr", scope: !148, file: !6, line: 178, baseType: !136, size: 32, offset: 32)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_FULLSIZE_HWRINGBUFF_MENU", file: !6, line: 167, baseType: !154)
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 160, size: 192, elements: !155)
!155 = !{!156, !157, !158, !159, !160, !162}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !154, file: !6, line: 161, baseType: !122, size: 16)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !154, file: !6, line: 162, baseType: !134, size: 32, offset: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !154, file: !6, line: 163, baseType: !136, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "destination", scope: !154, file: !6, line: 164, baseType: !136, size: 32, offset: 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "WPPT", scope: !154, file: !6, line: 165, baseType: !161, size: 32, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "WPTO", scope: !154, file: !6, line: 166, baseType: !161, size: 32, offset: 160)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 32)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "DMA_HWRINGBUFF_MENU", file: !6, line: 152, baseType: !165)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 146, size: 160, elements: !166)
!166 = !{!167, !168, !169, !170, !171}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "TMOD", scope: !165, file: !6, line: 147, baseType: !122, size: 16)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "master", scope: !165, file: !6, line: 148, baseType: !134, size: 32, offset: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "addr", scope: !165, file: !6, line: 149, baseType: !136, size: 32, offset: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "WPPT", scope: !165, file: !6, line: 150, baseType: !161, size: 32, offset: 96)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "WPTO", scope: !165, file: !6, line: 151, baseType: !161, size: 32, offset: 128)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 32)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !52, line: 95, baseType: !51)
!174 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint8", file: !47, line: 108, baseType: !132)
!175 = !{!0, !176, !185, !187, !192, !194}
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "DMA_VFIFO_LISR_FUNC", scope: !2, file: !3, line: 60, type: !178, isLocal: false, isDefinition: true)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 448, elements: !183)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !6, line: 197, baseType: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = !DISubroutineType(types: !182)
!182 = !{null}
!183 = !{!184}
!184 = !DISubrange(count: 14)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "DMA_VFIFO_TO_LISR_FUNC", scope: !2, file: !3, line: 64, type: !178, isLocal: false, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "DMA_Owner", scope: !2, file: !3, line: 71, type: !189, isLocal: false, isDefinition: true)
!189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 352, elements: !190)
!190 = !{!191}
!191 = !DISubrange(count: 11)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "DMA_Channel_Status", scope: !2, file: !3, line: 68, type: !114, isLocal: true, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "DMA_used_channel", scope: !2, file: !3, line: 69, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !126, size: 88, elements: !190)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !179, size: 352, elements: !190)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "g_u4ClkCnt1ms", scope: !200, file: !201, line: 71, type: !218, isLocal: false, isDefinition: true)
!200 = distinct !DICompileUnit(language: DW_LANG_C99, file: !201, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !202, retainedTypes: !203, globals: !204, splitDebugInlining: false, nameTableKind: None)
!201 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!202 = !{!46, !51}
!203 = !{!115, !173}
!204 = !{!198, !205}
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "GPTTimer", scope: !200, file: !201, line: 67, type: !207, isLocal: true, isDefinition: true)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPTStruct", file: !208, line: 111, baseType: !209)
!208 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !208, line: 109, size: 96, elements: !210)
!210 = !{!211}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "GPT_FUNC", scope: !209, file: !208, line: 110, baseType: !212, size: 96)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpt_func", file: !208, line: 106, baseType: !213)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !208, line: 102, size: 96, elements: !214)
!214 = !{!215, !216, !217}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "gpt0_func", scope: !213, file: !208, line: 103, baseType: !180, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "gpt1_func", scope: !213, file: !208, line: 104, baseType: !180, size: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "gpt3_func", scope: !213, file: !208, line: 105, baseType: !180, size: 32, offset: 64)
!218 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !219)
!219 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT32", file: !47, line: 62, baseType: !7)
!220 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!221 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "gXtalFreq", scope: !224, file: !225, line: 43, type: !136, isLocal: true, isDefinition: true)
!224 = distinct !DICompileUnit(language: DW_LANG_C99, file: !225, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !226, globals: !232, splitDebugInlining: false, nameTableKind: None)
!225 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/top.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!226 = !{!227, !219, !229, !231}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 32)
!230 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !136)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!232 = !{!222, !233}
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "gCpuFrequency", scope: !224, file: !225, line: 44, type: !136, isLocal: true, isDefinition: true)
!235 = !DIGlobalVariableExpression(var: !236, expr: !DIExpression())
!236 = distinct !DIGlobalVariable(name: "gUartClkFreq", scope: !237, file: !238, line: 54, type: !136, isLocal: false, isDefinition: true)
!237 = distinct !DICompileUnit(language: DW_LANG_C99, file: !238, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !239, retainedTypes: !246, globals: !254, splitDebugInlining: false, nameTableKind: None)
!238 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!239 = !{!240, !97}
!240 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !241, line: 71, baseType: !7, size: 32, elements: !242)
!241 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!242 = !{!243, !244, !245}
!243 = !DIEnumerator(name: "UART_PORT0", value: 0)
!244 = !DIEnumerator(name: "UART_PORT1", value: 1)
!245 = !DIEnumerator(name: "UART_MAX_PORT", value: 2)
!246 = !{!227, !136, !247, !249, !251, !252, !219}
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 32)
!248 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !249)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint16", file: !47, line: 113, baseType: !250)
!250 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT8", file: !47, line: 59, baseType: !132)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !251)
!254 = !{!235}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "g_adc_status", scope: !257, file: !258, line: 252, type: !338, isLocal: false, isDefinition: true)
!257 = distinct !DICompileUnit(language: DW_LANG_C99, file: !258, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !259, retainedTypes: !306, globals: !313, splitDebugInlining: false, nameTableKind: None)
!258 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_adc.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!259 = !{!260, !267, !275, !280, !289, !293, !298, !51, !97}
!260 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !261, line: 53, baseType: !7, size: 32, elements: !262)
!261 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_efuse.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!262 = !{!263, !264, !265, !266}
!263 = !DIEnumerator(name: "HAL_EFUSE_OK", value: 0)
!264 = !DIEnumerator(name: "HAL_EFUSE_INVALID_PARAMETER", value: 1)
!265 = !DIEnumerator(name: "HAL_EFUSE_INVALID_MAGIC", value: 2)
!266 = !DIEnumerator(name: "HAL_EFUSE_INVALID_ACCESS", value: 3)
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !268, line: 163, baseType: !53, size: 32, elements: !269)
!268 = !DIFile(filename: "../../../../../driver/chip/inc/hal_adc.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!269 = !{!270, !271, !272, !273, !274}
!270 = !DIEnumerator(name: "HAL_ADC_STATUS_INVALID_PARAMETER", value: -4)
!271 = !DIEnumerator(name: "HAL_ADC_STATUS_ERROR_BUSY", value: -3)
!272 = !DIEnumerator(name: "HAL_ADC_STATUS_ERROR_CHANNEL", value: -2)
!273 = !DIEnumerator(name: "HAL_ADC_STATUS_ERROR", value: -1)
!274 = !DIEnumerator(name: "HAL_ADC_STATUS_OK", value: 0)
!275 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !276, line: 429, baseType: !7, size: 32, elements: !277)
!276 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/low_hal_adc.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!277 = !{!278, !279}
!278 = !DIEnumerator(name: "ADC_PMODE_ONE_TIME", value: 0)
!279 = !DIEnumerator(name: "ADC_PMODE_PERIODIC", value: 1)
!280 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !276, line: 434, baseType: !7, size: 32, elements: !281)
!281 = !{!282, !283, !284, !285, !286, !287, !288}
!282 = !DIEnumerator(name: "ADC_AVG_1_SAMPLE", value: 0)
!283 = !DIEnumerator(name: "ADC_AVG_2_SAMPLE", value: 1)
!284 = !DIEnumerator(name: "ADC_AVG_4_SAMPLE", value: 2)
!285 = !DIEnumerator(name: "ADC_AVG_8_SAMPLE", value: 3)
!286 = !DIEnumerator(name: "ADC_AVG_16_SAMPLE", value: 4)
!287 = !DIEnumerator(name: "ADC_AVG_32_SAMPLE", value: 5)
!288 = !DIEnumerator(name: "ADC_AVG_64_SAMPLE", value: 6)
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !276, line: 444, baseType: !7, size: 32, elements: !290)
!290 = !{!291, !292}
!291 = !DIEnumerator(name: "ADC_FIFO_DIRECT", value: 0)
!292 = !DIEnumerator(name: "ADC_FIFO_DMA", value: 1)
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ENUM_HAL_RET_T", file: !294, line: 365, baseType: !132, size: 8, elements: !295)
!294 = !DIFile(filename: "../../../../../driver/CMSIS/Device/MTK/mt7687/Include/mt7687_cm4_hw_memmap.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!295 = !{!296, !297}
!296 = !DIEnumerator(name: "HAL_RET_SUCCESS", value: 0)
!297 = !DIEnumerator(name: "HAL_RET_FAIL", value: 1)
!298 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !299, line: 308, baseType: !7, size: 32, elements: !300)
!299 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!300 = !{!301, !302, !303, !304, !305}
!301 = !DIEnumerator(name: "HAL_ADC_CHANNEL_0", value: 0)
!302 = !DIEnumerator(name: "HAL_ADC_CHANNEL_1", value: 1)
!303 = !DIEnumerator(name: "HAL_ADC_CHANNEL_2", value: 2)
!304 = !DIEnumerator(name: "HAL_ADC_CHANNEL_3", value: 3)
!305 = !DIEnumerator(name: "HAL_ADC_CHANNEL_MAX", value: 4)
!306 = !{!307, !309, !311, !219, !115, !312, !161, !173, !247, !231}
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !129, line: 36, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !131, line: 57, baseType: !250)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_typedef, name: "u_int32", file: !47, line: 133, baseType: !7)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 32)
!313 = !{!255, !314, !336, !339}
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "g_rAdcInfo", scope: !257, file: !258, line: 251, type: !316, isLocal: false, isDefinition: true)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "ADC_INFO_T", file: !276, line: 466, baseType: !317)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ADC_INFO_T", file: !276, line: 460, size: 288, elements: !318)
!318 = !{!319, !335}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "rFsmParam", scope: !317, file: !276, line: 461, baseType: !320, size: 256)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "ADC_FSM_PARAM_T", file: !276, line: 458, baseType: !321)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_ADC_FSM_PARAM_T", file: !276, line: 449, size: 256, elements: !322)
!322 = !{!323, !325, !327, !329, !330, !332, !333, !334}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "ePmode", scope: !321, file: !276, line: 450, baseType: !324, size: 32)
!324 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_Adc_Pmode", file: !276, line: 432, baseType: !275)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "eAvg_Mode", scope: !321, file: !276, line: 451, baseType: !326, size: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_Adc_Avg_Mode", file: !276, line: 442, baseType: !280)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "u2Channel_Map", scope: !321, file: !276, line: 452, baseType: !328, size: 16, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !47, line: 60, baseType: !250)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "u4Period", scope: !321, file: !276, line: 453, baseType: !219, size: 32, offset: 96)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "eFifo_Mode", scope: !321, file: !276, line: 454, baseType: !331, size: 32, offset: 128)
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "t_Adc_Fifo_Mode", file: !276, line: 447, baseType: !289)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pru4DmaVfifoAddr", scope: !321, file: !276, line: 455, baseType: !312, size: 32, offset: 160)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "u4DmaVfifoLen", scope: !321, file: !276, line: 456, baseType: !219, size: 32, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "u4DmaVfifoTriggerLevel", scope: !321, file: !276, line: 457, baseType: !219, size: 32, offset: 224)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "u1ChnlNum", scope: !317, file: !276, line: 462, baseType: !251, size: 8, offset: 256)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "g_adc_efuse_offset", scope: !257, file: !258, line: 254, type: !338, isLocal: false, isDefinition: true)
!338 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !128)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "g_adc_efuse_gain", scope: !257, file: !258, line: 255, type: !338, isLocal: false, isDefinition: true)
!341 = !DIGlobalVariableExpression(var: !342, expr: !DIExpression())
!342 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !343, file: !344, line: 51, type: !423, isLocal: false, isDefinition: true)
!343 = distinct !DICompileUnit(language: DW_LANG_C99, file: !344, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !345, retainedTypes: !392, globals: !422, splitDebugInlining: false, nameTableKind: None)
!344 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!345 = !{!346, !357, !376, !383}
!346 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !347, line: 163, baseType: !53, size: 32, elements: !348)
!347 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!348 = !{!349, !350, !351, !352, !353, !354, !355, !356}
!349 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!350 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!351 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!352 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!353 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!354 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!355 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!356 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!357 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !347, line: 186, baseType: !7, size: 32, elements: !358)
!358 = !{!359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375}
!359 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!360 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!361 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!362 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!363 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!364 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!365 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!366 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!367 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!368 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!369 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!370 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!371 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!372 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!373 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!374 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!375 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!376 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !347, line: 176, baseType: !7, size: 32, elements: !377)
!377 = !{!378, !379, !380, !381, !382}
!378 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!379 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!380 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!381 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!382 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!383 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !384, line: 99, baseType: !7, size: 32, elements: !385)
!384 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!385 = !{!386, !387, !388, !389, !390, !391}
!386 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!387 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!388 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!389 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!390 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!391 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!392 = !{!393, !161}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !395, line: 72, baseType: !396)
!395 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !395, line: 56, size: 525312, elements: !397)
!397 = !{!398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !412, !413, !417, !421}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !396, file: !395, line: 57, baseType: !230, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !396, file: !395, line: 58, baseType: !230, size: 32, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !396, file: !395, line: 59, baseType: !230, size: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !396, file: !395, line: 60, baseType: !230, size: 32, offset: 96)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !396, file: !395, line: 61, baseType: !230, size: 32, offset: 128)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !396, file: !395, line: 62, baseType: !230, size: 32, offset: 160)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !396, file: !395, line: 63, baseType: !230, size: 32, offset: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !396, file: !395, line: 64, baseType: !230, size: 32, offset: 224)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !396, file: !395, line: 65, baseType: !230, size: 32, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !396, file: !395, line: 66, baseType: !230, size: 32, offset: 288)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !396, file: !395, line: 67, baseType: !409, size: 32, offset: 320)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 32, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 1)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !396, file: !395, line: 68, baseType: !230, size: 32, offset: 352)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !396, file: !395, line: 69, baseType: !414, size: 523904, offset: 384)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 523904, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 16372)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !396, file: !395, line: 70, baseType: !418, size: 512, offset: 524288)
!418 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 512, elements: !419)
!419 = !{!420}
!420 = !DISubrange(count: 16)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !396, file: !395, line: 71, baseType: !418, size: 512, offset: 524800)
!422 = !{!341}
!423 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !126)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !426, file: !427, line: 53, type: !514, isLocal: false, isDefinition: true)
!426 = distinct !DICompileUnit(language: DW_LANG_C99, file: !427, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !428, retainedTypes: !437, globals: !513, splitDebugInlining: false, nameTableKind: None)
!427 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!428 = !{!429, !51}
!429 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !430, line: 152, baseType: !53, size: 32, elements: !431)
!430 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!431 = !{!432, !433, !434, !435, !436}
!432 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!433 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!434 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!435 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!436 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!437 = !{!438, !161, !136, !439, !441, !474}
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !52, line: 97, baseType: !173)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !129, line: 44, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !131, line: 77, baseType: !53)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !443, line: 378, baseType: !444)
!443 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !443, line: 363, size: 28704, elements: !445)
!445 = !{!446, !450, !454, !455, !456, !457, !458, !459, !460, !461, !465, !469, !473}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !444, file: !443, line: 365, baseType: !447, size: 256)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !230, size: 256, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 8)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !444, file: !443, line: 366, baseType: !451, size: 768, offset: 256)
!451 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 768, elements: !452)
!452 = !{!453}
!453 = !DISubrange(count: 24)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !444, file: !443, line: 367, baseType: !447, size: 256, offset: 1024)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !444, file: !443, line: 368, baseType: !451, size: 768, offset: 1280)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !444, file: !443, line: 369, baseType: !447, size: 256, offset: 2048)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !444, file: !443, line: 370, baseType: !451, size: 768, offset: 2304)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !444, file: !443, line: 371, baseType: !447, size: 256, offset: 3072)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !444, file: !443, line: 372, baseType: !451, size: 768, offset: 3328)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !444, file: !443, line: 373, baseType: !447, size: 256, offset: 4096)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !444, file: !443, line: 374, baseType: !462, size: 1792, offset: 4352)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 1792, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 56)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !444, file: !443, line: 375, baseType: !466, size: 1920, offset: 6144)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 1920, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 240)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !444, file: !443, line: 376, baseType: !470, size: 20608, offset: 8064)
!470 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 20608, elements: !471)
!471 = !{!472}
!472 = !DISubrange(count: 644)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !444, file: !443, line: 377, baseType: !230, size: 32, offset: 28672)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !443, line: 418, baseType: !476)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !443, line: 395, size: 1120, elements: !477)
!477 = !{!478, !480, !481, !482, !483, !484, !485, !489, !490, !491, !492, !493, !494, !495, !496, !500, !501, !502, !506, !510, !512}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !476, file: !443, line: 397, baseType: !479, size: 32)
!479 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !230)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !476, file: !443, line: 398, baseType: !230, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !476, file: !443, line: 399, baseType: !230, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !476, file: !443, line: 400, baseType: !230, size: 32, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !476, file: !443, line: 401, baseType: !230, size: 32, offset: 128)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !476, file: !443, line: 402, baseType: !230, size: 32, offset: 160)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !476, file: !443, line: 403, baseType: !486, size: 96, offset: 192)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !338, size: 96, elements: !487)
!487 = !{!488}
!488 = !DISubrange(count: 12)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !476, file: !443, line: 404, baseType: !230, size: 32, offset: 288)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !476, file: !443, line: 405, baseType: !230, size: 32, offset: 320)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !476, file: !443, line: 406, baseType: !230, size: 32, offset: 352)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !476, file: !443, line: 407, baseType: !230, size: 32, offset: 384)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !476, file: !443, line: 408, baseType: !230, size: 32, offset: 416)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !476, file: !443, line: 409, baseType: !230, size: 32, offset: 448)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !476, file: !443, line: 410, baseType: !230, size: 32, offset: 480)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !476, file: !443, line: 411, baseType: !497, size: 64, offset: 512)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 64, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 2)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !476, file: !443, line: 412, baseType: !479, size: 32, offset: 576)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !476, file: !443, line: 413, baseType: !479, size: 32, offset: 608)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !476, file: !443, line: 414, baseType: !503, size: 128, offset: 640)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 128, elements: !504)
!504 = !{!505}
!505 = !DISubrange(count: 4)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !476, file: !443, line: 415, baseType: !507, size: 160, offset: 768)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 160, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 5)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !476, file: !443, line: 416, baseType: !511, size: 160, offset: 928)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 160, elements: !508)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !476, file: !443, line: 417, baseType: !230, size: 32, offset: 1088)
!513 = !{!424}
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 6144, elements: !523)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !427, line: 50, baseType: !516)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !427, line: 47, size: 64, elements: !517)
!517 = !{!518, !522}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !516, file: !427, line: 48, baseType: !519, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 32)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !438}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !516, file: !427, line: 49, baseType: !136, size: 32, offset: 32)
!523 = !{!524}
!524 = !DISubrange(count: 96)
!525 = !DIGlobalVariableExpression(var: !526, expr: !DIExpression())
!526 = distinct !DIGlobalVariable(name: "g_gpt_context", scope: !527, file: !528, line: 61, type: !560, isLocal: true, isDefinition: true)
!527 = distinct !DICompileUnit(language: DW_LANG_C99, file: !528, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !529, retainedTypes: !558, globals: !559, splitDebugInlining: false, nameTableKind: None)
!528 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpt.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!529 = !{!530, !538, !545, !549, !554}
!530 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !531, line: 387, baseType: !53, size: 32, elements: !532)
!531 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpt.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!532 = !{!533, !534, !535, !536, !537}
!533 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT_USED", value: -4)
!534 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR", value: -3)
!535 = !DIEnumerator(name: "HAL_GPT_STATUS_ERROR_PORT", value: -2)
!536 = !DIEnumerator(name: "HAL_GPT_STATUS_INVALID_PARAMETER", value: -1)
!537 = !DIEnumerator(name: "HAL_GPT_STATUS_OK", value: 0)
!538 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !299, line: 657, baseType: !7, size: 32, elements: !539)
!539 = !{!540, !541, !542, !543, !544}
!540 = !DIEnumerator(name: "HAL_GPT_0", value: 0)
!541 = !DIEnumerator(name: "HAL_GPT_1", value: 1)
!542 = !DIEnumerator(name: "HAL_GPT_2", value: 2)
!543 = !DIEnumerator(name: "HAL_GPT_4", value: 4)
!544 = !DIEnumerator(name: "HAL_GPT_MAX", value: 5)
!545 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !531, line: 397, baseType: !7, size: 32, elements: !546)
!546 = !{!547, !548}
!547 = !DIEnumerator(name: "HAL_GPT_STOPPED", value: 0)
!548 = !DIEnumerator(name: "HAL_GPT_RUNNING", value: 1)
!549 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !299, line: 666, baseType: !7, size: 32, elements: !550)
!550 = !{!551, !552, !553}
!551 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_32K", value: 0)
!552 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_1M", value: 1)
!553 = !DIEnumerator(name: "HAL_GPT_CLOCK_SOURCE_BUS", value: 2)
!554 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !531, line: 380, baseType: !7, size: 32, elements: !555)
!555 = !{!556, !557}
!556 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_ONE_SHOT", value: 0)
!557 = !DIEnumerator(name: "HAL_GPT_TIMER_TYPE_REPEAT", value: 1)
!558 = !{!161, !136}
!559 = !{!525}
!560 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 640, elements: !508)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_context_t", file: !528, line: 55, baseType: !562)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !528, line: 51, size: 128, elements: !563)
!563 = !{!564, !566, !576}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "running_status", scope: !562, file: !528, line: 52, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_running_status_t", file: !531, line: 400, baseType: !545)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "callback_context", scope: !562, file: !528, line: 53, baseType: !567, size: 64, offset: 32)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_context", file: !528, line: 49, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !528, line: 46, size: 64, elements: !569)
!569 = !{!570, !575}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !568, file: !528, line: 47, baseType: !571, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpt_callback_t", file: !531, line: 371, baseType: !572)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 32)
!573 = !DISubroutineType(types: !574)
!574 = !{null, !161}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !568, file: !528, line: 48, baseType: !161, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "has_initlized", scope: !562, file: !528, line: 54, baseType: !126, size: 8, offset: 96)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !579, file: !580, line: 77, type: !644, isLocal: true, isDefinition: true)
!579 = distinct !DICompileUnit(language: DW_LANG_C99, file: !580, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !581, retainedTypes: !631, globals: !633, splitDebugInlining: false, nameTableKind: None)
!580 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!581 = !{!582, !590, !595, !611, !617, !621, !240, !97, !626}
!582 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !583, line: 345, baseType: !53, size: 32, elements: !584)
!583 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!584 = !{!585, !586, !587, !588, !589}
!585 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!586 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!587 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!588 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!589 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!590 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !299, line: 109, baseType: !7, size: 32, elements: !591)
!591 = !{!592, !593, !594}
!592 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!593 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!594 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!595 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !583, line: 302, baseType: !7, size: 32, elements: !596)
!596 = !{!597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610}
!597 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!598 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!599 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!600 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!601 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!602 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!603 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!604 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!605 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!606 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!607 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!608 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!609 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!610 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!611 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !583, line: 321, baseType: !7, size: 32, elements: !612)
!612 = !{!613, !614, !615, !616}
!613 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!614 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!615 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!616 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!617 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !583, line: 330, baseType: !7, size: 32, elements: !618)
!618 = !{!619, !620}
!619 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!620 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!621 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !583, line: 337, baseType: !7, size: 32, elements: !622)
!622 = !{!623, !624, !625}
!623 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!624 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!625 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!626 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !583, line: 355, baseType: !53, size: 32, elements: !627)
!627 = !{!628, !629, !630}
!628 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!629 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!630 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!631 = !{!7, !161, !132, !632, !128}
!632 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!633 = !{!577, !634}
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "func_tbl", scope: !636, file: !580, line: 536, type: !642, isLocal: true, isDefinition: true)
!636 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !580, file: !580, line: 534, type: !637, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !579, retainedNodes: !640)
!637 = !DISubroutineType(types: !638)
!638 = !{!179, !639}
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !299, line: 113, baseType: !590)
!640 = !{!641}
!641 = !DILocalVariable(name: "uart_port", arg: 1, scope: !636, file: !580, line: 534, type: !639)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !643, size: 64, elements: !498)
!643 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !179)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 1024, elements: !498)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !580, line: 75, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !580, line: 68, size: 512, elements: !647)
!647 = !{!648, !649, !661, !662, !673, !674}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !646, file: !580, line: 69, baseType: !126, size: 8)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !646, file: !580, line: 70, baseType: !650, size: 128, offset: 32)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !583, line: 378, baseType: !651)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !583, line: 373, size: 128, elements: !652)
!652 = !{!653, !655, !657, !659}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !651, file: !583, line: 374, baseType: !654, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !583, line: 317, baseType: !595)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !651, file: !583, line: 375, baseType: !656, size: 32, offset: 32)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !583, line: 326, baseType: !611)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !651, file: !583, line: 376, baseType: !658, size: 32, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !583, line: 333, baseType: !617)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !651, file: !583, line: 377, baseType: !660, size: 32, offset: 96)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !583, line: 341, baseType: !621)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !646, file: !580, line: 71, baseType: !126, size: 8, offset: 160)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !646, file: !580, line: 72, baseType: !663, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !580, line: 66, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !580, line: 63, size: 64, elements: !665)
!665 = !{!666, !672}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !664, file: !580, line: 64, baseType: !667, size: 32)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !583, line: 410, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 32)
!669 = !DISubroutineType(types: !670)
!670 = !{null, !671, !161}
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !583, line: 359, baseType: !626)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !664, file: !580, line: 65, baseType: !161, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !646, file: !580, line: 73, baseType: !126, size: 8, offset: 256)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !646, file: !580, line: 74, baseType: !675, size: 224, offset: 288)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !583, line: 390, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !583, line: 382, size: 224, elements: !677)
!677 = !{!678, !680, !681, !682, !683, !684, !685}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !676, file: !583, line: 383, baseType: !679, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !676, file: !583, line: 384, baseType: !136, size: 32, offset: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !676, file: !583, line: 385, baseType: !136, size: 32, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !676, file: !583, line: 386, baseType: !679, size: 32, offset: 96)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !676, file: !583, line: 387, baseType: !136, size: 32, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !676, file: !583, line: 388, baseType: !136, size: 32, offset: 160)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !676, file: !583, line: 389, baseType: !136, size: 32, offset: 192)
!686 = !DIGlobalVariableExpression(var: !687, expr: !DIExpression())
!687 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !688, file: !689, line: 59, type: !136, isLocal: false, isDefinition: true)
!688 = distinct !DICompileUnit(language: DW_LANG_C99, file: !689, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !690, globals: !743, splitDebugInlining: false, nameTableKind: None)
!689 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/adc_get_data_polling/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!690 = !{!691, !699, !724}
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !443, line: 656, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !443, line: 650, size: 128, elements: !694)
!694 = !{!695, !696, !697, !698}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !693, file: !443, line: 652, baseType: !230, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !693, file: !443, line: 653, baseType: !230, size: 32, offset: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !693, file: !443, line: 654, baseType: !230, size: 32, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !693, file: !443, line: 655, baseType: !479, size: 32, offset: 96)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 32)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !443, line: 418, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !443, line: 395, size: 1120, elements: !702)
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !701, file: !443, line: 397, baseType: !479, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !701, file: !443, line: 398, baseType: !230, size: 32, offset: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !701, file: !443, line: 399, baseType: !230, size: 32, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !701, file: !443, line: 400, baseType: !230, size: 32, offset: 96)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !701, file: !443, line: 401, baseType: !230, size: 32, offset: 128)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !701, file: !443, line: 402, baseType: !230, size: 32, offset: 160)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !701, file: !443, line: 403, baseType: !486, size: 96, offset: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !701, file: !443, line: 404, baseType: !230, size: 32, offset: 288)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !701, file: !443, line: 405, baseType: !230, size: 32, offset: 320)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !701, file: !443, line: 406, baseType: !230, size: 32, offset: 352)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !701, file: !443, line: 407, baseType: !230, size: 32, offset: 384)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !701, file: !443, line: 408, baseType: !230, size: 32, offset: 416)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !701, file: !443, line: 409, baseType: !230, size: 32, offset: 448)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !701, file: !443, line: 410, baseType: !230, size: 32, offset: 480)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !701, file: !443, line: 411, baseType: !497, size: 64, offset: 512)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !701, file: !443, line: 412, baseType: !479, size: 32, offset: 576)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !701, file: !443, line: 413, baseType: !479, size: 32, offset: 608)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !701, file: !443, line: 414, baseType: !503, size: 128, offset: 640)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !701, file: !443, line: 415, baseType: !507, size: 160, offset: 768)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !701, file: !443, line: 416, baseType: !511, size: 160, offset: 928)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !701, file: !443, line: 417, baseType: !230, size: 32, offset: 1088)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !395, line: 72, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !395, line: 56, size: 525312, elements: !727)
!727 = !{!728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !726, file: !395, line: 57, baseType: !230, size: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !726, file: !395, line: 58, baseType: !230, size: 32, offset: 32)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !726, file: !395, line: 59, baseType: !230, size: 32, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !726, file: !395, line: 60, baseType: !230, size: 32, offset: 96)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !726, file: !395, line: 61, baseType: !230, size: 32, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !726, file: !395, line: 62, baseType: !230, size: 32, offset: 160)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !726, file: !395, line: 63, baseType: !230, size: 32, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !726, file: !395, line: 64, baseType: !230, size: 32, offset: 224)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !726, file: !395, line: 65, baseType: !230, size: 32, offset: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !726, file: !395, line: 66, baseType: !230, size: 32, offset: 288)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !726, file: !395, line: 67, baseType: !409, size: 32, offset: 320)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !726, file: !395, line: 68, baseType: !230, size: 32, offset: 352)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !726, file: !395, line: 69, baseType: !414, size: 523904, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !726, file: !395, line: 70, baseType: !418, size: 512, offset: 524288)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !726, file: !395, line: 71, baseType: !418, size: 512, offset: 524800)
!743 = !{!686, !744}
!744 = !DIGlobalVariableExpression(var: !745, expr: !DIExpression())
!745 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !688, file: !689, line: 61, type: !230, isLocal: true, isDefinition: true)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "heap_end", scope: !748, file: !749, line: 66, type: !754, isLocal: true, isDefinition: true)
!748 = distinct !DISubprogram(name: "_sbrk_r", scope: !749, file: !749, line: 63, type: !750, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !946, retainedNodes: !950)
!749 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!750 = !DISubroutineType(types: !751)
!751 = !{!752, !755, !945}
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !753, line: 123, baseType: !754)
!753 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !757, line: 377, size: 1920, elements: !758)
!757 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!758 = !{!759, !760, !834, !835, !836, !837, !838, !839, !840, !843, !864, !868, !869, !870, !871, !881, !894, !895, !900, !919, !920, !927, !928, !944}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !756, file: !757, line: 381, baseType: !53, size: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !756, file: !757, line: 386, baseType: !761, size: 32, offset: 32)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !757, line: 292, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !757, line: 186, size: 832, elements: !764)
!764 = !{!765, !767, !768, !769, !771, !772, !777, !778, !779, !780, !784, !790, !797, !801, !802, !803, !804, !808, !810, !811, !812, !814, !820, !833}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !763, file: !757, line: 187, baseType: !766, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !763, file: !757, line: 188, baseType: !53, size: 32, offset: 32)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !763, file: !757, line: 189, baseType: !53, size: 32, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !763, file: !757, line: 190, baseType: !770, size: 16, offset: 96)
!770 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !763, file: !757, line: 191, baseType: !770, size: 16, offset: 112)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !763, file: !757, line: 192, baseType: !773, size: 64, offset: 128)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !757, line: 122, size: 64, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !773, file: !757, line: 123, baseType: !766, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !773, file: !757, line: 124, baseType: !53, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !763, file: !757, line: 193, baseType: !53, size: 32, offset: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !763, file: !757, line: 196, baseType: !755, size: 32, offset: 224)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !763, file: !757, line: 200, baseType: !161, size: 32, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !763, file: !757, line: 202, baseType: !781, size: 32, offset: 288)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DISubroutineType(types: !783)
!783 = !{!53, !755, !161, !754, !53}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !763, file: !757, line: 204, baseType: !785, size: 32, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 32)
!786 = !DISubroutineType(types: !787)
!787 = !{!53, !755, !161, !788, !53}
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !632)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !763, file: !757, line: 207, baseType: !791, size: 32, offset: 352)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = !DISubroutineType(types: !793)
!793 = !{!794, !755, !161, !794, !53}
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !795, line: 116, baseType: !796)
!795 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!796 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !763, file: !757, line: 208, baseType: !798, size: 32, offset: 384)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!799 = !DISubroutineType(types: !800)
!800 = !{!53, !755, !161}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !763, file: !757, line: 211, baseType: !773, size: 64, offset: 416)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !763, file: !757, line: 212, baseType: !766, size: 32, offset: 480)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !763, file: !757, line: 213, baseType: !53, size: 32, offset: 512)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !763, file: !757, line: 216, baseType: !805, size: 24, offset: 544)
!805 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 24, elements: !806)
!806 = !{!807}
!807 = !DISubrange(count: 3)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !763, file: !757, line: 217, baseType: !809, size: 8, offset: 568)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 8, elements: !410)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !763, file: !757, line: 220, baseType: !773, size: 64, offset: 576)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !763, file: !757, line: 223, baseType: !53, size: 32, offset: 640)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !763, file: !757, line: 224, baseType: !813, size: 32, offset: 672)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !795, line: 46, baseType: !796)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !763, file: !757, line: 231, baseType: !815, size: 32, offset: 704)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !757, line: 35, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !817, line: 34, baseType: !818)
!817 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 32)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !817, line: 33, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !763, file: !757, line: 233, baseType: !821, size: 64, offset: 736)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !795, line: 170, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !795, line: 162, size: 64, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !822, file: !795, line: 164, baseType: !53, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !822, file: !795, line: 169, baseType: !826, size: 32, offset: 32)
!826 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !822, file: !795, line: 165, size: 32, elements: !827)
!827 = !{!828, !831}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !826, file: !795, line: 167, baseType: !829, size: 32)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !830, line: 116, baseType: !53)
!830 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!831 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !826, file: !795, line: 168, baseType: !832, size: 32)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !132, size: 32, elements: !504)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !763, file: !757, line: 234, baseType: !53, size: 32, offset: 800)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !756, file: !757, line: 386, baseType: !761, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !756, file: !757, line: 386, baseType: !761, size: 32, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !756, file: !757, line: 388, baseType: !53, size: 32, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !756, file: !757, line: 390, baseType: !754, size: 32, offset: 160)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !756, file: !757, line: 392, baseType: !53, size: 32, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !756, file: !757, line: 394, baseType: !53, size: 32, offset: 224)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !756, file: !757, line: 395, baseType: !841, size: 32, offset: 256)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 32)
!842 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !757, line: 45, flags: DIFlagFwdDecl)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !756, file: !757, line: 397, baseType: !844, size: 32, offset: 288)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 32)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !757, line: 349, size: 128, elements: !846)
!846 = !{!847, !860, !861, !862}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !845, file: !757, line: 352, baseType: !848, size: 32)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !757, line: 52, size: 192, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !849, file: !757, line: 54, baseType: !848, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !849, file: !757, line: 55, baseType: !53, size: 32, offset: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !849, file: !757, line: 55, baseType: !53, size: 32, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !849, file: !757, line: 55, baseType: !53, size: 32, offset: 96)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !849, file: !757, line: 55, baseType: !53, size: 32, offset: 128)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !849, file: !757, line: 56, baseType: !857, size: 32, offset: 160)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !858, size: 32, elements: !410)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !757, line: 22, baseType: !859)
!859 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !845, file: !757, line: 353, baseType: !53, size: 32, offset: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !845, file: !757, line: 354, baseType: !848, size: 32, offset: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !845, file: !757, line: 355, baseType: !863, size: 32, offset: 96)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !756, file: !757, line: 399, baseType: !865, size: 32, offset: 320)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 32)
!866 = !DISubroutineType(types: !867)
!867 = !{null, !755}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !756, file: !757, line: 401, baseType: !53, size: 32, offset: 352)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !756, file: !757, line: 404, baseType: !53, size: 32, offset: 384)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !756, file: !757, line: 405, baseType: !754, size: 32, offset: 416)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !756, file: !757, line: 407, baseType: !872, size: 32, offset: 448)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !757, line: 324, size: 192, elements: !874)
!874 = !{!875, !877, !878, !879}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !873, file: !757, line: 325, baseType: !876, size: 48)
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 48, elements: !806)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !873, file: !757, line: 326, baseType: !876, size: 48, offset: 48)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !873, file: !757, line: 327, baseType: !250, size: 16, offset: 96)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !873, file: !757, line: 330, baseType: !880, size: 64, offset: 128)
!880 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !756, file: !757, line: 408, baseType: !882, size: 32, offset: 480)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 32)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !757, line: 60, size: 288, elements: !884)
!884 = !{!885, !886, !887, !888, !889, !890, !891, !892, !893}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !883, file: !757, line: 62, baseType: !53, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !883, file: !757, line: 63, baseType: !53, size: 32, offset: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !883, file: !757, line: 64, baseType: !53, size: 32, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !883, file: !757, line: 65, baseType: !53, size: 32, offset: 96)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !883, file: !757, line: 66, baseType: !53, size: 32, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !883, file: !757, line: 67, baseType: !53, size: 32, offset: 160)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !883, file: !757, line: 68, baseType: !53, size: 32, offset: 192)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !883, file: !757, line: 69, baseType: !53, size: 32, offset: 224)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !883, file: !757, line: 70, baseType: !53, size: 32, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !756, file: !757, line: 409, baseType: !754, size: 32, offset: 512)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !756, file: !757, line: 412, baseType: !896, size: 32, offset: 544)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 32)
!898 = !DISubroutineType(types: !899)
!899 = !{null, !53}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !756, file: !757, line: 416, baseType: !901, size: 32, offset: 576)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 32)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !757, line: 90, size: 1120, elements: !903)
!903 = !{!904, !905, !906, !910}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !902, file: !757, line: 91, baseType: !901, size: 32)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !902, file: !757, line: 92, baseType: !53, size: 32, offset: 32)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !902, file: !757, line: 93, baseType: !907, size: 1024, offset: 64)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 1024, elements: !908)
!908 = !{!909}
!909 = !DISubrange(count: 32)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !902, file: !757, line: 94, baseType: !911, size: 32, offset: 1088)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 32)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !757, line: 79, size: 2112, elements: !913)
!913 = !{!914, !916, !917, !918}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !912, file: !757, line: 80, baseType: !915, size: 1024)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1024, elements: !908)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !912, file: !757, line: 81, baseType: !915, size: 1024, offset: 1024)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !912, file: !757, line: 83, baseType: !858, size: 32, offset: 2048)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !912, file: !757, line: 86, baseType: !858, size: 32, offset: 2080)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !756, file: !757, line: 417, baseType: !902, size: 1120, offset: 608)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !756, file: !757, line: 420, baseType: !921, size: 96, offset: 1728)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !757, line: 296, size: 96, elements: !922)
!922 = !{!923, !925, !926}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !921, file: !757, line: 298, baseType: !924, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !921, file: !757, line: 299, baseType: !53, size: 32, offset: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !921, file: !757, line: 300, baseType: !761, size: 32, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !756, file: !757, line: 421, baseType: !761, size: 32, offset: 1824)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !756, file: !757, line: 422, baseType: !929, size: 32, offset: 1856)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 32)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !757, line: 359, size: 640, elements: !931)
!931 = !{!932, !933, !934, !935, !936, !938, !939, !940, !941, !942, !943}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !930, file: !757, line: 362, baseType: !754, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !930, file: !757, line: 363, baseType: !821, size: 64, offset: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !930, file: !757, line: 364, baseType: !821, size: 64, offset: 96)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !930, file: !757, line: 365, baseType: !821, size: 64, offset: 160)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !930, file: !757, line: 366, baseType: !937, size: 64, offset: 224)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 64, elements: !448)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !930, file: !757, line: 367, baseType: !53, size: 32, offset: 288)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !930, file: !757, line: 368, baseType: !821, size: 64, offset: 320)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !930, file: !757, line: 369, baseType: !821, size: 64, offset: 384)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !930, file: !757, line: 370, baseType: !821, size: 64, offset: 448)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !930, file: !757, line: 371, baseType: !821, size: 64, offset: 512)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !930, file: !757, line: 372, baseType: !821, size: 64, offset: 576)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !756, file: !757, line: 423, baseType: !754, size: 32, offset: 1888)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !830, line: 46, baseType: !7)
!946 = distinct !DICompileUnit(language: DW_LANG_C99, file: !947, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !948, globals: !949, splitDebugInlining: false, nameTableKind: None)
!947 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!948 = !{!754, !752}
!949 = !{!746}
!950 = !{!951, !952, !953, !954}
!951 = !DILocalVariable(name: "r", arg: 1, scope: !748, file: !749, line: 63, type: !755)
!952 = !DILocalVariable(name: "nbytes", arg: 2, scope: !748, file: !749, line: 63, type: !945)
!953 = !DILocalVariable(name: "prev_heap_end", scope: !748, file: !749, line: 67, type: !754)
!954 = !DILocalVariable(name: "stack", scope: !748, file: !749, line: 68, type: !754)
!955 = !DIGlobalVariableExpression(var: !956, expr: !DIExpression())
!956 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !957, file: !962, line: 4, type: !966, isLocal: false, isDefinition: true)
!957 = distinct !DICompileUnit(language: DW_LANG_C99, file: !958, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !959, splitDebugInlining: false, nameTableKind: None)
!958 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!959 = !{!955, !960, !964}
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !957, file: !962, line: 5, type: !963, isLocal: false, isDefinition: true)
!962 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 88, elements: !190)
!964 = !DIGlobalVariableExpression(var: !965, expr: !DIExpression())
!965 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !957, file: !962, line: 6, type: !963, isLocal: false, isDefinition: true)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 248, elements: !967)
!967 = !{!968}
!968 = !DISubrange(count: 31)
!969 = distinct !DICompileUnit(language: DW_LANG_C99, file: !970, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !971, retainedTypes: !977, splitDebugInlining: false, nameTableKind: None)
!970 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!971 = !{!972}
!972 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !973, line: 1209, baseType: !7, size: 32, elements: !974)
!973 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!974 = !{!975, !976}
!975 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!976 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!977 = !{!115, !114}
!978 = distinct !DICompileUnit(language: DW_LANG_C99, file: !979, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !980, retainedTypes: !1058, splitDebugInlining: false, nameTableKind: None)
!979 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!980 = !{!981}
!981 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !982, line: 150, baseType: !7, size: 32, elements: !983)
!982 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!983 = !{!984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057}
!984 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!985 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!986 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!987 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!988 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!989 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!990 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!991 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!992 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!993 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!994 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!995 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!996 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!997 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!998 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!999 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!1000 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!1001 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!1002 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!1003 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!1004 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!1005 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!1006 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!1007 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!1008 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!1009 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!1010 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!1011 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!1012 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!1013 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!1014 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!1015 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!1016 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!1017 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!1018 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!1019 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!1020 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!1021 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!1022 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!1023 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!1024 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!1025 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!1026 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!1027 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!1028 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!1029 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!1030 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!1031 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!1032 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!1033 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!1034 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!1035 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!1036 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!1037 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!1038 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!1039 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!1040 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!1041 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!1042 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!1043 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!1044 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!1045 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!1046 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!1047 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!1048 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!1049 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!1050 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!1051 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!1052 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!1053 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!1054 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!1055 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!1056 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!1057 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!1058 = !{!115, !219}
!1059 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1060, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1061, splitDebugInlining: false, nameTableKind: None)
!1060 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/adc_get_data_polling/GCC")
!1061 = !{!1062, !1087}
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 32)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !443, line: 418, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !443, line: 395, size: 1120, elements: !1065)
!1065 = !{!1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !1064, file: !443, line: 397, baseType: !479, size: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !1064, file: !443, line: 398, baseType: !230, size: 32, offset: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !1064, file: !443, line: 399, baseType: !230, size: 32, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !1064, file: !443, line: 400, baseType: !230, size: 32, offset: 96)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !1064, file: !443, line: 401, baseType: !230, size: 32, offset: 128)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !1064, file: !443, line: 402, baseType: !230, size: 32, offset: 160)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !1064, file: !443, line: 403, baseType: !486, size: 96, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !1064, file: !443, line: 404, baseType: !230, size: 32, offset: 288)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !1064, file: !443, line: 405, baseType: !230, size: 32, offset: 320)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !1064, file: !443, line: 406, baseType: !230, size: 32, offset: 352)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !1064, file: !443, line: 407, baseType: !230, size: 32, offset: 384)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !1064, file: !443, line: 408, baseType: !230, size: 32, offset: 416)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !1064, file: !443, line: 409, baseType: !230, size: 32, offset: 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !1064, file: !443, line: 410, baseType: !230, size: 32, offset: 480)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !1064, file: !443, line: 411, baseType: !497, size: 64, offset: 512)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !1064, file: !443, line: 412, baseType: !479, size: 32, offset: 576)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !1064, file: !443, line: 413, baseType: !479, size: 32, offset: 608)
