; ModuleID = 'build/arduino_nano_33_ble/boards/stm32/power_mgmt/blinky/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.gpio_driver_data }
%struct.gpio_driver_data = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.gpio_driver_data }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16*, %struct.pm_device* }
%struct.device_state = type { i8, i8 }
%struct.pm_device = type { %struct.device*, %struct.k_mutex, i32, %struct.k_work_delayable, %struct.k_condvar, %struct.device*, i32, i32, i32 (%struct.device*, i32)* }
%struct.k_mutex = type { %union.anon, %struct.k_thread*, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/power_mgmt/blinky/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/power_mgmt/blinky")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 60, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/power_mgmt/blinky")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 3072, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 48)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1536, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "_char_out", scope: !27, file: !105, line: 54, type: !106, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/power_mgmt/blinky")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DISubroutineType(types: !108)
!108 = !{!103, !103}
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !111, file: !167, line: 27, type: !196, isLocal: true, isDefinition: true)
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !113, retainedTypes: !138, globals: !164, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/power_mgmt/blinky")
!113 = !{!114, !125, !132, !30}
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !115, line: 27, baseType: !32, size: 32, elements: !116)
!115 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124}
!117 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!118 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!119 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!120 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!121 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!122 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!123 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!124 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_state", file: !126, line: 53, baseType: !32, size: 32, elements: !127)
!126 = !DIFile(filename: "zephyr/include/zephyr/pm/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!127 = !{!128, !129, !130, !131}
!128 = !DIEnumerator(name: "PM_DEVICE_STATE_ACTIVE", value: 0)
!129 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDED", value: 1)
!130 = !DIEnumerator(name: "PM_DEVICE_STATE_SUSPENDING", value: 2)
!131 = !DIEnumerator(name: "PM_DEVICE_STATE_OFF", value: 3)
!132 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_device_action", file: !126, line: 75, baseType: !32, size: 32, elements: !133)
!133 = !{!134, !135, !136, !137}
!134 = !DIEnumerator(name: "PM_DEVICE_ACTION_SUSPEND", value: 0)
!135 = !DIEnumerator(name: "PM_DEVICE_ACTION_RESUME", value: 1)
!136 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_OFF", value: 2)
!137 = !DIEnumerator(name: "PM_DEVICE_ACTION_TURN_ON", value: 3)
!138 = !{!102, !139, !103, !24, !143, !159, !161, !162}
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !140, line: 46, baseType: !141)
!140 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !142)
!142 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32)
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !145, line: 54, size: 96, elements: !146)
!145 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!146 = !{!147, !154, !158}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !144, file: !145, line: 55, baseType: !148, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !149, line: 33, baseType: !150)
!149 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !149, line: 29, size: 32, elements: !151)
!151 = !{!152}
!152 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !150, file: !149, line: 30, baseType: !153, size: 32)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !144, file: !145, line: 60, baseType: !155, size: 32, offset: 32)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 32)
!156 = !DISubroutineType(types: !157)
!157 = !{null, !114}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !144, file: !145, line: 65, baseType: !155, size: 32, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!161 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !163)
!163 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!164 = !{!109, !165, !171, !173, !186, !188}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !111, file: !167, line: 44, type: !168, isLocal: true, isDefinition: true)
!167 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !169, line: 43, elements: !170)
!169 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!170 = !{}
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !111, file: !167, line: 49, type: !168, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !111, file: !167, line: 36, type: !175, isLocal: true, isDefinition: true)
!175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 128, elements: !184)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !115, line: 114, size: 128, elements: !177)
!177 = !{!178, !179, !182, !183}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !176, file: !115, line: 115, baseType: !114, size: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !176, file: !115, line: 141, baseType: !180, size: 8, offset: 32)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !181)
!181 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !176, file: !115, line: 149, baseType: !161, size: 32, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !176, file: !115, line: 156, baseType: !161, size: 32, offset: 96)
!184 = !{!185}
!185 = !DISubrange(count: 1)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !111, file: !167, line: 40, type: !175, isLocal: true, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !111, file: !167, line: 28, type: !190, isLocal: true, isDefinition: true)
!190 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !149, line: 40, baseType: !191)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !149, line: 35, size: 64, elements: !192)
!192 = !{!193, !195}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !191, file: !149, line: 36, baseType: !194, size: 32)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 32)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !191, file: !149, line: 37, baseType: !194, size: 32, offset: 32)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 32, elements: !184)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !198, line: 22, baseType: !199)
!198 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!199 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!200 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!201 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !204, file: !236, line: 50, type: !223, isLocal: true, isDefinition: true)
!204 = distinct !DICompileUnit(language: DW_LANG_C99, file: !205, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !206, retainedTypes: !207, globals: !233, splitDebugInlining: false, nameTableKind: None)
!205 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/power_mgmt/blinky")
!206 = !{!114, !30}
!207 = !{!208, !139, !210, !103, !102, !161, !162, !212, !159, !223, !224}
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !209)
!209 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!210 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !211, line: 214, baseType: !32)
!211 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 32)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !214, line: 45, size: 64, elements: !215)
!214 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!215 = !{!216, !222}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !213, file: !214, line: 46, baseType: !217, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !149, line: 33, baseType: !218)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !149, line: 29, size: 32, elements: !219)
!219 = !{!220}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !218, file: !149, line: 30, baseType: !221, size: 32)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 32)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !213, file: !214, line: 48, baseType: !161, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !214, line: 38, size: 64, elements: !226)
!226 = !{!227, !228}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !225, file: !214, line: 39, baseType: !217, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !225, file: !214, line: 41, baseType: !229, size: 32, offset: 32)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !214, line: 35, baseType: !230)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 32)
!231 = !DISubroutineType(types: !232)
!232 = !{null, !223}
!233 = !{!234, !238, !246, !202, !248, !258}
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "latency_lock", scope: !204, file: !236, line: 44, type: !237, isLocal: true, isDefinition: true)
!236 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !169, line: 43, elements: !170)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !204, file: !236, line: 46, type: !240, isLocal: true, isDefinition: true)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !149, line: 40, baseType: !241)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !149, line: 35, size: 64, elements: !242)
!242 = !{!243, !245}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !241, file: !149, line: 36, baseType: !244, size: 32)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !241, file: !149, line: 37, baseType: !244, size: 32, offset: 32)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "latency_subs", scope: !204, file: !236, line: 52, type: !240, isLocal: true, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !204, file: !236, line: 39, type: !250, isLocal: true, isDefinition: true)
!250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !251, elements: !256)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !236, line: 35, size: 96, elements: !252)
!252 = !{!253, !254, !255}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !251, file: !236, line: 36, baseType: !114, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !251, file: !236, line: 37, baseType: !180, size: 8, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !251, file: !236, line: 38, baseType: !197, size: 32, offset: 64)
!256 = !{!257}
!257 = !DISubrange(count: 0)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !204, file: !236, line: 48, type: !223, isLocal: true, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !262, file: !269, line: 47, type: !283, isLocal: true, isDefinition: true)
!262 = distinct !DICompileUnit(language: DW_LANG_C99, file: !263, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !264, retainedTypes: !265, globals: !266, splitDebugInlining: false, nameTableKind: None)
!263 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/power_mgmt/blinky")
!264 = !{!114}
!265 = !{!210, !103}
!266 = !{!267, !260, !279}
!267 = !DIGlobalVariableExpression(var: !268, expr: !DIExpression())
!268 = distinct !DIGlobalVariable(name: "cpus_states", scope: !262, file: !269, line: 50, type: !270, isLocal: true, isDefinition: true)
!269 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 32, elements: !184)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !273)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !115, line: 114, size: 128, elements: !274)
!274 = !{!275, !276, !277, !278}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !273, file: !115, line: 115, baseType: !114, size: 32)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !273, file: !115, line: 141, baseType: !180, size: 8, offset: 32)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !273, file: !115, line: 149, baseType: !161, size: 32, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !273, file: !115, line: 156, baseType: !161, size: 32, offset: 96)
!279 = !DIGlobalVariableExpression(var: !280, expr: !DIExpression())
!280 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !262, file: !269, line: 55, type: !281, isLocal: true, isDefinition: true)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 8, elements: !184)
!282 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !180)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !272, elements: !256)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "static_regions", scope: !286, file: !293, line: 62, type: !428, isLocal: true, isDefinition: true)
!286 = distinct !DICompileUnit(language: DW_LANG_C99, file: !287, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !288, globals: !289, splitDebugInlining: false, nameTableKind: None)
!287 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/power_mgmt/blinky")
!288 = !{!210, !103, !161, !102}
!289 = !{!290, !284}
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !292, file: !293, line: 198, type: !416, isLocal: true, isDefinition: true)
!292 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !293, file: !293, line: 175, type: !294, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !286, retainedNodes: !411)
!293 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!294 = !DISubroutineType(types: !295)
!295 = !{null, !296}
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 32)
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !298, line: 245, size: 1024, elements: !299)
!298 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!299 = !{!300, !367, !380, !381, !382, !383, !389, !406}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !297, file: !298, line: 247, baseType: !301, size: 384)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !298, line: 57, size: 384, elements: !302)
!302 = !{!303, !331, !339, !340, !341, !354, !355, !356}
!303 = !DIDerivedType(tag: DW_TAG_member, scope: !301, file: !298, line: 60, baseType: !304, size: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !298, line: 60, size: 64, elements: !305)
!305 = !{!306, !322}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !304, file: !298, line: 61, baseType: !307, size: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !308, line: 49, baseType: !309)
!308 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !308, line: 37, size: 64, elements: !310)
!310 = !{!311, !317}
!311 = !DIDerivedType(tag: DW_TAG_member, scope: !309, file: !308, line: 38, baseType: !312, size: 32)
!312 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !309, file: !308, line: 38, size: 32, elements: !313)
!313 = !{!314, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !312, file: !308, line: 39, baseType: !315, size: 32)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !312, file: !308, line: 40, baseType: !315, size: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, scope: !309, file: !308, line: 42, baseType: !318, size: 32, offset: 32)
!318 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !309, file: !308, line: 42, size: 32, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !318, file: !308, line: 43, baseType: !315, size: 32)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !318, file: !308, line: 44, baseType: !315, size: 32)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !304, file: !298, line: 62, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !324, line: 49, size: 64, elements: !325)
!324 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !323, file: !324, line: 50, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 64, elements: !329)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!329 = !{!330}
!330 = !DISubrange(count: 2)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !301, file: !298, line: 68, baseType: !332, size: 32, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !334, line: 233, baseType: !335)
!334 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !334, line: 231, size: 64, elements: !336)
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !335, file: !334, line: 232, baseType: !338, size: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !308, line: 48, baseType: !309)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !301, file: !298, line: 71, baseType: !180, size: 8, offset: 96)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !301, file: !298, line: 74, baseType: !180, size: 8, offset: 104)
!341 = !DIDerivedType(tag: DW_TAG_member, scope: !301, file: !298, line: 90, baseType: !342, size: 16, offset: 112)
!342 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !301, file: !298, line: 90, size: 16, elements: !343)
!343 = !{!344, !351}
!344 = !DIDerivedType(tag: DW_TAG_member, scope: !342, file: !298, line: 91, baseType: !345, size: 16)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !342, file: !298, line: 91, size: 16, elements: !346)
!346 = !{!347, !350}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !345, file: !298, line: 96, baseType: !348, size: 8)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !349)
!349 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !345, file: !298, line: 97, baseType: !180, size: 8, offset: 8)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !342, file: !298, line: 100, baseType: !352, size: 16)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !353)
!353 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !301, file: !298, line: 107, baseType: !161, size: 32, offset: 128)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !301, file: !298, line: 127, baseType: !102, size: 32, offset: 160)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !301, file: !298, line: 131, baseType: !357, size: 192, offset: 192)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !334, line: 244, size: 192, elements: !358)
!358 = !{!359, !360, !366}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !357, file: !334, line: 245, baseType: !307, size: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !357, file: !334, line: 246, baseType: !361, size: 32, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !334, line: 242, baseType: !362)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 32)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !365}
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 32)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !357, file: !334, line: 249, baseType: !141, size: 64, offset: 128)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !297, file: !298, line: 250, baseType: !368, size: 288, offset: 384)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !369, line: 25, size: 288, elements: !370)
!369 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !368, file: !369, line: 26, baseType: !161, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !368, file: !369, line: 27, baseType: !161, size: 32, offset: 32)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !368, file: !369, line: 28, baseType: !161, size: 32, offset: 64)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !368, file: !369, line: 29, baseType: !161, size: 32, offset: 96)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !368, file: !369, line: 30, baseType: !161, size: 32, offset: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !368, file: !369, line: 31, baseType: !161, size: 32, offset: 160)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !368, file: !369, line: 32, baseType: !161, size: 32, offset: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !368, file: !369, line: 33, baseType: !161, size: 32, offset: 224)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !368, file: !369, line: 34, baseType: !161, size: 32, offset: 256)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !297, file: !298, line: 253, baseType: !102, size: 32, offset: 672)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !297, file: !298, line: 256, baseType: !333, size: 64, offset: 704)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !297, file: !298, line: 294, baseType: !103, size: 32, offset: 768)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !297, file: !298, line: 300, baseType: !384, size: 96, offset: 800)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !298, line: 149, size: 96, elements: !385)
!385 = !{!386, !387, !388}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !384, file: !298, line: 153, baseType: !22, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !384, file: !298, line: 162, baseType: !210, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !384, file: !298, line: 168, baseType: !210, size: 32, offset: 64)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !297, file: !298, line: 325, baseType: !390, size: 32, offset: 896)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !392, line: 5073, size: 160, elements: !393)
!392 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!393 = !{!394, !403, !404}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !391, file: !392, line: 5074, baseType: !395, size: 96)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !396, line: 56, size: 96, elements: !397)
!396 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!397 = !{!398, !401, !402}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !395, file: !396, line: 57, baseType: !399, size: 32)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 32)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !396, line: 57, flags: DIFlagFwdDecl)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !395, file: !396, line: 58, baseType: !102, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !395, file: !396, line: 59, baseType: !210, size: 32, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !391, file: !392, line: 5075, baseType: !333, size: 64, offset: 96)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !391, file: !392, line: 5076, baseType: !405, offset: 160)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !169, line: 43, elements: !170)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !297, file: !298, line: 343, baseType: !407, size: 64, offset: 928)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !369, line: 60, size: 64, elements: !408)
!408 = !{!409, !410}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !407, file: !369, line: 63, baseType: !161, size: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !407, file: !369, line: 66, baseType: !161, size: 32, offset: 32)
!411 = !{!412, !413, !414, !415}
!412 = !DILocalVariable(name: "thread", arg: 1, scope: !292, file: !293, line: 175, type: !296)
!413 = !DILocalVariable(name: "region_num", scope: !292, file: !293, line: 200, type: !180)
!414 = !DILocalVariable(name: "guard_start", scope: !292, file: !293, line: 265, type: !22)
!415 = !DILocalVariable(name: "guard_size", scope: !292, file: !293, line: 266, type: !210)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 96, elements: !184)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !418, line: 52, size: 96, elements: !419)
!418 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!419 = !{!420, !421, !422}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !417, file: !418, line: 53, baseType: !22, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !417, file: !418, line: 54, baseType: !210, size: 32, offset: 32)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !417, file: !418, line: 55, baseType: !423, size: 32, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !424, line: 151, baseType: !425)
!424 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !424, line: 149, size: 32, elements: !426)
!426 = !{!427}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !425, file: !424, line: 150, baseType: !161, size: 32)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !429, size: 96, elements: !184)
!429 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !417)
!430 = !DIGlobalVariableExpression(var: !431, expr: !DIExpression())
!431 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !432, file: !468, line: 39, type: !180, isLocal: true, isDefinition: true)
!432 = distinct !DICompileUnit(language: DW_LANG_C99, file: !433, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !434, globals: !467, splitDebugInlining: false, nameTableKind: None)
!433 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/power_mgmt/blinky")
!434 = !{!435, !102, !103, !453, !180}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !437, line: 1226, baseType: !438)
!437 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !437, line: 1213, size: 352, elements: !439)
!439 = !{!440, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !438, file: !437, line: 1215, baseType: !441, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !442)
!442 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !161)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !438, file: !437, line: 1216, baseType: !442, size: 32, offset: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !438, file: !437, line: 1217, baseType: !442, size: 32, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !438, file: !437, line: 1218, baseType: !442, size: 32, offset: 96)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !438, file: !437, line: 1219, baseType: !442, size: 32, offset: 128)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !438, file: !437, line: 1220, baseType: !442, size: 32, offset: 160)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !438, file: !437, line: 1221, baseType: !442, size: 32, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !438, file: !437, line: 1222, baseType: !442, size: 32, offset: 224)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !438, file: !437, line: 1223, baseType: !442, size: 32, offset: 256)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !438, file: !437, line: 1224, baseType: !442, size: 32, offset: 288)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !438, file: !437, line: 1225, baseType: !442, size: 32, offset: 320)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !456, line: 27, size: 96, elements: !457)
!456 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!457 = !{!458, !459, !462}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !455, file: !456, line: 29, baseType: !161, size: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !455, file: !456, line: 31, baseType: !460, size: 32, offset: 32)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !160)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !455, file: !456, line: 37, baseType: !463, size: 32, offset: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !424, line: 146, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !424, line: 141, size: 32, elements: !465)
!465 = !{!466}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !464, file: !424, line: 143, baseType: !161, size: 32)
!467 = !{!430}
!468 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !471, file: !478, line: 21, type: !106, isLocal: true, isDefinition: true)
!471 = distinct !DICompileUnit(language: DW_LANG_C99, file: !472, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !473, globals: !477, splitDebugInlining: false, nameTableKind: None)
!472 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/power_mgmt/blinky")
!473 = !{!474, !103, !102}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !476, line: 22, baseType: !103)
!476 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!477 = !{!469}
!478 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!479 = !DIGlobalVariableExpression(var: !480, expr: !DIExpression())
!480 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !481, file: !486, line: 13, type: !503, isLocal: true, isDefinition: true)
!481 = distinct !DICompileUnit(language: DW_LANG_C99, file: !482, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !483, splitDebugInlining: false, nameTableKind: None)
!482 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/power_mgmt/blinky")
!483 = !{!484, !479}
!484 = !DIGlobalVariableExpression(var: !485, expr: !DIExpression())
!485 = distinct !DIGlobalVariable(name: "mpu_config", scope: !481, file: !486, line: 37, type: !487, isLocal: false, isDefinition: true)
!486 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!487 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !488)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !456, line: 41, size: 64, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !488, file: !456, line: 43, baseType: !161, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !488, file: !456, line: 45, baseType: !492, size: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !494)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !456, line: 27, size: 96, elements: !495)
!495 = !{!496, !497, !498}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !494, file: !456, line: 29, baseType: !161, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !494, file: !456, line: 31, baseType: !460, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !494, file: !456, line: 37, baseType: !499, size: 32, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !424, line: 146, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !424, line: 141, size: 32, elements: !501)
!501 = !{!502}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !500, file: !424, line: 143, baseType: !161, size: 32)
!503 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 192, elements: !329)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf52_init", scope: !506, file: !676, line: 93, type: !677, isLocal: true, isDefinition: true, align: 32)
!506 = distinct !DICompileUnit(language: DW_LANG_C99, file: !507, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !508, globals: !671, splitDebugInlining: false, nameTableKind: None)
!507 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/power_mgmt/blinky")
!508 = !{!509, !180, !102, !103, !589, !161, !590, !626, !637}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_POWER_Type", file: !511, line: 1071, baseType: !512)
!511 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf52840.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 1035, size: 19584, elements: !513)
!513 = !{!514, !518, !519, !520, !524, !525, !527, !528, !529, !530, !531, !532, !536, !537, !538, !542, !543, !547, !548, !552, !553, !557, !558, !559, !560, !561, !562, !563, !567, !568, !569, !570, !574, !575, !579}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !512, file: !511, line: 1036, baseType: !515, size: 960)
!515 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 960, elements: !516)
!516 = !{!517}
!517 = !DISubrange(count: 30)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CONSTLAT", scope: !512, file: !511, line: 1037, baseType: !442, size: 32, offset: 960)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LOWPWR", scope: !512, file: !511, line: 1038, baseType: !442, size: 32, offset: 992)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !512, file: !511, line: 1039, baseType: !521, size: 1088, offset: 1024)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 1088, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 34)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_POFWARN", scope: !512, file: !511, line: 1040, baseType: !442, size: 32, offset: 2112)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !512, file: !511, line: 1041, baseType: !526, size: 64, offset: 2144)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 64, elements: !329)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPENTER", scope: !512, file: !511, line: 1042, baseType: !442, size: 32, offset: 2208)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_SLEEPEXIT", scope: !512, file: !511, line: 1043, baseType: !442, size: 32, offset: 2240)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBDETECTED", scope: !512, file: !511, line: 1044, baseType: !442, size: 32, offset: 2272)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBREMOVED", scope: !512, file: !511, line: 1045, baseType: !442, size: 32, offset: 2304)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_USBPWRRDY", scope: !512, file: !511, line: 1046, baseType: !442, size: 32, offset: 2336)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !512, file: !511, line: 1047, baseType: !533, size: 3808, offset: 2368)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 3808, elements: !534)
!534 = !{!535}
!535 = !DISubrange(count: 119)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !512, file: !511, line: 1048, baseType: !442, size: 32, offset: 6176)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !512, file: !511, line: 1049, baseType: !442, size: 32, offset: 6208)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !512, file: !511, line: 1050, baseType: !539, size: 1952, offset: 6240)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 1952, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 61)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "RESETREAS", scope: !512, file: !511, line: 1051, baseType: !442, size: 32, offset: 8192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !512, file: !511, line: 1052, baseType: !544, size: 288, offset: 8224)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 288, elements: !545)
!545 = !{!546}
!546 = !DISubrange(count: 9)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "RAMSTATUS", scope: !512, file: !511, line: 1053, baseType: !441, size: 32, offset: 8512)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !512, file: !511, line: 1054, baseType: !549, size: 96, offset: 8544)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 96, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 3)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "USBREGSTATUS", scope: !512, file: !511, line: 1055, baseType: !441, size: 32, offset: 8640)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !512, file: !511, line: 1056, baseType: !554, size: 1568, offset: 8672)
!554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 1568, elements: !555)
!555 = !{!556}
!556 = !DISubrange(count: 49)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "SYSTEMOFF", scope: !512, file: !511, line: 1057, baseType: !442, size: 32, offset: 10240)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !512, file: !511, line: 1058, baseType: !549, size: 96, offset: 10272)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "POFCON", scope: !512, file: !511, line: 1059, baseType: !442, size: 32, offset: 10368)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !512, file: !511, line: 1060, baseType: !526, size: 64, offset: 10400)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET", scope: !512, file: !511, line: 1061, baseType: !442, size: 32, offset: 10464)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "GPREGRET2", scope: !512, file: !511, line: 1062, baseType: !442, size: 32, offset: 10496)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !512, file: !511, line: 1063, baseType: !564, size: 672, offset: 10528)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 672, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 21)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN", scope: !512, file: !511, line: 1064, baseType: !442, size: 32, offset: 11200)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED11", scope: !512, file: !511, line: 1065, baseType: !441, size: 32, offset: 11232)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "DCDCEN0", scope: !512, file: !511, line: 1066, baseType: !442, size: 32, offset: 11264)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED12", scope: !512, file: !511, line: 1067, baseType: !571, size: 1504, offset: 11296)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 1504, elements: !572)
!572 = !{!573}
!573 = !DISubrange(count: 47)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "MAINREGSTATUS", scope: !512, file: !511, line: 1068, baseType: !441, size: 32, offset: 12800)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED13", scope: !512, file: !511, line: 1069, baseType: !576, size: 5600, offset: 12832)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 5600, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 175)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "RAM", scope: !512, file: !511, line: 1070, baseType: !580, size: 1152, offset: 18432)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !581, size: 1152, elements: !545)
!581 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "POWER_RAM_Type", file: !511, line: 278, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 272, size: 128, elements: !584)
!584 = !{!585, !586, !587, !588}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "POWER", scope: !583, file: !511, line: 273, baseType: !442, size: 32)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "POWERSET", scope: !583, file: !511, line: 274, baseType: !442, size: 32, offset: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "POWERCLR", scope: !583, file: !511, line: 275, baseType: !442, size: 32, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !583, file: !511, line: 277, baseType: !441, size: 32, offset: 96)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !437, line: 468, baseType: !592)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !437, line: 445, size: 1120, elements: !593)
!593 = !{!594, !595, !596, !597, !598, !599, !600, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !619, !623, !625}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !592, file: !437, line: 447, baseType: !441, size: 32)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !592, file: !437, line: 448, baseType: !442, size: 32, offset: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !592, file: !437, line: 449, baseType: !442, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !592, file: !437, line: 450, baseType: !442, size: 32, offset: 96)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !592, file: !437, line: 451, baseType: !442, size: 32, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !592, file: !437, line: 452, baseType: !442, size: 32, offset: 160)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !592, file: !437, line: 453, baseType: !601, size: 96, offset: 192)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 96, elements: !603)
!602 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !180)
!603 = !{!604}
!604 = !DISubrange(count: 12)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !592, file: !437, line: 454, baseType: !442, size: 32, offset: 288)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !592, file: !437, line: 455, baseType: !442, size: 32, offset: 320)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !592, file: !437, line: 456, baseType: !442, size: 32, offset: 352)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !592, file: !437, line: 457, baseType: !442, size: 32, offset: 384)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !592, file: !437, line: 458, baseType: !442, size: 32, offset: 416)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !592, file: !437, line: 459, baseType: !442, size: 32, offset: 448)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !592, file: !437, line: 460, baseType: !442, size: 32, offset: 480)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !592, file: !437, line: 461, baseType: !526, size: 64, offset: 512)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !592, file: !437, line: 462, baseType: !441, size: 32, offset: 576)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !592, file: !437, line: 463, baseType: !441, size: 32, offset: 608)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !592, file: !437, line: 464, baseType: !616, size: 128, offset: 640)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 128, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 4)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !592, file: !437, line: 465, baseType: !620, size: 160, offset: 768)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 160, elements: !621)
!621 = !{!622}
!622 = !DISubrange(count: 5)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !592, file: !437, line: 466, baseType: !624, size: 160, offset: 928)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 160, elements: !621)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !592, file: !437, line: 467, baseType: !442, size: 32, offset: 1088)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !628, file: !627, line: 167, baseType: !636)
!627 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!628 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !627, file: !627, line: 134, type: !629, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !506, retainedNodes: !631)
!629 = !DISubroutineType(types: !630)
!630 = !{null, !161}
!631 = !{!632, !633, !635}
!632 = !DILocalVariable(name: "time_us", arg: 1, scope: !628, file: !627, line: 134, type: !161)
!633 = !DILocalVariable(name: "delay_cycles", scope: !628, file: !627, line: 168, type: !634)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!635 = !DILocalVariable(name: "cycles", scope: !628, file: !627, line: 171, type: !161)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !511, line: 2399, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 2373, size: 10880, elements: !640)
!640 = !{!641, !645, !646, !647, !648, !652, !653, !658, !659, !660, !661, !662, !663, !667, !668, !669, !670}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !639, file: !511, line: 2374, baseType: !642, size: 8192)
!642 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 8192, elements: !643)
!643 = !{!644}
!644 = !DISubrange(count: 256)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !639, file: !511, line: 2375, baseType: !441, size: 32, offset: 8192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !639, file: !511, line: 2376, baseType: !441, size: 32, offset: 8224)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !639, file: !511, line: 2377, baseType: !441, size: 32, offset: 8256)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !639, file: !511, line: 2378, baseType: !649, size: 1984, offset: 8288)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 1984, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 62)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !639, file: !511, line: 2379, baseType: !442, size: 32, offset: 10272)
!653 = !DIDerivedType(tag: DW_TAG_member, scope: !639, file: !511, line: 2381, baseType: !654, size: 32, offset: 10304)
!654 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !639, file: !511, line: 2381, size: 32, elements: !655)
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGE", scope: !654, file: !511, line: 2382, baseType: !442, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR1", scope: !654, file: !511, line: 2383, baseType: !442, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !639, file: !511, line: 2386, baseType: !442, size: 32, offset: 10336)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPCR0", scope: !639, file: !511, line: 2387, baseType: !442, size: 32, offset: 10368)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEUICR", scope: !639, file: !511, line: 2389, baseType: !442, size: 32, offset: 10400)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIAL", scope: !639, file: !511, line: 2391, baseType: !442, size: 32, offset: 10432)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !639, file: !511, line: 2393, baseType: !442, size: 32, offset: 10464)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !639, file: !511, line: 2394, baseType: !664, size: 256, offset: 10496)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 256, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 8)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !639, file: !511, line: 2395, baseType: !442, size: 32, offset: 10752)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !639, file: !511, line: 2396, baseType: !441, size: 32, offset: 10784)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !639, file: !511, line: 2397, baseType: !442, size: 32, offset: 10816)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !639, file: !511, line: 2398, baseType: !442, size: 32, offset: 10848)
!671 = !{!504, !672}
!672 = !DIGlobalVariableExpression(var: !673, expr: !DIExpression())
!673 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !628, file: !627, line: 161, type: !674, isLocal: true, isDefinition: true, align: 128)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 48, elements: !550)
!675 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !352)
!676 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf52/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !679, line: 51, size: 64, elements: !680)
!679 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!680 = !{!681, !688}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !678, file: !679, line: 60, baseType: !682, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 32)
!683 = !DISubroutineType(types: !684)
!684 = !{!103, !685}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !687)
!687 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !679, line: 48, flags: DIFlagFwdDecl)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !678, file: !679, line: 65, baseType: !685, size: 32, offset: 32)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "__init_board_init", scope: !691, file: !798, line: 36, type: !813, isLocal: true, isDefinition: true, align: 32)
!691 = distinct !DICompileUnit(language: DW_LANG_C99, file: !692, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !693, retainedTypes: !705, globals: !794, splitDebugInlining: false, nameTableKind: None)
!692 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/power_mgmt/blinky")
!693 = !{!694, !700}
!694 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !695, line: 506, baseType: !32, size: 32, elements: !696)
!695 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!696 = !{!697, !698, !699}
!697 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!698 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!699 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!700 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !695, line: 512, baseType: !32, size: 32, elements: !701)
!701 = !{!702, !703, !704}
!702 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!703 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!704 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!705 = !{!706, !783, !788, !749, !700, !694, !793, !102}
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 32)
!707 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !695, line: 523, size: 288, elements: !709)
!709 = !{!710, !739, !745, !750, !754, !755, !756, !760, !779}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !708, file: !695, line: 524, baseType: !711, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = !DISubroutineType(types: !713)
!713 = !{!103, !714, !737, !738}
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 32)
!715 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !717, line: 378, size: 224, elements: !718)
!717 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!718 = !{!719, !720, !721, !722, !729, !730, !734}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !716, file: !717, line: 380, baseType: !460, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !716, file: !717, line: 382, baseType: !13, size: 32, offset: 32)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !716, file: !717, line: 384, baseType: !13, size: 32, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !716, file: !717, line: 386, baseType: !723, size: 32, offset: 96)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 32)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !717, line: 351, size: 16, elements: !725)
!725 = !{!726, !727}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !724, file: !717, line: 359, baseType: !180, size: 8)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !724, file: !717, line: 364, baseType: !728, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!728 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !716, file: !717, line: 388, baseType: !102, size: 32, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !716, file: !717, line: 396, baseType: !731, size: 32, offset: 160)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!733 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !717, line: 43, baseType: !208)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "pm", scope: !716, file: !717, line: 403, baseType: !735, size: 32, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 32)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "pm_device", file: !717, line: 367, flags: DIFlagFwdDecl)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !695, line: 237, baseType: !180)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !695, line: 257, baseType: !161)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !708, file: !695, line: 530, baseType: !740, size: 32, offset: 32)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 32)
!741 = !DISubroutineType(types: !742)
!742 = !{!103, !714, !743}
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !695, line: 229, baseType: !161)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !708, file: !695, line: 532, baseType: !746, size: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 32)
!747 = !DISubroutineType(types: !748)
!748 = !{!103, !714, !749, !744}
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !695, line: 216, baseType: !161)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !708, file: !695, line: 535, baseType: !751, size: 32, offset: 96)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!752 = !DISubroutineType(types: !753)
!753 = !{!103, !714, !749}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !708, file: !695, line: 537, baseType: !751, size: 32, offset: 128)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !708, file: !695, line: 539, baseType: !751, size: 32, offset: 160)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !708, file: !695, line: 541, baseType: !757, size: 32, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 32)
!758 = !DISubroutineType(types: !759)
!759 = !{!103, !714, !737, !694, !700}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !708, file: !695, line: 544, baseType: !761, size: 32, offset: 224)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 32)
!762 = !DISubroutineType(types: !763)
!763 = !{!103, !714, !764, !728}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 32)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !695, line: 478, size: 96, elements: !766)
!766 = !{!767, !773, !778}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !765, file: !695, line: 482, baseType: !768, size: 32)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !149, line: 33, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !149, line: 29, size: 32, elements: !770)
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !769, file: !149, line: 30, baseType: !772, size: 32)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 32)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !765, file: !695, line: 485, baseType: !774, size: 32, offset: 32)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !695, line: 464, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 32)
!776 = !DISubroutineType(types: !777)
!777 = !{null, !714, !764, !749}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !765, file: !695, line: 493, baseType: !749, size: 32, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !708, file: !695, line: 547, baseType: !780, size: 32, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 32)
!781 = !DISubroutineType(types: !782)
!782 = !{!161, !714}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !785)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !695, line: 428, size: 32, elements: !786)
!786 = !{!787}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !785, file: !695, line: 434, baseType: !749, size: 32)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !695, line: 441, size: 32, elements: !791)
!791 = !{!792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !790, file: !695, line: 447, baseType: !749, size: 32)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 32)
!794 = !{!689, !795, !811}
!795 = !DIGlobalVariableExpression(var: !796, expr: !DIExpression())
!796 = distinct !DIGlobalVariable(name: "pull_up", scope: !797, file: !798, line: 15, type: !804, isLocal: true, isDefinition: true)
!797 = distinct !DISubprogram(name: "board_init", scope: !798, file: !798, line: 10, type: !799, scopeLine: 11, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !691, retainedNodes: !801)
!798 = !DIFile(filename: "zephyr/boards/arm/arduino_nano_33_ble/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!799 = !DISubroutineType(types: !800)
!800 = !{!103, !714}
!801 = !{!802, !803}
!802 = !DILocalVariable(name: "dev", arg: 1, scope: !797, file: !798, line: 10, type: !714)
!803 = !DILocalVariable(name: "res", scope: !797, file: !798, line: 14, type: !103)
!804 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_dt_spec", file: !695, line: 271, size: 64, elements: !806)
!806 = !{!807, !808, !809}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !805, file: !695, line: 273, baseType: !714, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pin", scope: !805, file: !695, line: 275, baseType: !737, size: 8, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "dt_flags", scope: !805, file: !695, line: 277, baseType: !810, size: 16, offset: 48)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_dt_flags_t", file: !695, line: 249, baseType: !352)
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "user_led", scope: !797, file: !798, line: 17, type: !804, isLocal: true, isDefinition: true)
!813 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !679, line: 51, size: 64, elements: !815)
!815 = !{!816, !818}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !814, file: !679, line: 60, baseType: !817, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !814, file: !679, line: 65, baseType: !714, size: 32, offset: 32)
!819 = !DIGlobalVariableExpression(var: !820, expr: !DIExpression())
!820 = distinct !DIGlobalVariable(name: "__device_dts_ord_68", scope: !821, file: !1056, line: 733, type: !1157, isLocal: false, isDefinition: true, align: 32)
!821 = distinct !DICompileUnit(language: DW_LANG_C99, file: !822, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !823, retainedTypes: !966, globals: !1052, splitDebugInlining: false, nameTableKind: None)
!822 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_nano_33_ble/boards/stm32/power_mgmt/blinky")
!823 = !{!824, !830, !30, !835, !840, !847, !855, !863, !872, !876, !931, !938, !957}
!824 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !825, line: 23, baseType: !32, size: 32, elements: !826)
!825 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!826 = !{!827, !828, !829}
!827 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!828 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!829 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!830 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !825, line: 48, baseType: !32, size: 32, elements: !831)
!831 = !{!832, !833, !834}
!832 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!833 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!834 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!835 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !836, line: 167, baseType: !32, size: 32, elements: !837)
!836 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!837 = !{!838, !839}
!838 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!839 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!840 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !836, line: 107, baseType: !32, size: 32, elements: !841)
!841 = !{!842, !843, !844, !845, !846}
!842 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 0)
!843 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 1)
!844 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Synth", value: 2)
!845 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Low_Swing", value: 131073)
!846 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal_Full_Swing", value: 196609)
!847 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !836, line: 208, baseType: !32, size: 32, elements: !848)
!848 = !{!849, !850, !851, !852, !853, !854}
!849 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!850 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!851 = !DIEnumerator(name: "NRF_CLOCK_INT_DONE_MASK", value: 8)
!852 = !DIEnumerator(name: "NRF_CLOCK_INT_CTTO_MASK", value: 16)
!853 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTARTED_MASK", value: 1024)
!854 = !DIEnumerator(name: "NRF_CLOCK_INT_CTSTOPPED_MASK", value: 2048)
!855 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !836, line: 261, baseType: !32, size: 32, elements: !856)
!856 = !{!857, !858, !859, !860, !861, !862}
!857 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!858 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!859 = !DIEnumerator(name: "NRF_CLOCK_EVENT_DONE", value: 268)
!860 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTTO", value: 272)
!861 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTARTED", value: 296)
!862 = !DIEnumerator(name: "NRF_CLOCK_EVENT_CTSTOPPED", value: 300)
!863 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !836, line: 237, baseType: !32, size: 32, elements: !864)
!864 = !{!865, !866, !867, !868, !869, !870, !871}
!865 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!866 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!867 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!868 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!869 = !DIEnumerator(name: "NRF_CLOCK_TASK_CAL", value: 16)
!870 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTART", value: 20)
!871 = !DIEnumerator(name: "NRF_CLOCK_TASK_CTSTOP", value: 24)
!872 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !836, line: 152, baseType: !32, size: 32, elements: !873)
!873 = !{!874, !875}
!874 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!875 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!876 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !511, line: 71, baseType: !103, size: 32, elements: !877)
!877 = !{!878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930}
!878 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!879 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!880 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!881 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!882 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!883 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!884 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!885 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!886 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!887 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!888 = !DIEnumerator(name: "POWER_CLOCK_IRQn", value: 0)
!889 = !DIEnumerator(name: "RADIO_IRQn", value: 1)
!890 = !DIEnumerator(name: "UARTE0_UART0_IRQn", value: 2)
!891 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_SPI0_TWI0_IRQn", value: 3)
!892 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_SPI1_TWI1_IRQn", value: 4)
!893 = !DIEnumerator(name: "NFCT_IRQn", value: 5)
!894 = !DIEnumerator(name: "GPIOTE_IRQn", value: 6)
!895 = !DIEnumerator(name: "SAADC_IRQn", value: 7)
!896 = !DIEnumerator(name: "TIMER0_IRQn", value: 8)
!897 = !DIEnumerator(name: "TIMER1_IRQn", value: 9)
!898 = !DIEnumerator(name: "TIMER2_IRQn", value: 10)
!899 = !DIEnumerator(name: "RTC0_IRQn", value: 11)
!900 = !DIEnumerator(name: "TEMP_IRQn", value: 12)
!901 = !DIEnumerator(name: "RNG_IRQn", value: 13)
!902 = !DIEnumerator(name: "ECB_IRQn", value: 14)
!903 = !DIEnumerator(name: "CCM_AAR_IRQn", value: 15)
!904 = !DIEnumerator(name: "WDT_IRQn", value: 16)
!905 = !DIEnumerator(name: "RTC1_IRQn", value: 17)
!906 = !DIEnumerator(name: "QDEC_IRQn", value: 18)
!907 = !DIEnumerator(name: "COMP_LPCOMP_IRQn", value: 19)
!908 = !DIEnumerator(name: "SWI0_EGU0_IRQn", value: 20)
!909 = !DIEnumerator(name: "SWI1_EGU1_IRQn", value: 21)
!910 = !DIEnumerator(name: "SWI2_EGU2_IRQn", value: 22)
!911 = !DIEnumerator(name: "SWI3_EGU3_IRQn", value: 23)
!912 = !DIEnumerator(name: "SWI4_EGU4_IRQn", value: 24)
!913 = !DIEnumerator(name: "SWI5_EGU5_IRQn", value: 25)
!914 = !DIEnumerator(name: "TIMER3_IRQn", value: 26)
!915 = !DIEnumerator(name: "TIMER4_IRQn", value: 27)
!916 = !DIEnumerator(name: "PWM0_IRQn", value: 28)
!917 = !DIEnumerator(name: "PDM_IRQn", value: 29)
!918 = !DIEnumerator(name: "MWU_IRQn", value: 32)
!919 = !DIEnumerator(name: "PWM1_IRQn", value: 33)
!920 = !DIEnumerator(name: "PWM2_IRQn", value: 34)
!921 = !DIEnumerator(name: "SPIM2_SPIS2_SPI2_IRQn", value: 35)
!922 = !DIEnumerator(name: "RTC2_IRQn", value: 36)
!923 = !DIEnumerator(name: "I2S_IRQn", value: 37)
!924 = !DIEnumerator(name: "FPU_IRQn", value: 38)
!925 = !DIEnumerator(name: "USBD_IRQn", value: 39)
!926 = !DIEnumerator(name: "UARTE1_IRQn", value: 40)
!927 = !DIEnumerator(name: "QSPI_IRQn", value: 41)
!928 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 42)
!929 = !DIEnumerator(name: "PWM3_IRQn", value: 45)
!930 = !DIEnumerator(name: "SPIM3_IRQn", value: 47)
!931 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !932, line: 44, baseType: !32, size: 32, elements: !933)
!932 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!933 = !{!934, !935, !936, !937}
!934 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!935 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!936 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!937 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!938 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !939, line: 54, baseType: !32, size: 32, elements: !940)
!939 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!940 = !{!941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956}
!941 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!942 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!943 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!944 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!945 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!946 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!947 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!948 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!949 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!950 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!951 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!952 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!953 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!954 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!955 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!956 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!957 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !958, line: 53, baseType: !32, size: 32, elements: !959)
!958 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!959 = !{!960, !961, !962, !963, !964, !965}
!960 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!961 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!962 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!963 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!964 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!965 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!966 = !{!824, !102, !103, !967, !1016, !1017, !1018, !1019, !139, !161, !162, !728, !589, !1020, !223, !1021, !1051, !210}
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 32)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !511, line: 1022, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !511, line: 979, size: 11712, elements: !970)
!970 = !{!971, !972, !973, !974, !975, !976, !977, !978, !982, !983, !984, !985, !986, !987, !988, !989, !990, !994, !995, !996, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !969, file: !511, line: 980, baseType: !442, size: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !969, file: !511, line: 981, baseType: !442, size: 32, offset: 32)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !969, file: !511, line: 982, baseType: !442, size: 32, offset: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !969, file: !511, line: 983, baseType: !442, size: 32, offset: 96)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CAL", scope: !969, file: !511, line: 984, baseType: !442, size: 32, offset: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTART", scope: !969, file: !511, line: 985, baseType: !442, size: 32, offset: 160)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_CTSTOP", scope: !969, file: !511, line: 986, baseType: !442, size: 32, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !969, file: !511, line: 987, baseType: !979, size: 1824, offset: 224)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 1824, elements: !980)
!980 = !{!981}
!981 = !DISubrange(count: 57)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !969, file: !511, line: 988, baseType: !442, size: 32, offset: 2048)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !969, file: !511, line: 989, baseType: !442, size: 32, offset: 2080)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !969, file: !511, line: 990, baseType: !441, size: 32, offset: 2112)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_DONE", scope: !969, file: !511, line: 991, baseType: !442, size: 32, offset: 2144)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTTO", scope: !969, file: !511, line: 992, baseType: !442, size: 32, offset: 2176)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !969, file: !511, line: 993, baseType: !620, size: 160, offset: 2208)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTARTED", scope: !969, file: !511, line: 994, baseType: !442, size: 32, offset: 2368)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_CTSTOPPED", scope: !969, file: !511, line: 996, baseType: !442, size: 32, offset: 2400)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !969, file: !511, line: 998, baseType: !991, size: 3744, offset: 2432)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 3744, elements: !992)
!992 = !{!993}
!993 = !DISubrange(count: 117)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !969, file: !511, line: 999, baseType: !442, size: 32, offset: 6176)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !969, file: !511, line: 1000, baseType: !442, size: 32, offset: 6208)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !969, file: !511, line: 1001, baseType: !997, size: 2016, offset: 6240)
!997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 2016, elements: !998)
!998 = !{!999}
!999 = !DISubrange(count: 63)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !969, file: !511, line: 1002, baseType: !441, size: 32, offset: 8256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !969, file: !511, line: 1004, baseType: !441, size: 32, offset: 8288)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !969, file: !511, line: 1005, baseType: !441, size: 32, offset: 8320)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !969, file: !511, line: 1006, baseType: !441, size: 32, offset: 8352)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !969, file: !511, line: 1008, baseType: !441, size: 32, offset: 8384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !969, file: !511, line: 1009, baseType: !441, size: 32, offset: 8416)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !969, file: !511, line: 1011, baseType: !649, size: 1984, offset: 8448)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !969, file: !511, line: 1012, baseType: !442, size: 32, offset: 10432)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !969, file: !511, line: 1013, baseType: !549, size: 96, offset: 10464)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "HFXODEBOUNCE", scope: !969, file: !511, line: 1014, baseType: !442, size: 32, offset: 10560)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED8", scope: !969, file: !511, line: 1016, baseType: !549, size: 96, offset: 10592)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "CTIV", scope: !969, file: !511, line: 1017, baseType: !442, size: 32, offset: 10688)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED9", scope: !969, file: !511, line: 1018, baseType: !664, size: 256, offset: 10720)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "TRACECONFIG", scope: !969, file: !511, line: 1019, baseType: !442, size: 32, offset: 10976)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED10", scope: !969, file: !511, line: 1020, baseType: !564, size: 672, offset: 11008)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "LFRCMODE", scope: !969, file: !511, line: 1021, baseType: !442, size: 32, offset: 11680)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !836, line: 146, baseType: !840)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !836, line: 164, baseType: !872)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !437, line: 426, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !437, line: 411, size: 28704, elements: !1024)
!1024 = !{!1025, !1027, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1042, !1046, !1050}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !1023, file: !437, line: 413, baseType: !1026, size: 256)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 256, elements: !665)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1023, file: !437, line: 414, baseType: !1028, size: 768, offset: 256)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 768, elements: !1029)
!1029 = !{!1030}
!1030 = !DISubrange(count: 24)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !1023, file: !437, line: 415, baseType: !1026, size: 256, offset: 1024)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !1023, file: !437, line: 416, baseType: !1028, size: 768, offset: 1280)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !1023, file: !437, line: 417, baseType: !1026, size: 256, offset: 2048)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1023, file: !437, line: 418, baseType: !1028, size: 768, offset: 2304)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !1023, file: !437, line: 419, baseType: !1026, size: 256, offset: 3072)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1023, file: !437, line: 420, baseType: !1028, size: 768, offset: 3328)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !1023, file: !437, line: 421, baseType: !1026, size: 256, offset: 4096)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1023, file: !437, line: 422, baseType: !1039, size: 1792, offset: 4352)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 1792, elements: !1040)
!1040 = !{!1041}
!1041 = !DISubrange(count: 56)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !1023, file: !437, line: 423, baseType: !1043, size: 1920, offset: 6144)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 1920, elements: !1044)
!1044 = !{!1045}
!1045 = !DISubrange(count: 240)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !1023, file: !437, line: 424, baseType: !1047, size: 20608, offset: 8064)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !161, size: 20608, elements: !1048)
!1048 = !{!1049}
!1049 = !DISubrange(count: 644)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !1023, file: !437, line: 425, baseType: !442, size: 32, offset: 28672)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !932, line: 56, baseType: !102)
!1052 = !{!1053, !1103, !1144, !819, !1147, !1173, !1175, !1192, !1194, !1204, !1207, !1222, !1260, !1274}
!1053 = !DIGlobalVariableExpression(var: !1054, expr: !DIExpression())
