; ModuleID = 'build/96b_meerkat96/subsys/console/echo/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.tty_serial = type { %struct.device*, %struct.k_sem, i8*, i32, i16, i16, i32, %struct.k_sem, i8*, i32, i16, i16, i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.k_fifo = type { %struct.k_queue }
%struct.k_queue = type { %struct._sflist, %struct.k_spinlock, %union.anon }
%struct._sflist = type { %struct.z_heap_bucket*, %struct.z_heap_bucket* }
%struct.z_heap_bucket = type { i32 }
%struct.k_spinlock = type {}
%struct.console_input = type { i32, i8, [128 x i8] }
%struct.pinctrl_soc_pinmux = type { i32, i32, i32, i8 }
%struct.imx_gpio_config = type { %struct.z_heap_bucket, %struct.GPIO_Type*, %struct.pinctrl_soc_pinmux*, i8 }
%struct.GPIO_Type = type { i32, i32, i32, i32, i32, i32, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/console/echo/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/console/echo")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 139, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/console/echo")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8128, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 127)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 4064, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "prompt", scope: !27, file: !105, line: 9, type: !106, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/console/echo/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/console/echo")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/samples/subsys/console/echo/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 400, elements: !109)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!109 = !{!110}
!110 = !DISubrange(count: 50)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "_char_out", scope: !113, file: !116, line: 54, type: !117, isLocal: false, isDefinition: true)
!113 = distinct !DICompileUnit(language: DW_LANG_C99, file: !114, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !115, splitDebugInlining: false, nameTableKind: None)
!114 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/console/echo")
!115 = !{!111}
!116 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DISubroutineType(types: !119)
!119 = !{!103, !103}
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "__init_nxp_mcimx7_init", scope: !122, file: !541, line: 258, type: !542, isLocal: true, isDefinition: true, align: 32)
!122 = distinct !DICompileUnit(language: DW_LANG_C99, file: !123, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !124, retainedTypes: !407, globals: !540, splitDebugInlining: false, nameTableKind: None)
!123 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/console/echo")
!124 = !{!125, !157, !167, !216, !222, !343, !378}
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_root_control", file: !126, line: 54, baseType: !32, size: 32, elements: !127)
!126 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./ccm_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156}
!128 = !DIEnumerator(name: "ccmRootM4", value: 809009280)
!129 = !DIEnumerator(name: "ccmRootAxi", value: 809011200)
!130 = !DIEnumerator(name: "ccmRootAhb", value: 809013248)
!131 = !DIEnumerator(name: "ccmRootIpg", value: 809013376)
!132 = !DIEnumerator(name: "ccmRootQspi", value: 809020032)
!133 = !DIEnumerator(name: "ccmRootCan1", value: 809020544)
!134 = !DIEnumerator(name: "ccmRootCan2", value: 809020672)
!135 = !DIEnumerator(name: "ccmRootI2c1", value: 809020800)
!136 = !DIEnumerator(name: "ccmRootI2c2", value: 809020928)
!137 = !DIEnumerator(name: "ccmRootI2c3", value: 809021056)
!138 = !DIEnumerator(name: "ccmRootI2c4", value: 809021184)
!139 = !DIEnumerator(name: "ccmRootUart1", value: 809021312)
!140 = !DIEnumerator(name: "ccmRootUart2", value: 809021440)
!141 = !DIEnumerator(name: "ccmRootUart3", value: 809021568)
!142 = !DIEnumerator(name: "ccmRootUart4", value: 809021696)
!143 = !DIEnumerator(name: "ccmRootUart5", value: 809021824)
!144 = !DIEnumerator(name: "ccmRootUart6", value: 809021952)
!145 = !DIEnumerator(name: "ccmRootUart7", value: 809022080)
!146 = !DIEnumerator(name: "ccmRootEcspi1", value: 809022208)
!147 = !DIEnumerator(name: "ccmRootEcspi2", value: 809022336)
!148 = !DIEnumerator(name: "ccmRootEcspi3", value: 809022464)
!149 = !DIEnumerator(name: "ccmRootEcspi4", value: 809022592)
!150 = !DIEnumerator(name: "ccmRootFtm1", value: 809023232)
!151 = !DIEnumerator(name: "ccmRootFtm2", value: 809023360)
!152 = !DIEnumerator(name: "ccmRootGpt1", value: 809023744)
!153 = !DIEnumerator(name: "ccmRootGpt2", value: 809023872)
!154 = !DIEnumerator(name: "ccmRootGpt3", value: 809024000)
!155 = !DIEnumerator(name: "ccmRootGpt4", value: 809024128)
!156 = !DIEnumerator(name: "ccmRootWdog", value: 809024384)
!157 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_rootmux_wdog", file: !126, line: 224, baseType: !32, size: 32, elements: !158)
!158 = !{!159, !160, !161, !162, !163, !164, !165, !166}
!159 = !DIEnumerator(name: "ccmRootmuxWdogOsc24m", value: 0)
!160 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd2Div2", value: 1)
!161 = !DIEnumerator(name: "ccmRootmuxWdogSysPllDiv4", value: 2)
!162 = !DIEnumerator(name: "ccmRootmuxWdogDdrPllDiv2", value: 3)
!163 = !DIEnumerator(name: "ccmRootmuxWdogEnetPll125m", value: 4)
!164 = !DIEnumerator(name: "ccmRootmuxWdogUsbPll", value: 5)
!165 = !DIEnumerator(name: "ccmRootmuxWdogRef1m", value: 6)
!166 = !DIEnumerator(name: "ccmRootmuxWdogSysPllPfd1Div2", value: 7)
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_ccgr_gate", file: !126, line: 275, baseType: !32, size: 32, elements: !168)
!168 = !{!169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215}
!169 = !DIEnumerator(name: "ccmCcgrGateSimWakeup", value: 808992912)
!170 = !DIEnumerator(name: "ccmCcgrGateIpmux1", value: 808992928)
!171 = !DIEnumerator(name: "ccmCcgrGateIpmux2", value: 808992944)
!172 = !DIEnumerator(name: "ccmCcgrGateIpmux3", value: 808992960)
!173 = !DIEnumerator(name: "ccmCcgrGateOcram", value: 808993040)
!174 = !DIEnumerator(name: "ccmCcgrGateOcramS", value: 808993056)
!175 = !DIEnumerator(name: "ccmCcgrGateQspi", value: 808993104)
!176 = !DIEnumerator(name: "ccmCcgrGateAdc", value: 808993280)
!177 = !DIEnumerator(name: "ccmCcgrGateRdc", value: 808993376)
!178 = !DIEnumerator(name: "ccmCcgrGateMu", value: 808993392)
!179 = !DIEnumerator(name: "ccmCcgrGateSemaHs", value: 808993408)
!180 = !DIEnumerator(name: "ccmCcgrGateSema1", value: 808993792)
!181 = !DIEnumerator(name: "ccmCcgrGateSema2", value: 808993808)
!182 = !DIEnumerator(name: "ccmCcgrGateCan1", value: 808994624)
!183 = !DIEnumerator(name: "ccmCcgrGateCan2", value: 808994640)
!184 = !DIEnumerator(name: "ccmCcgrGateEcspi1", value: 808994688)
!185 = !DIEnumerator(name: "ccmCcgrGateEcspi2", value: 808994704)
!186 = !DIEnumerator(name: "ccmCcgrGateEcspi3", value: 808994720)
!187 = !DIEnumerator(name: "ccmCcgrGateEcspi4", value: 808994736)
!188 = !DIEnumerator(name: "ccmCcgrGateGpt1", value: 808994752)
!189 = !DIEnumerator(name: "ccmCcgrGateGpt2", value: 808994768)
!190 = !DIEnumerator(name: "ccmCcgrGateGpt3", value: 808994784)
!191 = !DIEnumerator(name: "ccmCcgrGateGpt4", value: 808994800)
!192 = !DIEnumerator(name: "ccmCcgrGateI2c1", value: 808994944)
!193 = !DIEnumerator(name: "ccmCcgrGateI2c2", value: 808994960)
!194 = !DIEnumerator(name: "ccmCcgrGateI2c3", value: 808994976)
!195 = !DIEnumerator(name: "ccmCcgrGateI2c4", value: 808994992)
!196 = !DIEnumerator(name: "ccmCcgrGateUart1", value: 808995136)
!197 = !DIEnumerator(name: "ccmCcgrGateUart2", value: 808995152)
!198 = !DIEnumerator(name: "ccmCcgrGateUart3", value: 808995168)
!199 = !DIEnumerator(name: "ccmCcgrGateUart4", value: 808995184)
!200 = !DIEnumerator(name: "ccmCcgrGateUart5", value: 808995200)
!201 = !DIEnumerator(name: "ccmCcgrGateUart6", value: 808995216)
!202 = !DIEnumerator(name: "ccmCcgrGateUart7", value: 808995232)
!203 = !DIEnumerator(name: "ccmCcgrGateWdog1", value: 808995264)
!204 = !DIEnumerator(name: "ccmCcgrGateWdog2", value: 808995280)
!205 = !DIEnumerator(name: "ccmCcgrGateWdog3", value: 808995296)
!206 = !DIEnumerator(name: "ccmCcgrGateWdog4", value: 808995312)
!207 = !DIEnumerator(name: "ccmCcgrGateGpio1", value: 808995328)
!208 = !DIEnumerator(name: "ccmCcgrGateGpio2", value: 808995344)
!209 = !DIEnumerator(name: "ccmCcgrGateGpio3", value: 808995360)
!210 = !DIEnumerator(name: "ccmCcgrGateGpio4", value: 808995376)
!211 = !DIEnumerator(name: "ccmCcgrGateGpio5", value: 808995392)
!212 = !DIEnumerator(name: "ccmCcgrGateGpio6", value: 808995408)
!213 = !DIEnumerator(name: "ccmCcgrGateGpio7", value: 808995424)
!214 = !DIEnumerator(name: "ccmCcgrGateIomux", value: 808995456)
!215 = !DIEnumerator(name: "ccmCcgrGateIomuxLpsr", value: 808995472)
!216 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_gate_value", file: !126, line: 327, baseType: !32, size: 32, elements: !217)
!217 = !{!218, !219, !220, !221}
!218 = !DIEnumerator(name: "ccmClockNotNeeded", value: 0)
!219 = !DIEnumerator(name: "ccmClockNeededRun", value: 4369)
!220 = !DIEnumerator(name: "ccmClockNeededRunWait", value: 8738)
!221 = !DIEnumerator(name: "ccmClockNeededAll", value: 13107)
!222 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_pdap", file: !223, line: 76, baseType: !32, size: 32, elements: !224)
!223 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./rdc_defs_imx7d.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342}
!225 = !DIEnumerator(name: "rdcPdapGpio1", value: 0)
!226 = !DIEnumerator(name: "rdcPdapGpio2", value: 1)
!227 = !DIEnumerator(name: "rdcPdapGpio3", value: 2)
!228 = !DIEnumerator(name: "rdcPdapGpio4", value: 3)
!229 = !DIEnumerator(name: "rdcPdapGpio5", value: 4)
!230 = !DIEnumerator(name: "rdcPdapGpio6", value: 5)
!231 = !DIEnumerator(name: "rdcPdapGpio7", value: 6)
!232 = !DIEnumerator(name: "rdcPdapIomuxcLpsrGpr", value: 7)
!233 = !DIEnumerator(name: "rdcPdapWdog1", value: 8)
!234 = !DIEnumerator(name: "rdcPdapWdog2", value: 9)
!235 = !DIEnumerator(name: "rdcPdapWdog3", value: 10)
!236 = !DIEnumerator(name: "rdcPdapWdog4", value: 11)
!237 = !DIEnumerator(name: "rdcPdapIomuxcLpsr", value: 12)
!238 = !DIEnumerator(name: "rdcPdapGpt1", value: 13)
!239 = !DIEnumerator(name: "rdcPdapGpt2", value: 14)
!240 = !DIEnumerator(name: "rdcPdapGpt3", value: 15)
!241 = !DIEnumerator(name: "rdcPdapGpt4", value: 16)
!242 = !DIEnumerator(name: "rdcPdapRomcp", value: 17)
!243 = !DIEnumerator(name: "rdcPdapKpp", value: 18)
!244 = !DIEnumerator(name: "rdcPdapIomuxc", value: 19)
!245 = !DIEnumerator(name: "rdcPdapIomuxcGpr", value: 20)
!246 = !DIEnumerator(name: "rdcPdapOcotpCtrl", value: 21)
!247 = !DIEnumerator(name: "rdcPdapAnatopDig", value: 22)
!248 = !DIEnumerator(name: "rdcPdapSnvs", value: 23)
!249 = !DIEnumerator(name: "rdcPdapCcm", value: 24)
!250 = !DIEnumerator(name: "rdcPdapSrc", value: 25)
!251 = !DIEnumerator(name: "rdcPdapGpc", value: 26)
!252 = !DIEnumerator(name: "rdcPdapSemaphore1", value: 27)
!253 = !DIEnumerator(name: "rdcPdapSemaphore2", value: 28)
!254 = !DIEnumerator(name: "rdcPdapRdc", value: 29)
!255 = !DIEnumerator(name: "rdcPdapCsu", value: 30)
!256 = !DIEnumerator(name: "rdcPdapReserved1", value: 31)
!257 = !DIEnumerator(name: "rdcPdapReserved2", value: 32)
!258 = !DIEnumerator(name: "rdcPdapAdc1", value: 33)
!259 = !DIEnumerator(name: "rdcPdapAdc2", value: 34)
!260 = !DIEnumerator(name: "rdcPdapEcspi4", value: 35)
!261 = !DIEnumerator(name: "rdcPdapFlexTimer1", value: 36)
!262 = !DIEnumerator(name: "rdcPdapFlexTimer2", value: 37)
!263 = !DIEnumerator(name: "rdcPdapPwm1", value: 38)
!264 = !DIEnumerator(name: "rdcPdapPwm2", value: 39)
!265 = !DIEnumerator(name: "rdcPdapPwm3", value: 40)
!266 = !DIEnumerator(name: "rdcPdapPwm4", value: 41)
!267 = !DIEnumerator(name: "rdcPdapSystemCounterRead", value: 42)
!268 = !DIEnumerator(name: "rdcPdapSystemCounterCompare", value: 43)
!269 = !DIEnumerator(name: "rdcPdapSystemCounterControl", value: 44)
!270 = !DIEnumerator(name: "rdcPdapPcie", value: 45)
!271 = !DIEnumerator(name: "rdcPdapReserved3", value: 46)
!272 = !DIEnumerator(name: "rdcPdapEpdc", value: 47)
!273 = !DIEnumerator(name: "rdcPdapPxp", value: 48)
!274 = !DIEnumerator(name: "rdcPdapCsi", value: 49)
!275 = !DIEnumerator(name: "rdcPdapReserved4", value: 50)
!276 = !DIEnumerator(name: "rdcPdapLcdif", value: 51)
!277 = !DIEnumerator(name: "rdcPdapReserved5", value: 52)
!278 = !DIEnumerator(name: "rdcPdapMipiCsi", value: 53)
!279 = !DIEnumerator(name: "rdcPdapMipiDsi", value: 54)
!280 = !DIEnumerator(name: "rdcPdapReserved6", value: 55)
!281 = !DIEnumerator(name: "rdcPdapTzasc", value: 56)
!282 = !DIEnumerator(name: "rdcPdapDdrPhy", value: 57)
!283 = !DIEnumerator(name: "rdcPdapDdrc", value: 58)
!284 = !DIEnumerator(name: "rdcPdapReserved7", value: 59)
!285 = !DIEnumerator(name: "rdcPdapPerfMon1", value: 60)
!286 = !DIEnumerator(name: "rdcPdapPerfMon2", value: 61)
!287 = !DIEnumerator(name: "rdcPdapAxi", value: 62)
!288 = !DIEnumerator(name: "rdcPdapQosc", value: 63)
!289 = !DIEnumerator(name: "rdcPdapFlexCan1", value: 64)
!290 = !DIEnumerator(name: "rdcPdapFlexCan2", value: 65)
!291 = !DIEnumerator(name: "rdcPdapI2c1", value: 66)
!292 = !DIEnumerator(name: "rdcPdapI2c2", value: 67)
!293 = !DIEnumerator(name: "rdcPdapI2c3", value: 68)
!294 = !DIEnumerator(name: "rdcPdapI2c4", value: 69)
!295 = !DIEnumerator(name: "rdcPdapUart4", value: 70)
!296 = !DIEnumerator(name: "rdcPdapUart5", value: 71)
!297 = !DIEnumerator(name: "rdcPdapUart6", value: 72)
!298 = !DIEnumerator(name: "rdcPdapUart7", value: 73)
!299 = !DIEnumerator(name: "rdcPdapMuA", value: 74)
!300 = !DIEnumerator(name: "rdcPdapMuB", value: 75)
!301 = !DIEnumerator(name: "rdcPdapSemaphoreHs", value: 76)
!302 = !DIEnumerator(name: "rdcPdapUsbPl301", value: 77)
!303 = !DIEnumerator(name: "rdcPdapReserved8", value: 78)
!304 = !DIEnumerator(name: "rdcPdapReserved9", value: 79)
!305 = !DIEnumerator(name: "rdcPdapReserved10", value: 80)
!306 = !DIEnumerator(name: "rdcPdapUSB1Otg1", value: 81)
!307 = !DIEnumerator(name: "rdcPdapUSB2Otg2", value: 82)
!308 = !DIEnumerator(name: "rdcPdapUSB3Host", value: 83)
!309 = !DIEnumerator(name: "rdcPdapUsdhc1", value: 84)
!310 = !DIEnumerator(name: "rdcPdapUsdhc2", value: 85)
!311 = !DIEnumerator(name: "rdcPdapUsdhc3", value: 86)
!312 = !DIEnumerator(name: "rdcPdapReserved11", value: 87)
!313 = !DIEnumerator(name: "rdcPdapReserved12", value: 88)
!314 = !DIEnumerator(name: "rdcPdapSim1", value: 89)
!315 = !DIEnumerator(name: "rdcPdapSim2", value: 90)
!316 = !DIEnumerator(name: "rdcPdapQspi", value: 91)
!317 = !DIEnumerator(name: "rdcPdapWeim", value: 92)
!318 = !DIEnumerator(name: "rdcPdapSdma", value: 93)
!319 = !DIEnumerator(name: "rdcPdapEnet1", value: 94)
!320 = !DIEnumerator(name: "rdcPdapEnet2", value: 95)
!321 = !DIEnumerator(name: "rdcPdapReserved13", value: 96)
!322 = !DIEnumerator(name: "rdcPdapReserved14", value: 97)
!323 = !DIEnumerator(name: "rdcPdapEcspi1", value: 98)
!324 = !DIEnumerator(name: "rdcPdapEcspi2", value: 99)
!325 = !DIEnumerator(name: "rdcPdapEcspi3", value: 100)
!326 = !DIEnumerator(name: "rdcPdapReserved15", value: 101)
!327 = !DIEnumerator(name: "rdcPdapUart1", value: 102)
!328 = !DIEnumerator(name: "rdcPdapReserved16", value: 103)
!329 = !DIEnumerator(name: "rdcPdapUart3", value: 104)
!330 = !DIEnumerator(name: "rdcPdapUart2", value: 105)
!331 = !DIEnumerator(name: "rdcPdapSai1", value: 106)
!332 = !DIEnumerator(name: "rdcPdapSai2", value: 107)
!333 = !DIEnumerator(name: "rdcPdapSai3", value: 108)
!334 = !DIEnumerator(name: "rdcPdapReserved17", value: 109)
!335 = !DIEnumerator(name: "rdcPdapReserved18", value: 110)
!336 = !DIEnumerator(name: "rdcPdapSpba", value: 111)
!337 = !DIEnumerator(name: "rdcPdapDap", value: 112)
!338 = !DIEnumerator(name: "rdcPdapReserved19", value: 113)
!339 = !DIEnumerator(name: "rdcPdapReserved20", value: 114)
!340 = !DIEnumerator(name: "rdcPdapReserved21", value: 115)
!341 = !DIEnumerator(name: "rdcPdapCaam", value: 116)
!342 = !DIEnumerator(name: "rdcPdapReserved22", value: 117)
!343 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_ccm_pll_gate", file: !126, line: 237, baseType: !32, size: 32, elements: !344)
!344 = !{!345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377}
!345 = !DIEnumerator(name: "ccmPllGateCkil", value: 808978432)
!346 = !DIEnumerator(name: "ccmPllGateArm", value: 808978448)
!347 = !DIEnumerator(name: "ccmPllGateArmDiv1", value: 808978464)
!348 = !DIEnumerator(name: "ccmPllGateDdr", value: 808978480)
!349 = !DIEnumerator(name: "ccmPllGateDdrDiv1", value: 808978496)
!350 = !DIEnumerator(name: "ccmPllGateDdrDiv2", value: 808978512)
!351 = !DIEnumerator(name: "ccmPllGateSys", value: 808978528)
!352 = !DIEnumerator(name: "ccmPllGateSysDiv1", value: 808978544)
!353 = !DIEnumerator(name: "ccmPllGateSysDiv2", value: 808978560)
!354 = !DIEnumerator(name: "ccmPllGateSysDiv4", value: 808978576)
!355 = !DIEnumerator(name: "ccmPllGatePfd0", value: 808978592)
!356 = !DIEnumerator(name: "ccmPllGatePfd0Div2", value: 808978608)
!357 = !DIEnumerator(name: "ccmPllGatePfd1", value: 808978624)
!358 = !DIEnumerator(name: "ccmPllGatePfd1Div2", value: 808978640)
!359 = !DIEnumerator(name: "ccmPllGatePfd2", value: 808978656)
!360 = !DIEnumerator(name: "ccmPllGatePfd2Div2", value: 808978672)
!361 = !DIEnumerator(name: "ccmPllGatePfd3", value: 808978688)
!362 = !DIEnumerator(name: "ccmPllGatePfd4", value: 808978704)
!363 = !DIEnumerator(name: "ccmPllGatePfd5", value: 808978720)
!364 = !DIEnumerator(name: "ccmPllGatePfd6", value: 808978736)
!365 = !DIEnumerator(name: "ccmPllGatePfd7", value: 808978752)
!366 = !DIEnumerator(name: "ccmPllGateEnet", value: 808978768)
!367 = !DIEnumerator(name: "ccmPllGateEnet500m", value: 808978784)
!368 = !DIEnumerator(name: "ccmPllGateEnet250m", value: 808978800)
!369 = !DIEnumerator(name: "ccmPllGateEnet125m", value: 808978816)
!370 = !DIEnumerator(name: "ccmPllGateEnet100m", value: 808978832)
!371 = !DIEnumerator(name: "ccmPllGateEnet50m", value: 808978848)
!372 = !DIEnumerator(name: "ccmPllGateEnet40m", value: 808978864)
!373 = !DIEnumerator(name: "ccmPllGateEnet25m", value: 808978880)
!374 = !DIEnumerator(name: "ccmPllGateAudio", value: 808978896)
!375 = !DIEnumerator(name: "ccmPllGateAudioDiv1", value: 808978912)
!376 = !DIEnumerator(name: "ccmPllGateVideo", value: 808978928)
!377 = !DIEnumerator(name: "ccmPllGateVideoDiv1", value: 808978944)
!378 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_rdc_mda", file: !223, line: 44, baseType: !32, size: 32, elements: !379)
!379 = !{!380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!380 = !DIEnumerator(name: "rdcMdaA7", value: 0)
!381 = !DIEnumerator(name: "rdcMdaM4", value: 1)
!382 = !DIEnumerator(name: "rdcMdaPcie", value: 2)
!383 = !DIEnumerator(name: "rdcMdaCsi", value: 3)
!384 = !DIEnumerator(name: "rdcMdaEpdc", value: 4)
!385 = !DIEnumerator(name: "rdcMdaLcdif", value: 5)
!386 = !DIEnumerator(name: "rdcMdaDisplayPort", value: 6)
!387 = !DIEnumerator(name: "rdcMdaPxp", value: 7)
!388 = !DIEnumerator(name: "rdcMdaCoresight", value: 8)
!389 = !DIEnumerator(name: "rdcMdaDap", value: 9)
!390 = !DIEnumerator(name: "rdcMdaCaam", value: 10)
!391 = !DIEnumerator(name: "rdcMdaSdmaPeriph", value: 11)
!392 = !DIEnumerator(name: "rdcMdaSdmaBurst", value: 12)
!393 = !DIEnumerator(name: "rdcMdaApbhdma", value: 13)
!394 = !DIEnumerator(name: "rdcMdaRawnand", value: 14)
!395 = !DIEnumerator(name: "rdcMdaUsdhc1", value: 15)
!396 = !DIEnumerator(name: "rdcMdaUsdhc2", value: 16)
!397 = !DIEnumerator(name: "rdcMdaUsdhc3", value: 17)
!398 = !DIEnumerator(name: "rdcMdaNc1", value: 18)
!399 = !DIEnumerator(name: "rdcMdaUsb", value: 19)
!400 = !DIEnumerator(name: "rdcMdaNc2", value: 20)
!401 = !DIEnumerator(name: "rdcMdaTest", value: 21)
!402 = !DIEnumerator(name: "rdcMdaEnet1Tx", value: 22)
!403 = !DIEnumerator(name: "rdcMdaEnet1Rx", value: 23)
!404 = !DIEnumerator(name: "rdcMdaEnet2Tx", value: 24)
!405 = !DIEnumerator(name: "rdcMdaEnet2Rx", value: 25)
!406 = !DIEnumerator(name: "rdcMdaSdmaPort", value: 26)
!407 = !{!408, !483, !526, !539, !415}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "CCM_Type", file: !410, line: 4575, baseType: !411)
!410 = !DIFile(filename: "modules/hal/nxp/imx/devices/MCIMX7D/./MCIMX7D_M4.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !410, line: 4532, size: 390144, elements: !412)
!412 = !{!413, !416, !417, !418, !419, !425, !435, !439, !449, !453}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0", scope: !411, file: !410, line: 4533, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_SET", scope: !411, file: !410, line: 4534, baseType: !414, size: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_CLR", scope: !411, file: !410, line: 4535, baseType: !414, size: 32, offset: 64)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "GPR0_TOG", scope: !411, file: !410, line: 4536, baseType: !414, size: 32, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !411, file: !410, line: 4537, baseType: !420, size: 16256, offset: 128)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 16256, elements: !423)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !422)
!422 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!423 = !{!424}
!424 = !DISubrange(count: 2032)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !411, file: !410, line: 4543, baseType: !426, size: 4224, offset: 16384)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 4224, elements: !433)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !411, file: !410, line: 4538, size: 128, elements: !428)
!428 = !{!429, !430, !431, !432}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL", scope: !427, file: !410, line: 4539, baseType: !414, size: 32)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_SET", scope: !427, file: !410, line: 4540, baseType: !414, size: 32, offset: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_CLR", scope: !427, file: !410, line: 4541, baseType: !414, size: 32, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "PLL_CTRL_TOG", scope: !427, file: !410, line: 4542, baseType: !414, size: 32, offset: 96)
!433 = !{!434}
!434 = !DISubrange(count: 33)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !411, file: !410, line: 4544, baseType: !436, size: 110464, offset: 20608)
!436 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 110464, elements: !437)
!437 = !{!438}
!438 = !DISubrange(count: 13808)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !411, file: !410, line: 4550, baseType: !440, size: 24448, offset: 131072)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 24448, elements: !447)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !411, file: !410, line: 4545, size: 128, elements: !442)
!442 = !{!443, !444, !445, !446}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR", scope: !441, file: !410, line: 4546, baseType: !414, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_SET", scope: !441, file: !410, line: 4547, baseType: !414, size: 32, offset: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_CLR", scope: !441, file: !410, line: 4548, baseType: !414, size: 32, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "CCGR_TOG", scope: !441, file: !410, line: 4549, baseType: !414, size: 32, offset: 96)
!447 = !{!448}
!448 = !DISubrange(count: 191)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !411, file: !410, line: 4551, baseType: !450, size: 106624, offset: 155520)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 106624, elements: !451)
!451 = !{!452}
!452 = !DISubrange(count: 13328)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !411, file: !410, line: 4574, baseType: !454, size: 128000, offset: 262144)
!454 = !DICompositeType(tag: DW_TAG_array_type, baseType: !455, size: 128000, elements: !481)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !411, file: !410, line: 4552, size: 1024, elements: !456)
!456 = !{!457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !477, !478, !479, !480}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT", scope: !455, file: !410, line: 4553, baseType: !414, size: 32)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_SET", scope: !455, file: !410, line: 4554, baseType: !414, size: 32, offset: 32)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_CLR", scope: !455, file: !410, line: 4555, baseType: !414, size: 32, offset: 64)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "TARGET_ROOT_TOG", scope: !455, file: !410, line: 4556, baseType: !414, size: 32, offset: 96)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "MISC", scope: !455, file: !410, line: 4557, baseType: !414, size: 32, offset: 128)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_SET", scope: !455, file: !410, line: 4558, baseType: !414, size: 32, offset: 160)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_CLR", scope: !455, file: !410, line: 4559, baseType: !414, size: 32, offset: 192)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "MISC_ROOT_TOG", scope: !455, file: !410, line: 4560, baseType: !414, size: 32, offset: 224)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "POST", scope: !455, file: !410, line: 4561, baseType: !414, size: 32, offset: 256)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_SET", scope: !455, file: !410, line: 4562, baseType: !414, size: 32, offset: 288)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_CLR", scope: !455, file: !410, line: 4563, baseType: !414, size: 32, offset: 320)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "POST_ROOT_TOG", scope: !455, file: !410, line: 4564, baseType: !414, size: 32, offset: 352)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "PRE", scope: !455, file: !410, line: 4565, baseType: !414, size: 32, offset: 384)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_SET", scope: !455, file: !410, line: 4566, baseType: !414, size: 32, offset: 416)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_CLR", scope: !455, file: !410, line: 4567, baseType: !414, size: 32, offset: 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "PRE_ROOT_TOG", scope: !455, file: !410, line: 4568, baseType: !414, size: 32, offset: 480)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !455, file: !410, line: 4569, baseType: !474, size: 384, offset: 512)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 384, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 48)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL", scope: !455, file: !410, line: 4570, baseType: !414, size: 32, offset: 896)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_SET", scope: !455, file: !410, line: 4571, baseType: !414, size: 32, offset: 928)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_CLR", scope: !455, file: !410, line: 4572, baseType: !414, size: 32, offset: 960)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "ACCESS_CTRL_ROOT_TOG", scope: !455, file: !410, line: 4573, baseType: !414, size: 32, offset: 992)
!481 = !{!482}
!482 = !DISubrange(count: 125)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 32)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "RDC_Type", file: !410, line: 38320, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !410, line: 38303, size: 23040, elements: !486)
!486 = !{!487, !489, !493, !494, !495, !496, !500, !504, !508, !512, !516}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "VIR", scope: !485, file: !410, line: 38304, baseType: !488, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !414)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_0", scope: !485, file: !410, line: 38305, baseType: !490, size: 256, offset: 32)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 256, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "STAT", scope: !485, file: !410, line: 38306, baseType: !414, size: 32, offset: 288)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "INTCTRL", scope: !485, file: !410, line: 38307, baseType: !414, size: 32, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "INTSTAT", scope: !485, file: !410, line: 38308, baseType: !414, size: 32, offset: 352)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_1", scope: !485, file: !410, line: 38309, baseType: !497, size: 3712, offset: 384)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 3712, elements: !498)
!498 = !{!499}
!499 = !DISubrange(count: 464)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "MDA", scope: !485, file: !410, line: 38310, baseType: !501, size: 864, offset: 4096)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 864, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 27)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_2", scope: !485, file: !410, line: 38311, baseType: !505, size: 3232, offset: 4960)
!505 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 3232, elements: !506)
!506 = !{!507}
!507 = !DISubrange(count: 404)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "PDAP", scope: !485, file: !410, line: 38312, baseType: !509, size: 3776, offset: 8192)
!509 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 3776, elements: !510)
!510 = !{!511}
!511 = !DISubrange(count: 118)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED_3", scope: !485, file: !410, line: 38313, baseType: !513, size: 4416, offset: 11968)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 4416, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 552)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "MR", scope: !485, file: !410, line: 38319, baseType: !517, size: 6656, offset: 16384)
!517 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 6656, elements: !524)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !485, file: !410, line: 38314, size: 128, elements: !519)
!519 = !{!520, !521, !522, !523}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "MRSA", scope: !518, file: !410, line: 38315, baseType: !414, size: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "MREA", scope: !518, file: !410, line: 38316, baseType: !414, size: 32, offset: 32)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "MRC", scope: !518, file: !410, line: 38317, baseType: !414, size: 32, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "MRVS", scope: !518, file: !410, line: 38318, baseType: !414, size: 32, offset: 96)
!524 = !{!525}
!525 = !DISubrange(count: 52)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "WDOG_Type", file: !410, line: 43319, baseType: !528)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !410, line: 43313, size: 80, elements: !529)
!529 = !{!530, !534, !535, !537, !538}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "WCR", scope: !528, file: !410, line: 43314, baseType: !531, size: 16)
!531 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !533)
!533 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "WSR", scope: !528, file: !410, line: 43315, baseType: !531, size: 16, offset: 16)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "WRSR", scope: !528, file: !410, line: 43316, baseType: !536, size: 16, offset: 32)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !531)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "WICR", scope: !528, file: !410, line: 43317, baseType: !531, size: 16, offset: 48)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "WMCR", scope: !528, file: !410, line: 43318, baseType: !531, size: 16, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!540 = !{!120}
!541 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!542 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !543)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !544, line: 51, size: 64, elements: !545)
!544 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!545 = !{!546, !553}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !543, file: !544, line: 60, baseType: !547, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 32)
!548 = !DISubroutineType(types: !549)
!549 = !{!103, !550}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!551 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !552)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !544, line: 48, flags: DIFlagFwdDecl)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !543, file: !544, line: 65, baseType: !550, size: 32, offset: 32)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "console_serial", scope: !556, file: !655, line: 13, type: !664, isLocal: true, isDefinition: true)
!556 = distinct !DICompileUnit(language: DW_LANG_C99, file: !557, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !558, globals: !652, splitDebugInlining: false, nameTableKind: None)
!557 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/console/getchar.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/console/echo")
!558 = !{!559, !102, !103}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !562, line: 336, size: 608, elements: !563)
!562 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!563 = !{!564, !592, !596, !600, !613, !618, !624, !630, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !561, file: !562, line: 365, baseType: !565, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 32)
!566 = !DISubroutineType(types: !567)
!567 = !{!103, !568, !591}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !571, line: 378, size: 192, elements: !572)
!571 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!572 = !{!573, !575, !576, !577, !584, !585}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !570, file: !571, line: 380, baseType: !574, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !570, file: !571, line: 382, baseType: !13, size: 32, offset: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !570, file: !571, line: 384, baseType: !13, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !570, file: !571, line: 386, baseType: !578, size: 32, offset: 96)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !571, line: 351, size: 16, elements: !580)
!580 = !{!581, !582}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !579, file: !571, line: 359, baseType: !421, size: 8)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !579, file: !571, line: 364, baseType: !583, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!583 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !570, file: !571, line: 388, baseType: !102, size: 32, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !570, file: !571, line: 396, baseType: !586, size: 32, offset: 160)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !571, line: 43, baseType: !589)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !590)
!590 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !561, file: !562, line: 366, baseType: !593, size: 32, offset: 32)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 32)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !568, !422}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !561, file: !562, line: 374, baseType: !597, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 32)
!598 = !DISubroutineType(types: !599)
!599 = !{!103, !568}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !561, file: !562, line: 377, baseType: !601, size: 32, offset: 96)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 32)
!602 = !DISubroutineType(types: !603)
!603 = !{!103, !568, !604}
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !606)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !562, line: 122, size: 64, elements: !607)
!607 = !{!608, !609, !610, !611, !612}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !606, file: !562, line: 123, baseType: !415, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !606, file: !562, line: 124, baseType: !421, size: 8, offset: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !606, file: !562, line: 125, baseType: !421, size: 8, offset: 40)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !606, file: !562, line: 126, baseType: !421, size: 8, offset: 48)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !606, file: !562, line: 127, baseType: !421, size: 8, offset: 56)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !561, file: !562, line: 379, baseType: !614, size: 32, offset: 128)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 32)
!615 = !DISubroutineType(types: !616)
!616 = !{!103, !568, !617}
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !561, file: !562, line: 384, baseType: !619, size: 32, offset: 160)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!620 = !DISubroutineType(types: !621)
!621 = !{!103, !568, !622, !103}
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !421)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !561, file: !562, line: 393, baseType: !625, size: 32, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 32)
!626 = !DISubroutineType(types: !627)
!627 = !{!103, !568, !628, !629}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !561, file: !562, line: 402, baseType: !631, size: 32, offset: 224)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 32)
!632 = !DISubroutineType(types: !633)
!633 = !{null, !568}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !561, file: !562, line: 405, baseType: !631, size: 32, offset: 256)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !561, file: !562, line: 408, baseType: !597, size: 32, offset: 288)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !561, file: !562, line: 411, baseType: !631, size: 32, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !561, file: !562, line: 414, baseType: !631, size: 32, offset: 352)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !561, file: !562, line: 417, baseType: !597, size: 32, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !561, file: !562, line: 420, baseType: !597, size: 32, offset: 416)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !561, file: !562, line: 423, baseType: !631, size: 32, offset: 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !561, file: !562, line: 426, baseType: !631, size: 32, offset: 480)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !561, file: !562, line: 429, baseType: !597, size: 32, offset: 512)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !561, file: !562, line: 432, baseType: !597, size: 32, offset: 544)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !561, file: !562, line: 435, baseType: !645, size: 32, offset: 576)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 32)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !568, !648, !102}
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !562, line: 142, baseType: !649)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 32)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !568, !102}
!652 = !{!554, !653, !659}
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "console_rxbuf", scope: !556, file: !655, line: 15, type: !656, isLocal: true, isDefinition: true)
!655 = !DIFile(filename: "zephyr/subsys/console/getchar.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 512, elements: !657)
!657 = !{!658}
!658 = !DISubrange(count: 64)
!659 = !DIGlobalVariableExpression(var: !660, expr: !DIExpression())
!660 = distinct !DIGlobalVariable(name: "console_txbuf", scope: !556, file: !655, line: 16, type: !661, isLocal: true, isDefinition: true)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 4096, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 512)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tty_serial", file: !665, line: 18, size: 544, elements: !666)
!665 = !DIFile(filename: "zephyr/include/zephyr/console/tty.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!666 = !{!667, !668, !695, !696, !697, !698, !699, !701, !702, !703, !704, !705, !706}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "uart_dev", scope: !664, file: !665, line: 19, baseType: !568, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "rx_sem", scope: !664, file: !665, line: 21, baseType: !669, size: 128, offset: 32)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !670, line: 2909, size: 128, elements: !671)
!670 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!671 = !{!672, !693, !694}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !669, file: !670, line: 2910, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !674, line: 233, baseType: !675)
!674 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !674, line: 231, size: 64, elements: !676)
!676 = !{!677}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !675, file: !674, line: 232, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !679, line: 48, baseType: !680)
!679 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !679, line: 37, size: 64, elements: !681)
!681 = !{!682, !688}
!682 = !DIDerivedType(tag: DW_TAG_member, scope: !680, file: !679, line: 38, baseType: !683, size: 32)
!683 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !680, file: !679, line: 38, size: 32, elements: !684)
!684 = !{!685, !687}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !683, file: !679, line: 39, baseType: !686, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !683, file: !679, line: 40, baseType: !686, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, scope: !680, file: !679, line: 42, baseType: !689, size: 32, offset: 32)
!689 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !680, file: !679, line: 42, size: 32, elements: !690)
!690 = !{!691, !692}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !689, file: !679, line: 43, baseType: !686, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !689, file: !679, line: 44, baseType: !686, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !669, file: !670, line: 2911, baseType: !32, size: 32, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !669, file: !670, line: 2912, baseType: !32, size: 32, offset: 96)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "rx_ringbuf", scope: !664, file: !665, line: 22, baseType: !628, size: 32, offset: 160)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "rx_ringbuf_sz", scope: !664, file: !665, line: 23, baseType: !415, size: 32, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "rx_get", scope: !664, file: !665, line: 24, baseType: !532, size: 16, offset: 224)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rx_put", scope: !664, file: !665, line: 24, baseType: !532, size: 16, offset: 240)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "rx_timeout", scope: !664, file: !665, line: 25, baseType: !700, size: 32, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "tx_sem", scope: !664, file: !665, line: 27, baseType: !669, size: 128, offset: 288)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ringbuf", scope: !664, file: !665, line: 28, baseType: !628, size: 32, offset: 416)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ringbuf_sz", scope: !664, file: !665, line: 29, baseType: !415, size: 32, offset: 448)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "tx_get", scope: !664, file: !665, line: 30, baseType: !532, size: 16, offset: 480)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "tx_put", scope: !664, file: !665, line: 30, baseType: !532, size: 16, offset: 496)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "tx_timeout", scope: !664, file: !665, line: 31, baseType: !700, size: 32, offset: 512)
!707 = !DIGlobalVariableExpression(var: !708, expr: !DIExpression())
!708 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !709, file: !716, line: 21, type: !117, isLocal: true, isDefinition: true)
!709 = distinct !DICompileUnit(language: DW_LANG_C99, file: !710, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !711, globals: !715, splitDebugInlining: false, nameTableKind: None)
!710 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/console/echo")
!711 = !{!712, !103, !102}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !714, line: 22, baseType: !103)
!714 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!715 = !{!707}
!716 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!717 = !DIGlobalVariableExpression(var: !718, expr: !DIExpression())
!718 = distinct !DIGlobalVariable(name: "debug_hook_in", scope: !719, file: !723, line: 43, type: !917, isLocal: true, isDefinition: true)
!719 = distinct !DICompileUnit(language: DW_LANG_C99, file: !720, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !721, retainedTypes: !730, globals: !810, splitDebugInlining: false, nameTableKind: None)
!720 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/console/echo")
!721 = !{!30, !722}
!722 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !723, line: 214, baseType: !32, size: 32, elements: !724)
!723 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!724 = !{!725, !726, !727, !728, !729}
!725 = !DIEnumerator(name: "ESC_ESC", value: 0)
!726 = !DIEnumerator(name: "ESC_ANSI", value: 1)
!727 = !DIEnumerator(name: "ESC_ANSI_FIRST", value: 2)
!728 = !DIEnumerator(name: "ESC_ANSI_VAL", value: 3)
!729 = !DIEnumerator(name: "ESC_ANSI_VAL_2", value: 4)
!730 = !{!102, !103, !731, !32, !24}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 32)
!732 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !562, line: 336, size: 608, elements: !734)
!734 = !{!735, !754, !758, !762, !775, !780, !784, !788, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !733, file: !562, line: 365, baseType: !736, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 32)
!737 = !DISubroutineType(types: !738)
!738 = !{!103, !739, !591}
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !571, line: 378, size: 192, elements: !742)
!742 = !{!743, !744, !745, !746, !752, !753}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !741, file: !571, line: 380, baseType: !574, size: 32)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !741, file: !571, line: 382, baseType: !13, size: 32, offset: 32)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !741, file: !571, line: 384, baseType: !13, size: 32, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !741, file: !571, line: 386, baseType: !747, size: 32, offset: 96)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 32)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !571, line: 351, size: 16, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !748, file: !571, line: 359, baseType: !421, size: 8)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !748, file: !571, line: 364, baseType: !583, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !741, file: !571, line: 388, baseType: !102, size: 32, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !741, file: !571, line: 396, baseType: !586, size: 32, offset: 160)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !733, file: !562, line: 366, baseType: !755, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 32)
!756 = !DISubroutineType(types: !757)
!757 = !{null, !739, !422}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !733, file: !562, line: 374, baseType: !759, size: 32, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 32)
!760 = !DISubroutineType(types: !761)
!761 = !{!103, !739}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !733, file: !562, line: 377, baseType: !763, size: 32, offset: 96)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 32)
!764 = !DISubroutineType(types: !765)
!765 = !{!103, !739, !766}
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 32)
!767 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !562, line: 122, size: 64, elements: !769)
!769 = !{!770, !771, !772, !773, !774}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !768, file: !562, line: 123, baseType: !415, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !768, file: !562, line: 124, baseType: !421, size: 8, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !768, file: !562, line: 125, baseType: !421, size: 8, offset: 40)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !768, file: !562, line: 126, baseType: !421, size: 8, offset: 48)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !768, file: !562, line: 127, baseType: !421, size: 8, offset: 56)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !733, file: !562, line: 379, baseType: !776, size: 32, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 32)
!777 = !DISubroutineType(types: !778)
!778 = !{!103, !739, !779}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !733, file: !562, line: 384, baseType: !781, size: 32, offset: 160)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 32)
!782 = !DISubroutineType(types: !783)
!783 = !{!103, !739, !622, !103}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !733, file: !562, line: 393, baseType: !785, size: 32, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 32)
!786 = !DISubroutineType(types: !787)
!787 = !{!103, !739, !628, !629}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !733, file: !562, line: 402, baseType: !789, size: 32, offset: 224)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 32)
!790 = !DISubroutineType(types: !791)
!791 = !{null, !739}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !733, file: !562, line: 405, baseType: !789, size: 32, offset: 256)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !733, file: !562, line: 408, baseType: !759, size: 32, offset: 288)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !733, file: !562, line: 411, baseType: !789, size: 32, offset: 320)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !733, file: !562, line: 414, baseType: !789, size: 32, offset: 352)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !733, file: !562, line: 417, baseType: !759, size: 32, offset: 384)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !733, file: !562, line: 420, baseType: !759, size: 32, offset: 416)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !733, file: !562, line: 423, baseType: !789, size: 32, offset: 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !733, file: !562, line: 426, baseType: !789, size: 32, offset: 480)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !733, file: !562, line: 429, baseType: !759, size: 32, offset: 512)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !733, file: !562, line: 432, baseType: !759, size: 32, offset: 544)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !733, file: !562, line: 435, baseType: !803, size: 32, offset: 576)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!804 = !DISubroutineType(types: !805)
!805 = !{null, !739, !806, !102}
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !562, line: 142, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 32)
!808 = !DISubroutineType(types: !809)
!809 = !{null, !739, !102}
!810 = !{!811, !717, !818, !862, !864, !870, !877, !880, !905, !909, !911, !913, !915}
!811 = !DIGlobalVariableExpression(var: !812, expr: !DIExpression())
!812 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !719, file: !723, line: 603, type: !813, isLocal: true, isDefinition: true, align: 32)
!813 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !814)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !544, line: 51, size: 64, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !814, file: !544, line: 60, baseType: !759, size: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !814, file: !544, line: 65, baseType: !739, size: 32, offset: 32)
!818 = !DIGlobalVariableExpression(var: !819, expr: !DIExpression())
!819 = distinct !DIGlobalVariable(name: "avail_queue", scope: !719, file: !723, line: 108, type: !820, isLocal: true, isDefinition: true)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 32)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_fifo", file: !670, line: 2208, size: 128, elements: !822)
!822 = !{!823}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "_queue", scope: !821, file: !670, line: 2209, baseType: !824, size: 128)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_queue", file: !670, line: 1709, size: 128, elements: !825)
!825 = !{!826, !839, !843}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "data_q", scope: !824, file: !670, line: 1710, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sflist_t", file: !828, line: 46, baseType: !829)
!828 = !DIFile(filename: "zephyr/include/zephyr/sys/sflist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sflist", file: !828, line: 41, size: 64, elements: !830)
!830 = !{!831, !838}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !829, file: !828, line: 42, baseType: !832, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_sfnode_t", file: !828, line: 39, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_sfnode", file: !828, line: 35, size: 32, elements: !835)
!835 = !{!836}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "next_and_flags", scope: !834, file: !828, line: 36, baseType: !837, size: 32)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "unative_t", file: !828, line: 32, baseType: !415)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !829, file: !828, line: 43, baseType: !832, size: 32, offset: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !824, file: !670, line: 1711, baseType: !840, offset: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !841, line: 43, elements: !842)
!841 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!842 = !{}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !824, file: !670, line: 1712, baseType: !844, size: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !674, line: 233, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !674, line: 231, size: 64, elements: !846)
!846 = !{!847}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !845, file: !674, line: 232, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !679, line: 48, baseType: !849)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !679, line: 37, size: 64, elements: !850)
!850 = !{!851, !857}
!851 = !DIDerivedType(tag: DW_TAG_member, scope: !849, file: !679, line: 38, baseType: !852, size: 32)
!852 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !849, file: !679, line: 38, size: 32, elements: !853)
!853 = !{!854, !856}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !852, file: !679, line: 39, baseType: !855, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !852, file: !679, line: 40, baseType: !855, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_member, scope: !849, file: !679, line: 42, baseType: !858, size: 32, offset: 32)
!858 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !849, file: !679, line: 42, size: 32, elements: !859)
!859 = !{!860, !861}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !858, file: !679, line: 43, baseType: !855, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !858, file: !679, line: 44, baseType: !855, size: 32)
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "lines_queue", scope: !719, file: !723, line: 109, type: !820, isLocal: true, isDefinition: true)
!864 = !DIGlobalVariableExpression(var: !865, expr: !DIExpression())
!865 = distinct !DIGlobalVariable(name: "completion_cb", scope: !719, file: !723, line: 110, type: !866, isLocal: true, isDefinition: true)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 32)
!867 = !DISubroutineType(types: !868)
!868 = !{!421, !869, !421}
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 32)
!870 = !DIGlobalVariableExpression(var: !871, expr: !DIExpression())
!871 = distinct !DIGlobalVariable(name: "debug_hook_out", scope: !719, file: !723, line: 54, type: !872, isLocal: true, isDefinition: true)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 32)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_console_out_debug_hook_t", file: !874, line: 40, baseType: !875)
!874 = !DIFile(filename: "zephyr/include/zephyr/drivers/console/uart_console.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!875 = !DISubroutineType(types: !876)
!876 = !{!103, !108}
!877 = !DIGlobalVariableExpression(var: !878, expr: !DIExpression())
!878 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !719, file: !723, line: 38, type: !879, isLocal: true, isDefinition: true)
!879 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !739)
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "cmd", scope: !882, file: !723, line: 435, type: !893, isLocal: true, isDefinition: true)
!882 = distinct !DISubprogram(name: "uart_console_isr", scope: !723, file: !723, line: 428, type: !808, scopeLine: 429, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !719, retainedNodes: !883)
!883 = !{!884, !885, !886, !888, !889}
!884 = !DILocalVariable(name: "unused", arg: 1, scope: !882, file: !723, line: 428, type: !739)
!885 = !DILocalVariable(name: "user_data", arg: 2, scope: !882, file: !723, line: 428, type: !102)
!886 = !DILocalVariable(name: "byte", scope: !887, file: !723, line: 436, type: !421)
!887 = distinct !DILexicalBlock(scope: !882, file: !723, line: 434, column: 48)
!888 = !DILocalVariable(name: "rx", scope: !887, file: !723, line: 437, type: !103)
!889 = !DILocalVariable(name: "ret", scope: !890, file: !723, line: 461, type: !102)
!890 = distinct !DILexicalBlock(scope: !891, file: !723, line: 461, column: 10)
!891 = distinct !DILexicalBlock(scope: !892, file: !723, line: 460, column: 13)
!892 = distinct !DILexicalBlock(scope: !887, file: !723, line: 460, column: 7)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 32)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "console_input", file: !895, line: 21, size: 1088, elements: !896)
!895 = !DIFile(filename: "zephyr/include/zephyr/drivers/console/console.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!896 = !{!897, !900, !901}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "_unused", scope: !894, file: !895, line: 23, baseType: !898, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !23, line: 104, baseType: !899)
!899 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "is_mcumgr", scope: !894, file: !895, line: 25, baseType: !421, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !894, file: !895, line: 27, baseType: !902, size: 1024, offset: 40)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !108, size: 1024, elements: !903)
!903 = !{!904}
!904 = !DISubrange(count: 128)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "esc_state", scope: !719, file: !723, line: 228, type: !907, isLocal: true, isDefinition: true)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !908, line: 22, baseType: !899)
!908 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(name: "ansi_val", scope: !719, file: !723, line: 229, type: !32, isLocal: true, isDefinition: true)
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(name: "ansi_val_2", scope: !719, file: !723, line: 229, type: !32, isLocal: true, isDefinition: true)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(name: "cur", scope: !719, file: !723, line: 230, type: !421, isLocal: true, isDefinition: true)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "end", scope: !719, file: !723, line: 230, type: !421, isLocal: true, isDefinition: true)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_console_in_debug_hook_t", file: !874, line: 45, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 32)
!919 = !DISubroutineType(types: !920)
!920 = !{!103, !421}
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(name: "mcux_igpio_pinmux_0", scope: !923, file: !1027, line: 318, type: !1103, isLocal: false, isDefinition: true)
!923 = distinct !DICompileUnit(language: DW_LANG_C99, file: !924, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !925, retainedTypes: !942, globals: !1024, splitDebugInlining: false, nameTableKind: None)
!924 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/console/echo")
!925 = !{!926, !932, !937}
!926 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !927, line: 506, baseType: !32, size: 32, elements: !928)
!927 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!928 = !{!929, !930, !931}
!929 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!930 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!931 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!932 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !927, line: 512, baseType: !32, size: 32, elements: !933)
!933 = !{!934, !935, !936}
!934 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!935 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!936 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_gpio_pin_action", file: !938, line: 66, baseType: !32, size: 32, elements: !939)
!938 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./gpio_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!939 = !{!940, !941}
!940 = !DIEnumerator(name: "gpioPinClear", value: 0)
!941 = !DIEnumerator(name: "gpioPinSet", value: 1)
!942 = !{!943, !1013, !1018, !978, !932, !926, !1023, !102, !539, !993, !869}
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !927, line: 523, size: 288, elements: !946)
!946 = !{!947, !968, !974, !979, !983, !984, !985, !989, !1009}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !945, file: !927, line: 524, baseType: !948, size: 32)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 32)
!949 = !DISubroutineType(types: !950)
!950 = !{!103, !951, !966, !967}
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !571, line: 378, size: 192, elements: !954)
!954 = !{!955, !956, !957, !958, !964, !965}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !953, file: !571, line: 380, baseType: !574, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !953, file: !571, line: 382, baseType: !13, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !953, file: !571, line: 384, baseType: !13, size: 32, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !953, file: !571, line: 386, baseType: !959, size: 32, offset: 96)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !571, line: 351, size: 16, elements: !961)
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !960, file: !571, line: 359, baseType: !421, size: 8)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !960, file: !571, line: 364, baseType: !583, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !953, file: !571, line: 388, baseType: !102, size: 32, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !953, file: !571, line: 396, baseType: !586, size: 32, offset: 160)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !927, line: 237, baseType: !421)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !927, line: 257, baseType: !415)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !945, file: !927, line: 530, baseType: !969, size: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DISubroutineType(types: !971)
!971 = !{!103, !951, !972}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !927, line: 229, baseType: !415)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !945, file: !927, line: 532, baseType: !975, size: 32, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 32)
!976 = !DISubroutineType(types: !977)
!977 = !{!103, !951, !978, !973}
!978 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !927, line: 216, baseType: !415)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !945, file: !927, line: 535, baseType: !980, size: 32, offset: 96)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 32)
!981 = !DISubroutineType(types: !982)
!982 = !{!103, !951, !978}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !945, file: !927, line: 537, baseType: !980, size: 32, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !945, file: !927, line: 539, baseType: !980, size: 32, offset: 160)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !945, file: !927, line: 541, baseType: !986, size: 32, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DISubroutineType(types: !988)
!988 = !{!103, !951, !966, !926, !932}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !945, file: !927, line: 544, baseType: !990, size: 32, offset: 224)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = !DISubroutineType(types: !992)
!992 = !{!103, !951, !993, !583}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 32)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !927, line: 478, size: 96, elements: !995)
!995 = !{!996, !1003, !1008}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !994, file: !927, line: 482, baseType: !997, size: 32)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !998, line: 33, baseType: !999)
!998 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !998, line: 29, size: 32, elements: !1000)
!1000 = !{!1001}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !999, file: !998, line: 30, baseType: !1002, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !994, file: !927, line: 485, baseType: !1004, size: 32, offset: 32)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !927, line: 464, baseType: !1005)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1006, size: 32)
!1006 = !DISubroutineType(types: !1007)
!1007 = !{null, !951, !993, !978}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !994, file: !927, line: 493, baseType: !978, size: 32, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !945, file: !927, line: 547, baseType: !1010, size: 32, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 32)
!1011 = !DISubroutineType(types: !1012)
!1012 = !{!415, !951}
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1015)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !927, line: 428, size: 32, elements: !1016)
!1016 = !{!1017}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !1015, file: !927, line: 434, baseType: !978, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !927, line: 441, size: 32, elements: !1021)
!1021 = !{!1022}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !1020, file: !927, line: 447, baseType: !978, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 32)
!1024 = !{!921, !1025, !1031, !1033, !1043, !1055, !1057, !1088, !1090, !1101}
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !923, file: !1027, line: 318, type: !1028, isLocal: false, isDefinition: true, align: 16)
!1027 = !DIFile(filename: "zephyr/drivers/gpio/gpio_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 400, elements: !1029)
!1029 = !{!1030}
!1030 = !DISubrange(count: 25)
!1031 = !DIGlobalVariableExpression(var: !1032, expr: !DIExpression())
!1032 = distinct !DIGlobalVariable(name: "__device_dts_ord_25", scope: !923, file: !1027, line: 318, type: !952, isLocal: false, isDefinition: true, align: 32)
!1033 = !DIGlobalVariableExpression(var: !1034, expr: !DIExpression())
!1034 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_25", scope: !923, file: !1027, line: 318, type: !1035, isLocal: true, isDefinition: true, align: 32)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !544, line: 51, size: 64, elements: !1037)
!1037 = !{!1038, !1042}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !1036, file: !544, line: 60, baseType: !1039, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 32)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!103, !951}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !1036, file: !544, line: 65, baseType: !951, size: 32, offset: 32)
!1043 = !DIGlobalVariableExpression(var: !1044, expr: !DIExpression())
!1044 = distinct !DIGlobalVariable(name: "imx_gpio_0_data", scope: !923, file: !1027, line: 318, type: !1045, isLocal: true, isDefinition: true)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_data", file: !1027, line: 33, size: 96, elements: !1046)
!1046 = !{!1047, !1048}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1045, file: !1027, line: 35, baseType: !1020, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "callbacks", scope: !1045, file: !1027, line: 37, baseType: !1049, size: 64, offset: 32)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !998, line: 40, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !998, line: 35, size: 64, elements: !1051)
!1051 = !{!1052, !1054}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1050, file: !998, line: 36, baseType: !1053, size: 32)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1050, file: !998, line: 37, baseType: !1053, size: 32, offset: 32)
!1055 = !DIGlobalVariableExpression(var: !1056, expr: !DIExpression())
!1056 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_25", scope: !923, file: !1027, line: 318, type: !960, isLocal: true, isDefinition: true, align: 8)
!1057 = !DIGlobalVariableExpression(var: !1058, expr: !DIExpression())
!1058 = distinct !DIGlobalVariable(name: "imx_gpio_0_config", scope: !923, file: !1027, line: 318, type: !1059, isLocal: true, isDefinition: true)
!1059 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "imx_gpio_config", file: !1027, line: 23, size: 128, elements: !1061)
!1061 = !{!1062, !1063, !1076, !1087}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1060, file: !1027, line: 25, baseType: !1015, size: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1060, file: !1027, line: 26, baseType: !1064, size: 32, offset: 32)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 32)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "GPIO_Type", file: !410, line: 19729, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !410, line: 19720, size: 256, elements: !1067)
!1067 = !{!1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "DR", scope: !1066, file: !410, line: 19721, baseType: !414, size: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "GDIR", scope: !1066, file: !410, line: 19722, baseType: !414, size: 32, offset: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "PSR", scope: !1066, file: !410, line: 19723, baseType: !488, size: 32, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "ICR1", scope: !1066, file: !410, line: 19724, baseType: !414, size: 32, offset: 96)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "ICR2", scope: !1066, file: !410, line: 19725, baseType: !414, size: 32, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !1066, file: !410, line: 19726, baseType: !414, size: 32, offset: 160)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ISR", scope: !1066, file: !410, line: 19727, baseType: !414, size: 32, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "EDGE_SEL", scope: !1066, file: !410, line: 19728, baseType: !414, size: 32, offset: 224)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "pin_muxes", scope: !1060, file: !1027, line: 28, baseType: !1077, size: 32, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 32)
!1078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pinctrl_soc_pinmux", file: !1080, line: 51, size: 128, elements: !1081)
!1080 = !DIFile(filename: "zephyr/soc/arm/nxp_imx/mcimx7_m4/pinctrl_soc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1081 = !{!1082, !1083, !1084, !1085, !1086}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "mux_register", scope: !1079, file: !1080, line: 52, baseType: !415, size: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "config_register", scope: !1079, file: !1080, line: 53, baseType: !415, size: 32, offset: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "input_register", scope: !1079, file: !1080, line: 54, baseType: !415, size: 32, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "mux_mode", scope: !1079, file: !1080, line: 55, baseType: !421, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "input_daisy", scope: !1079, file: !1080, line: 56, baseType: !415, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "mux_count", scope: !1060, file: !1027, line: 29, baseType: !421, size: 8, offset: 96)
!1088 = !DIGlobalVariableExpression(var: !1089, expr: !DIExpression())
!1089 = distinct !DIGlobalVariable(name: "imx_gpio_driver_api", scope: !923, file: !1027, line: 249, type: !944, isLocal: true, isDefinition: true)
!1090 = !DIGlobalVariableExpression(var: !1091, expr: !DIExpression())
!1091 = distinct !DIGlobalVariable(name: "__isr_imx_gpio_port_isr_irq_0", scope: !1092, file: !1027, line: 318, type: !1095, isLocal: true, isDefinition: true, align: 32)
!1092 = distinct !DISubprogram(name: "imx_gpio_0_init", scope: !1027, file: !1027, line: 318, type: !1040, scopeLine: 318, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !923, retainedNodes: !1093)
!1093 = !{!1094}
!1094 = !DILocalVariable(name: "port", arg: 1, scope: !1092, file: !1027, line: 318, type: !951)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !1096)
!1096 = !{!1097, !1098, !1099, !1100}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !1095, file: !10, line: 55, baseType: !700, size: 32)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1095, file: !10, line: 57, baseType: !700, size: 32, offset: 32)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !1095, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !1095, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!1101 = !DIGlobalVariableExpression(var: !1102, expr: !DIExpression())
!1102 = distinct !DIGlobalVariable(name: "__isr_imx_gpio_port_isr_irq_1", scope: !1092, file: !1027, line: 318, type: !1095, isLocal: true, isDefinition: true, align: 32)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1078, size: 2048, elements: !1104)
!1104 = !{!1105}
!1105 = !DISubrange(count: 16)
!1106 = !DIGlobalVariableExpression(var: !1107, expr: !DIExpression())
!1107 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_25", scope: !1108, file: !1113, line: 7, type: !1114, isLocal: false, isDefinition: true, align: 16)
!1108 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1109, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1110, splitDebugInlining: false, nameTableKind: None)
!1109 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/console/echo/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/console/echo")
!1110 = !{!1106, !1111}
!1111 = !DIGlobalVariableExpression(var: !1112, expr: !DIExpression())
!1112 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_198", scope: !1108, file: !1113, line: 12, type: !1114, isLocal: false, isDefinition: true, align: 16)
!1113 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/console/echo")
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 48, elements: !1115)
!1115 = !{!1116}
!1116 = !DISubrange(count: 3)
!1117 = !DIGlobalVariableExpression(var: !1118, expr: !DIExpression())
!1118 = distinct !DIGlobalVariable(name: "imx_uart_0_config", scope: !1119, file: !1316, line: 339, type: !1314, isLocal: true, isDefinition: true)
!1119 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1120, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !1121, retainedTypes: !1207, globals: !1352, splitDebugInlining: false, nameTableKind: None)
!1120 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/serial/uart_imx.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_meerkat96/subsys/console/echo")
!1121 = !{!30, !1122, !1160, !1188, !1192, !1196, !1201}
!1122 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "_uart_status_flag", file: !1123, line: 122, baseType: !32, size: 32, elements: !1124)
!1123 = !DIFile(filename: "modules/hal/nxp/imx/drivers/./uart_imx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1124 = !{!1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159}
!1125 = !DIEnumerator(name: "uartStatusRxCharReady", value: 15)
!1126 = !DIEnumerator(name: "uartStatusRxError", value: 14)
!1127 = !DIEnumerator(name: "uartStatusRxOverrunError", value: 13)
!1128 = !DIEnumerator(name: "uartStatusRxFrameError", value: 12)
!1129 = !DIEnumerator(name: "uartStatusRxBreakDetect", value: 11)
!1130 = !DIEnumerator(name: "uartStatusRxParityError", value: 10)
!1131 = !DIEnumerator(name: "uartStatusParityError", value: 9699343)
!1132 = !DIEnumerator(name: "uartStatusRtsStatus", value: 9699342)
!1133 = !DIEnumerator(name: "uartStatusTxReady", value: 9699341)
!1134 = !DIEnumerator(name: "uartStatusRtsDelta", value: 9699340)
!1135 = !DIEnumerator(name: "uartStatusEscape", value: 9699339)
!1136 = !DIEnumerator(name: "uartStatusFrameError", value: 9699338)
!1137 = !DIEnumerator(name: "uartStatusRxReady", value: 9699337)
!1138 = !DIEnumerator(name: "uartStatusAgingTimer", value: 9699336)
!1139 = !DIEnumerator(name: "uartStatusDtrDelta", value: 9699335)
!1140 = !DIEnumerator(name: "uartStatusRxDs", value: 9699334)
!1141 = !DIEnumerator(name: "uartStatustAirWake", value: 9699333)
!1142 = !DIEnumerator(name: "uartStatusAwake", value: 9699332)
!1143 = !DIEnumerator(name: "uartStatusRs485SlaveAddrMatch", value: 9699331)
!1144 = !DIEnumerator(name: "uartStatusAutoBaud", value: 9961487)
!1145 = !DIEnumerator(name: "uartStatusTxEmpty", value: 9961486)
!1146 = !DIEnumerator(name: "uartStatusDtr", value: 9961485)
!1147 = !DIEnumerator(name: "uartStatusIdle", value: 9961484)
