; ModuleID = './build/aes_encrypt_decrypt_data.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7em-none-unknown-eabihf"

%union.CACHE_CON_Type = type { %struct.anon }
%struct.anon = type { i32 }
%struct.CACHE_ENTRY_Type = type { %union.CACHE_CON_Type, %union.CACHE_CON_Type }
%struct.nvic_function_t = type { void (i32)*, i32 }
%struct.uart_context_t = type { i8, %struct.hal_uart_config_t, i8, %struct.hal_uart_callback_config_t, i8, %struct.hal_uart_dma_config_t }
%struct.hal_uart_config_t = type { i32, i32, i32, i32 }
%struct.hal_uart_callback_config_t = type { void (i32, i8*)*, i8* }
%struct.hal_uart_dma_config_t = type { i8*, i32, i32, i8*, i32, i32, i32 }
%struct.__va_list = type { i8* }
%struct.hal_aes_buffer_t = type { i8*, i32 }
%struct.hal_cache_region_config_t = type { i32, i32 }
%struct.gpio_status = type { i32, i8, i8, i8 }
%struct.stat = type { i16, i16, i32, i16, i16, i16, i16, i32, %struct.timespec, %struct.timespec, %struct.timespec, i32, i32, [2 x i32] }
%struct.timespec = type { i64, i32 }
%struct._reent = type { i32, %struct.__sFILE*, %struct.__sFILE*, %struct.__sFILE*, i32, i8*, i32, i32, %struct.__locale_t*, %struct._mprec*, void (%struct._reent*)*, i32, i32, i8*, %struct._rand48*, %struct.__tm*, i8*, void (i32)**, %struct._atexit*, %struct._atexit, %struct._glue, %struct.__sFILE*, %struct._misc_reent*, i8* }
%struct.__locale_t = type opaque

!109 = !DIEnumerator(name: "CM4_AUDIO_WAKE_IRQ", value: 26)
!110 = !DIEnumerator(name: "CM4_SPIM_IRQ", value: 27)
!111 = !DIEnumerator(name: "CM4_USB_IRQ", value: 28)
!112 = !DIEnumerator(name: "CM4_UDMA_IRQ", value: 29)
!113 = !DIEnumerator(name: "CM4_TRNG_IRQ", value: 30)
!114 = !DIEnumerator(name: "IRQ_NUMBER_MAX", value: 96)
!115 = !{!116, !117, !118}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !71, line: 95, baseType: !70)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !13, line: 24, baseType: !119)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !15, line: 43, baseType: !55)
!120 = !{!59, !121}
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "g_aes_op_done", scope: !61, file: !62, line: 71, type: !123, isLocal: true, isDefinition: true)
!123 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !124)
!124 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!125 = !DIGlobalVariableExpression(var: !126, expr: !DIExpression())
!126 = distinct !DIGlobalVariable(name: "g_cache_status", scope: !127, file: !128, line: 51, type: !123, isLocal: false, isDefinition: true)
!127 = distinct !DICompileUnit(language: DW_LANG_C99, file: !128, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !129, retainedTypes: !176, globals: !206, splitDebugInlining: false, nameTableKind: None)
!128 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_cache.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!129 = !{!130, !141, !160, !167}
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !131, line: 163, baseType: !66, size: 32, elements: !132)
!131 = !DIFile(filename: "../../../../../driver/chip/inc/hal_cache.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140}
!133 = !DIEnumerator(name: "HAL_CACHE_STATUS_INVALID_PARAMETER", value: -7)
!134 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_BUSY", value: -6)
!135 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_CACHE_SIZE", value: -5)
!136 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION", value: -4)
!137 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_ADDRESS", value: -3)
!138 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR_REGION_SIZE", value: -2)
!139 = !DIEnumerator(name: "HAL_CACHE_STATUS_ERROR", value: -1)
!140 = !DIEnumerator(name: "HAL_CACHE_STATUS_OK", value: 0)
!141 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !131, line: 186, baseType: !7, size: 32, elements: !142)
!142 = !{!143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159}
!143 = !DIEnumerator(name: "HAL_CACHE_REGION_0", value: 0)
!144 = !DIEnumerator(name: "HAL_CACHE_REGION_1", value: 1)
!145 = !DIEnumerator(name: "HAL_CACHE_REGION_2", value: 2)
!146 = !DIEnumerator(name: "HAL_CACHE_REGION_3", value: 3)
!147 = !DIEnumerator(name: "HAL_CACHE_REGION_4", value: 4)
!148 = !DIEnumerator(name: "HAL_CACHE_REGION_5", value: 5)
!149 = !DIEnumerator(name: "HAL_CACHE_REGION_6", value: 6)
!150 = !DIEnumerator(name: "HAL_CACHE_REGION_7", value: 7)
!151 = !DIEnumerator(name: "HAL_CACHE_REGION_8", value: 8)
!152 = !DIEnumerator(name: "HAL_CACHE_REGION_9", value: 9)
!153 = !DIEnumerator(name: "HAL_CACHE_REGION_10", value: 10)
!154 = !DIEnumerator(name: "HAL_CACHE_REGION_11", value: 11)
!155 = !DIEnumerator(name: "HAL_CACHE_REGION_12", value: 12)
!156 = !DIEnumerator(name: "HAL_CACHE_REGION_13", value: 13)
!157 = !DIEnumerator(name: "HAL_CACHE_REGION_14", value: 14)
!158 = !DIEnumerator(name: "HAL_CACHE_REGION_15", value: 15)
!159 = !DIEnumerator(name: "HAL_CACHE_REGION_MAX", value: 16)
!160 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !131, line: 176, baseType: !7, size: 32, elements: !161)
!161 = !{!162, !163, !164, !165, !166}
!162 = !DIEnumerator(name: "HAL_CACHE_SIZE_0KB", value: 0)
!163 = !DIEnumerator(name: "HAL_CACHE_SIZE_8KB", value: 1)
!164 = !DIEnumerator(name: "HAL_CACHE_SIZE_16KB", value: 2)
!165 = !DIEnumerator(name: "HAL_CACHE_SIZE_32KB", value: 3)
!166 = !DIEnumerator(name: "HAL_CACHE_SIZE_MAX", value: 4)
!167 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !168, line: 99, baseType: !7, size: 32, elements: !169)
!168 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_internal.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!169 = !{!170, !171, !172, !173, !174, !175}
!170 = !DIEnumerator(name: "CACHE_INVALIDATE_ALL_LINES", value: 1)
!171 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_ADDRESS", value: 2)
!172 = !DIEnumerator(name: "CACHE_INVALIDATE_ONE_LINE_BY_SET_WAY", value: 4)
!173 = !DIEnumerator(name: "CACHE_FLUSH_ALL_LINES", value: 9)
!174 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_ADDRESS", value: 10)
!175 = !DIEnumerator(name: "CACHE_FLUSH_ONE_LINE_BY_SET_WAY", value: 12)
!176 = !{!177, !116}
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !179, line: 72, baseType: !180)
!179 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_cache_hw.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !179, line: 56, size: 525312, elements: !181)
!181 = !{!182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !196, !197, !201, !205}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !180, file: !179, line: 57, baseType: !11, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !180, file: !179, line: 58, baseType: !11, size: 32, offset: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !180, file: !179, line: 59, baseType: !11, size: 32, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !180, file: !179, line: 60, baseType: !11, size: 32, offset: 96)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !180, file: !179, line: 61, baseType: !11, size: 32, offset: 128)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !180, file: !179, line: 62, baseType: !11, size: 32, offset: 160)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !180, file: !179, line: 63, baseType: !11, size: 32, offset: 192)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !180, file: !179, line: 64, baseType: !11, size: 32, offset: 224)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !180, file: !179, line: 65, baseType: !11, size: 32, offset: 256)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !180, file: !179, line: 66, baseType: !11, size: 32, offset: 288)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !180, file: !179, line: 67, baseType: !193, size: 32, offset: 320)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 32, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 1)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !180, file: !179, line: 68, baseType: !11, size: 32, offset: 352)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !180, file: !179, line: 69, baseType: !198, size: 523904, offset: 384)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 523904, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 16372)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !180, file: !179, line: 70, baseType: !202, size: 512, offset: 524288)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 512, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 16)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !180, file: !179, line: 71, baseType: !202, size: 512, offset: 524800)
!206 = !{!125}
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "nvic_function_table", scope: !209, file: !210, line: 53, type: !298, isLocal: false, isDefinition: true)
!209 = distinct !DICompileUnit(language: DW_LANG_C99, file: !210, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, retainedTypes: !220, globals: !297, splitDebugInlining: false, nameTableKind: None)
!210 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!211 = !{!212, !70}
!212 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !213, line: 152, baseType: !66, size: 32, elements: !214)
!213 = !DIFile(filename: "../../../../../driver/chip/inc/hal_nvic.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!214 = !{!215, !216, !217, !218, !219}
!215 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_NO_ISR", value: -4)
!216 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR_IRQ_NUMBER", value: -3)
!217 = !DIEnumerator(name: "HAL_NVIC_STATUS_INVALID_PARAMETER", value: -2)
!218 = !DIEnumerator(name: "HAL_NVIC_STATUS_ERROR", value: -1)
!219 = !DIEnumerator(name: "HAL_NVIC_STATUS_OK", value: 0)
!220 = !{!221, !116, !12, !222, !224, !258}
!221 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_nvic_irq_t", file: !71, line: 97, baseType: !117)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !13, line: 44, baseType: !223)
!223 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !15, line: 77, baseType: !66)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 32)
!225 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !226, line: 378, baseType: !227)
!226 = !DIFile(filename: "../../../../../driver/CMSIS/Include/core_cm4.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !226, line: 363, size: 28704, elements: !228)
!228 = !{!229, !233, !237, !238, !239, !240, !241, !242, !243, !244, !248, !253, !257}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !227, file: !226, line: 365, baseType: !230, size: 256)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 256, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 8)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !227, file: !226, line: 366, baseType: !234, size: 768, offset: 256)
!234 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 768, elements: !235)
!235 = !{!236}
!236 = !DISubrange(count: 24)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !227, file: !226, line: 367, baseType: !230, size: 256, offset: 1024)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !227, file: !226, line: 368, baseType: !234, size: 768, offset: 1280)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !227, file: !226, line: 369, baseType: !230, size: 256, offset: 2048)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !227, file: !226, line: 370, baseType: !234, size: 768, offset: 2304)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !227, file: !226, line: 371, baseType: !230, size: 256, offset: 3072)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !227, file: !226, line: 372, baseType: !234, size: 768, offset: 3328)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !227, file: !226, line: 373, baseType: !230, size: 256, offset: 4096)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !227, file: !226, line: 374, baseType: !245, size: 1792, offset: 4352)
!245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 1792, elements: !246)
!246 = !{!247}
!247 = !DISubrange(count: 56)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !227, file: !226, line: 375, baseType: !249, size: 1920, offset: 6144)
!249 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 1920, elements: !251)
!250 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !118)
!251 = !{!252}
!252 = !DISubrange(count: 240)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !227, file: !226, line: 376, baseType: !254, size: 20608, offset: 8064)
!254 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 20608, elements: !255)
!255 = !{!256}
!256 = !DISubrange(count: 644)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !227, file: !226, line: 377, baseType: !11, size: 32, offset: 28672)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 32)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !226, line: 418, baseType: !260)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !226, line: 395, size: 1120, elements: !261)
!261 = !{!262, !264, !265, !266, !267, !268, !269, !273, !274, !275, !276, !277, !278, !279, !280, !284, !285, !286, !290, !294, !296}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !260, file: !226, line: 397, baseType: !263, size: 32)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !260, file: !226, line: 398, baseType: !11, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !260, file: !226, line: 399, baseType: !11, size: 32, offset: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !260, file: !226, line: 400, baseType: !11, size: 32, offset: 96)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !260, file: !226, line: 401, baseType: !11, size: 32, offset: 128)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !260, file: !226, line: 402, baseType: !11, size: 32, offset: 160)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !260, file: !226, line: 403, baseType: !270, size: 96, offset: 192)
!270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 96, elements: !271)
!271 = !{!272}
!272 = !DISubrange(count: 12)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !260, file: !226, line: 404, baseType: !11, size: 32, offset: 288)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !260, file: !226, line: 405, baseType: !11, size: 32, offset: 320)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !260, file: !226, line: 406, baseType: !11, size: 32, offset: 352)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !260, file: !226, line: 407, baseType: !11, size: 32, offset: 384)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !260, file: !226, line: 408, baseType: !11, size: 32, offset: 416)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !260, file: !226, line: 409, baseType: !11, size: 32, offset: 448)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !260, file: !226, line: 410, baseType: !11, size: 32, offset: 480)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !260, file: !226, line: 411, baseType: !281, size: 64, offset: 512)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 64, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 2)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !260, file: !226, line: 412, baseType: !263, size: 32, offset: 576)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !260, file: !226, line: 413, baseType: !263, size: 32, offset: 608)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !260, file: !226, line: 414, baseType: !287, size: 128, offset: 640)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 128, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 4)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !260, file: !226, line: 415, baseType: !291, size: 160, offset: 768)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 160, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 5)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !260, file: !226, line: 416, baseType: !295, size: 160, offset: 928)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !292)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !260, file: !226, line: 417, baseType: !11, size: 32, offset: 1088)
!297 = !{!207}
!298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 6144, elements: !307)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "nvic_function_t", file: !210, line: 50, baseType: !300)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !210, line: 47, size: 64, elements: !301)
!301 = !{!302, !306}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "nvic_callback", scope: !300, file: !210, line: 48, baseType: !303, size: 32)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 32)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !221}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "irq_pending", scope: !300, file: !210, line: 49, baseType: !12, size: 32, offset: 32)
!307 = !{!308}
!308 = !DISubrange(count: 96)
!309 = !DIGlobalVariableExpression(var: !310, expr: !DIExpression())
!310 = distinct !DIGlobalVariable(name: "g_uart_context_table", scope: !311, file: !312, line: 77, type: !381, isLocal: true, isDefinition: true)
!311 = distinct !DICompileUnit(language: DW_LANG_C99, file: !312, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, retainedTypes: !364, globals: !366, splitDebugInlining: false, nameTableKind: None)
!312 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_uart.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!313 = !{!314, !322, !328, !344, !350, !354, !26, !32, !359}
!314 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !315, line: 345, baseType: !66, size: 32, elements: !316)
!315 = !DIFile(filename: "../../../../../driver/chip/inc/hal_uart.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!316 = !{!317, !318, !319, !320, !321}
!317 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_PARAMETER", value: -4)
!318 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_BUSY", value: -3)
!319 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR_UNINITIALIZED", value: -2)
!320 = !DIEnumerator(name: "HAL_UART_STATUS_ERROR", value: -1)
!321 = !DIEnumerator(name: "HAL_UART_STATUS_OK", value: 0)
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !323, line: 109, baseType: !7, size: 32, elements: !324)
!323 = !DIFile(filename: "../../../../../driver/chip/mt7687/inc/hal_platform.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!324 = !{!325, !326, !327}
!325 = !DIEnumerator(name: "HAL_UART_0", value: 0)
!326 = !DIEnumerator(name: "HAL_UART_1", value: 1)
!327 = !DIEnumerator(name: "HAL_UART_MAX", value: 2)
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !315, line: 302, baseType: !7, size: 32, elements: !329)
!329 = !{!330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343}
!330 = !DIEnumerator(name: "HAL_UART_BAUDRATE_110", value: 0)
!331 = !DIEnumerator(name: "HAL_UART_BAUDRATE_300", value: 1)
!332 = !DIEnumerator(name: "HAL_UART_BAUDRATE_1200", value: 2)
!333 = !DIEnumerator(name: "HAL_UART_BAUDRATE_2400", value: 3)
!334 = !DIEnumerator(name: "HAL_UART_BAUDRATE_4800", value: 4)
!335 = !DIEnumerator(name: "HAL_UART_BAUDRATE_9600", value: 5)
!336 = !DIEnumerator(name: "HAL_UART_BAUDRATE_19200", value: 6)
!337 = !DIEnumerator(name: "HAL_UART_BAUDRATE_38400", value: 7)
!338 = !DIEnumerator(name: "HAL_UART_BAUDRATE_57600", value: 8)
!339 = !DIEnumerator(name: "HAL_UART_BAUDRATE_115200", value: 9)
!340 = !DIEnumerator(name: "HAL_UART_BAUDRATE_230400", value: 10)
!341 = !DIEnumerator(name: "HAL_UART_BAUDRATE_460800", value: 11)
!342 = !DIEnumerator(name: "HAL_UART_BAUDRATE_921600", value: 12)
!343 = !DIEnumerator(name: "HAL_UART_BAUDRATE_MAX", value: 13)
!344 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !315, line: 321, baseType: !7, size: 32, elements: !345)
!345 = !{!346, !347, !348, !349}
!346 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_5", value: 0)
!347 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_6", value: 1)
!348 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_7", value: 2)
!349 = !DIEnumerator(name: "HAL_UART_WORD_LENGTH_8", value: 3)
!350 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !315, line: 330, baseType: !7, size: 32, elements: !351)
!351 = !{!352, !353}
!352 = !DIEnumerator(name: "HAL_UART_STOP_BIT_1", value: 0)
!353 = !DIEnumerator(name: "HAL_UART_STOP_BIT_2", value: 1)
!354 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !315, line: 337, baseType: !7, size: 32, elements: !355)
!355 = !{!356, !357, !358}
!356 = !DIEnumerator(name: "HAL_UART_PARITY_NONE", value: 0)
!357 = !DIEnumerator(name: "HAL_UART_PARITY_ODD", value: 1)
!358 = !DIEnumerator(name: "HAL_UART_PARITY_EVEN", value: 2)
!359 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !315, line: 355, baseType: !66, size: 32, elements: !360)
!360 = !{!361, !362, !363}
!361 = !DIEnumerator(name: "HAL_UART_EVENT_TRANSACTION_ERROR", value: -1)
!362 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_READ", value: 1)
!363 = !DIEnumerator(name: "HAL_UART_EVENT_READY_TO_WRITE", value: 2)
!364 = !{!7, !116, !55, !365, !118}
!365 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!366 = !{!309, !367}
!367 = !DIGlobalVariableExpression(var: !368, expr: !DIExpression())
!368 = distinct !DIGlobalVariable(name: "func_tbl", scope: !369, file: !312, line: 536, type: !379, isLocal: true, isDefinition: true)
!369 = distinct !DISubprogram(name: "hal_uart_map_receive_callback", scope: !312, file: !312, line: 534, type: !370, scopeLine: 535, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !311, retainedNodes: !377)
!370 = !DISubroutineType(types: !371)
!371 = !{!372, !376}
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "VOID_FUNC", file: !33, line: 197, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 32)
!374 = !DISubroutineType(types: !375)
!375 = !{null}
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_port_t", file: !323, line: 113, baseType: !322)
!377 = !{!378}
!378 = !DILocalVariable(name: "uart_port", arg: 1, scope: !369, file: !312, line: 534, type: !376)
!379 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 64, elements: !282)
!380 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 1024, elements: !282)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_context_t", file: !312, line: 75, baseType: !383)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !312, line: 68, size: 512, elements: !384)
!384 = !{!385, !386, !398, !399, !410, !411}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config_present", scope: !383, file: !312, line: 69, baseType: !124, size: 8)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "basic_config", scope: !383, file: !312, line: 70, baseType: !387, size: 128, offset: 32)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_config_t", file: !315, line: 378, baseType: !388)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !315, line: 373, size: 128, elements: !389)
!389 = !{!390, !392, !394, !396}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !388, file: !315, line: 374, baseType: !391, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_baudrate_t", file: !315, line: 317, baseType: !328)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "word_length", scope: !388, file: !315, line: 375, baseType: !393, size: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_word_length_t", file: !315, line: 326, baseType: !344)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bit", scope: !388, file: !315, line: 376, baseType: !395, size: 32, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_stop_bit_t", file: !315, line: 333, baseType: !350)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !388, file: !315, line: 377, baseType: !397, size: 32, offset: 96)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_parity_t", file: !315, line: 341, baseType: !354)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "callback_present", scope: !383, file: !312, line: 71, baseType: !124, size: 8, offset: 160)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "callback_config", scope: !383, file: !312, line: 72, baseType: !400, size: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_config_t", file: !312, line: 66, baseType: !401)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !312, line: 63, size: 64, elements: !402)
!402 = !{!403, !409}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !401, file: !312, line: 64, baseType: !404, size: 32)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_t", file: !315, line: 410, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !408, !116}
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_callback_event_t", file: !315, line: 359, baseType: !359)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !401, file: !312, line: 65, baseType: !116, size: 32, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config_present", scope: !383, file: !312, line: 73, baseType: !124, size: 8, offset: 256)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "dma_config", scope: !383, file: !312, line: 74, baseType: !412, size: 224, offset: 288)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_uart_dma_config_t", file: !315, line: 390, baseType: !413)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !315, line: 382, size: 224, elements: !414)
!414 = !{!415, !417, !418, !419, !420, !421, !422}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer", scope: !413, file: !315, line: 383, baseType: !416, size: 32)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_buffer_size", scope: !413, file: !315, line: 384, baseType: !12, size: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "send_vfifo_threshold_size", scope: !413, file: !315, line: 385, baseType: !12, size: 32, offset: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer", scope: !413, file: !315, line: 386, baseType: !416, size: 32, offset: 96)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_buffer_size", scope: !413, file: !315, line: 387, baseType: !12, size: 32, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_threshold_size", scope: !413, file: !315, line: 388, baseType: !12, size: 32, offset: 160)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "receive_vfifo_alert_size", scope: !413, file: !315, line: 389, baseType: !12, size: 32, offset: 192)
!423 = !DIGlobalVariableExpression(var: !424, expr: !DIExpression())
!424 = distinct !DIGlobalVariable(name: "SystemCoreClock", scope: !425, file: !426, line: 59, type: !12, isLocal: false, isDefinition: true)
!425 = distinct !DICompileUnit(language: DW_LANG_C99, file: !426, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !427, globals: !480, splitDebugInlining: false, nameTableKind: None)
!426 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/src/system_mt7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!427 = !{!428, !436, !461}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "SysTick_Type", file: !226, line: 656, baseType: !430)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !226, line: 650, size: 128, elements: !431)
!431 = !{!432, !433, !434, !435}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !430, file: !226, line: 652, baseType: !11, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "LOAD", scope: !430, file: !226, line: 653, baseType: !11, size: 32, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "VAL", scope: !430, file: !226, line: 654, baseType: !11, size: 32, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "CALIB", scope: !430, file: !226, line: 655, baseType: !263, size: 32, offset: 96)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !226, line: 418, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !226, line: 395, size: 1120, elements: !439)
!439 = !{!440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !438, file: !226, line: 397, baseType: !263, size: 32)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !438, file: !226, line: 398, baseType: !11, size: 32, offset: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !438, file: !226, line: 399, baseType: !11, size: 32, offset: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !438, file: !226, line: 400, baseType: !11, size: 32, offset: 96)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !438, file: !226, line: 401, baseType: !11, size: 32, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !438, file: !226, line: 402, baseType: !11, size: 32, offset: 160)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !438, file: !226, line: 403, baseType: !270, size: 96, offset: 192)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !438, file: !226, line: 404, baseType: !11, size: 32, offset: 288)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !438, file: !226, line: 405, baseType: !11, size: 32, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !438, file: !226, line: 406, baseType: !11, size: 32, offset: 352)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !438, file: !226, line: 407, baseType: !11, size: 32, offset: 384)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !438, file: !226, line: 408, baseType: !11, size: 32, offset: 416)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !438, file: !226, line: 409, baseType: !11, size: 32, offset: 448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !438, file: !226, line: 410, baseType: !11, size: 32, offset: 480)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !438, file: !226, line: 411, baseType: !281, size: 64, offset: 512)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !438, file: !226, line: 412, baseType: !263, size: 32, offset: 576)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !438, file: !226, line: 413, baseType: !263, size: 32, offset: 608)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !438, file: !226, line: 414, baseType: !287, size: 128, offset: 640)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !438, file: !226, line: 415, baseType: !291, size: 160, offset: 768)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !438, file: !226, line: 416, baseType: !295, size: 160, offset: 928)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !438, file: !226, line: 417, baseType: !11, size: 32, offset: 1088)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "CACHE_REGISTER_T", file: !179, line: 72, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !179, line: 56, size: 525312, elements: !464)
!464 = !{!465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CON", scope: !463, file: !179, line: 57, baseType: !11, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_OP", scope: !463, file: !179, line: 58, baseType: !11, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0L", scope: !463, file: !179, line: 59, baseType: !11, size: 32, offset: 64)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT0U", scope: !463, file: !179, line: 60, baseType: !11, size: 32, offset: 96)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0L", scope: !463, file: !179, line: 61, baseType: !11, size: 32, offset: 128)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT0U", scope: !463, file: !179, line: 62, baseType: !11, size: 32, offset: 160)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1L", scope: !463, file: !179, line: 63, baseType: !11, size: 32, offset: 192)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_HCNT1U", scope: !463, file: !179, line: 64, baseType: !11, size: 32, offset: 224)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1L", scope: !463, file: !179, line: 65, baseType: !11, size: 32, offset: 256)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_CCNT1U", scope: !463, file: !179, line: 66, baseType: !11, size: 32, offset: 288)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !463, file: !179, line: 67, baseType: !193, size: 32, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_REGION_EN", scope: !463, file: !179, line: 68, baseType: !11, size: 32, offset: 352)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !463, file: !179, line: 69, baseType: !198, size: 523904, offset: 384)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_ENTRY_N", scope: !463, file: !179, line: 70, baseType: !202, size: 512, offset: 524288)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "CACHE_END_ENTRY_N", scope: !463, file: !179, line: 71, baseType: !202, size: 512, offset: 524800)
!480 = !{!423, !481}
!481 = !DIGlobalVariableExpression(var: !482, expr: !DIExpression())
!482 = distinct !DIGlobalVariable(name: "System_Initialize_Done", scope: !425, file: !426, line: 61, type: !11, isLocal: true, isDefinition: true)
!483 = !DIGlobalVariableExpression(var: !484, expr: !DIExpression())
!484 = distinct !DIGlobalVariable(name: "heap_end", scope: !485, file: !486, line: 66, type: !491, isLocal: true, isDefinition: true)
!485 = distinct !DISubprogram(name: "_sbrk_r", scope: !486, file: !486, line: 63, type: !487, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !683, retainedNodes: !687)
!486 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC/syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!487 = !DISubroutineType(types: !488)
!488 = !{!489, !492, !682}
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "caddr_t", file: !490, line: 123, baseType: !491)
!490 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/types.h", directory: "/home/mjshen/RTOSExploration")
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 32)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 32)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_reent", file: !494, line: 377, size: 1920, elements: !495)
!494 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/reent.h", directory: "/home/mjshen/RTOSExploration")
!495 = !{!496, !497, !571, !572, !573, !574, !575, !576, !577, !580, !601, !605, !606, !607, !608, !618, !631, !632, !637, !656, !657, !664, !665, !681}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "_errno", scope: !493, file: !494, line: 381, baseType: !66, size: 32)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "_stdin", scope: !493, file: !494, line: 386, baseType: !498, size: 32, offset: 32)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !499, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !494, line: 292, baseType: !500)
!500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !494, line: 186, size: 832, elements: !501)
!501 = !{!502, !504, !505, !506, !508, !509, !514, !515, !516, !517, !521, !527, !534, !538, !539, !540, !541, !545, !547, !548, !549, !551, !557, !570}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !500, file: !494, line: 187, baseType: !503, size: 32)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 32)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !500, file: !494, line: 188, baseType: !66, size: 32, offset: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !500, file: !494, line: 189, baseType: !66, size: 32, offset: 64)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !500, file: !494, line: 190, baseType: !507, size: 16, offset: 96)
!507 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !500, file: !494, line: 191, baseType: !507, size: 16, offset: 112)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !500, file: !494, line: 192, baseType: !510, size: 64, offset: 128)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !494, line: 122, size: 64, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !510, file: !494, line: 123, baseType: !503, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !510, file: !494, line: 124, baseType: !66, size: 32, offset: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !500, file: !494, line: 193, baseType: !66, size: 32, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "_data", scope: !500, file: !494, line: 196, baseType: !492, size: 32, offset: 224)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !500, file: !494, line: 200, baseType: !116, size: 32, offset: 256)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !500, file: !494, line: 202, baseType: !518, size: 32, offset: 288)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 32)
!519 = !DISubroutineType(types: !520)
!520 = !{!66, !492, !116, !491, !66}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !500, file: !494, line: 204, baseType: !522, size: 32, offset: 320)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 32)
!523 = !DISubroutineType(types: !524)
!524 = !{!66, !492, !116, !525, !66}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !365)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !500, file: !494, line: 207, baseType: !528, size: 32, offset: 352)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 32)
!529 = !DISubroutineType(types: !530)
!530 = !{!531, !492, !116, !531, !66}
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "_fpos_t", file: !532, line: 116, baseType: !533)
!532 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/_types.h", directory: "/home/mjshen/RTOSExploration")
!533 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !500, file: !494, line: 208, baseType: !535, size: 32, offset: 384)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DISubroutineType(types: !537)
!537 = !{!66, !492, !116}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !500, file: !494, line: 211, baseType: !510, size: 64, offset: 416)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_up", scope: !500, file: !494, line: 212, baseType: !503, size: 32, offset: 480)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !500, file: !494, line: 213, baseType: !66, size: 32, offset: 512)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !500, file: !494, line: 216, baseType: !542, size: 24, offset: 544)
!542 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 24, elements: !543)
!543 = !{!544}
!544 = !DISubrange(count: 3)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !500, file: !494, line: 217, baseType: !546, size: 8, offset: 568)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 8, elements: !194)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !500, file: !494, line: 220, baseType: !510, size: 64, offset: 576)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !500, file: !494, line: 223, baseType: !66, size: 32, offset: 640)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !500, file: !494, line: 224, baseType: !550, size: 32, offset: 672)
!550 = !DIDerivedType(tag: DW_TAG_typedef, name: "_off_t", file: !532, line: 46, baseType: !533)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !500, file: !494, line: 231, baseType: !552, size: 32, offset: 704)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "_flock_t", file: !494, line: 35, baseType: !553)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "_LOCK_T", file: !554, line: 34, baseType: !555)
!554 = !DIFile(filename: "gcc-arm-none-eabi-10.3-2021.10/bin/../lib/gcc/arm-none-eabi/10.3.1/../../../../arm-none-eabi/include/sys/lock.h", directory: "/home/mjshen/RTOSExploration")
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 32)
!556 = !DICompositeType(tag: DW_TAG_structure_type, name: "__lock", file: !554, line: 33, flags: DIFlagFwdDecl)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstate", scope: !500, file: !494, line: 233, baseType: !558, size: 64, offset: 736)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "_mbstate_t", file: !532, line: 170, baseType: !559)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !532, line: 162, size: 64, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !559, file: !532, line: 164, baseType: !66, size: 32)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !559, file: !532, line: 169, baseType: !563, size: 32, offset: 32)
!563 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !559, file: !532, line: 165, size: 32, elements: !564)
!564 = !{!565, !568}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !563, file: !532, line: 167, baseType: !566, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !567, line: 116, baseType: !66)
!567 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.6/include/stddef.h", directory: "")
!568 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !563, file: !532, line: 168, baseType: !569, size: 32)
!569 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 32, elements: !288)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !500, file: !494, line: 234, baseType: !66, size: 32, offset: 800)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "_stdout", scope: !493, file: !494, line: 386, baseType: !498, size: 32, offset: 64)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_stderr", scope: !493, file: !494, line: 386, baseType: !498, size: 32, offset: 96)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "_inc", scope: !493, file: !494, line: 388, baseType: !66, size: 32, offset: 128)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_emergency", scope: !493, file: !494, line: 390, baseType: !491, size: 32, offset: 160)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "__sdidinit", scope: !493, file: !494, line: 392, baseType: !66, size: 32, offset: 192)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "_unspecified_locale_info", scope: !493, file: !494, line: 394, baseType: !66, size: 32, offset: 224)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "_locale", scope: !493, file: !494, line: 395, baseType: !578, size: 32, offset: 256)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 32)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "__locale_t", file: !494, line: 45, flags: DIFlagFwdDecl)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "_mp", scope: !493, file: !494, line: 397, baseType: !581, size: 32, offset: 288)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 32)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_mprec", file: !494, line: 349, size: 128, elements: !583)
!583 = !{!584, !597, !598, !599}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "_result", scope: !582, file: !494, line: 352, baseType: !585, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 32)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Bigint", file: !494, line: 52, size: 192, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !586, file: !494, line: 54, baseType: !585, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "_k", scope: !586, file: !494, line: 55, baseType: !66, size: 32, offset: 32)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "_maxwds", scope: !586, file: !494, line: 55, baseType: !66, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "_sign", scope: !586, file: !494, line: 55, baseType: !66, size: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "_wds", scope: !586, file: !494, line: 55, baseType: !66, size: 32, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "_x", scope: !586, file: !494, line: 56, baseType: !594, size: 32, offset: 160)
!594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 32, elements: !194)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ULong", file: !494, line: 22, baseType: !596)
!596 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "_result_k", scope: !582, file: !494, line: 353, baseType: !66, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "_p5s", scope: !582, file: !494, line: 354, baseType: !585, size: 32, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "_freelist", scope: !582, file: !494, line: 355, baseType: !600, size: 32, offset: 96)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "__cleanup", scope: !493, file: !494, line: 399, baseType: !602, size: 32, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 32)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !492}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "_gamma_signgam", scope: !493, file: !494, line: 401, baseType: !66, size: 32, offset: 352)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtlen", scope: !493, file: !494, line: 404, baseType: !66, size: 32, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "_cvtbuf", scope: !493, file: !494, line: 405, baseType: !491, size: 32, offset: 416)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "_r48", scope: !493, file: !494, line: 407, baseType: !609, size: 32, offset: 448)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_rand48", file: !494, line: 324, size: 192, elements: !611)
!611 = !{!612, !614, !615, !616}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "_seed", scope: !610, file: !494, line: 325, baseType: !613, size: 48)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 48, elements: !543)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "_mult", scope: !610, file: !494, line: 326, baseType: !613, size: 48, offset: 48)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "_add", scope: !610, file: !494, line: 327, baseType: !53, size: 16, offset: 96)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "_rand_next", scope: !610, file: !494, line: 330, baseType: !617, size: 64, offset: 128)
!617 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "_localtime_buf", scope: !493, file: !494, line: 408, baseType: !619, size: 32, offset: 480)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 32)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__tm", file: !494, line: 60, size: 288, elements: !621)
!621 = !{!622, !623, !624, !625, !626, !627, !628, !629, !630}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_sec", scope: !620, file: !494, line: 62, baseType: !66, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_min", scope: !620, file: !494, line: 63, baseType: !66, size: 32, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_hour", scope: !620, file: !494, line: 64, baseType: !66, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mday", scope: !620, file: !494, line: 65, baseType: !66, size: 32, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_mon", scope: !620, file: !494, line: 66, baseType: !66, size: 32, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_year", scope: !620, file: !494, line: 67, baseType: !66, size: 32, offset: 160)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_wday", scope: !620, file: !494, line: 68, baseType: !66, size: 32, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_yday", scope: !620, file: !494, line: 69, baseType: !66, size: 32, offset: 224)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "__tm_isdst", scope: !620, file: !494, line: 70, baseType: !66, size: 32, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "_asctime_buf", scope: !493, file: !494, line: 409, baseType: !491, size: 32, offset: 512)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "_sig_func", scope: !493, file: !494, line: 412, baseType: !633, size: 32, offset: 544)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!635 = !DISubroutineType(types: !636)
!636 = !{null, !66}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit", scope: !493, file: !494, line: 416, baseType: !638, size: 32, offset: 576)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_atexit", file: !494, line: 90, size: 1120, elements: !640)
!640 = !{!641, !642, !643, !647}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !639, file: !494, line: 91, baseType: !638, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "_ind", scope: !639, file: !494, line: 92, baseType: !66, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "_fns", scope: !639, file: !494, line: 93, baseType: !644, size: 1024, offset: 64)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 1024, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 32)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "_on_exit_args_ptr", scope: !639, file: !494, line: 94, baseType: !648, size: 32, offset: 1088)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_on_exit_args", file: !494, line: 79, size: 2112, elements: !650)
!650 = !{!651, !653, !654, !655}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "_fnargs", scope: !649, file: !494, line: 80, baseType: !652, size: 1024)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 1024, elements: !645)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "_dso_handle", scope: !649, file: !494, line: 81, baseType: !652, size: 1024, offset: 1024)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "_fntypes", scope: !649, file: !494, line: 83, baseType: !595, size: 32, offset: 2048)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "_is_cxa", scope: !649, file: !494, line: 86, baseType: !595, size: 32, offset: 2080)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "_atexit0", scope: !493, file: !494, line: 417, baseType: !639, size: 1120, offset: 608)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "__sglue", scope: !493, file: !494, line: 420, baseType: !658, size: 96, offset: 1728)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_glue", file: !494, line: 296, size: 96, elements: !659)
!659 = !{!660, !662, !663}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "_next", scope: !658, file: !494, line: 298, baseType: !661, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "_niobs", scope: !658, file: !494, line: 299, baseType: !66, size: 32, offset: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "_iobs", scope: !658, file: !494, line: 300, baseType: !498, size: 32, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "__sf", scope: !493, file: !494, line: 421, baseType: !498, size: 32, offset: 1824)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "_misc", scope: !493, file: !494, line: 422, baseType: !666, size: 32, offset: 1856)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 32)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_misc_reent", file: !494, line: 359, size: 640, elements: !668)
!668 = !{!669, !670, !671, !672, !673, !675, !676, !677, !678, !679, !680}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "_strtok_last", scope: !667, file: !494, line: 362, baseType: !491, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "_mblen_state", scope: !667, file: !494, line: 363, baseType: !558, size: 64, offset: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "_wctomb_state", scope: !667, file: !494, line: 364, baseType: !558, size: 64, offset: 96)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "_mbtowc_state", scope: !667, file: !494, line: 365, baseType: !558, size: 64, offset: 160)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "_l64a_buf", scope: !667, file: !494, line: 366, baseType: !674, size: 64, offset: 224)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 64, elements: !231)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "_getdate_err", scope: !667, file: !494, line: 367, baseType: !66, size: 32, offset: 288)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrlen_state", scope: !667, file: !494, line: 368, baseType: !558, size: 64, offset: 320)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "_mbrtowc_state", scope: !667, file: !494, line: 369, baseType: !558, size: 64, offset: 384)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "_mbsrtowcs_state", scope: !667, file: !494, line: 370, baseType: !558, size: 64, offset: 448)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "_wcrtomb_state", scope: !667, file: !494, line: 371, baseType: !558, size: 64, offset: 512)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "_wcsrtombs_state", scope: !667, file: !494, line: 372, baseType: !558, size: 64, offset: 576)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "_signal_buf", scope: !493, file: !494, line: 423, baseType: !491, size: 32, offset: 1888)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !567, line: 46, baseType: !7)
!683 = distinct !DICompileUnit(language: DW_LANG_C99, file: !684, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !685, globals: !686, splitDebugInlining: false, nameTableKind: None)
!684 = !DIFile(filename: "syscalls.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!685 = !{!491, !489}
!686 = !{!483}
!687 = !{!688, !689, !690, !691}
!688 = !DILocalVariable(name: "r", arg: 1, scope: !485, file: !486, line: 63, type: !492)
!689 = !DILocalVariable(name: "nbytes", arg: 2, scope: !485, file: !486, line: 63, type: !682)
!690 = !DILocalVariable(name: "prev_heap_end", scope: !485, file: !486, line: 67, type: !491)
!691 = !DILocalVariable(name: "stack", scope: !485, file: !486, line: 68, type: !491)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "build_date_time_str", scope: !694, file: !699, line: 4, type: !705, isLocal: false, isDefinition: true)
!694 = distinct !DICompileUnit(language: DW_LANG_C99, file: !695, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !696, splitDebugInlining: false, nameTableKind: None)
!695 = !DIFile(filename: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC/build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!696 = !{!692, !697, !703}
!697 = !DIGlobalVariableExpression(var: !698, expr: !DIExpression())
!698 = distinct !DIGlobalVariable(name: "sw_verno_str", scope: !694, file: !699, line: 5, type: !700, isLocal: false, isDefinition: true)
!699 = !DIFile(filename: "build/middleware/MTK/verno/verno.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 88, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 11)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "hw_verno_str", scope: !694, file: !699, line: 6, type: !700, isLocal: false, isDefinition: true)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 248, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 31)
!708 = distinct !DICompileUnit(language: DW_LANG_C99, file: !709, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !710, retainedTypes: !716, splitDebugInlining: false, nameTableKind: None)
!709 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_gpio_7687.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!710 = !{!711}
!711 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !712, line: 1209, baseType: !7, size: 32, elements: !713)
!712 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_gpio_7687.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!713 = !{!714, !715}
!714 = !DIEnumerator(name: "ePAD_CONTROL_BY_N9", value: 0)
!715 = !DIEnumerator(name: "ePAD_CONTROL_BY_CM4", value: 1)
!716 = !{!717, !719}
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "kal_uint32", file: !9, line: 116, baseType: !7)
!720 = distinct !DICompileUnit(language: DW_LANG_C99, file: !721, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !722, retainedTypes: !800, splitDebugInlining: false, nameTableKind: None)
!721 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/hal_pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!722 = !{!723}
!723 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !724, line: 150, baseType: !7, size: 32, elements: !725)
!724 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/hal_pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799}
!726 = !DIEnumerator(name: "ePAD_ANTSEL0", value: 0)
!727 = !DIEnumerator(name: "ePAD_ANTSEL1", value: 1)
!728 = !DIEnumerator(name: "ePAD_ANTSEL2", value: 2)
!729 = !DIEnumerator(name: "ePAD_ANTSEL3", value: 3)
!730 = !DIEnumerator(name: "ePAD_ANTSEL4", value: 4)
!731 = !DIEnumerator(name: "ePAD_ANTSEL5", value: 5)
!732 = !DIEnumerator(name: "ePAD_ANTSEL6", value: 6)
!733 = !DIEnumerator(name: "ePAD_ANTSEL7", value: 7)
!734 = !DIEnumerator(name: "ePAD_IN_GPIO8", value: 8)
!735 = !DIEnumerator(name: "ePAD_IN_GPIO9", value: 9)
!736 = !DIEnumerator(name: "ePAD_IN_GPIO10", value: 10)
!737 = !DIEnumerator(name: "ePAD_IN_GPIO11", value: 11)
!738 = !DIEnumerator(name: "ePAD_IN_GPIO12", value: 12)
!739 = !DIEnumerator(name: "ePAD_IN_GPIO13", value: 13)
!740 = !DIEnumerator(name: "ePAD_IN_GPIO14", value: 14)
!741 = !DIEnumerator(name: "ePAD_IN_GPIO15", value: 15)
!742 = !DIEnumerator(name: "ePAD_IN_GPIO16", value: 16)
!743 = !DIEnumerator(name: "ePAD_IN_GPIO17", value: 17)
!744 = !DIEnumerator(name: "ePAD_IN_GPIO18", value: 18)
!745 = !DIEnumerator(name: "ePAD_IN_GPIO19", value: 19)
!746 = !DIEnumerator(name: "ePAD_IN_GPIO20", value: 20)
!747 = !DIEnumerator(name: "ePAD_IN_GPIO21", value: 21)
!748 = !DIEnumerator(name: "ePAD_IN_GPIO22", value: 22)
!749 = !DIEnumerator(name: "ePAD_IN_UART0_TXD", value: 23)
!750 = !DIEnumerator(name: "ePAD_PERST_N", value: 24)
!751 = !DIEnumerator(name: "ePAD_WAKE_N", value: 25)
!752 = !DIEnumerator(name: "ePAD_CLK_REQ_N", value: 26)
!753 = !DIEnumerator(name: "ePAD_SDIO_CLK", value: 27)
!754 = !DIEnumerator(name: "ePAD_SDIO_CMD", value: 28)
!755 = !DIEnumerator(name: "ePAD_SDIO_DAT3", value: 29)
!756 = !DIEnumerator(name: "ePAD_SDIO_DAT2", value: 30)
!757 = !DIEnumerator(name: "ePAD_SDIO_DAT1", value: 31)
!758 = !DIEnumerator(name: "ePAD_SDIO_DAT0", value: 32)
!759 = !DIEnumerator(name: "ePAD_GPIO0", value: 33)
!760 = !DIEnumerator(name: "ePAD_GPIO1", value: 34)
!761 = !DIEnumerator(name: "ePAD_UART_DBG", value: 35)
!762 = !DIEnumerator(name: "ePAD_UART_RX", value: 36)
!763 = !DIEnumerator(name: "ePAD_UART_TX", value: 37)
!764 = !DIEnumerator(name: "ePAD_UART_RTS", value: 38)
!765 = !DIEnumerator(name: "ePAD_UART_CTS", value: 39)
!766 = !DIEnumerator(name: "ePAD_IN_GPIO44", value: 40)
!767 = !DIEnumerator(name: "ePAD_IN_GPIO45", value: 41)
!768 = !DIEnumerator(name: "ePAD_IN_GPIO46", value: 42)
!769 = !DIEnumerator(name: "ePAD_IN_GPIO47", value: 43)
!770 = !DIEnumerator(name: "ePAD_IN_GPIO48", value: 44)
!771 = !DIEnumerator(name: "ePAD_IN_GPIO49", value: 45)
!772 = !DIEnumerator(name: "ePAD_IN_GPIO50", value: 46)
!773 = !DIEnumerator(name: "ePAD_IN_GPIO51", value: 47)
!774 = !DIEnumerator(name: "ePAD_IN_GPIO52", value: 48)
!775 = !DIEnumerator(name: "ePAD_IN_GPIO53", value: 49)
!776 = !DIEnumerator(name: "ePAD_IN_GPIO54", value: 50)
!777 = !DIEnumerator(name: "ePAD_IN_PWM2", value: 51)
!778 = !DIEnumerator(name: "ePAD_IN_PWM3", value: 52)
!779 = !DIEnumerator(name: "ePAD_IN_PWM4", value: 53)
!780 = !DIEnumerator(name: "ePAD_IN_PWM5", value: 54)
!781 = !DIEnumerator(name: "ePAD_IN_PWM6", value: 55)
!782 = !DIEnumerator(name: "ePAD_IN_PWM7", value: 56)
!783 = !DIEnumerator(name: "ePAD_WF_RF_DIS_B", value: 57)
!784 = !DIEnumerator(name: "ePAD_BT_RF_DIS_B", value: 58)
!785 = !DIEnumerator(name: "ePAD_WF_LED_B", value: 59)
!786 = !DIEnumerator(name: "ePAD_BT_LED_B", value: 60)
!787 = !DIEnumerator(name: "ePAD_IN_ADC4", value: 61)
!788 = !DIEnumerator(name: "ePAD_IN_ADC5", value: 62)
!789 = !DIEnumerator(name: "ePAD_IN_ADC6", value: 63)
!790 = !DIEnumerator(name: "ePAD_IN_ADC7", value: 64)
!791 = !DIEnumerator(name: "ePAD_IN_ADC8", value: 65)
!792 = !DIEnumerator(name: "ePAD_IN_ADC9", value: 66)
!793 = !DIEnumerator(name: "ePAD_IN_ADC10", value: 67)
!794 = !DIEnumerator(name: "ePAD_IN_ADC11", value: 68)
!795 = !DIEnumerator(name: "ePAD_IN_ADC12", value: 69)
!796 = !DIEnumerator(name: "ePAD_IN_ADC13", value: 70)
!797 = !DIEnumerator(name: "ePAD_IN_ADC14", value: 71)
!798 = !DIEnumerator(name: "ePAD_IN_ADC15", value: 72)
!799 = !DIEnumerator(name: "ePAD_NUM", value: 73)
!800 = !{!717, !8}
!801 = distinct !DICompileUnit(language: DW_LANG_C99, file: !802, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !803, splitDebugInlining: false, nameTableKind: None)
!802 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/nvic.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!803 = !{!804, !829}
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 32)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "SCB_Type", file: !226, line: 418, baseType: !806)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !226, line: 395, size: 1120, elements: !807)
!807 = !{!808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "CPUID", scope: !806, file: !226, line: 397, baseType: !263, size: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "ICSR", scope: !806, file: !226, line: 398, baseType: !11, size: 32, offset: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "VTOR", scope: !806, file: !226, line: 399, baseType: !11, size: 32, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "AIRCR", scope: !806, file: !226, line: 400, baseType: !11, size: 32, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "SCR", scope: !806, file: !226, line: 401, baseType: !11, size: 32, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "CCR", scope: !806, file: !226, line: 402, baseType: !11, size: 32, offset: 160)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "SHP", scope: !806, file: !226, line: 403, baseType: !270, size: 96, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "SHCSR", scope: !806, file: !226, line: 404, baseType: !11, size: 32, offset: 288)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "CFSR", scope: !806, file: !226, line: 405, baseType: !11, size: 32, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "HFSR", scope: !806, file: !226, line: 406, baseType: !11, size: 32, offset: 352)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "DFSR", scope: !806, file: !226, line: 407, baseType: !11, size: 32, offset: 384)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "MMFAR", scope: !806, file: !226, line: 408, baseType: !11, size: 32, offset: 416)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "BFAR", scope: !806, file: !226, line: 409, baseType: !11, size: 32, offset: 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "AFSR", scope: !806, file: !226, line: 410, baseType: !11, size: 32, offset: 480)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "PFR", scope: !806, file: !226, line: 411, baseType: !281, size: 64, offset: 512)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "DFR", scope: !806, file: !226, line: 412, baseType: !263, size: 32, offset: 576)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "ADR", scope: !806, file: !226, line: 413, baseType: !263, size: 32, offset: 608)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "MMFR", scope: !806, file: !226, line: 414, baseType: !287, size: 128, offset: 640)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "ISAR", scope: !806, file: !226, line: 415, baseType: !291, size: 160, offset: 768)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !806, file: !226, line: 416, baseType: !295, size: 160, offset: 928)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "CPACR", scope: !806, file: !226, line: 417, baseType: !11, size: 32, offset: 1088)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !226, line: 378, baseType: !831)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !226, line: 363, size: 28704, elements: !832)
!832 = !{!833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !831, file: !226, line: 365, baseType: !230, size: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !831, file: !226, line: 366, baseType: !234, size: 768, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !831, file: !226, line: 367, baseType: !230, size: 256, offset: 1024)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !831, file: !226, line: 368, baseType: !234, size: 768, offset: 1280)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !831, file: !226, line: 369, baseType: !230, size: 256, offset: 2048)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !831, file: !226, line: 370, baseType: !234, size: 768, offset: 2304)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !831, file: !226, line: 371, baseType: !230, size: 256, offset: 3072)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !831, file: !226, line: 372, baseType: !234, size: 768, offset: 3328)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !831, file: !226, line: 373, baseType: !230, size: 256, offset: 4096)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !831, file: !226, line: 374, baseType: !245, size: 1792, offset: 4352)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "IP", scope: !831, file: !226, line: 375, baseType: !249, size: 1920, offset: 6144)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !831, file: !226, line: 376, baseType: !254, size: 20608, offset: 8064)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !831, file: !226, line: 377, baseType: !11, size: 32, offset: 28672)
!846 = distinct !DICompileUnit(language: DW_LANG_C99, file: !847, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !848, splitDebugInlining: false, nameTableKind: None)
!847 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/pinmux.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!848 = !{!849, !723}
!849 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !850, line: 55, baseType: !7, size: 32, elements: !851)
!850 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/pinmux.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!851 = !{!852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879}
!852 = !DIEnumerator(name: "eIOT_GPIO_IDX_0", value: 0)
!853 = !DIEnumerator(name: "eIOT_GPIO_IDX_1", value: 1)
!854 = !DIEnumerator(name: "eIOT_GPIO_IDX_2", value: 2)
!855 = !DIEnumerator(name: "eIOT_GPIO_IDX_3", value: 3)
!856 = !DIEnumerator(name: "eIOT_GPIO_IDX_4", value: 4)
!857 = !DIEnumerator(name: "eIOT_GPIO_IDX_5", value: 5)
!858 = !DIEnumerator(name: "eIOT_GPIO_IDX_6", value: 6)
!859 = !DIEnumerator(name: "eIOT_GPIO_IDX_7", value: 7)
!860 = !DIEnumerator(name: "eIOT_GPIO_IDX_24", value: 24)
!861 = !DIEnumerator(name: "eIOT_GPIO_IDX_25", value: 25)
!862 = !DIEnumerator(name: "eIOT_GPIO_IDX_26", value: 26)
!863 = !DIEnumerator(name: "eIOT_GPIO_IDX_27", value: 27)
!864 = !DIEnumerator(name: "eIOT_GPIO_IDX_28", value: 28)
!865 = !DIEnumerator(name: "eIOT_GPIO_IDX_29", value: 29)
!866 = !DIEnumerator(name: "eIOT_GPIO_IDX_30", value: 30)
!867 = !DIEnumerator(name: "eIOT_GPIO_IDX_31", value: 31)
!868 = !DIEnumerator(name: "eIOT_GPIO_IDX_32", value: 32)
!869 = !DIEnumerator(name: "eIOT_GPIO_IDX_33", value: 33)
!870 = !DIEnumerator(name: "eIOT_GPIO_IDX_34", value: 34)
!871 = !DIEnumerator(name: "eIOT_GPIO_IDX_35", value: 35)
!872 = !DIEnumerator(name: "eIOT_GPIO_IDX_36", value: 36)
!873 = !DIEnumerator(name: "eIOT_GPIO_IDX_37", value: 37)
!874 = !DIEnumerator(name: "eIOT_GPIO_IDX_38", value: 38)
!875 = !DIEnumerator(name: "eIOT_GPIO_IDX_39", value: 39)
!876 = !DIEnumerator(name: "eIOT_GPIO_IDX_57", value: 57)
!877 = !DIEnumerator(name: "eIOT_GPIO_IDX_58", value: 58)
!878 = !DIEnumerator(name: "eIOT_GPIO_IDX_59", value: 59)
!879 = !DIEnumerator(name: "eIOT_GPIO_IDX_60", value: 60)
!880 = distinct !DICompileUnit(language: DW_LANG_C99, file: !881, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!881 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_log.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!882 = distinct !DICompileUnit(language: DW_LANG_C99, file: !883, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !884, retainedTypes: !948, splitDebugInlining: false, nameTableKind: None)
!883 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/hal_gpio.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!884 = !{!885, !892, !849, !923, !929, !933, !937, !943}
!885 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !886, line: 233, baseType: !66, size: 32, elements: !887)
!886 = !DIFile(filename: "../../../../../driver/chip/inc/hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!887 = !{!888, !889, !890, !891}
!888 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR", value: -3)
!889 = !DIEnumerator(name: "HAL_PINMUX_STATUS_ERROR_PORT", value: -2)
!890 = !DIEnumerator(name: "HAL_PINMUX_STATUS_INVALID_FUNCTION", value: -1)
!891 = !DIEnumerator(name: "HAL_PINMUX_STATUS_OK", value: 0)
!892 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !323, line: 249, baseType: !7, size: 32, elements: !893)
!893 = !{!894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922}
!894 = !DIEnumerator(name: "HAL_GPIO_0", value: 0)
!895 = !DIEnumerator(name: "HAL_GPIO_1", value: 1)
!896 = !DIEnumerator(name: "HAL_GPIO_2", value: 2)
!897 = !DIEnumerator(name: "HAL_GPIO_3", value: 3)
!898 = !DIEnumerator(name: "HAL_GPIO_4", value: 4)
!899 = !DIEnumerator(name: "HAL_GPIO_5", value: 5)
!900 = !DIEnumerator(name: "HAL_GPIO_6", value: 6)
!901 = !DIEnumerator(name: "HAL_GPIO_7", value: 7)
!902 = !DIEnumerator(name: "HAL_GPIO_24", value: 24)
!903 = !DIEnumerator(name: "HAL_GPIO_25", value: 25)
!904 = !DIEnumerator(name: "HAL_GPIO_26", value: 26)
!905 = !DIEnumerator(name: "HAL_GPIO_27", value: 27)
!906 = !DIEnumerator(name: "HAL_GPIO_28", value: 28)
!907 = !DIEnumerator(name: "HAL_GPIO_29", value: 29)
!908 = !DIEnumerator(name: "HAL_GPIO_30", value: 30)
!909 = !DIEnumerator(name: "HAL_GPIO_31", value: 31)
!910 = !DIEnumerator(name: "HAL_GPIO_32", value: 32)
!911 = !DIEnumerator(name: "HAL_GPIO_33", value: 33)
!912 = !DIEnumerator(name: "HAL_GPIO_34", value: 34)
!913 = !DIEnumerator(name: "HAL_GPIO_35", value: 35)
!914 = !DIEnumerator(name: "HAL_GPIO_36", value: 36)
!915 = !DIEnumerator(name: "HAL_GPIO_37", value: 37)
!916 = !DIEnumerator(name: "HAL_GPIO_38", value: 38)
!917 = !DIEnumerator(name: "HAL_GPIO_39", value: 39)
!918 = !DIEnumerator(name: "HAL_GPIO_57", value: 57)
!919 = !DIEnumerator(name: "HAL_GPIO_58", value: 58)
!920 = !DIEnumerator(name: "HAL_GPIO_59", value: 59)
!921 = !DIEnumerator(name: "HAL_GPIO_60", value: 60)
!922 = !DIEnumerator(name: "HAL_GPIO_MAX", value: 61)
!923 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !886, line: 224, baseType: !66, size: 32, elements: !924)
!924 = !{!925, !926, !927, !928}
!925 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR", value: -3)
!926 = !DIEnumerator(name: "HAL_GPIO_STATUS_ERROR_PIN", value: -2)
!927 = !DIEnumerator(name: "HAL_GPIO_STATUS_INVALID_PARAMETER", value: -1)
!928 = !DIEnumerator(name: "HAL_GPIO_STATUS_OK", value: 0)
!929 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !886, line: 217, baseType: !7, size: 32, elements: !930)
!930 = !{!931, !932}
!931 = !DIEnumerator(name: "HAL_GPIO_DATA_LOW", value: 0)
!932 = !DIEnumerator(name: "HAL_GPIO_DATA_HIGH", value: 1)
!933 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !886, line: 210, baseType: !7, size: 32, elements: !934)
!934 = !{!935, !936}
!935 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_INPUT", value: 0)
!936 = !DIEnumerator(name: "HAL_GPIO_DIRECTION_OUTPUT", value: 1)
!937 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !886, line: 242, baseType: !7, size: 32, elements: !938)
!938 = !{!939, !940, !941, !942}
!939 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_4MA", value: 0)
!940 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_8MA", value: 1)
!941 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_12MA", value: 2)
!942 = !DIEnumerator(name: "HAL_GPIO_DRIVING_CURRENT_16MA", value: 3)
!943 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !944, line: 57, baseType: !7, size: 32, elements: !945)
!944 = !DIFile(filename: "../../../../../driver/chip/mt7687/src/common/include/low_hal_gpio.h", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!945 = !{!946, !947}
!946 = !DIEnumerator(name: "eDirection_IN", value: 0)
!947 = !DIEnumerator(name: "eDirection_OUT", value: 1)
!948 = !{!949, !116, !950, !118, !951, !952}
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_IOT_GPIO_NAME_T", file: !850, line: 87, baseType: !849)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_data_t", file: !886, line: 220, baseType: !929)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "hal_gpio_driving_current_t", file: !886, line: 247, baseType: !937)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "ENUM_DIR_T", file: !944, line: 60, baseType: !943)
!953 = distinct !DICompileUnit(language: DW_LANG_C99, file: !954, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !955, splitDebugInlining: false, nameTableKind: None)
!954 = !DIFile(filename: "../../../../../project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/src/main.c", directory: "/home/mjshen/RTOSExploration/Embedded-GUI-for-MT2523/project/mt7687_hdk/hal_examples/aes_encrypt_decrypt_data/GCC")
!955 = !{!322, !328, !344, !350, !354, !892}
!956 = !{!"Ubuntu clang version 14.0.6"}
!957 = !{i32 7, !"Dwarf Version", i32 2}
!958 = !{i32 2, !"Debug Info Version", i32 3}
!959 = !{i32 1, !"wchar_size", i32 4}
!960 = !{i32 1, !"min_enum_size", i32 4}
!961 = !{i32 1, !"branch-target-enforcement", i32 0}
!962 = !{i32 1, !"sign-return-address", i32 0}
!963 = !{i32 1, !"sign-return-address-all", i32 0}
!964 = !{i32 1, !"sign-return-address-with-bkey", i32 0}
!965 = !{i32 7, !"frame-pointer", i32 2}
!966 = distinct !DISubprogram(name: "halGPIO_ConfDirection", scope: !709, file: !709, line: 54, type: !967, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !708, retainedNodes: !970)
!967 = !DISubroutineType(types: !968)
!968 = !{!969, !8, !54}
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "INT32", file: !9, line: 56, baseType: !66)
!970 = !{!971, !972, !973, !975}
!971 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !966, file: !709, line: 54, type: !8)
!972 = !DILocalVariable(name: "outEnable", arg: 2, scope: !966, file: !709, line: 54, type: !54)
!973 = !DILocalVariable(name: "no", scope: !966, file: !709, line: 57, type: !974)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "UINT16", file: !9, line: 60, baseType: !53)
!975 = !DILocalVariable(name: "remainder", scope: !966, file: !709, line: 58, type: !974)
!976 = !DILocation(line: 0, scope: !966)
!977 = !DILocation(line: 59, column: 19, scope: !966)
!978 = !DILocation(line: 60, column: 17, scope: !966)
!979 = !DILocation(line: 61, column: 5, scope: !966)
!980 = !DILocation(line: 65, column: 27, scope: !981)
!981 = distinct !DILexicalBlock(scope: !982, file: !709, line: 65, column: 17)
!982 = distinct !DILexicalBlock(scope: !966, file: !709, line: 61, column: 17)
!983 = !DILocation(line: 0, scope: !981)
!984 = !DILocation(line: 65, column: 17, scope: !982)
!985 = !DILocation(line: 66, column: 21, scope: !986)
!986 = distinct !DILexicalBlock(scope: !981, file: !709, line: 65, column: 33)
!987 = !DILocation(line: 67, column: 73, scope: !988)
!988 = distinct !DILexicalBlock(scope: !989, file: !709, line: 66, column: 38)
!989 = distinct !DILexicalBlock(scope: !986, file: !709, line: 66, column: 21)
!990 = !DILocation(line: 67, column: 69, scope: !988)
!991 = !DILocation(line: 67, column: 66, scope: !988)
!992 = !DILocation(line: 68, column: 17, scope: !988)
!993 = !DILocation(line: 68, column: 28, scope: !989)
!994 = !DILocation(line: 69, column: 77, scope: !995)
!995 = distinct !DILexicalBlock(scope: !996, file: !709, line: 68, column: 45)
!996 = distinct !DILexicalBlock(scope: !989, file: !709, line: 68, column: 28)
!997 = !DILocation(line: 70, column: 77, scope: !995)
!998 = !DILocation(line: 71, column: 17, scope: !995)
!999 = !DILocation(line: 72, column: 77, scope: !1000)
!1000 = distinct !DILexicalBlock(scope: !1001, file: !709, line: 71, column: 45)
!1001 = distinct !DILexicalBlock(scope: !996, file: !709, line: 71, column: 28)
!1002 = !DILocation(line: 73, column: 77, scope: !1000)
!1003 = !DILocation(line: 74, column: 17, scope: !1000)
!1004 = !DILocation(line: 75, column: 79, scope: !1005)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !709, line: 74, column: 45)
!1006 = distinct !DILexicalBlock(scope: !1001, file: !709, line: 74, column: 28)
!1007 = !DILocation(line: 76, column: 79, scope: !1005)
!1008 = !DILocation(line: 77, column: 17, scope: !1005)
!1009 = !DILocation(line: 78, column: 79, scope: !1010)
!1010 = distinct !DILexicalBlock(scope: !1011, file: !709, line: 77, column: 45)
!1011 = distinct !DILexicalBlock(scope: !1006, file: !709, line: 77, column: 28)
!1012 = !DILocation(line: 79, column: 79, scope: !1010)
!1013 = !DILocation(line: 80, column: 17, scope: !1010)
!1014 = !DILocation(line: 81, column: 79, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1016, file: !709, line: 80, column: 45)
!1016 = distinct !DILexicalBlock(scope: !1011, file: !709, line: 80, column: 28)
!1017 = !DILocation(line: 82, column: 79, scope: !1015)
!1018 = !DILocation(line: 83, column: 17, scope: !1015)
!1019 = !DILocation(line: 85, column: 17, scope: !986)
!1020 = !DILocation(line: 86, column: 13, scope: !986)
!1021 = !DILocation(line: 88, column: 21, scope: !1022)
!1022 = distinct !DILexicalBlock(scope: !981, file: !709, line: 86, column: 20)
!1023 = !DILocation(line: 89, column: 72, scope: !1024)
!1024 = distinct !DILexicalBlock(scope: !1025, file: !709, line: 88, column: 38)
!1025 = distinct !DILexicalBlock(scope: !1022, file: !709, line: 88, column: 21)
!1026 = !DILocation(line: 89, column: 66, scope: !1024)
!1027 = !DILocation(line: 90, column: 17, scope: !1024)
!1028 = !DILocation(line: 90, column: 28, scope: !1025)
!1029 = !DILocation(line: 91, column: 77, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1031, file: !709, line: 90, column: 45)
!1031 = distinct !DILexicalBlock(scope: !1025, file: !709, line: 90, column: 28)
!1032 = !DILocation(line: 92, column: 17, scope: !1030)
!1033 = !DILocation(line: 93, column: 77, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1035, file: !709, line: 92, column: 45)
!1035 = distinct !DILexicalBlock(scope: !1031, file: !709, line: 92, column: 28)
!1036 = !DILocation(line: 94, column: 17, scope: !1034)
!1037 = !DILocation(line: 95, column: 79, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1039, file: !709, line: 94, column: 45)
!1039 = distinct !DILexicalBlock(scope: !1035, file: !709, line: 94, column: 28)
!1040 = !DILocation(line: 96, column: 17, scope: !1038)
!1041 = !DILocation(line: 97, column: 79, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1043, file: !709, line: 96, column: 45)
!1043 = distinct !DILexicalBlock(scope: !1039, file: !709, line: 96, column: 28)
!1044 = !DILocation(line: 98, column: 17, scope: !1042)
!1045 = !DILocation(line: 99, column: 79, scope: !1046)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !709, line: 98, column: 45)
!1047 = distinct !DILexicalBlock(scope: !1043, file: !709, line: 98, column: 28)
!1048 = !DILocation(line: 100, column: 17, scope: !1046)
!1049 = !DILocation(line: 103, column: 17, scope: !1022)
!1050 = !DILocation(line: 109, column: 27, scope: !1051)
!1051 = distinct !DILexicalBlock(scope: !982, file: !709, line: 109, column: 17)
!1052 = !DILocation(line: 0, scope: !1051)
!1053 = !DILocation(line: 109, column: 17, scope: !982)
!1054 = !DILocation(line: 110, column: 21, scope: !1055)
!1055 = distinct !DILexicalBlock(scope: !1051, file: !709, line: 109, column: 33)
!1056 = !DILocation(line: 111, column: 73, scope: !1057)
!1057 = distinct !DILexicalBlock(scope: !1058, file: !709, line: 110, column: 36)
!1058 = distinct !DILexicalBlock(scope: !1055, file: !709, line: 110, column: 21)
!1059 = !DILocation(line: 111, column: 69, scope: !1057)
!1060 = !DILocation(line: 111, column: 66, scope: !1057)
!1061 = !DILocation(line: 112, column: 17, scope: !1057)
!1062 = !DILocation(line: 113, column: 79, scope: !1063)
!1063 = distinct !DILexicalBlock(scope: !1058, file: !709, line: 112, column: 24)
!1064 = !DILocation(line: 114, column: 79, scope: !1063)
!1065 = !DILocation(line: 117, column: 17, scope: !1055)
!1066 = !DILocation(line: 118, column: 13, scope: !1055)
!1067 = !DILocation(line: 120, column: 21, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1051, file: !709, line: 118, column: 20)
!1069 = !DILocation(line: 121, column: 72, scope: !1070)
!1070 = distinct !DILexicalBlock(scope: !1071, file: !709, line: 120, column: 36)
!1071 = distinct !DILexicalBlock(scope: !1068, file: !709, line: 120, column: 21)
!1072 = !DILocation(line: 121, column: 66, scope: !1070)
!1073 = !DILocation(line: 122, column: 17, scope: !1070)
!1074 = !DILocation(line: 123, column: 79, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1071, file: !709, line: 122, column: 24)
!1076 = !DILocation(line: 126, column: 17, scope: !1068)
!1077 = !DILocation(line: 133, column: 1, scope: !966)
!1078 = distinct !DISubprogram(name: "halGPO_Write", scope: !709, file: !709, line: 136, type: !967, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !708, retainedNodes: !1079)
!1079 = !{!1080, !1081, !1082, !1083}
!1080 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1078, file: !709, line: 136, type: !8)
!1081 = !DILocalVariable(name: "writeValue", arg: 2, scope: !1078, file: !709, line: 136, type: !54)
!1082 = !DILocalVariable(name: "no", scope: !1078, file: !709, line: 138, type: !974)
!1083 = !DILocalVariable(name: "remainder", scope: !1078, file: !709, line: 139, type: !974)
!1084 = !DILocation(line: 0, scope: !1078)
!1085 = !DILocation(line: 140, column: 19, scope: !1078)
!1086 = !DILocation(line: 141, column: 17, scope: !1078)
!1087 = !DILocation(line: 142, column: 5, scope: !1078)
!1088 = !DILocation(line: 145, column: 17, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !1090, file: !709, line: 145, column: 17)
!1090 = distinct !DILexicalBlock(scope: !1078, file: !709, line: 142, column: 17)
!1091 = !DILocation(line: 0, scope: !1089)
!1092 = !DILocation(line: 145, column: 17, scope: !1090)
!1093 = !DILocation(line: 146, column: 17, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1089, file: !709, line: 145, column: 29)
!1095 = !DILocation(line: 147, column: 13, scope: !1094)
!1096 = !DILocation(line: 148, column: 17, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1089, file: !709, line: 147, column: 20)
!1098 = !DILocation(line: 153, column: 17, scope: !1099)
!1099 = distinct !DILexicalBlock(scope: !1090, file: !709, line: 153, column: 17)
!1100 = !DILocation(line: 0, scope: !1099)
!1101 = !DILocation(line: 153, column: 17, scope: !1090)
!1102 = !DILocation(line: 154, column: 17, scope: !1103)
!1103 = distinct !DILexicalBlock(scope: !1099, file: !709, line: 153, column: 29)
!1104 = !DILocation(line: 155, column: 13, scope: !1103)
!1105 = !DILocation(line: 156, column: 17, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1099, file: !709, line: 155, column: 20)
!1107 = !DILocation(line: 163, column: 1, scope: !1078)
!1108 = distinct !DISubprogram(name: "halgetGPIO_DOUT", scope: !709, file: !709, line: 169, type: !1109, scopeLine: 170, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !708, retainedNodes: !1111)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!54, !8}
!1111 = !{!1112, !1113, !1114, !1115}
!1112 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1108, file: !709, line: 169, type: !8)
!1113 = !DILocalVariable(name: "no", scope: !1108, file: !709, line: 171, type: !974)
!1114 = !DILocalVariable(name: "remainder", scope: !1108, file: !709, line: 172, type: !974)
!1115 = !DILocalVariable(name: "dout", scope: !1108, file: !709, line: 175, type: !54)
!1116 = !DILocation(line: 0, scope: !1108)
!1117 = !DILocation(line: 173, column: 19, scope: !1108)
!1118 = !DILocation(line: 174, column: 17, scope: !1108)
!1119 = !DILocation(line: 177, column: 5, scope: !1108)
!1120 = !DILocation(line: 183, column: 13, scope: !1121)
!1121 = distinct !DILexicalBlock(scope: !1108, file: !709, line: 177, column: 17)
!1122 = !DILocation(line: 0, scope: !1121)
!1123 = !DILocation(line: 187, column: 5, scope: !1108)
!1124 = !DILocation(line: 188, column: 1, scope: !1108)
!1125 = distinct !DISubprogram(name: "halgetGPIO_DIN", scope: !709, file: !709, line: 189, type: !1109, scopeLine: 190, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !708, retainedNodes: !1126)
!1126 = !{!1127, !1128, !1129, !1130}
!1127 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1125, file: !709, line: 189, type: !8)
!1128 = !DILocalVariable(name: "no", scope: !1125, file: !709, line: 191, type: !974)
!1129 = !DILocalVariable(name: "remainder", scope: !1125, file: !709, line: 192, type: !974)
!1130 = !DILocalVariable(name: "din", scope: !1125, file: !709, line: 195, type: !54)
!1131 = !DILocation(line: 0, scope: !1125)
!1132 = !DILocation(line: 193, column: 19, scope: !1125)
!1133 = !DILocation(line: 194, column: 17, scope: !1125)
!1134 = !DILocation(line: 196, column: 5, scope: !1125)
!1135 = !DILocation(line: 203, column: 13, scope: !1136)
!1136 = distinct !DILexicalBlock(scope: !1125, file: !709, line: 196, column: 17)
!1137 = !DILocation(line: 0, scope: !1136)
!1138 = !DILocation(line: 208, column: 5, scope: !1125)
!1139 = !DILocation(line: 209, column: 1, scope: !1125)
!1140 = distinct !DISubprogram(name: "halgetGPIO_OutEnable", scope: !709, file: !709, line: 210, type: !1109, scopeLine: 211, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !708, retainedNodes: !1141)
!1141 = !{!1142, !1143, !1144, !1145}
!1142 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1140, file: !709, line: 210, type: !8)
!1143 = !DILocalVariable(name: "no", scope: !1140, file: !709, line: 212, type: !974)
!1144 = !DILocalVariable(name: "remainder", scope: !1140, file: !709, line: 213, type: !974)
!1145 = !DILocalVariable(name: "outEnable", scope: !1140, file: !709, line: 216, type: !54)
!1146 = !DILocation(line: 0, scope: !1140)
!1147 = !DILocation(line: 214, column: 19, scope: !1140)
!1148 = !DILocation(line: 215, column: 17, scope: !1140)
!1149 = !DILocation(line: 218, column: 5, scope: !1140)
!1150 = !DILocation(line: 224, column: 13, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1140, file: !709, line: 218, column: 17)
!1152 = !DILocation(line: 0, scope: !1151)
!1153 = !DILocation(line: 228, column: 5, scope: !1140)
!1154 = !DILocation(line: 229, column: 1, scope: !1140)
!1155 = distinct !DISubprogram(name: "halGPIO_PullUp_SET", scope: !709, file: !709, line: 232, type: !1156, scopeLine: 233, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !708, retainedNodes: !1158)
!1156 = !DISubroutineType(types: !1157)
!1157 = !{!969, !8}
!1158 = !{!1159, !1160, !1161}
!1159 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1155, file: !709, line: 232, type: !8)
!1160 = !DILocalVariable(name: "no", scope: !1155, file: !709, line: 234, type: !974)
!1161 = !DILocalVariable(name: "remainder", scope: !1155, file: !709, line: 235, type: !974)
!1162 = !DILocation(line: 0, scope: !1155)
!1163 = !DILocation(line: 236, column: 19, scope: !1155)
!1164 = !DILocation(line: 237, column: 17, scope: !1155)
!1165 = !DILocation(line: 238, column: 5, scope: !1155)
!1166 = !DILocation(line: 239, column: 5, scope: !1155)
!1167 = !DILocation(line: 241, column: 27, scope: !1168)
!1168 = distinct !DILexicalBlock(scope: !1169, file: !709, line: 241, column: 17)
!1169 = distinct !DILexicalBlock(scope: !1155, file: !709, line: 239, column: 17)
!1170 = !DILocation(line: 241, column: 17, scope: !1169)
!1171 = !DILocation(line: 241, column: 17, scope: !1168)
!1172 = !DILocation(line: 242, column: 17, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1168, file: !709, line: 241, column: 34)
!1174 = !DILocation(line: 243, column: 13, scope: !1173)
!1175 = !DILocation(line: 243, column: 24, scope: !1168)
!1176 = !DILocation(line: 244, column: 73, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1178, file: !709, line: 243, column: 41)
!1178 = distinct !DILexicalBlock(scope: !1168, file: !709, line: 243, column: 24)
!1179 = !DILocation(line: 245, column: 73, scope: !1177)
!1180 = !DILocation(line: 246, column: 13, scope: !1177)
!1181 = !DILocation(line: 247, column: 73, scope: !1182)
!1182 = distinct !DILexicalBlock(scope: !1183, file: !709, line: 246, column: 41)
!1183 = distinct !DILexicalBlock(scope: !1178, file: !709, line: 246, column: 24)
!1184 = !DILocation(line: 248, column: 73, scope: !1182)
!1185 = !DILocation(line: 249, column: 13, scope: !1182)
!1186 = !DILocation(line: 250, column: 75, scope: !1187)
!1187 = distinct !DILexicalBlock(scope: !1188, file: !709, line: 249, column: 41)
!1188 = distinct !DILexicalBlock(scope: !1183, file: !709, line: 249, column: 24)
!1189 = !DILocation(line: 251, column: 75, scope: !1187)
!1190 = !DILocation(line: 252, column: 13, scope: !1187)
!1191 = !DILocation(line: 253, column: 75, scope: !1192)
!1192 = distinct !DILexicalBlock(scope: !1193, file: !709, line: 252, column: 41)
!1193 = distinct !DILexicalBlock(scope: !1188, file: !709, line: 252, column: 24)
!1194 = !DILocation(line: 254, column: 75, scope: !1192)
!1195 = !DILocation(line: 255, column: 13, scope: !1192)
!1196 = !DILocation(line: 256, column: 75, scope: !1197)
!1197 = distinct !DILexicalBlock(scope: !1198, file: !709, line: 255, column: 41)
!1198 = distinct !DILexicalBlock(scope: !1193, file: !709, line: 255, column: 24)
!1199 = !DILocation(line: 257, column: 75, scope: !1197)
!1200 = !DILocation(line: 258, column: 13, scope: !1197)
!1201 = !DILocation(line: 261, column: 18, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !1169, file: !709, line: 261, column: 17)
!1203 = !DILocation(line: 261, column: 17, scope: !1169)
!1204 = !DILocation(line: 262, column: 75, scope: !1205)
!1205 = distinct !DILexicalBlock(scope: !1202, file: !709, line: 261, column: 29)
!1206 = !DILocation(line: 263, column: 75, scope: !1205)
!1207 = !DILocation(line: 264, column: 13, scope: !1205)
!1208 = !DILocation(line: 265, column: 17, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !1202, file: !709, line: 264, column: 20)
!1210 = !DILocation(line: 272, column: 1, scope: !1155)
!1211 = distinct !DISubprogram(name: "halGPIO_PullDown_RESET", scope: !709, file: !709, line: 359, type: !1156, scopeLine: 360, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !708, retainedNodes: !1212)
!1212 = !{!1213, !1214, !1215}
!1213 = !DILocalVariable(name: "GPIO_pin", arg: 1, scope: !1211, file: !709, line: 359, type: !8)
!1214 = !DILocalVariable(name: "no", scope: !1211, file: !709, line: 362, type: !974)
!1215 = !DILocalVariable(name: "remainder", scope: !1211, file: !709, line: 363, type: !974)
!1216 = !DILocation(line: 0, scope: !1211)
!1217 = !DILocation(line: 364, column: 19, scope: !1211)
