; ModuleID = 'build/actinius_icarus/pi/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.k_thread = type { %struct._thread_base, %struct._callee_saved, i8*, %union.anon, [32 x i8], i32, %struct._thread_stack_info, %struct.k_heap*, %struct._thread_arch }
%struct._thread_base = type { %union.anon, %union.anon*, i8, i8, %union.anon.2, i32, i8*, %struct._timeout }
%union.anon.2 = type { i16 }
%struct._timeout = type { %struct._dnode, void (%struct._timeout*)*, i64 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct._callee_saved = type { i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._thread_stack_info = type { i32, i32, i32 }
%struct.k_heap = type { %struct.sys_heap, %union.anon, %struct.k_spinlock }
%struct.sys_heap = type { %struct.z_heap*, i8*, i32 }
%struct.z_heap = type opaque
%struct.k_spinlock = type { i32 }
%struct._thread_arch = type { i32, i32 }
%struct.z_thread_stack_element = type { i8 }
%struct.log_source_const_data = type { i8*, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/pi/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/pi")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/pi")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "tthread", scope: !27, file: !125, line: 29, type: !141, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !122, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/arch/smp/pi/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/pi")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !106, !108, !113, !114, !118, !119, !120}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 32)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !104, line: 22, baseType: !105)
!104 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!105 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!107 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_thread_entry_t", file: !109, line: 46, baseType: !110)
!109 = !DIFile(filename: "zephyr/include/zephyr/sys/arch_interface.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 32)
!111 = !DISubroutineType(types: !112)
!112 = !{null, !113, !113, !113}
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !115, line: 46, baseType: !116)
!115 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !117)
!117 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!119 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !121)
!121 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!122 = !{!123, !25, !134, !139}
!123 = !DIGlobalVariableExpression(var: !124, expr: !DIExpression())
!124 = distinct !DIGlobalVariable(name: "tstack", scope: !27, file: !125, line: 28, type: !126, isLocal: true, isDefinition: true, align: 64)
!125 = !DIFile(filename: "zephyr/samples/arch/smp/pi/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !127, size: 561152, elements: !131)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_thread_stack_element", file: !128, line: 47, size: 8, elements: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread_stack.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = !{!130}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !127, file: !128, line: 48, baseType: !107, size: 8)
!131 = !{!132, !133}
!132 = !DISubrange(count: 16)
!133 = !DISubrange(count: 4384)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "buffer", scope: !27, file: !125, line: 30, type: !136, isLocal: true, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 30848, elements: !137)
!137 = !{!132, !138}
!138 = !DISubrange(count: 241)
!139 = !DIGlobalVariableExpression(var: !140, expr: !DIExpression())
!140 = distinct !DIGlobalVariable(name: "counter", scope: !27, file: !125, line: 31, type: !103, isLocal: true, isDefinition: true)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !142, size: 20480, elements: !267)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !143, line: 245, size: 1280, elements: !144)
!143 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!144 = !{!145, !214, !227, !228, !229, !233, !234, !242, !262}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !142, file: !143, line: 247, baseType: !146, size: 384)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !143, line: 57, size: 384, elements: !147)
!147 = !{!148, !176, !184, !187, !188, !201, !202, !203}
!148 = !DIDerivedType(tag: DW_TAG_member, scope: !146, file: !143, line: 60, baseType: !149, size: 64)
!149 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !146, file: !143, line: 60, size: 64, elements: !150)
!150 = !{!151, !167}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !149, file: !143, line: 61, baseType: !152, size: 64)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !153, line: 49, baseType: !154)
!153 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !153, line: 37, size: 64, elements: !155)
!155 = !{!156, !162}
!156 = !DIDerivedType(tag: DW_TAG_member, scope: !154, file: !153, line: 38, baseType: !157, size: 32)
!157 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !154, file: !153, line: 38, size: 32, elements: !158)
!158 = !{!159, !161}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !157, file: !153, line: 39, baseType: !160, size: 32)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 32)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !157, file: !153, line: 40, baseType: !160, size: 32)
!162 = !DIDerivedType(tag: DW_TAG_member, scope: !154, file: !153, line: 42, baseType: !163, size: 32, offset: 32)
!163 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !154, file: !153, line: 42, size: 32, elements: !164)
!164 = !{!165, !166}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !163, file: !153, line: 43, baseType: !160, size: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !163, file: !153, line: 44, baseType: !160, size: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !149, file: !143, line: 62, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !169, line: 49, size: 64, elements: !170)
!169 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!170 = !{!171}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !168, file: !169, line: 50, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !173, size: 64, elements: !174)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 32)
!174 = !{!175}
!175 = !DISubrange(count: 2)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !146, file: !143, line: 68, baseType: !177, size: 32, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !179, line: 233, baseType: !180)
!179 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !179, line: 231, size: 64, elements: !181)
!181 = !{!182}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !180, file: !179, line: 232, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !153, line: 48, baseType: !154)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !146, file: !143, line: 71, baseType: !185, size: 8, offset: 96)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !186)
!186 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !146, file: !143, line: 74, baseType: !185, size: 8, offset: 104)
!188 = !DIDerivedType(tag: DW_TAG_member, scope: !146, file: !143, line: 90, baseType: !189, size: 16, offset: 112)
!189 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !146, file: !143, line: 90, size: 16, elements: !190)
!190 = !{!191, !198}
!191 = !DIDerivedType(tag: DW_TAG_member, scope: !189, file: !143, line: 91, baseType: !192, size: 16)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !189, file: !143, line: 91, size: 16, elements: !193)
!193 = !{!194, !197}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !192, file: !143, line: 96, baseType: !195, size: 8)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !196)
!196 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !192, file: !143, line: 97, baseType: !185, size: 8, offset: 8)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !189, file: !143, line: 100, baseType: !199, size: 16)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !200)
!200 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !146, file: !143, line: 107, baseType: !118, size: 32, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !146, file: !143, line: 127, baseType: !113, size: 32, offset: 160)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !146, file: !143, line: 131, baseType: !204, size: 192, offset: 192)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !179, line: 244, size: 192, elements: !205)
!205 = !{!206, !207, !213}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !204, file: !179, line: 245, baseType: !152, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !204, file: !179, line: 246, baseType: !208, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !179, line: 242, baseType: !209)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = !DISubroutineType(types: !211)
!211 = !{null, !212}
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 32)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !204, file: !179, line: 249, baseType: !116, size: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !142, file: !143, line: 250, baseType: !215, size: 288, offset: 384)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !216, line: 25, size: 288, elements: !217)
!216 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!217 = !{!218, !219, !220, !221, !222, !223, !224, !225, !226}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !215, file: !216, line: 26, baseType: !118, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !215, file: !216, line: 27, baseType: !118, size: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !215, file: !216, line: 28, baseType: !118, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !215, file: !216, line: 29, baseType: !118, size: 32, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !215, file: !216, line: 30, baseType: !118, size: 32, offset: 128)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !215, file: !216, line: 31, baseType: !118, size: 32, offset: 160)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !215, file: !216, line: 32, baseType: !118, size: 32, offset: 192)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !215, file: !216, line: 33, baseType: !118, size: 32, offset: 224)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !215, file: !216, line: 34, baseType: !118, size: 32, offset: 256)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !142, file: !143, line: 253, baseType: !113, size: 32, offset: 672)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !142, file: !143, line: 256, baseType: !178, size: 64, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !142, file: !143, line: 279, baseType: !230, size: 256, offset: 768)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 256, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !142, file: !143, line: 294, baseType: !119, size: 32, offset: 1024)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !142, file: !143, line: 300, baseType: !235, size: 96, offset: 1056)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !143, line: 149, size: 96, elements: !236)
!236 = !{!237, !238, !241}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !235, file: !143, line: 153, baseType: !22, size: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !235, file: !143, line: 162, baseType: !239, size: 32, offset: 32)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !240, line: 214, baseType: !32)
!240 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!241 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !235, file: !143, line: 168, baseType: !239, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !142, file: !143, line: 325, baseType: !243, size: 32, offset: 1152)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 32)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !245, line: 5073, size: 192, elements: !246)
!245 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!246 = !{!247, !256, !257}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !244, file: !245, line: 5074, baseType: !248, size: 96)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !249, line: 56, size: 96, elements: !250)
!249 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!250 = !{!251, !254, !255}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !248, file: !249, line: 57, baseType: !252, size: 32)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !249, line: 57, flags: DIFlagFwdDecl)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !248, file: !249, line: 58, baseType: !113, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !248, file: !249, line: 59, baseType: !239, size: 32, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !244, file: !245, line: 5075, baseType: !178, size: 64, offset: 96)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !244, file: !245, line: 5076, baseType: !258, size: 32, offset: 160)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !259, line: 43, size: 32, elements: !260)
!259 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!260 = !{!261}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !258, file: !259, line: 52, baseType: !22, size: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !142, file: !143, line: 343, baseType: !263, size: 64, offset: 1184)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !216, line: 60, size: 64, elements: !264)
!264 = !{!265, !266}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !263, file: !216, line: 63, baseType: !118, size: 32)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !263, file: !216, line: 66, baseType: !118, size: 32, offset: 32)
!267 = !{!132}
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !270, file: !286, line: 18, type: !287, isLocal: false, isDefinition: true)
!270 = distinct !DICompileUnit(language: DW_LANG_C99, file: !271, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !272, globals: !285, splitDebugInlining: false, nameTableKind: None)
!271 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/pi")
!272 = !{!22, !113, !24, !273, !275, !277, !239, !119, !280, !281, !282, !283, !106, !284, !199, !278}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 32)
!274 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 32)
!276 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 32)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !107)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 32)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 32)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 32)
!285 = !{!268}
!286 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!287 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !288)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !289, line: 16, size: 64, elements: !290)
!289 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!290 = !{!291, !292}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !288, file: !289, line: 17, baseType: !278, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !288, file: !289, line: 18, baseType: !185, size: 8, offset: 32)
!293 = !DIGlobalVariableExpression(var: !294, expr: !DIExpression())
!294 = distinct !DIGlobalVariable(name: "_char_out", scope: !295, file: !299, line: 54, type: !300, isLocal: false, isDefinition: true)
!295 = distinct !DICompileUnit(language: DW_LANG_C99, file: !296, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !297, globals: !298, splitDebugInlining: false, nameTableKind: None)
!296 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/pi")
!297 = !{!113, !119}
!298 = !{!293}
!299 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!301 = !DISubroutineType(types: !302)
!302 = !{!119, !119}
!303 = !DIGlobalVariableExpression(var: !304, expr: !DIExpression())
!304 = distinct !DIGlobalVariable(name: "log_const_soc", scope: !305, file: !362, line: 35, type: !379, isLocal: false, isDefinition: true)
!305 = distinct !DICompileUnit(language: DW_LANG_C99, file: !306, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !307, globals: !359, splitDebugInlining: false, nameTableKind: None)
!306 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/pi")
!307 = !{!113, !119, !308, !118, !319}
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !310, file: !309, line: 167, baseType: !318)
!309 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!310 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !309, file: !309, line: 134, type: !311, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !305, retainedNodes: !313)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !118}
!313 = !{!314, !315, !317}
!314 = !DILocalVariable(name: "time_us", arg: 1, scope: !310, file: !309, line: 134, type: !118)
!315 = !DILocalVariable(name: "delay_cycles", scope: !310, file: !309, line: 168, type: !316)
!316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !308)
!317 = !DILocalVariable(name: "cycles", scope: !310, file: !309, line: 171, type: !118)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 32)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 32)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !321, line: 1928, baseType: !322)
!321 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !321, line: 1909, size: 11360, elements: !323)
!323 = !{!324, !330, !331, !332, !333, !337, !338, !339, !340, !344, !345, !349, !350, !351, !352, !353, !357, !358}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !322, file: !321, line: 1910, baseType: !325, size: 8192)
!325 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 8192, elements: !328)
!326 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!327 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !118)
!328 = !{!329}
!329 = !DISubrange(count: 256)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !322, file: !321, line: 1911, baseType: !326, size: 32, offset: 8192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !322, file: !321, line: 1912, baseType: !326, size: 32, offset: 8224)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !322, file: !321, line: 1913, baseType: !326, size: 32, offset: 8256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !322, file: !321, line: 1914, baseType: !334, size: 1984, offset: 8288)
!334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 1984, elements: !335)
!335 = !{!336}
!336 = !DISubrange(count: 62)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !322, file: !321, line: 1915, baseType: !327, size: 32, offset: 10272)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !322, file: !321, line: 1916, baseType: !326, size: 32, offset: 10304)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !322, file: !321, line: 1917, baseType: !327, size: 32, offset: 10336)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !322, file: !321, line: 1918, baseType: !341, size: 96, offset: 10368)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 96, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 3)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !322, file: !321, line: 1919, baseType: !327, size: 32, offset: 10464)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !322, file: !321, line: 1920, baseType: !346, size: 256, offset: 10496)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 256, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 8)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !322, file: !321, line: 1921, baseType: !327, size: 32, offset: 10752)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !322, file: !321, line: 1922, baseType: !326, size: 32, offset: 10784)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !322, file: !321, line: 1923, baseType: !327, size: 32, offset: 10816)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !322, file: !321, line: 1924, baseType: !327, size: 32, offset: 10848)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !322, file: !321, line: 1925, baseType: !354, size: 416, offset: 10880)
!354 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 416, elements: !355)
!355 = !{!356}
!356 = !DISubrange(count: 13)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !322, file: !321, line: 1926, baseType: !327, size: 32, offset: 11296)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !322, file: !321, line: 1927, baseType: !327, size: 32, offset: 11328)
!359 = !{!303, !360, !375}
!360 = !DIGlobalVariableExpression(var: !361, expr: !DIExpression())
!361 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !305, file: !362, line: 65, type: !363, isLocal: true, isDefinition: true, align: 32)
!362 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !364)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !365, line: 51, size: 64, elements: !366)
!365 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!366 = !{!367, !374}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !364, file: !365, line: 60, baseType: !368, size: 32)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 32)
!369 = !DISubroutineType(types: !370)
!370 = !{!119, !371}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 32)
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !365, line: 48, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !364, file: !365, line: 65, baseType: !371, size: 32, offset: 32)
!375 = !DIGlobalVariableExpression(var: !376, expr: !DIExpression())
!376 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !310, file: !309, line: 161, type: !377, isLocal: true, isDefinition: true, align: 128)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 48, elements: !342)
!378 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !199)
!379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !380)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !289, line: 16, size: 64, elements: !381)
!381 = !{!382, !383}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !380, file: !289, line: 17, baseType: !278, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !380, file: !289, line: 18, baseType: !185, size: 8, offset: 32)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "log_const_pm", scope: !386, file: !420, line: 22, type: !450, isLocal: false, isDefinition: true)
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !388, retainedTypes: !400, globals: !417, splitDebugInlining: false, nameTableKind: None)
!387 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/pi")
!388 = !{!389, !30}
!389 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !390, line: 27, baseType: !32, size: 32, elements: !391)
!390 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399}
!392 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!393 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!394 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!395 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!396 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!397 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!398 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!399 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!400 = !{!113, !114, !119, !24, !401, !106, !118, !120}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 32)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !403, line: 54, size: 96, elements: !404)
!403 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!404 = !{!405, !412, !416}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !402, file: !403, line: 55, baseType: !406, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !407, line: 33, baseType: !408)
!407 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !407, line: 29, size: 32, elements: !409)
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !408, file: !407, line: 30, baseType: !411, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !402, file: !403, line: 60, baseType: !413, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !389}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !402, file: !403, line: 65, baseType: !413, size: 32, offset: 64)
!417 = !{!384, !418, !424, !429, !431, !440, !442}
!418 = !DIGlobalVariableExpression(var: !419, expr: !DIExpression())
!419 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !386, file: !420, line: 27, type: !421, isLocal: true, isDefinition: true)
!420 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!421 = !DICompositeType(tag: DW_TAG_array_type, baseType: !103, size: 32, elements: !422)
!422 = !{!423}
!423 = !DISubrange(count: 1)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !386, file: !420, line: 44, type: !426, isLocal: true, isDefinition: true)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !259, line: 43, size: 32, elements: !427)
!427 = !{!428}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !426, file: !259, line: 52, baseType: !22, size: 32)
!429 = !DIGlobalVariableExpression(var: !430, expr: !DIExpression())
!430 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !386, file: !420, line: 49, type: !426, isLocal: true, isDefinition: true)
!431 = !DIGlobalVariableExpression(var: !432, expr: !DIExpression())
!432 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !386, file: !420, line: 36, type: !433, isLocal: true, isDefinition: true)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 128, elements: !422)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !390, line: 114, size: 128, elements: !435)
!435 = !{!436, !437, !438, !439}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !434, file: !390, line: 115, baseType: !389, size: 32)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !434, file: !390, line: 141, baseType: !185, size: 8, offset: 32)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !434, file: !390, line: 149, baseType: !118, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !434, file: !390, line: 156, baseType: !118, size: 32, offset: 96)
!440 = !DIGlobalVariableExpression(var: !441, expr: !DIExpression())
!441 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !386, file: !420, line: 40, type: !433, isLocal: true, isDefinition: true)
!442 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression())
!443 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !386, file: !420, line: 28, type: !444, isLocal: true, isDefinition: true)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !407, line: 40, baseType: !445)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !407, line: 35, size: 64, elements: !446)
!446 = !{!447, !449}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !445, file: !407, line: 36, baseType: !448, size: 32)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !445, file: !407, line: 37, baseType: !448, size: 32, offset: 32)
!450 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !451)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !289, line: 16, size: 64, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !451, file: !289, line: 17, baseType: !278, size: 32)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !451, file: !289, line: 18, baseType: !185, size: 8, offset: 32)
!455 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!456 = !DIGlobalVariableExpression(var: !443, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !459, file: !488, line: 50, type: !475, isLocal: true, isDefinition: true)
!459 = distinct !DICompileUnit(language: DW_LANG_C99, file: !460, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !388, retainedTypes: !461, globals: !485, splitDebugInlining: false, nameTableKind: None)
!460 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/pi")
!461 = !{!462, !114, !239, !119, !113, !118, !120, !464, !106, !475, !476}
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !463)
!463 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 32)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !466, line: 45, size: 64, elements: !467)
!466 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!467 = !{!468, !474}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !465, file: !466, line: 46, baseType: !469, size: 32)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !407, line: 33, baseType: !470)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !407, line: 29, size: 32, elements: !471)
!471 = !{!472}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !470, file: !407, line: 30, baseType: !473, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 32)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !465, file: !466, line: 48, baseType: !118, size: 32, offset: 32)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !119)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 32)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !466, line: 38, size: 64, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !477, file: !466, line: 39, baseType: !469, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !477, file: !466, line: 41, baseType: !481, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !466, line: 35, baseType: !482)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 32)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !475}
!485 = !{!486, !492, !500, !457, !502, !512}
!486 = !DIGlobalVariableExpression(var: !487, expr: !DIExpression())
!487 = distinct !DIGlobalVariable(name: "latency_lock", scope: !459, file: !488, line: 44, type: !489, isLocal: true, isDefinition: true)
!488 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !259, line: 43, size: 32, elements: !490)
!490 = !{!491}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !489, file: !259, line: 52, baseType: !22, size: 32)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !459, file: !488, line: 46, type: !494, isLocal: true, isDefinition: true)
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !407, line: 40, baseType: !495)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !407, line: 35, size: 64, elements: !496)
!496 = !{!497, !499}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !495, file: !407, line: 36, baseType: !498, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !495, file: !407, line: 37, baseType: !498, size: 32, offset: 32)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "latency_subs", scope: !459, file: !488, line: 52, type: !494, isLocal: true, isDefinition: true)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !459, file: !488, line: 39, type: !504, isLocal: true, isDefinition: true)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, elements: !510)
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !488, line: 35, size: 96, elements: !506)
!506 = !{!507, !508, !509}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !505, file: !488, line: 36, baseType: !389, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !505, file: !488, line: 37, baseType: !185, size: 8, offset: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !505, file: !488, line: 38, baseType: !103, size: 32, offset: 64)
!510 = !{!511}
!511 = !DISubrange(count: 0)
!512 = !DIGlobalVariableExpression(var: !513, expr: !DIExpression())
!513 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !459, file: !488, line: 48, type: !475, isLocal: true, isDefinition: true)
!514 = !DIGlobalVariableExpression(var: !515, expr: !DIExpression())
!515 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !516, file: !523, line: 47, type: !537, isLocal: true, isDefinition: true)
!516 = distinct !DICompileUnit(language: DW_LANG_C99, file: !517, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !518, retainedTypes: !519, globals: !520, splitDebugInlining: false, nameTableKind: None)
!517 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/pi")
!518 = !{!389}
!519 = !{!239, !119}
!520 = !{!521, !514, !533}
!521 = !DIGlobalVariableExpression(var: !522, expr: !DIExpression())
!522 = distinct !DIGlobalVariable(name: "cpus_states", scope: !516, file: !523, line: 50, type: !524, isLocal: true, isDefinition: true)
!523 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!524 = !DICompositeType(tag: DW_TAG_array_type, baseType: !525, size: 32, elements: !422)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 32)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !527)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !390, line: 114, size: 128, elements: !528)
!528 = !{!529, !530, !531, !532}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !527, file: !390, line: 115, baseType: !389, size: 32)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !527, file: !390, line: 141, baseType: !185, size: 8, offset: 32)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !527, file: !390, line: 149, baseType: !118, size: 32, offset: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !527, file: !390, line: 156, baseType: !118, size: 32, offset: 96)
!533 = !DIGlobalVariableExpression(var: !534, expr: !DIExpression())
!534 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !516, file: !523, line: 55, type: !535, isLocal: true, isDefinition: true)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 8, elements: !422)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !185)
!537 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, elements: !510)
!538 = !DIGlobalVariableExpression(var: !539, expr: !DIExpression())
!539 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !540, file: !547, line: 17, type: !673, isLocal: false, isDefinition: true)
!540 = distinct !DICompileUnit(language: DW_LANG_C99, file: !541, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !542, globals: !543, splitDebugInlining: false, nameTableKind: None)
!541 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/pi")
!542 = !{!239, !119, !118, !113}
!543 = !{!538, !544, !669}
!544 = !DIGlobalVariableExpression(var: !545, expr: !DIExpression())
!545 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !546, file: !547, line: 198, type: !656, isLocal: true, isDefinition: true)
!546 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !547, file: !547, line: 175, type: !548, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !540, retainedNodes: !653)
!547 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!548 = !DISubroutineType(types: !549)
!549 = !{null, !550}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 32)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !143, line: 245, size: 1280, elements: !552)
!552 = !{!553, !611, !623, !624, !625, !626, !627, !633, !648}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !551, file: !143, line: 247, baseType: !554, size: 384)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !143, line: 57, size: 384, elements: !555)
!555 = !{!556, !580, !587, !588, !589, !598, !599, !600}
!556 = !DIDerivedType(tag: DW_TAG_member, scope: !554, file: !143, line: 60, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !554, file: !143, line: 60, size: 64, elements: !558)
!558 = !{!559, !574}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !557, file: !143, line: 61, baseType: !560, size: 64)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !153, line: 49, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !153, line: 37, size: 64, elements: !562)
!562 = !{!563, !569}
!563 = !DIDerivedType(tag: DW_TAG_member, scope: !561, file: !153, line: 38, baseType: !564, size: 32)
!564 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !561, file: !153, line: 38, size: 32, elements: !565)
!565 = !{!566, !568}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !564, file: !153, line: 39, baseType: !567, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !564, file: !153, line: 40, baseType: !567, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, scope: !561, file: !153, line: 42, baseType: !570, size: 32, offset: 32)
!570 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !561, file: !153, line: 42, size: 32, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !570, file: !153, line: 43, baseType: !567, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !570, file: !153, line: 44, baseType: !567, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !557, file: !143, line: 62, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !169, line: 49, size: 64, elements: !576)
!576 = !{!577}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !575, file: !169, line: 50, baseType: !578, size: 64)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 64, elements: !174)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !554, file: !143, line: 68, baseType: !581, size: 32, offset: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 32)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !179, line: 233, baseType: !583)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !179, line: 231, size: 64, elements: !584)
!584 = !{!585}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !583, file: !179, line: 232, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !153, line: 48, baseType: !561)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !554, file: !143, line: 71, baseType: !185, size: 8, offset: 96)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !554, file: !143, line: 74, baseType: !185, size: 8, offset: 104)
!589 = !DIDerivedType(tag: DW_TAG_member, scope: !554, file: !143, line: 90, baseType: !590, size: 16, offset: 112)
!590 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !554, file: !143, line: 90, size: 16, elements: !591)
!591 = !{!592, !597}
!592 = !DIDerivedType(tag: DW_TAG_member, scope: !590, file: !143, line: 91, baseType: !593, size: 16)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !590, file: !143, line: 91, size: 16, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !593, file: !143, line: 96, baseType: !195, size: 8)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !593, file: !143, line: 97, baseType: !185, size: 8, offset: 8)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !590, file: !143, line: 100, baseType: !199, size: 16)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !554, file: !143, line: 107, baseType: !118, size: 32, offset: 128)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !554, file: !143, line: 127, baseType: !113, size: 32, offset: 160)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !554, file: !143, line: 131, baseType: !601, size: 192, offset: 192)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !179, line: 244, size: 192, elements: !602)
!602 = !{!603, !604, !610}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !601, file: !179, line: 245, baseType: !560, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !601, file: !179, line: 246, baseType: !605, size: 32, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !179, line: 242, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 32)
!607 = !DISubroutineType(types: !608)
!608 = !{null, !609}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !601, file: !179, line: 249, baseType: !116, size: 64, offset: 128)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !551, file: !143, line: 250, baseType: !612, size: 288, offset: 384)
!612 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !216, line: 25, size: 288, elements: !613)
!613 = !{!614, !615, !616, !617, !618, !619, !620, !621, !622}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !612, file: !216, line: 26, baseType: !118, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !612, file: !216, line: 27, baseType: !118, size: 32, offset: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !612, file: !216, line: 28, baseType: !118, size: 32, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !612, file: !216, line: 29, baseType: !118, size: 32, offset: 96)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !612, file: !216, line: 30, baseType: !118, size: 32, offset: 128)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !612, file: !216, line: 31, baseType: !118, size: 32, offset: 160)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !612, file: !216, line: 32, baseType: !118, size: 32, offset: 192)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !612, file: !216, line: 33, baseType: !118, size: 32, offset: 224)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !612, file: !216, line: 34, baseType: !118, size: 32, offset: 256)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !551, file: !143, line: 253, baseType: !113, size: 32, offset: 672)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !551, file: !143, line: 256, baseType: !582, size: 64, offset: 704)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !551, file: !143, line: 279, baseType: !230, size: 256, offset: 768)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !551, file: !143, line: 294, baseType: !119, size: 32, offset: 1024)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !551, file: !143, line: 300, baseType: !628, size: 96, offset: 1056)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !143, line: 149, size: 96, elements: !629)
!629 = !{!630, !631, !632}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !628, file: !143, line: 153, baseType: !22, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !628, file: !143, line: 162, baseType: !239, size: 32, offset: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !628, file: !143, line: 168, baseType: !239, size: 32, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !551, file: !143, line: 325, baseType: !634, size: 32, offset: 1152)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 32)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !245, line: 5073, size: 192, elements: !636)
!636 = !{!637, !643, !644}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !635, file: !245, line: 5074, baseType: !638, size: 96)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !249, line: 56, size: 96, elements: !639)
!639 = !{!640, !641, !642}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !638, file: !249, line: 57, baseType: !252, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !638, file: !249, line: 58, baseType: !113, size: 32, offset: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !638, file: !249, line: 59, baseType: !239, size: 32, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !635, file: !245, line: 5075, baseType: !582, size: 64, offset: 96)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !635, file: !245, line: 5076, baseType: !645, size: 32, offset: 160)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !259, line: 43, size: 32, elements: !646)
!646 = !{!647}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !645, file: !259, line: 52, baseType: !22, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !551, file: !143, line: 343, baseType: !649, size: 64, offset: 1184)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !216, line: 60, size: 64, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !649, file: !216, line: 63, baseType: !118, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !649, file: !216, line: 66, baseType: !118, size: 32, offset: 32)
!653 = !{!654, !655}
!654 = !DILocalVariable(name: "thread", arg: 1, scope: !546, file: !547, line: 175, type: !550)
!655 = !DILocalVariable(name: "region_num", scope: !546, file: !547, line: 200, type: !185)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, elements: !510)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !658, line: 52, size: 96, elements: !659)
!658 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!659 = !{!660, !661, !662}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !657, file: !658, line: 53, baseType: !22, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !657, file: !658, line: 54, baseType: !239, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !657, file: !658, line: 55, baseType: !663, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !664, line: 304, baseType: !665)
!664 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !664, line: 301, size: 32, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !665, file: !664, line: 302, baseType: !199, size: 16)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !665, file: !664, line: 303, baseType: !199, size: 16, offset: 16)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "static_regions", scope: !540, file: !547, line: 62, type: !671, isLocal: true, isDefinition: true)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 96, elements: !422)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !657)
!673 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !289, line: 16, size: 64, elements: !675)
!675 = !{!676, !677}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !674, file: !289, line: 17, baseType: !278, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !674, file: !289, line: 18, baseType: !185, size: 8, offset: 32)
!678 = !DIGlobalVariableExpression(var: !679, expr: !DIExpression())
!679 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !680, file: !734, line: 39, type: !185, isLocal: true, isDefinition: true)
!680 = distinct !DICompileUnit(language: DW_LANG_C99, file: !681, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !682, globals: !725, splitDebugInlining: false, nameTableKind: None)
!681 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/pi")
!682 = !{!683, !113, !119, !711}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !685, line: 1495, baseType: !686)
!685 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !685, line: 1474, size: 448, elements: !687)
!687 = !{!688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !701}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !686, file: !685, line: 1476, baseType: !326, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !686, file: !685, line: 1477, baseType: !327, size: 32, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !686, file: !685, line: 1478, baseType: !327, size: 32, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !686, file: !685, line: 1479, baseType: !327, size: 32, offset: 96)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !686, file: !685, line: 1480, baseType: !327, size: 32, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !686, file: !685, line: 1481, baseType: !327, size: 32, offset: 160)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !686, file: !685, line: 1482, baseType: !327, size: 32, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !686, file: !685, line: 1483, baseType: !327, size: 32, offset: 224)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !686, file: !685, line: 1484, baseType: !327, size: 32, offset: 256)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !686, file: !685, line: 1485, baseType: !327, size: 32, offset: 288)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !686, file: !685, line: 1486, baseType: !327, size: 32, offset: 320)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !686, file: !685, line: 1487, baseType: !700, size: 32, offset: 352)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 32, elements: !422)
!701 = !DIDerivedType(tag: DW_TAG_member, scope: !686, file: !685, line: 1488, baseType: !702, size: 64, offset: 384)
!702 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !686, file: !685, line: 1488, size: 64, elements: !703)
!703 = !{!704, !706}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !702, file: !685, line: 1489, baseType: !705, size: 64)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 64, elements: !174)
!706 = !DIDerivedType(tag: DW_TAG_member, scope: !702, file: !685, line: 1490, baseType: !707, size: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !702, file: !685, line: 1490, size: 64, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !707, file: !685, line: 1491, baseType: !327, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !707, file: !685, line: 1492, baseType: !327, size: 32, offset: 32)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !714, line: 27, size: 128, elements: !715)
!714 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!715 = !{!716, !717, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !713, file: !714, line: 29, baseType: !118, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !713, file: !714, line: 31, baseType: !278, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !713, file: !714, line: 37, baseType: !719, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !664, line: 298, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !664, line: 289, size: 64, elements: !721)
!721 = !{!722, !723, !724}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !720, file: !664, line: 291, baseType: !185, size: 5, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !720, file: !664, line: 293, baseType: !185, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !720, file: !664, line: 295, baseType: !118, size: 32, offset: 32)
!725 = !{!678, !726}
!726 = !DIGlobalVariableExpression(var: !727, expr: !DIExpression())
!727 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !680, file: !728, line: 31, type: !729, isLocal: true, isDefinition: true)
!728 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !730, size: 160, elements: !422)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !728, line: 21, size: 160, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !730, file: !728, line: 22, baseType: !119, size: 32)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !730, file: !728, line: 23, baseType: !713, size: 128, offset: 32)
!734 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !737, file: !744, line: 21, type: !300, isLocal: true, isDefinition: true)
!737 = distinct !DICompileUnit(language: DW_LANG_C99, file: !738, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !739, globals: !743, splitDebugInlining: false, nameTableKind: None)
!738 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/pi")
!739 = !{!740, !119, !113}
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !741, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !742, line: 22, baseType: !119)
!742 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!743 = !{!735}
!744 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!745 = !DIGlobalVariableExpression(var: !746, expr: !DIExpression())
!746 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !747, file: !752, line: 13, type: !771, isLocal: true, isDefinition: true)
!747 = distinct !DICompileUnit(language: DW_LANG_C99, file: !748, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !749, splitDebugInlining: false, nameTableKind: None)
!748 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/pi")
!749 = !{!750, !745}
!750 = !DIGlobalVariableExpression(var: !751, expr: !DIExpression())
!751 = distinct !DIGlobalVariable(name: "mpu_config", scope: !747, file: !752, line: 37, type: !753, isLocal: false, isDefinition: true)
!752 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !714, line: 41, size: 64, elements: !755)
!755 = !{!756, !757}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !754, file: !714, line: 43, baseType: !118, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !754, file: !714, line: 45, baseType: !758, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !714, line: 27, size: 128, elements: !761)
!761 = !{!762, !763, !764}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !760, file: !714, line: 29, baseType: !118, size: 32)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !760, file: !714, line: 31, baseType: !278, size: 32, offset: 32)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !760, file: !714, line: 37, baseType: !765, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !664, line: 298, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !664, line: 289, size: 64, elements: !767)
!767 = !{!768, !769, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !766, file: !664, line: 291, baseType: !185, size: 5, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !766, file: !664, line: 293, baseType: !185, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !766, file: !664, line: 295, baseType: !118, size: 32, offset: 32)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !759, size: 256, elements: !174)
!772 = !DIGlobalVariableExpression(var: !773, expr: !DIExpression())
!773 = distinct !DIGlobalVariable(name: "log_const_clock_control", scope: !774, file: !976, line: 18, type: !1212, isLocal: false, isDefinition: true)
!774 = distinct !DICompileUnit(language: DW_LANG_C99, file: !775, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !776, retainedTypes: !894, globals: !972, splitDebugInlining: false, nameTableKind: None)
!775 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/build/actinius_icarus/pi")
!776 = !{!777, !783, !30, !788, !793, !797, !801, !805, !811, !815, !859, !866, !885}
!777 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !778, line: 23, baseType: !32, size: 32, elements: !779)
!778 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!779 = !{!780, !781, !782}
!780 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!781 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!782 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!783 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !778, line: 48, baseType: !32, size: 32, elements: !784)
!784 = !{!785, !786, !787}
!785 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!786 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!787 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!788 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !789, line: 167, baseType: !32, size: 32, elements: !790)
!789 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!790 = !{!791, !792}
!791 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!792 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!793 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !789, line: 107, baseType: !32, size: 32, elements: !794)
!794 = !{!795, !796}
!795 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!796 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!797 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !789, line: 208, baseType: !32, size: 32, elements: !798)
!798 = !{!799, !800}
!799 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!800 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!801 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !789, line: 261, baseType: !32, size: 32, elements: !802)
!802 = !{!803, !804}
!803 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!804 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!805 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !789, line: 237, baseType: !32, size: 32, elements: !806)
!806 = !{!807, !808, !809, !810}
!807 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!808 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!809 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!810 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!811 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !789, line: 152, baseType: !32, size: 32, elements: !812)
!812 = !{!813, !814}
!813 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!814 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!815 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !321, line: 71, baseType: !119, size: 32, elements: !816)
!816 = !{!817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858}
!817 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!818 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!819 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!820 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!821 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!822 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!823 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!824 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!825 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!826 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!827 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!828 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!829 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!830 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!831 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!832 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!833 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!834 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!835 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!836 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!837 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!838 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!839 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!840 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!841 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!842 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!843 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!844 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!845 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!846 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!847 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!848 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!849 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!850 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!851 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!852 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!853 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!854 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!855 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!856 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!857 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!858 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!859 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !860, line: 44, baseType: !32, size: 32, elements: !861)
!860 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!861 = !{!862, !863, !864, !865}
!862 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!863 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!864 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!865 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!866 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !867, line: 54, baseType: !32, size: 32, elements: !868)
!867 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!868 = !{!869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884}
!869 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!870 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!871 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!872 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!873 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!874 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!875 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!876 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!877 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!878 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!879 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!880 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!881 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!882 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!883 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!884 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!885 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !886, line: 53, baseType: !32, size: 32, elements: !887)
!886 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!887 = !{!888, !889, !890, !891, !892, !893}
!888 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!889 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!890 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!891 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!892 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!893 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!894 = !{!777, !113, !119, !895, !937, !938, !939, !940, !114, !118, !120, !941, !942, !284, !475, !943, !971, !239}
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 32)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !321, line: 923, baseType: !897)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !321, line: 883, size: 10464, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !907, !908, !909, !910, !911, !912, !913, !914, !918, !919, !920, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !897, file: !321, line: 884, baseType: !327, size: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !897, file: !321, line: 885, baseType: !327, size: 32, offset: 32)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !897, file: !321, line: 886, baseType: !327, size: 32, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !897, file: !321, line: 887, baseType: !327, size: 32, offset: 96)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !897, file: !321, line: 888, baseType: !904, size: 896, offset: 128)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 896, elements: !905)
!905 = !{!906}
!906 = !DISubrange(count: 28)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !897, file: !321, line: 889, baseType: !327, size: 32, offset: 1024)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !897, file: !321, line: 890, baseType: !327, size: 32, offset: 1056)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !897, file: !321, line: 891, baseType: !327, size: 32, offset: 1088)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !897, file: !321, line: 892, baseType: !327, size: 32, offset: 1120)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !897, file: !321, line: 893, baseType: !904, size: 896, offset: 1152)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !897, file: !321, line: 894, baseType: !327, size: 32, offset: 2048)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !897, file: !321, line: 895, baseType: !327, size: 32, offset: 2080)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !897, file: !321, line: 896, baseType: !915, size: 960, offset: 2112)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 960, elements: !916)
!916 = !{!917}
!917 = !DISubrange(count: 30)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !897, file: !321, line: 897, baseType: !327, size: 32, offset: 3072)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !897, file: !321, line: 898, baseType: !327, size: 32, offset: 3104)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !897, file: !321, line: 899, baseType: !921, size: 3008, offset: 3136)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !326, size: 3008, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 94)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !897, file: !321, line: 900, baseType: !327, size: 32, offset: 6144)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !897, file: !321, line: 901, baseType: !327, size: 32, offset: 6176)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !897, file: !321, line: 902, baseType: !327, size: 32, offset: 6208)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !897, file: !321, line: 903, baseType: !326, size: 32, offset: 6240)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !897, file: !321, line: 904, baseType: !334, size: 1984, offset: 6272)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !897, file: !321, line: 905, baseType: !326, size: 32, offset: 8256)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !897, file: !321, line: 907, baseType: !326, size: 32, offset: 8288)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !897, file: !321, line: 910, baseType: !326, size: 32, offset: 8320)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !897, file: !321, line: 911, baseType: !326, size: 32, offset: 8352)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !897, file: !321, line: 913, baseType: !326, size: 32, offset: 8384)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !897, file: !321, line: 917, baseType: !326, size: 32, offset: 8416)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !897, file: !321, line: 919, baseType: !334, size: 1984, offset: 8448)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !897, file: !321, line: 920, baseType: !327, size: 32, offset: 10432)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !789, line: 146, baseType: !793)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !789, line: 164, baseType: !811)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 32)
!941 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !685, line: 485, baseType: !945)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !685, line: 468, size: 28704, elements: !946)
!946 = !{!947, !949, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !966, !970}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !945, file: !685, line: 470, baseType: !948, size: 512)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !327, size: 512, elements: !267)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !945, file: !685, line: 471, baseType: !950, size: 512, offset: 512)
!950 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 512, elements: !267)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !945, file: !685, line: 472, baseType: !948, size: 512, offset: 1024)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !945, file: !685, line: 473, baseType: !950, size: 512, offset: 1536)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !945, file: !685, line: 474, baseType: !948, size: 512, offset: 2048)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !945, file: !685, line: 475, baseType: !950, size: 512, offset: 2560)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !945, file: !685, line: 476, baseType: !948, size: 512, offset: 3072)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !945, file: !685, line: 477, baseType: !950, size: 512, offset: 3584)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !945, file: !685, line: 478, baseType: !948, size: 512, offset: 4096)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !945, file: !685, line: 479, baseType: !950, size: 512, offset: 4608)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !945, file: !685, line: 480, baseType: !948, size: 512, offset: 5120)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !945, file: !685, line: 481, baseType: !950, size: 512, offset: 5632)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !945, file: !685, line: 482, baseType: !962, size: 3968, offset: 6144)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !963, size: 3968, elements: !964)
!963 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !185)
!964 = !{!965}
!965 = !DISubrange(count: 496)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !945, file: !685, line: 483, baseType: !967, size: 18560, offset: 10112)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !118, size: 18560, elements: !968)
!968 = !{!969}
!969 = !DISubrange(count: 580)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !945, file: !685, line: 484, baseType: !327, size: 32, offset: 28672)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !860, line: 56, baseType: !113)
!972 = !{!772, !973, !1025, !1066, !1074, !1091, !1102, !1104, !1121, !1123, !1133, !1136, !1152, !1190, !1204}
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(name: "on", scope: !975, file: !976, line: 549, type: !103, isLocal: true, isDefinition: true)
!975 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !976, file: !976, line: 547, type: !977, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !774, retainedNodes: !979)
!976 = !DIFile(filename: "zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!977 = !DISubroutineType(types: !978)
!978 = !{null, !783}
!979 = !{!980, !981, !984}
!980 = !DILocalVariable(name: "start_mode", arg: 1, scope: !975, file: !976, line: 547, type: !783)
!981 = !DILocalVariable(name: "err", scope: !982, file: !976, line: 553, type: !119)
!982 = distinct !DILexicalBlock(scope: !983, file: !976, line: 552, column: 31)
!983 = distinct !DILexicalBlock(scope: !975, file: !976, line: 552, column: 6)
!984 = !DILocalVariable(name: "mgr", scope: !982, file: !976, line: 554, type: !985)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 32)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_manager", file: !987, line: 154, size: 256, elements: !988)
!987 = !DIFile(filename: "zephyr/include/zephyr/sys/onoff.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!988 = !{!989, !1001, !1002, !1018, !1022, !1023, !1024}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "clients", scope: !986, file: !987, line: 158, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !407, line: 40, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !407, line: 35, size: 64, elements: !992)
!992 = !{!993, !1000}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !991, file: !407, line: 36, baseType: !994, size: 32)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 32)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !407, line: 33, baseType: !996)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !407, line: 29, size: 32, elements: !997)
!997 = !{!998}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !996, file: !407, line: 30, baseType: !999, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !991, file: !407, line: 37, baseType: !994, size: 32, offset: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "monitors", scope: !986, file: !987, line: 163, baseType: !990, size: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "transitions", scope: !986, file: !987, line: 166, baseType: !1003, size: 32, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_transitions", file: !987, line: 133, size: 96, elements: !1006)
!1006 = !{!1007, !1016, !1017}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !1005, file: !987, line: 135, baseType: !1008, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_transition_fn", file: !987, line: 129, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 32)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{null, !985, !1012}
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "onoff_notify_fn", file: !987, line: 101, baseType: !1013)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 32)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{null, !985, !119}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "stop", scope: !1005, file: !987, line: 138, baseType: !1008, size: 32, offset: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "reset", scope: !1005, file: !987, line: 143, baseType: !1008, size: 32, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !986, file: !987, line: 169, baseType: !1019, size: 32, offset: 160)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !259, line: 43, size: 32, elements: !1020)
!1020 = !{!1021}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "thread_cpu", scope: !1019, file: !259, line: 52, baseType: !22, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "last_res", scope: !986, file: !987, line: 172, baseType: !119, size: 32, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !986, file: !987, line: 175, baseType: !199, size: 16, offset: 224)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !986, file: !987, line: 178, baseType: !199, size: 16, offset: 240)
!1025 = !DIGlobalVariableExpression(var: !1026, expr: !DIExpression())
!1026 = distinct !DIGlobalVariable(name: "cli", scope: !975, file: !976, line: 550, type: !1027, isLocal: true, isDefinition: true)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "onoff_client", file: !987, line: 273, size: 128, elements: !1028)
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !1027, file: !987, line: 280, baseType: !995, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !1027, file: !987, line: 283, baseType: !1031, size: 96, offset: 32)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_notify", file: !1032, line: 138, size: 96, elements: !1033)
!1032 = !DIFile(filename: "zephyr/include/zephyr/sys/notify.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1033 = !{!1034, !1063, !1064}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !1031, file: !1032, line: 149, baseType: !1035, size: 32)
!1035 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "method", file: !1032, line: 139, size: 32, elements: !1036)
!1036 = !{!1037, !1058}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "signal", scope: !1035, file: !1032, line: 145, baseType: !1038, size: 32)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 32)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_poll_signal", file: !245, line: 5397, size: 128, elements: !1040)
!1040 = !{!1041, !1056, !1057}
