; ModuleID = 'build/actinius_icarus_som_ns/sensor/accel_polling/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv8m.main-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.pm_state_info = type { i32, i8, i32, i32 }
%struct._snode = type { %struct._snode* }
%struct._slist = type { %struct._snode*, %struct._snode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.k_mem_partition_attr_t }
%struct.k_mem_partition_attr_t = type { i16, i16 }
%struct.dynamic_region_info = type { i32, %struct.arm_mpu_region }
%struct.arm_mpu_region = type { i32, i8*, %struct.arm_mpu_region_attr }
%struct.arm_mpu_region_attr = type { i8, i32 }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.onoff_client = type { %struct._snode, %struct.sys_notify }
%struct.sys_notify = type { %union.method, i32, i32 }
%union.method = type { %struct.k_poll_signal* }
%struct.k_poll_signal = type { %struct._dnode, i32, i32 }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.nrf_clock_control_config = type { [2 x %struct.nrf_clock_control_sub_config] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/accel_polling/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/accel_polling")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 77, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/accel_polling")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 4160, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 65)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 2080, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "channels", scope: !27, file: !290, line: 22, type: !295, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !200, globals: !287, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/sensor/accel_polling/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/accel_polling")
!29 = !{!30, !95, !115, !130}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_channel", file: !31, line: 53, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/drivers/sensor.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94}
!34 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_X", value: 0)
!35 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_Y", value: 1)
!36 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_Z", value: 2)
!37 = !DIEnumerator(name: "SENSOR_CHAN_ACCEL_XYZ", value: 3)
!38 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_X", value: 4)
!39 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_Y", value: 5)
!40 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_Z", value: 6)
!41 = !DIEnumerator(name: "SENSOR_CHAN_GYRO_XYZ", value: 7)
!42 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_X", value: 8)
!43 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_Y", value: 9)
!44 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_Z", value: 10)
!45 = !DIEnumerator(name: "SENSOR_CHAN_MAGN_XYZ", value: 11)
!46 = !DIEnumerator(name: "SENSOR_CHAN_DIE_TEMP", value: 12)
!47 = !DIEnumerator(name: "SENSOR_CHAN_AMBIENT_TEMP", value: 13)
!48 = !DIEnumerator(name: "SENSOR_CHAN_PRESS", value: 14)
!49 = !DIEnumerator(name: "SENSOR_CHAN_PROX", value: 15)
!50 = !DIEnumerator(name: "SENSOR_CHAN_HUMIDITY", value: 16)
!51 = !DIEnumerator(name: "SENSOR_CHAN_LIGHT", value: 17)
!52 = !DIEnumerator(name: "SENSOR_CHAN_IR", value: 18)
!53 = !DIEnumerator(name: "SENSOR_CHAN_RED", value: 19)
!54 = !DIEnumerator(name: "SENSOR_CHAN_GREEN", value: 20)
!55 = !DIEnumerator(name: "SENSOR_CHAN_BLUE", value: 21)
!56 = !DIEnumerator(name: "SENSOR_CHAN_ALTITUDE", value: 22)
!57 = !DIEnumerator(name: "SENSOR_CHAN_PM_1_0", value: 23)
!58 = !DIEnumerator(name: "SENSOR_CHAN_PM_2_5", value: 24)
!59 = !DIEnumerator(name: "SENSOR_CHAN_PM_10", value: 25)
!60 = !DIEnumerator(name: "SENSOR_CHAN_DISTANCE", value: 26)
!61 = !DIEnumerator(name: "SENSOR_CHAN_CO2", value: 27)
!62 = !DIEnumerator(name: "SENSOR_CHAN_VOC", value: 28)
!63 = !DIEnumerator(name: "SENSOR_CHAN_GAS_RES", value: 29)
!64 = !DIEnumerator(name: "SENSOR_CHAN_VOLTAGE", value: 30)
!65 = !DIEnumerator(name: "SENSOR_CHAN_CURRENT", value: 31)
!66 = !DIEnumerator(name: "SENSOR_CHAN_POWER", value: 32)
!67 = !DIEnumerator(name: "SENSOR_CHAN_RESISTANCE", value: 33)
!68 = !DIEnumerator(name: "SENSOR_CHAN_ROTATION", value: 34)
!69 = !DIEnumerator(name: "SENSOR_CHAN_POS_DX", value: 35)
!70 = !DIEnumerator(name: "SENSOR_CHAN_POS_DY", value: 36)
!71 = !DIEnumerator(name: "SENSOR_CHAN_POS_DZ", value: 37)
!72 = !DIEnumerator(name: "SENSOR_CHAN_RPM", value: 38)
!73 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_VOLTAGE", value: 39)
!74 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_AVG_CURRENT", value: 40)
!75 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STDBY_CURRENT", value: 41)
!76 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_MAX_LOAD_CURRENT", value: 42)
!77 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TEMP", value: 43)
!78 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STATE_OF_CHARGE", value: 44)
!79 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_FULL_CHARGE_CAPACITY", value: 45)
!80 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_REMAINING_CHARGE_CAPACITY", value: 46)
!81 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_NOM_AVAIL_CAPACITY", value: 47)
!82 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_FULL_AVAIL_CAPACITY", value: 48)
!83 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_AVG_POWER", value: 49)
!84 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_STATE_OF_HEALTH", value: 50)
!85 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TIME_TO_EMPTY", value: 51)
!86 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_TIME_TO_FULL", value: 52)
!87 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_CYCLE_COUNT", value: 53)
!88 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIGN_VOLTAGE", value: 54)
!89 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIRED_VOLTAGE", value: 55)
!90 = !DIEnumerator(name: "SENSOR_CHAN_GAUGE_DESIRED_CHARGING_CURRENT", value: 56)
!91 = !DIEnumerator(name: "SENSOR_CHAN_ALL", value: 57)
!92 = !DIEnumerator(name: "SENSOR_CHAN_COMMON_COUNT", value: 58)
!93 = !DIEnumerator(name: "SENSOR_CHAN_PRIV_START", value: 58)
!94 = !DIEnumerator(name: "SENSOR_CHAN_MAX", value: 32767)
!95 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_attribute", file: !31, line: 274, baseType: !32, size: 32, elements: !96)
!96 = !{!97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!97 = !DIEnumerator(name: "SENSOR_ATTR_SAMPLING_FREQUENCY", value: 0)
!98 = !DIEnumerator(name: "SENSOR_ATTR_LOWER_THRESH", value: 1)
!99 = !DIEnumerator(name: "SENSOR_ATTR_UPPER_THRESH", value: 2)
!100 = !DIEnumerator(name: "SENSOR_ATTR_SLOPE_TH", value: 3)
!101 = !DIEnumerator(name: "SENSOR_ATTR_SLOPE_DUR", value: 4)
!102 = !DIEnumerator(name: "SENSOR_ATTR_HYSTERESIS", value: 5)
!103 = !DIEnumerator(name: "SENSOR_ATTR_OVERSAMPLING", value: 6)
!104 = !DIEnumerator(name: "SENSOR_ATTR_FULL_SCALE", value: 7)
!105 = !DIEnumerator(name: "SENSOR_ATTR_OFFSET", value: 8)
!106 = !DIEnumerator(name: "SENSOR_ATTR_CALIB_TARGET", value: 9)
!107 = !DIEnumerator(name: "SENSOR_ATTR_CONFIGURATION", value: 10)
!108 = !DIEnumerator(name: "SENSOR_ATTR_CALIBRATION", value: 11)
!109 = !DIEnumerator(name: "SENSOR_ATTR_FEATURE_MASK", value: 12)
!110 = !DIEnumerator(name: "SENSOR_ATTR_ALERT", value: 13)
!111 = !DIEnumerator(name: "SENSOR_ATTR_FF_DUR", value: 14)
!112 = !DIEnumerator(name: "SENSOR_ATTR_COMMON_COUNT", value: 15)
!113 = !DIEnumerator(name: "SENSOR_ATTR_PRIV_START", value: 15)
!114 = !DIEnumerator(name: "SENSOR_ATTR_MAX", value: 32767)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sensor_trigger_type", file: !31, line: 203, baseType: !32, size: 32, elements: !116)
!116 = !{!117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129}
!117 = !DIEnumerator(name: "SENSOR_TRIG_TIMER", value: 0)
!118 = !DIEnumerator(name: "SENSOR_TRIG_DATA_READY", value: 1)
!119 = !DIEnumerator(name: "SENSOR_TRIG_DELTA", value: 2)
!120 = !DIEnumerator(name: "SENSOR_TRIG_NEAR_FAR", value: 3)
!121 = !DIEnumerator(name: "SENSOR_TRIG_THRESHOLD", value: 4)
!122 = !DIEnumerator(name: "SENSOR_TRIG_TAP", value: 5)
!123 = !DIEnumerator(name: "SENSOR_TRIG_DOUBLE_TAP", value: 6)
!124 = !DIEnumerator(name: "SENSOR_TRIG_FREEFALL", value: 7)
!125 = !DIEnumerator(name: "SENSOR_TRIG_MOTION", value: 8)
!126 = !DIEnumerator(name: "SENSOR_TRIG_STATIONARY", value: 9)
!127 = !DIEnumerator(name: "SENSOR_TRIG_COMMON_COUNT", value: 10)
!128 = !DIEnumerator(name: "SENSOR_TRIG_PRIV_START", value: 10)
!129 = !DIEnumerator(name: "SENSOR_TRIG_MAX", value: 32767)
!130 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !131, line: 27, baseType: !32, size: 32, elements: !132)
!131 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!132 = !{!133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199}
!133 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!134 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!135 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!136 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!137 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!138 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!139 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!140 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!141 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!142 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!143 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!144 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!145 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!146 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!147 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!148 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!149 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!150 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!151 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!152 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!153 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!154 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!155 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!156 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!157 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!158 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!159 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!160 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!161 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!162 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!163 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!164 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!165 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!166 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!167 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!168 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!169 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!170 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!171 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!172 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!173 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!174 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!175 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!176 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!177 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!178 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!179 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!180 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!181 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!182 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!183 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!184 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!185 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!186 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!187 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!188 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!189 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!190 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!191 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!192 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!193 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!194 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!195 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!196 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!197 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!198 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!199 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!200 = !{!201, !203, !204, !234, !279, !280, !284, !285}
!201 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !202, line: 214, baseType: !32)
!202 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!203 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 32)
!205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_driver_api", file: !31, line: 397, size: 160, elements: !207)
!207 = !{!208, !248, !254, !269, !274}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "attr_set", scope: !206, file: !31, line: 398, baseType: !209, size: 32)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_attr_set_t", file: !31, line: 354, baseType: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 32)
!211 = !DISubroutineType(types: !212)
!212 = !{!203, !213, !30, !95, !241}
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 32)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !215)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !216, line: 378, size: 192, elements: !217)
!216 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!217 = !{!218, !222, !223, !224, !233, !235}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !215, file: !216, line: 380, baseType: !219, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !221)
!221 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !215, file: !216, line: 382, baseType: !13, size: 32, offset: 32)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !215, file: !216, line: 384, baseType: !13, size: 32, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !215, file: !216, line: 386, baseType: !225, size: 32, offset: 96)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 32)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !216, line: 351, size: 16, elements: !227)
!227 = !{!228, !231}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !226, file: !216, line: 359, baseType: !229, size: 8)
!229 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !230)
!230 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !226, file: !216, line: 364, baseType: !232, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!232 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !215, file: !216, line: 388, baseType: !234, size: 32, offset: 128)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !215, file: !216, line: 396, baseType: !236, size: 32, offset: 160)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 32)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !238)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !216, line: 43, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !240)
!240 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 32)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !243)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_value", file: !31, line: 43, size: 64, elements: !244)
!244 = !{!245, !247}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "val1", scope: !243, file: !31, line: 45, baseType: !246, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !203)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "val2", scope: !243, file: !31, line: 47, baseType: !246, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "attr_get", scope: !206, file: !31, line: 399, baseType: !249, size: 32, offset: 32)
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_attr_get_t", file: !31, line: 365, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DISubroutineType(types: !252)
!252 = !{!203, !213, !30, !95, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "trigger_set", scope: !206, file: !31, line: 400, baseType: !255, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_trigger_set_t", file: !31, line: 376, baseType: !256)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DISubroutineType(types: !258)
!258 = !{!203, !213, !259, !265}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sensor_trigger", file: !31, line: 264, size: 64, elements: !262)
!262 = !{!263, !264}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !261, file: !31, line: 266, baseType: !115, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "chan", scope: !261, file: !31, line: 268, baseType: !30, size: 32, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_trigger_handler_t", file: !31, line: 345, baseType: !266)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 32)
!267 = !DISubroutineType(types: !268)
!268 = !{null, !213, !259}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "sample_fetch", scope: !206, file: !31, line: 401, baseType: !270, size: 32, offset: 96)
!270 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_sample_fetch_t", file: !31, line: 385, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !272, size: 32)
!272 = !DISubroutineType(types: !273)
!273 = !{!203, !213, !30}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "channel_get", scope: !206, file: !31, line: 402, baseType: !275, size: 32, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "sensor_channel_get_t", file: !31, line: 393, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 32)
!277 = !DISubroutineType(types: !278)
!278 = !{!203, !213, !30, !253}
!279 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_ticks_t", file: !281, line: 46, baseType: !282)
!281 = !DIFile(filename: "zephyr/include/zephyr/sys_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !283)
!283 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !23, line: 91, baseType: !286)
!286 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!287 = !{!288, !25}
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "sensors", scope: !27, file: !290, line: 20, type: !291, isLocal: true, isDefinition: true)
!290 = !DIFile(filename: "zephyr/samples/sensor/accel_polling/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !292, size: 32, elements: !293)
!292 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!293 = !{!294}
!294 = !DISubrange(count: 1)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 96, elements: !297)
!296 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!297 = !{!298}
!298 = !DISubrange(count: 3)
!299 = !DIGlobalVariableExpression(var: !300, expr: !DIExpression())
!300 = distinct !DIGlobalVariable(name: "_char_out", scope: !301, file: !306, line: 54, type: !307, isLocal: false, isDefinition: true)
!301 = distinct !DICompileUnit(language: DW_LANG_C99, file: !302, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !304, globals: !305, splitDebugInlining: false, nameTableKind: None)
!302 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/accel_polling")
!303 = !{!130}
!304 = !{!234, !203}
!305 = !{!299}
!306 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 32)
!308 = !DISubroutineType(types: !309)
!309 = !{!203, !203}
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "__init_nordicsemi_nrf91_init", scope: !312, file: !371, line: 65, type: !372, isLocal: true, isDefinition: true, align: 32)
!312 = distinct !DICompileUnit(language: DW_LANG_C99, file: !313, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !314, globals: !364, splitDebugInlining: false, nameTableKind: None)
!313 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/accel_polling")
!314 = !{!234, !203, !315, !284, !326}
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "delay_func_t", scope: !317, file: !316, line: 167, baseType: !325)
!316 = !DIFile(filename: "modules/hal/nordic/nrfx/soc/nrfx_coredep.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!317 = distinct !DISubprogram(name: "nrfx_coredep_delay_us", scope: !316, file: !316, line: 134, type: !318, scopeLine: 135, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !312, retainedNodes: !320)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !284}
!320 = !{!321, !322, !324}
!321 = !DILocalVariable(name: "time_us", arg: 1, scope: !317, file: !316, line: 134, type: !284)
!322 = !DILocalVariable(name: "delay_cycles", scope: !317, file: !316, line: 168, type: !323)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !315)
!324 = !DILocalVariable(name: "cycles", scope: !317, file: !316, line: 171, type: !284)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 32)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_NVMC_Type", file: !328, line: 1928, baseType: !329)
!328 = !DIFile(filename: "modules/hal/nordic/nrfx/mdk/nrf9160.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 1909, size: 11360, elements: !330)
!330 = !{!331, !337, !338, !339, !340, !344, !345, !346, !347, !349, !350, !354, !355, !356, !357, !358, !362, !363}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !329, file: !328, line: 1910, baseType: !332, size: 8192)
!332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 8192, elements: !335)
!333 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !284)
!335 = !{!336}
!336 = !DISubrange(count: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "READY", scope: !329, file: !328, line: 1911, baseType: !333, size: 32, offset: 8192)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !329, file: !328, line: 1912, baseType: !333, size: 32, offset: 8224)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "READYNEXT", scope: !329, file: !328, line: 1913, baseType: !333, size: 32, offset: 8256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !329, file: !328, line: 1914, baseType: !341, size: 1984, offset: 8288)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 1984, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 62)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIG", scope: !329, file: !328, line: 1915, baseType: !334, size: 32, offset: 10272)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !329, file: !328, line: 1916, baseType: !333, size: 32, offset: 10304)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEALL", scope: !329, file: !328, line: 1917, baseType: !334, size: 32, offset: 10336)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !329, file: !328, line: 1918, baseType: !348, size: 96, offset: 10368)
!348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 96, elements: !297)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "ERASEPAGEPARTIALCFG", scope: !329, file: !328, line: 1919, baseType: !334, size: 32, offset: 10464)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !329, file: !328, line: 1920, baseType: !351, size: 256, offset: 10496)
!351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 256, elements: !352)
!352 = !{!353}
!353 = !DISubrange(count: 8)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "ICACHECNF", scope: !329, file: !328, line: 1921, baseType: !334, size: 32, offset: 10752)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !329, file: !328, line: 1922, baseType: !333, size: 32, offset: 10784)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "IHIT", scope: !329, file: !328, line: 1923, baseType: !334, size: 32, offset: 10816)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "IMISS", scope: !329, file: !328, line: 1924, baseType: !334, size: 32, offset: 10848)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED7", scope: !329, file: !328, line: 1925, baseType: !359, size: 416, offset: 10880)
!359 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 416, elements: !360)
!360 = !{!361}
!361 = !DISubrange(count: 13)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "CONFIGNS", scope: !329, file: !328, line: 1926, baseType: !334, size: 32, offset: 11296)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "WRITEUICRNS", scope: !329, file: !328, line: 1927, baseType: !334, size: 32, offset: 11328)
!364 = !{!310, !365}
!365 = !DIGlobalVariableExpression(var: !366, expr: !DIExpression())
!366 = distinct !DIGlobalVariable(name: "delay_machine_code", scope: !317, file: !316, line: 161, type: !367, isLocal: true, isDefinition: true, align: 128)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 48, elements: !297)
!368 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !370)
!370 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!371 = !DIFile(filename: "zephyr/soc/arm/nordic_nrf/nrf91/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!372 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !373)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !374, line: 51, size: 64, elements: !375)
!374 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!375 = !{!376, !383}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !373, file: !374, line: 60, baseType: !377, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 32)
!378 = !DISubroutineType(types: !379)
!379 = !{!203, !380}
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !382)
!382 = !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !374, line: 48, flags: DIFlagFwdDecl)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !373, file: !374, line: 65, baseType: !380, size: 32, offset: 32)
!384 = !DIGlobalVariableExpression(var: !385, expr: !DIExpression())
!385 = distinct !DIGlobalVariable(name: "z_post_ops_required", scope: !386, file: !421, line: 27, type: !446, isLocal: true, isDefinition: true)
!386 = distinct !DICompileUnit(language: DW_LANG_C99, file: !387, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !388, retainedTypes: !400, globals: !418, splitDebugInlining: false, nameTableKind: None)
!387 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/accel_polling")
!388 = !{!389, !130}
!389 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pm_state", file: !390, line: 27, baseType: !32, size: 32, elements: !391)
!390 = !DIFile(filename: "zephyr/include/zephyr/pm/state.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!391 = !{!392, !393, !394, !395, !396, !397, !398, !399}
!392 = !DIEnumerator(name: "PM_STATE_ACTIVE", value: 0)
!393 = !DIEnumerator(name: "PM_STATE_RUNTIME_IDLE", value: 1)
!394 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_IDLE", value: 2)
!395 = !DIEnumerator(name: "PM_STATE_STANDBY", value: 3)
!396 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_RAM", value: 4)
!397 = !DIEnumerator(name: "PM_STATE_SUSPEND_TO_DISK", value: 5)
!398 = !DIEnumerator(name: "PM_STATE_SOFT_OFF", value: 6)
!399 = !DIEnumerator(name: "PM_STATE_COUNT", value: 7)
!400 = !{!234, !280, !203, !24, !401, !417, !284, !285}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 32)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_notifier", file: !403, line: 54, size: 96, elements: !404)
!403 = !DIFile(filename: "zephyr/include/zephyr/pm/pm.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!404 = !{!405, !412, !416}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_node", scope: !402, file: !403, line: 55, baseType: !406, size: 32)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !407, line: 33, baseType: !408)
!407 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !407, line: 29, size: 32, elements: !409)
!409 = !{!410}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !408, file: !407, line: 30, baseType: !411, size: 32)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "state_entry", scope: !402, file: !403, line: 60, baseType: !413, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !389}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "state_exit", scope: !402, file: !403, line: 65, baseType: !413, size: 32, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 32)
!418 = !{!384, !419, !425, !427, !436, !438}
!419 = !DIGlobalVariableExpression(var: !420, expr: !DIExpression())
!420 = distinct !DIGlobalVariable(name: "pm_forced_state_lock", scope: !386, file: !421, line: 44, type: !422, isLocal: true, isDefinition: true)
!421 = !DIFile(filename: "zephyr/subsys/pm/pm.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !423, line: 43, elements: !424)
!423 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!424 = !{}
!425 = !DIGlobalVariableExpression(var: !426, expr: !DIExpression())
!426 = distinct !DIGlobalVariable(name: "pm_notifier_lock", scope: !386, file: !421, line: 49, type: !422, isLocal: true, isDefinition: true)
!427 = !DIGlobalVariableExpression(var: !428, expr: !DIExpression())
!428 = distinct !DIGlobalVariable(name: "z_cpus_pm_state", scope: !386, file: !421, line: 36, type: !429, isLocal: true, isDefinition: true)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 128, elements: !293)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !390, line: 114, size: 128, elements: !431)
!431 = !{!432, !433, !434, !435}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !430, file: !390, line: 115, baseType: !389, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !430, file: !390, line: 141, baseType: !229, size: 8, offset: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !430, file: !390, line: 149, baseType: !284, size: 32, offset: 64)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !430, file: !390, line: 156, baseType: !284, size: 32, offset: 96)
!436 = !DIGlobalVariableExpression(var: !437, expr: !DIExpression())
!437 = distinct !DIGlobalVariable(name: "z_cpus_pm_forced_state", scope: !386, file: !421, line: 40, type: !429, isLocal: true, isDefinition: true)
!438 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression())
!439 = distinct !DIGlobalVariable(name: "pm_notifiers", scope: !386, file: !421, line: 28, type: !440, isLocal: true, isDefinition: true)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !407, line: 40, baseType: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !407, line: 35, size: 64, elements: !442)
!442 = !{!443, !445}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !441, file: !407, line: 36, baseType: !444, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !441, file: !407, line: 37, baseType: !444, size: 32, offset: 32)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !447, size: 32, elements: !293)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "atomic_t", file: !448, line: 22, baseType: !449)
!448 = !DIFile(filename: "zephyr/include/zephyr/sys/atomic.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!449 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!450 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 32))
!451 = !DIGlobalVariableExpression(var: !439, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 32))
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "max_latency_ticks", scope: !454, file: !480, line: 50, type: !246, isLocal: true, isDefinition: true)
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !388, retainedTypes: !456, globals: !477, splitDebugInlining: false, nameTableKind: None)
!455 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/accel_polling")
!456 = !{!239, !280, !201, !203, !234, !284, !285, !457, !417, !246, !468}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 32)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_request", file: !459, line: 45, size: 64, elements: !460)
!459 = !DIFile(filename: "zephyr/include/zephyr/pm/policy.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!460 = !{!461, !467}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !458, file: !459, line: 46, baseType: !462, size: 32)
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !407, line: 33, baseType: !463)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !407, line: 29, size: 32, elements: !464)
!464 = !{!465}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !463, file: !407, line: 30, baseType: !466, size: 32)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !458, file: !459, line: 48, baseType: !284, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 32)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_policy_latency_subscription", file: !459, line: 38, size: 64, elements: !470)
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !469, file: !459, line: 39, baseType: !462, size: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !469, file: !459, line: 41, baseType: !473, size: 32, offset: 32)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "pm_policy_latency_changed_cb_t", file: !459, line: 35, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 32)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !246}
!477 = !{!478, !482, !490, !452, !492, !502}
!478 = !DIGlobalVariableExpression(var: !479, expr: !DIExpression())
!479 = distinct !DIGlobalVariable(name: "latency_lock", scope: !454, file: !480, line: 44, type: !481, isLocal: true, isDefinition: true)
!480 = !DIFile(filename: "zephyr/subsys/pm/policy.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !423, line: 43, elements: !424)
!482 = !DIGlobalVariableExpression(var: !483, expr: !DIExpression())
!483 = distinct !DIGlobalVariable(name: "latency_reqs", scope: !454, file: !480, line: 46, type: !484, isLocal: true, isDefinition: true)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_slist_t", file: !407, line: 40, baseType: !485)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_slist", file: !407, line: 35, size: 64, elements: !486)
!486 = !{!487, !489}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !485, file: !407, line: 36, baseType: !488, size: 32)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !485, file: !407, line: 37, baseType: !488, size: 32, offset: 32)
!490 = !DIGlobalVariableExpression(var: !491, expr: !DIExpression())
!491 = distinct !DIGlobalVariable(name: "latency_subs", scope: !454, file: !480, line: 52, type: !484, isLocal: true, isDefinition: true)
!492 = !DIGlobalVariableExpression(var: !493, expr: !DIExpression())
!493 = distinct !DIGlobalVariable(name: "substate_lock_t", scope: !454, file: !480, line: 39, type: !494, isLocal: true, isDefinition: true)
!494 = !DICompositeType(tag: DW_TAG_array_type, baseType: !495, elements: !500)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !480, line: 35, size: 96, elements: !496)
!496 = !{!497, !498, !499}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !495, file: !480, line: 36, baseType: !389, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !495, file: !480, line: 37, baseType: !229, size: 8, offset: 32)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !495, file: !480, line: 38, baseType: !447, size: 32, offset: 64)
!500 = !{!501}
!501 = !DISubrange(count: 0)
!502 = !DIGlobalVariableExpression(var: !503, expr: !DIExpression())
!503 = distinct !DIGlobalVariable(name: "max_latency_us", scope: !454, file: !480, line: 48, type: !246, isLocal: true, isDefinition: true)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "pmstates_DT_N_S_cpus_S_cpu_0", scope: !506, file: !513, line: 47, type: !527, isLocal: true, isDefinition: true)
!506 = distinct !DICompileUnit(language: DW_LANG_C99, file: !507, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !508, retainedTypes: !509, globals: !510, splitDebugInlining: false, nameTableKind: None)
!507 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/accel_polling")
!508 = !{!389}
!509 = !{!201, !203}
!510 = !{!511, !504, !523}
!511 = !DIGlobalVariableExpression(var: !512, expr: !DIExpression())
!512 = distinct !DIGlobalVariable(name: "cpus_states", scope: !506, file: !513, line: 50, type: !514, isLocal: true, isDefinition: true)
!513 = !DIFile(filename: "zephyr/subsys/pm/state.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!514 = !DICompositeType(tag: DW_TAG_array_type, baseType: !515, size: 32, elements: !293)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 32)
!516 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !517)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pm_state_info", file: !390, line: 114, size: 128, elements: !518)
!518 = !{!519, !520, !521, !522}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !517, file: !390, line: 115, baseType: !389, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "substate_id", scope: !517, file: !390, line: 141, baseType: !229, size: 8, offset: 32)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "min_residency_us", scope: !517, file: !390, line: 149, baseType: !284, size: 32, offset: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "exit_latency_us", scope: !517, file: !390, line: 156, baseType: !284, size: 32, offset: 96)
!523 = !DIGlobalVariableExpression(var: !524, expr: !DIExpression())
!524 = distinct !DIGlobalVariable(name: "states_per_cpu", scope: !506, file: !513, line: 55, type: !525, isLocal: true, isDefinition: true)
!525 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 8, elements: !293)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !229)
!527 = !DICompositeType(tag: DW_TAG_array_type, baseType: !516, elements: !500)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "static_regions", scope: !530, file: !537, line: 62, type: !669, isLocal: true, isDefinition: true)
!530 = distinct !DICompileUnit(language: DW_LANG_C99, file: !531, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !532, globals: !533, splitDebugInlining: false, nameTableKind: None)
!531 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/accel_polling")
!532 = !{!201, !203, !284, !234}
!533 = !{!534, !528}
!534 = !DIGlobalVariableExpression(var: !535, expr: !DIExpression())
!535 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !536, file: !537, line: 198, type: !656, isLocal: true, isDefinition: true)
!536 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !537, file: !537, line: 175, type: !538, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !530, retainedNodes: !653)
!537 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!538 = !DISubroutineType(types: !539)
!539 = !{null, !540}
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 32)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !542, line: 245, size: 1024, elements: !543)
!542 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!543 = !{!544, !609, !622, !623, !624, !625, !631, !648}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !541, file: !542, line: 247, baseType: !545, size: 384)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !542, line: 57, size: 384, elements: !546)
!546 = !{!547, !575, !583, !584, !585, !596, !597, !598}
!547 = !DIDerivedType(tag: DW_TAG_member, scope: !545, file: !542, line: 60, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !545, file: !542, line: 60, size: 64, elements: !549)
!549 = !{!550, !566}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !548, file: !542, line: 61, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !552, line: 49, baseType: !553)
!552 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !552, line: 37, size: 64, elements: !554)
!554 = !{!555, !561}
!555 = !DIDerivedType(tag: DW_TAG_member, scope: !553, file: !552, line: 38, baseType: !556, size: 32)
!556 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !553, file: !552, line: 38, size: 32, elements: !557)
!557 = !{!558, !560}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !556, file: !552, line: 39, baseType: !559, size: 32)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 32)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !556, file: !552, line: 40, baseType: !559, size: 32)
!561 = !DIDerivedType(tag: DW_TAG_member, scope: !553, file: !552, line: 42, baseType: !562, size: 32, offset: 32)
!562 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !553, file: !552, line: 42, size: 32, elements: !563)
!563 = !{!564, !565}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !562, file: !552, line: 43, baseType: !559, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !562, file: !552, line: 44, baseType: !559, size: 32)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !548, file: !542, line: 62, baseType: !567, size: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !568, line: 49, size: 64, elements: !569)
!568 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!569 = !{!570}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !567, file: !568, line: 50, baseType: !571, size: 64)
!571 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 64, elements: !573)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 32)
!573 = !{!574}
!574 = !DISubrange(count: 2)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !545, file: !542, line: 68, baseType: !576, size: 32, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !578, line: 233, baseType: !579)
!578 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !578, line: 231, size: 64, elements: !580)
!580 = !{!581}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !579, file: !578, line: 232, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !552, line: 48, baseType: !553)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !545, file: !542, line: 71, baseType: !229, size: 8, offset: 96)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !545, file: !542, line: 74, baseType: !229, size: 8, offset: 104)
!585 = !DIDerivedType(tag: DW_TAG_member, scope: !545, file: !542, line: 90, baseType: !586, size: 16, offset: 112)
!586 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !545, file: !542, line: 90, size: 16, elements: !587)
!587 = !{!588, !595}
!588 = !DIDerivedType(tag: DW_TAG_member, scope: !586, file: !542, line: 91, baseType: !589, size: 16)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !586, file: !542, line: 91, size: 16, elements: !590)
!590 = !{!591, !594}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !589, file: !542, line: 96, baseType: !592, size: 8)
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !593)
!593 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !589, file: !542, line: 97, baseType: !229, size: 8, offset: 8)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !586, file: !542, line: 100, baseType: !369, size: 16)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !545, file: !542, line: 107, baseType: !284, size: 32, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !545, file: !542, line: 127, baseType: !234, size: 32, offset: 160)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !545, file: !542, line: 131, baseType: !599, size: 192, offset: 192)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !578, line: 244, size: 192, elements: !600)
!600 = !{!601, !602, !608}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !599, file: !578, line: 245, baseType: !551, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !599, file: !578, line: 246, baseType: !603, size: 32, offset: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !578, line: 242, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 32)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !607}
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !599, file: !578, line: 249, baseType: !282, size: 64, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !541, file: !542, line: 250, baseType: !610, size: 288, offset: 384)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !611, line: 25, size: 288, elements: !612)
!611 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620, !621}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !610, file: !611, line: 26, baseType: !284, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !610, file: !611, line: 27, baseType: !284, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !610, file: !611, line: 28, baseType: !284, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !610, file: !611, line: 29, baseType: !284, size: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !610, file: !611, line: 30, baseType: !284, size: 32, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !610, file: !611, line: 31, baseType: !284, size: 32, offset: 160)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !610, file: !611, line: 32, baseType: !284, size: 32, offset: 192)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !610, file: !611, line: 33, baseType: !284, size: 32, offset: 224)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !610, file: !611, line: 34, baseType: !284, size: 32, offset: 256)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !541, file: !542, line: 253, baseType: !234, size: 32, offset: 672)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !541, file: !542, line: 256, baseType: !577, size: 64, offset: 704)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !541, file: !542, line: 294, baseType: !203, size: 32, offset: 768)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !541, file: !542, line: 300, baseType: !626, size: 96, offset: 800)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !542, line: 149, size: 96, elements: !627)
!627 = !{!628, !629, !630}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !626, file: !542, line: 153, baseType: !22, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !626, file: !542, line: 162, baseType: !201, size: 32, offset: 32)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !626, file: !542, line: 168, baseType: !201, size: 32, offset: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !541, file: !542, line: 325, baseType: !632, size: 32, offset: 896)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 32)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !634, line: 5073, size: 160, elements: !635)
!634 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!635 = !{!636, !645, !646}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !633, file: !634, line: 5074, baseType: !637, size: 96)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !638, line: 56, size: 96, elements: !639)
!638 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!639 = !{!640, !643, !644}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !637, file: !638, line: 57, baseType: !641, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!642 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !638, line: 57, flags: DIFlagFwdDecl)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !637, file: !638, line: 58, baseType: !234, size: 32, offset: 32)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !637, file: !638, line: 59, baseType: !201, size: 32, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !633, file: !634, line: 5075, baseType: !577, size: 64, offset: 96)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !633, file: !634, line: 5076, baseType: !647, offset: 160)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !423, line: 43, elements: !424)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !541, file: !542, line: 343, baseType: !649, size: 64, offset: 928)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !611, line: 60, size: 64, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !649, file: !611, line: 63, baseType: !284, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !649, file: !611, line: 66, baseType: !284, size: 32, offset: 32)
!653 = !{!654, !655}
!654 = !DILocalVariable(name: "thread", arg: 1, scope: !536, file: !537, line: 175, type: !540)
!655 = !DILocalVariable(name: "region_num", scope: !536, file: !537, line: 200, type: !229)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, elements: !500)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !658, line: 52, size: 96, elements: !659)
!658 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!659 = !{!660, !661, !662}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !657, file: !658, line: 53, baseType: !22, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !657, file: !658, line: 54, baseType: !201, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !657, file: !658, line: 55, baseType: !663, size: 32, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !664, line: 304, baseType: !665)
!664 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v8.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !664, line: 301, size: 32, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !665, file: !664, line: 302, baseType: !369, size: 16)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !665, file: !664, line: 303, baseType: !369, size: 16, offset: 16)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 96, elements: !293)
!670 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !657)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !673, file: !727, line: 39, type: !229, isLocal: true, isDefinition: true)
!673 = distinct !DICompileUnit(language: DW_LANG_C99, file: !674, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !675, globals: !718, splitDebugInlining: false, nameTableKind: None)
!674 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/accel_polling")
!675 = !{!676, !234, !203, !704}
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !678, line: 1495, baseType: !679)
!678 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm33.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !678, line: 1474, size: 448, elements: !680)
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !694}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !679, file: !678, line: 1476, baseType: !333, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !679, file: !678, line: 1477, baseType: !334, size: 32, offset: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !679, file: !678, line: 1478, baseType: !334, size: 32, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !679, file: !678, line: 1479, baseType: !334, size: 32, offset: 96)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR", scope: !679, file: !678, line: 1480, baseType: !334, size: 32, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !679, file: !678, line: 1481, baseType: !334, size: 32, offset: 160)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A1", scope: !679, file: !678, line: 1482, baseType: !334, size: 32, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !679, file: !678, line: 1483, baseType: !334, size: 32, offset: 224)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A2", scope: !679, file: !678, line: 1484, baseType: !334, size: 32, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !679, file: !678, line: 1485, baseType: !334, size: 32, offset: 288)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "RLAR_A3", scope: !679, file: !678, line: 1486, baseType: !334, size: 32, offset: 320)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !679, file: !678, line: 1487, baseType: !693, size: 32, offset: 352)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 32, elements: !293)
!694 = !DIDerivedType(tag: DW_TAG_member, scope: !679, file: !678, line: 1488, baseType: !695, size: 64, offset: 384)
!695 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !679, file: !678, line: 1488, size: 64, elements: !696)
!696 = !{!697, !699}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR", scope: !695, file: !678, line: 1489, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 64, elements: !573)
!699 = !DIDerivedType(tag: DW_TAG_member, scope: !695, file: !678, line: 1490, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !695, file: !678, line: 1490, size: 64, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR0", scope: !700, file: !678, line: 1491, baseType: !334, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "MAIR1", scope: !700, file: !678, line: 1492, baseType: !334, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !707, line: 27, size: 128, elements: !708)
!707 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!708 = !{!709, !710, !711}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !706, file: !707, line: 29, baseType: !284, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !706, file: !707, line: 31, baseType: !219, size: 32, offset: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !706, file: !707, line: 37, baseType: !712, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !664, line: 298, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !664, line: 289, size: 64, elements: !714)
!714 = !{!715, !716, !717}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !713, file: !664, line: 291, baseType: !229, size: 5, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !713, file: !664, line: 293, baseType: !229, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !713, file: !664, line: 295, baseType: !284, size: 32, offset: 32)
!718 = !{!671, !719}
!719 = !DIGlobalVariableExpression(var: !720, expr: !DIExpression())
!720 = distinct !DIGlobalVariable(name: "dyn_reg_info", scope: !673, file: !721, line: 31, type: !722, isLocal: true, isDefinition: true)
!721 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu_v8_internal.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !723, size: 160, elements: !293)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dynamic_region_info", file: !721, line: 21, size: 160, elements: !724)
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !723, file: !721, line: 22, baseType: !203, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "region_conf", scope: !723, file: !721, line: 23, baseType: !706, size: 128, offset: 32)
!727 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!728 = !DIGlobalVariableExpression(var: !729, expr: !DIExpression())
!729 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !730, file: !737, line: 21, type: !307, isLocal: true, isDefinition: true)
!730 = distinct !DICompileUnit(language: DW_LANG_C99, file: !731, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !303, retainedTypes: !732, globals: !736, splitDebugInlining: false, nameTableKind: None)
!731 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/accel_polling")
!732 = !{!733, !203, !234}
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !735, line: 22, baseType: !203)
!735 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!736 = !{!728}
!737 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !740, file: !745, line: 13, type: !764, isLocal: true, isDefinition: true)
!740 = distinct !DICompileUnit(language: DW_LANG_C99, file: !741, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !742, splitDebugInlining: false, nameTableKind: None)
!741 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/accel_polling")
!742 = !{!743, !738}
!743 = !DIGlobalVariableExpression(var: !744, expr: !DIExpression())
!744 = distinct !DIGlobalVariable(name: "mpu_config", scope: !740, file: !745, line: 37, type: !746, isLocal: false, isDefinition: true)
!745 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !747)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !707, line: 41, size: 64, elements: !748)
!748 = !{!749, !750}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !747, file: !707, line: 43, baseType: !284, size: 32)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !747, file: !707, line: 45, baseType: !751, size: 32, offset: 32)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 32)
!752 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !753)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !707, line: 27, size: 128, elements: !754)
!754 = !{!755, !756, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !753, file: !707, line: 29, baseType: !284, size: 32)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !753, file: !707, line: 31, baseType: !219, size: 32, offset: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !753, file: !707, line: 37, baseType: !758, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !664, line: 298, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !664, line: 289, size: 64, elements: !760)
!760 = !{!761, !762, !763}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "rbar", scope: !759, file: !664, line: 291, baseType: !229, size: 5, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "mair_idx", scope: !759, file: !664, line: 293, baseType: !229, size: 3, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "r_limit", scope: !759, file: !664, line: 295, baseType: !284, size: 32, offset: 32)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !752, size: 256, elements: !573)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "__init_board_actinius_icarus_som_init", scope: !767, file: !863, line: 39, type: !864, isLocal: true, isDefinition: true, align: 32)
!767 = distinct !DICompileUnit(language: DW_LANG_C99, file: !768, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !769, retainedTypes: !781, globals: !862, splitDebugInlining: false, nameTableKind: None)
!768 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/actinius_icarus_som/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/accel_polling")
!769 = !{!770, !776}
!770 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !771, line: 506, baseType: !32, size: 32, elements: !772)
!771 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!772 = !{!773, !774, !775}
!773 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!774 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!775 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!776 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !771, line: 512, baseType: !32, size: 32, elements: !777)
!777 = !{!778, !779, !780}
!778 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!779 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!780 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!781 = !{!782, !851, !856, !817, !776, !770, !861, !234}
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !784)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !771, line: 523, size: 288, elements: !785)
!785 = !{!786, !807, !813, !818, !822, !823, !824, !828, !847}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !784, file: !771, line: 524, baseType: !787, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 32)
!788 = !DISubroutineType(types: !789)
!789 = !{!203, !790, !805, !806}
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !792)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !216, line: 378, size: 192, elements: !793)
!793 = !{!794, !795, !796, !797, !803, !804}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !792, file: !216, line: 380, baseType: !219, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !792, file: !216, line: 382, baseType: !13, size: 32, offset: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !792, file: !216, line: 384, baseType: !13, size: 32, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !792, file: !216, line: 386, baseType: !798, size: 32, offset: 96)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 32)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !216, line: 351, size: 16, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !799, file: !216, line: 359, baseType: !229, size: 8)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !799, file: !216, line: 364, baseType: !232, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !792, file: !216, line: 388, baseType: !234, size: 32, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !792, file: !216, line: 396, baseType: !236, size: 32, offset: 160)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !771, line: 237, baseType: !229)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !771, line: 257, baseType: !284)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !784, file: !771, line: 530, baseType: !808, size: 32, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DISubroutineType(types: !810)
!810 = !{!203, !790, !811}
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !771, line: 229, baseType: !284)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !784, file: !771, line: 532, baseType: !814, size: 32, offset: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 32)
!815 = !DISubroutineType(types: !816)
!816 = !{!203, !790, !817, !812}
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !771, line: 216, baseType: !284)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !784, file: !771, line: 535, baseType: !819, size: 32, offset: 96)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 32)
!820 = !DISubroutineType(types: !821)
!821 = !{!203, !790, !817}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !784, file: !771, line: 537, baseType: !819, size: 32, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !784, file: !771, line: 539, baseType: !819, size: 32, offset: 160)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !784, file: !771, line: 541, baseType: !825, size: 32, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 32)
!826 = !DISubroutineType(types: !827)
!827 = !{!203, !790, !805, !770, !776}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !784, file: !771, line: 544, baseType: !829, size: 32, offset: 224)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 32)
!830 = !DISubroutineType(types: !831)
!831 = !{!203, !790, !832, !232}
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 32)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !771, line: 478, size: 96, elements: !834)
!834 = !{!835, !841, !846}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !833, file: !771, line: 482, baseType: !836, size: 32)
!836 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !407, line: 33, baseType: !837)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !407, line: 29, size: 32, elements: !838)
!838 = !{!839}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !837, file: !407, line: 30, baseType: !840, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !833, file: !771, line: 485, baseType: !842, size: 32, offset: 32)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !771, line: 464, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 32)
!844 = !DISubroutineType(types: !845)
!845 = !{null, !790, !832, !817}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !833, file: !771, line: 493, baseType: !817, size: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !784, file: !771, line: 547, baseType: !848, size: 32, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 32)
!849 = !DISubroutineType(types: !850)
!850 = !{!284, !790}
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 32)
!852 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !771, line: 428, size: 32, elements: !854)
!854 = !{!855}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !853, file: !771, line: 434, baseType: !817, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !771, line: 441, size: 32, elements: !859)
!859 = !{!860}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !858, file: !771, line: 447, baseType: !817, size: 32)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 32)
!862 = !{!765}
!863 = !DIFile(filename: "zephyr/boards/arm/actinius_icarus_som/board.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!864 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !865)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !374, line: 51, size: 64, elements: !866)
!866 = !{!867, !871}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !865, file: !374, line: 60, baseType: !868, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 32)
!869 = !DISubroutineType(types: !870)
!870 = !{!203, !790}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !865, file: !374, line: 65, baseType: !790, size: 32, offset: 32)
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "__device_dts_ord_29", scope: !874, file: !1078, line: 733, type: !1181, isLocal: false, isDefinition: true, align: 32)
!874 = distinct !DICompileUnit(language: DW_LANG_C99, file: !875, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !876, retainedTypes: !994, globals: !1074, splitDebugInlining: false, nameTableKind: None)
!875 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_control_nrf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/actinius_icarus_som_ns/sensor/accel_polling")
!876 = !{!877, !883, !130, !888, !893, !897, !901, !905, !911, !915, !959, !966, !985}
!877 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_nrf_type", file: !878, line: 23, baseType: !32, size: 32, elements: !879)
!878 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/nrf_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!879 = !{!880, !881, !882}
!880 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_HFCLK", value: 0)
!881 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_LFCLK", value: 1)
!882 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_TYPE_COUNT", value: 2)
!883 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "nrf_lfclk_start_mode", file: !878, line: 48, baseType: !32, size: 32, elements: !884)
!884 = !{!885, !886, !887}
!885 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_NOWAIT", value: 0)
!886 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_AVAILABLE", value: 1)
!887 = !DIEnumerator(name: "CLOCK_CONTROL_NRF_LF_START_STABLE", value: 2)
!888 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !889, line: 167, baseType: !32, size: 32, elements: !890)
!889 = !DIFile(filename: "modules/hal/nordic/nrfx/hal/nrf_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!890 = !{!891, !892}
!891 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_LFCLK", value: 0)
!892 = !DIEnumerator(name: "NRF_CLOCK_DOMAIN_HFCLK", value: 1)
!893 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !889, line: 107, baseType: !32, size: 32, elements: !894)
!894 = !{!895, !896}
!895 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_RC", value: 1)
!896 = !DIEnumerator(name: "NRF_CLOCK_LFCLK_Xtal", value: 2)
!897 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !889, line: 208, baseType: !32, size: 32, elements: !898)
!898 = !{!899, !900}
!899 = !DIEnumerator(name: "NRF_CLOCK_INT_HF_STARTED_MASK", value: 1)
!900 = !DIEnumerator(name: "NRF_CLOCK_INT_LF_STARTED_MASK", value: 2)
!901 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !889, line: 261, baseType: !32, size: 32, elements: !902)
!902 = !{!903, !904}
!903 = !DIEnumerator(name: "NRF_CLOCK_EVENT_HFCLKSTARTED", value: 256)
!904 = !DIEnumerator(name: "NRF_CLOCK_EVENT_LFCLKSTARTED", value: 260)
!905 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !889, line: 237, baseType: !32, size: 32, elements: !906)
!906 = !{!907, !908, !909, !910}
!907 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTART", value: 0)
!908 = !DIEnumerator(name: "NRF_CLOCK_TASK_HFCLKSTOP", value: 4)
!909 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTART", value: 8)
!910 = !DIEnumerator(name: "NRF_CLOCK_TASK_LFCLKSTOP", value: 12)
!911 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !889, line: 152, baseType: !32, size: 32, elements: !912)
!912 = !{!913, !914}
!913 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_LOW_ACCURACY", value: 0)
!914 = !DIEnumerator(name: "NRF_CLOCK_HFCLK_HIGH_ACCURACY", value: 1)
!915 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !328, line: 71, baseType: !203, size: 32, elements: !916)
!916 = !{!917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958}
!917 = !DIEnumerator(name: "Reset_IRQn", value: -15)
!918 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!919 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!920 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!921 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!922 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!923 = !DIEnumerator(name: "SecureFault_IRQn", value: -9)
!924 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!925 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!926 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!927 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!928 = !DIEnumerator(name: "SPU_IRQn", value: 3)
!929 = !DIEnumerator(name: "CLOCK_POWER_IRQn", value: 5)
!930 = !DIEnumerator(name: "SPIM0_SPIS0_TWIM0_TWIS0_UARTE0_IRQn", value: 8)
!931 = !DIEnumerator(name: "SPIM1_SPIS1_TWIM1_TWIS1_UARTE1_IRQn", value: 9)
!932 = !DIEnumerator(name: "SPIM2_SPIS2_TWIM2_TWIS2_UARTE2_IRQn", value: 10)
!933 = !DIEnumerator(name: "SPIM3_SPIS3_TWIM3_TWIS3_UARTE3_IRQn", value: 11)
!934 = !DIEnumerator(name: "GPIOTE0_IRQn", value: 13)
!935 = !DIEnumerator(name: "SAADC_IRQn", value: 14)
!936 = !DIEnumerator(name: "TIMER0_IRQn", value: 15)
!937 = !DIEnumerator(name: "TIMER1_IRQn", value: 16)
!938 = !DIEnumerator(name: "TIMER2_IRQn", value: 17)
!939 = !DIEnumerator(name: "RTC0_IRQn", value: 20)
!940 = !DIEnumerator(name: "RTC1_IRQn", value: 21)
!941 = !DIEnumerator(name: "WDT_IRQn", value: 24)
!942 = !DIEnumerator(name: "EGU0_IRQn", value: 27)
!943 = !DIEnumerator(name: "EGU1_IRQn", value: 28)
!944 = !DIEnumerator(name: "EGU2_IRQn", value: 29)
!945 = !DIEnumerator(name: "EGU3_IRQn", value: 30)
!946 = !DIEnumerator(name: "EGU4_IRQn", value: 31)
!947 = !DIEnumerator(name: "EGU5_IRQn", value: 32)
!948 = !DIEnumerator(name: "PWM0_IRQn", value: 33)
!949 = !DIEnumerator(name: "PWM1_IRQn", value: 34)
!950 = !DIEnumerator(name: "PWM2_IRQn", value: 35)
!951 = !DIEnumerator(name: "PWM3_IRQn", value: 36)
!952 = !DIEnumerator(name: "PDM_IRQn", value: 38)
!953 = !DIEnumerator(name: "I2S_IRQn", value: 40)
!954 = !DIEnumerator(name: "IPC_IRQn", value: 42)
!955 = !DIEnumerator(name: "FPU_IRQn", value: 44)
!956 = !DIEnumerator(name: "GPIOTE1_IRQn", value: 49)
!957 = !DIEnumerator(name: "KMU_IRQn", value: 57)
!958 = !DIEnumerator(name: "CRYPTOCELL_IRQn", value: 64)
!959 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !960, line: 44, baseType: !32, size: 32, elements: !961)
!960 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!961 = !{!962, !963, !964, !965}
!962 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!963 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!964 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!965 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!966 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !967, line: 54, baseType: !32, size: 32, elements: !968)
!967 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/nrfx_errors.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!968 = !{!969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984}
!969 = !DIEnumerator(name: "NRFX_SUCCESS", value: 195887104)
!970 = !DIEnumerator(name: "NRFX_ERROR_INTERNAL", value: 195887105)
!971 = !DIEnumerator(name: "NRFX_ERROR_NO_MEM", value: 195887106)
!972 = !DIEnumerator(name: "NRFX_ERROR_NOT_SUPPORTED", value: 195887107)
!973 = !DIEnumerator(name: "NRFX_ERROR_INVALID_PARAM", value: 195887108)
!974 = !DIEnumerator(name: "NRFX_ERROR_INVALID_STATE", value: 195887109)
!975 = !DIEnumerator(name: "NRFX_ERROR_INVALID_LENGTH", value: 195887110)
!976 = !DIEnumerator(name: "NRFX_ERROR_TIMEOUT", value: 195887111)
!977 = !DIEnumerator(name: "NRFX_ERROR_FORBIDDEN", value: 195887112)
!978 = !DIEnumerator(name: "NRFX_ERROR_NULL", value: 195887113)
!979 = !DIEnumerator(name: "NRFX_ERROR_INVALID_ADDR", value: 195887114)
!980 = !DIEnumerator(name: "NRFX_ERROR_BUSY", value: 195887115)
!981 = !DIEnumerator(name: "NRFX_ERROR_ALREADY_INITIALIZED", value: 195887116)
!982 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_OVERRUN", value: 195952640)
!983 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_ANACK", value: 195952641)
!984 = !DIEnumerator(name: "NRFX_ERROR_DRV_TWI_ERR_DNACK", value: 195952642)
!985 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !986, line: 53, baseType: !32, size: 32, elements: !987)
!986 = !DIFile(filename: "modules/hal/nordic/nrfx/drivers/include/nrfx_clock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!987 = !{!988, !989, !990, !991, !992, !993}
!988 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK_STARTED", value: 0)
!989 = !DIEnumerator(name: "NRFX_CLOCK_EVT_LFCLK_STARTED", value: 1)
!990 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CTTO", value: 2)
!991 = !DIEnumerator(name: "NRFX_CLOCK_EVT_CAL_DONE", value: 3)
!992 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLKAUDIO_STARTED", value: 4)
!993 = !DIEnumerator(name: "NRFX_CLOCK_EVT_HFCLK192M_STARTED", value: 5)
!994 = !{!877, !234, !203, !995, !1037, !1038, !1039, !1040, !280, !284, !285, !232, !1041, !1042, !246, !1043, !1073, !201}
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_typedef, name: "NRF_CLOCK_Type", file: !328, line: 923, baseType: !997)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !328, line: 883, size: 10464, elements: !998)
!998 = !{!999, !1000, !1001, !1002, !1003, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1018, !1019, !1020, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTART", scope: !997, file: !328, line: 884, baseType: !334, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_HFCLKSTOP", scope: !997, file: !328, line: 885, baseType: !334, size: 32, offset: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTART", scope: !997, file: !328, line: 886, baseType: !334, size: 32, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "TASKS_LFCLKSTOP", scope: !997, file: !328, line: 887, baseType: !334, size: 32, offset: 96)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED", scope: !997, file: !328, line: 888, baseType: !1004, size: 896, offset: 128)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 896, elements: !1005)
!1005 = !{!1006}
!1006 = !DISubrange(count: 28)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTART", scope: !997, file: !328, line: 889, baseType: !334, size: 32, offset: 1024)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_HFCLKSTOP", scope: !997, file: !328, line: 890, baseType: !334, size: 32, offset: 1056)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTART", scope: !997, file: !328, line: 891, baseType: !334, size: 32, offset: 1088)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "SUBSCRIBE_LFCLKSTOP", scope: !997, file: !328, line: 892, baseType: !334, size: 32, offset: 1120)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED1", scope: !997, file: !328, line: 893, baseType: !1004, size: 896, offset: 1152)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_HFCLKSTARTED", scope: !997, file: !328, line: 894, baseType: !334, size: 32, offset: 2048)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "EVENTS_LFCLKSTARTED", scope: !997, file: !328, line: 895, baseType: !334, size: 32, offset: 2080)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !997, file: !328, line: 896, baseType: !1015, size: 960, offset: 2112)
!1015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 960, elements: !1016)
!1016 = !{!1017}
!1017 = !DISubrange(count: 30)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_HFCLKSTARTED", scope: !997, file: !328, line: 897, baseType: !334, size: 32, offset: 3072)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "PUBLISH_LFCLKSTARTED", scope: !997, file: !328, line: 898, baseType: !334, size: 32, offset: 3104)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !997, file: !328, line: 899, baseType: !1021, size: 3008, offset: 3136)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !333, size: 3008, elements: !1022)
!1022 = !{!1023}
!1023 = !DISubrange(count: 94)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "INTEN", scope: !997, file: !328, line: 900, baseType: !334, size: 32, offset: 6144)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "INTENSET", scope: !997, file: !328, line: 901, baseType: !334, size: 32, offset: 6176)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "INTENCLR", scope: !997, file: !328, line: 902, baseType: !334, size: 32, offset: 6208)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "INTPEND", scope: !997, file: !328, line: 903, baseType: !333, size: 32, offset: 6240)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !997, file: !328, line: 904, baseType: !341, size: 1984, offset: 6272)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKRUN", scope: !997, file: !328, line: 905, baseType: !333, size: 32, offset: 8256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "HFCLKSTAT", scope: !997, file: !328, line: 907, baseType: !333, size: 32, offset: 8288)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !997, file: !328, line: 910, baseType: !333, size: 32, offset: 8320)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKRUN", scope: !997, file: !328, line: 911, baseType: !333, size: 32, offset: 8352)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSTAT", scope: !997, file: !328, line: 913, baseType: !333, size: 32, offset: 8384)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRCCOPY", scope: !997, file: !328, line: 917, baseType: !333, size: 32, offset: 8416)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !997, file: !328, line: 919, baseType: !341, size: 1984, offset: 8448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "LFCLKSRC", scope: !997, file: !328, line: 920, baseType: !334, size: 32, offset: 10432)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_lfclk_t", file: !889, line: 146, baseType: !893)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "nrf_clock_hfclk_t", file: !889, line: 164, baseType: !911)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 32)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 32)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "NVIC_Type", file: !678, line: 485, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !678, line: 468, size: 28704, elements: !1046)
!1046 = !{!1047, !1051, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1068, !1072}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ISER", scope: !1045, file: !678, line: 470, baseType: !1048, size: 512)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !334, size: 512, elements: !1049)
!1049 = !{!1050}
!1050 = !DISubrange(count: 16)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED0", scope: !1045, file: !678, line: 471, baseType: !1052, size: 512, offset: 512)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 512, elements: !1049)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ICER", scope: !1045, file: !678, line: 472, baseType: !1048, size: 512, offset: 1024)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "RSERVED1", scope: !1045, file: !678, line: 473, baseType: !1052, size: 512, offset: 1536)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "ISPR", scope: !1045, file: !678, line: 474, baseType: !1048, size: 512, offset: 2048)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED2", scope: !1045, file: !678, line: 475, baseType: !1052, size: 512, offset: 2560)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ICPR", scope: !1045, file: !678, line: 476, baseType: !1048, size: 512, offset: 3072)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED3", scope: !1045, file: !678, line: 477, baseType: !1052, size: 512, offset: 3584)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "IABR", scope: !1045, file: !678, line: 478, baseType: !1048, size: 512, offset: 4096)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED4", scope: !1045, file: !678, line: 479, baseType: !1052, size: 512, offset: 4608)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "ITNS", scope: !1045, file: !678, line: 480, baseType: !1048, size: 512, offset: 5120)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED5", scope: !1045, file: !678, line: 481, baseType: !1052, size: 512, offset: 5632)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "IPR", scope: !1045, file: !678, line: 482, baseType: !1064, size: 3968, offset: 6144)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1065, size: 3968, elements: !1066)
!1065 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !229)
!1066 = !{!1067}
!1067 = !DISubrange(count: 496)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "RESERVED6", scope: !1045, file: !678, line: 483, baseType: !1069, size: 18560, offset: 10112)
!1069 = !DICompositeType(tag: DW_TAG_array_type, baseType: !284, size: 18560, elements: !1070)
!1070 = !{!1071}
!1071 = !DISubrange(count: 580)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "STIR", scope: !1045, file: !678, line: 484, baseType: !334, size: 32, offset: 28672)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !960, line: 56, baseType: !234)
!1074 = !{!1075, !1125, !1166, !872, !1171, !1196, !1198, !1215, !1217, !1227, !1230, !1245, !1283, !1297}
!1075 = !DIGlobalVariableExpression(var: !1076, expr: !DIExpression())
!1076 = distinct !DIGlobalVariable(name: "on", scope: !1077, file: !1078, line: 549, type: !447, isLocal: true, isDefinition: true)
!1077 = distinct !DISubprogram(name: "z_nrf_clock_control_lf_on", scope: !1078, file: !1078, line: 547, type: !1079, scopeLine: 548, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !874, retainedNodes: !1081)
