; ModuleID = 'build/96b_wistrio/subsys/console/echo/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.tty_serial = type { %struct.device*, %struct.k_sem, i8*, i32, i16, i16, i32, %struct.k_sem, i8*, i32, i16, i16, i32 }
%struct.k_sem = type { %union.anon, i32, i32 }
%union.anon = type { %struct._dnode }
%struct._dnode = type { %union.anon.0, %union.anon.0 }
%union.anon.0 = type { %struct._dnode* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.z_heap_bucket }
%struct.z_heap_bucket = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.z_heap_bucket }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.gpio_dt_spec = type { %struct.device*, i8, i16 }
%struct.stm32_exti_data = type { [16 x %struct.__exti_cb] }
%struct.__exti_cb = type { void (i32, i8*)*, i8* }
%struct._isr_list = type { i32, i32, i8*, i8* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "prompt", scope: !27, file: !105, line: 9, type: !106, isLocal: true, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !104, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/subsys/console/echo/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo")
!29 = !{!30}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !31, line: 27, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!34 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!35 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!36 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!37 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!38 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!39 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!40 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!41 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!42 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!43 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!44 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!45 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!46 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!47 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!48 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!49 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!50 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!51 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!52 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!53 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!54 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!55 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!56 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!57 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!58 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!59 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!60 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!61 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!62 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!63 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!64 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!65 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!100 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!103 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!104 = !{!25}
!105 = !DIFile(filename: "zephyr/samples/subsys/console/echo/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !107, size: 400, elements: !109)
!107 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!108 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!109 = !{!110}
!110 = !DISubrange(count: 50)
!111 = !DIGlobalVariableExpression(var: !112, expr: !DIExpression())
!112 = distinct !DIGlobalVariable(name: "_char_out", scope: !113, file: !116, line: 54, type: !117, isLocal: false, isDefinition: true)
!113 = distinct !DICompileUnit(language: DW_LANG_C99, file: !114, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !101, globals: !115, splitDebugInlining: false, nameTableKind: None)
!114 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo")
!115 = !{!111}
!116 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 32)
!118 = !DISubroutineType(types: !119)
!119 = !{!103, !103}
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "__init_stm32l1_init", scope: !122, file: !153, line: 60, type: !154, isLocal: true, isDefinition: true, align: 32)
!122 = distinct !DICompileUnit(language: DW_LANG_C99, file: !123, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !124, globals: !152, splitDebugInlining: false, nameTableKind: None)
!123 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo")
!124 = !{!125, !146}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !127, line: 386, baseType: !128)
!127 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l151xba.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 370, size: 448, elements: !129)
!129 = !{!130, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !128, file: !127, line: 372, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !132)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !128, file: !127, line: 373, baseType: !131, size: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !128, file: !127, line: 374, baseType: !131, size: 32, offset: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !128, file: !127, line: 375, baseType: !131, size: 32, offset: 96)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !128, file: !127, line: 376, baseType: !131, size: 32, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !128, file: !127, line: 377, baseType: !131, size: 32, offset: 160)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !128, file: !127, line: 378, baseType: !131, size: 32, offset: 192)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !128, file: !127, line: 379, baseType: !131, size: 32, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !128, file: !127, line: 380, baseType: !131, size: 32, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !128, file: !127, line: 381, baseType: !131, size: 32, offset: 288)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !128, file: !127, line: 382, baseType: !131, size: 32, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !128, file: !127, line: 383, baseType: !131, size: 32, offset: 352)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !128, file: !127, line: 384, baseType: !131, size: 32, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !128, file: !127, line: 385, baseType: !131, size: 32, offset: 416)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = !DIDerivedType(tag: DW_TAG_typedef, name: "PWR_TypeDef", file: !127, line: 364, baseType: !148)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 360, size: 64, elements: !149)
!149 = !{!150, !151}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !148, file: !127, line: 362, baseType: !131, size: 32)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !148, file: !127, line: 363, baseType: !131, size: 32, offset: 32)
!152 = !{!120}
!153 = !DIFile(filename: "zephyr/soc/arm/st_stm32/stm32l1/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !155)
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !156, line: 51, size: 64, elements: !157)
!156 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!157 = !{!158, !187}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !155, file: !156, line: 60, baseType: !159, size: 32)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !160, size: 32)
!160 = !DISubroutineType(types: !161)
!161 = !{!103, !162}
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !164)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !165, line: 378, size: 192, elements: !166)
!165 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!166 = !{!167, !169, !170, !171, !180, !181}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !164, file: !165, line: 380, baseType: !168, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !164, file: !165, line: 382, baseType: !13, size: 32, offset: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !164, file: !165, line: 384, baseType: !13, size: 32, offset: 64)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !164, file: !165, line: 386, baseType: !172, size: 32, offset: 96)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !165, line: 351, size: 16, elements: !174)
!174 = !{!175, !178}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !173, file: !165, line: 359, baseType: !176, size: 8)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !177)
!177 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !173, file: !165, line: 364, baseType: !179, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!179 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !164, file: !165, line: 388, baseType: !102, size: 32, offset: 128)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !164, file: !165, line: 396, baseType: !182, size: 32, offset: 160)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 32)
!183 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !184)
!184 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !165, line: 43, baseType: !185)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !186)
!186 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !155, file: !156, line: 65, baseType: !162, size: 32, offset: 32)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "__init_st_stm32_common_config", scope: !190, file: !193, line: 71, type: !194, isLocal: true, isDefinition: true, align: 32)
!190 = distinct !DICompileUnit(language: DW_LANG_C99, file: !191, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !192, splitDebugInlining: false, nameTableKind: None)
!191 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo")
!192 = !{!188}
!193 = !DIFile(filename: "zephyr/soc/arm/st_stm32/common/soc_config.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !156, line: 51, size: 64, elements: !196)
!196 = !{!197, !216}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !195, file: !156, line: 60, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32)
!199 = !DISubroutineType(types: !200)
!200 = !{!103, !201}
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 32)
!202 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !203)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !165, line: 378, size: 192, elements: !204)
!204 = !{!205, !206, !207, !208, !214, !215}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !203, file: !165, line: 380, baseType: !168, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !203, file: !165, line: 382, baseType: !13, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !203, file: !165, line: 384, baseType: !13, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !203, file: !165, line: 386, baseType: !209, size: 32, offset: 96)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 32)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !165, line: 351, size: 16, elements: !211)
!211 = !{!212, !213}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !210, file: !165, line: 359, baseType: !176, size: 8)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !210, file: !165, line: 364, baseType: !179, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !203, file: !165, line: 388, baseType: !102, size: 32, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !203, file: !165, line: 396, baseType: !182, size: 32, offset: 160)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !195, file: !156, line: 65, baseType: !201, size: 32, offset: 32)
!217 = !DIGlobalVariableExpression(var: !218, expr: !DIExpression())
!218 = distinct !DIGlobalVariable(name: "console_serial", scope: !219, file: !310, line: 13, type: !319, isLocal: true, isDefinition: true)
!219 = distinct !DICompileUnit(language: DW_LANG_C99, file: !220, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !221, globals: !307, splitDebugInlining: false, nameTableKind: None)
!220 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/subsys/console/getchar.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo")
!221 = !{!222, !102, !103}
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 32)
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !225, line: 336, size: 608, elements: !226)
!225 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!226 = !{!227, !247, !251, !255, !268, !273, !279, !285, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !224, file: !225, line: 365, baseType: !228, size: 32)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 32)
!229 = !DISubroutineType(types: !230)
!230 = !{!103, !231, !246}
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !165, line: 378, size: 192, elements: !234)
!234 = !{!235, !236, !237, !238, !244, !245}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !233, file: !165, line: 380, baseType: !168, size: 32)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !233, file: !165, line: 382, baseType: !13, size: 32, offset: 32)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !233, file: !165, line: 384, baseType: !13, size: 32, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !233, file: !165, line: 386, baseType: !239, size: 32, offset: 96)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 32)
!240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !165, line: 351, size: 16, elements: !241)
!241 = !{!242, !243}
!242 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !240, file: !165, line: 359, baseType: !176, size: 8)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !240, file: !165, line: 364, baseType: !179, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !233, file: !165, line: 388, baseType: !102, size: 32, offset: 128)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !233, file: !165, line: 396, baseType: !182, size: 32, offset: 160)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !224, file: !225, line: 366, baseType: !248, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 32)
!249 = !DISubroutineType(types: !250)
!250 = !{null, !231, !177}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !224, file: !225, line: 374, baseType: !252, size: 32, offset: 64)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 32)
!253 = !DISubroutineType(types: !254)
!254 = !{!103, !231}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !224, file: !225, line: 377, baseType: !256, size: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 32)
!257 = !DISubroutineType(types: !258)
!258 = !{!103, !231, !259}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 32)
!260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !225, line: 122, size: 64, elements: !262)
!262 = !{!263, !264, !265, !266, !267}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !261, file: !225, line: 123, baseType: !132, size: 32)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !261, file: !225, line: 124, baseType: !176, size: 8, offset: 32)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !261, file: !225, line: 125, baseType: !176, size: 8, offset: 40)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !261, file: !225, line: 126, baseType: !176, size: 8, offset: 48)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !261, file: !225, line: 127, baseType: !176, size: 8, offset: 56)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !224, file: !225, line: 379, baseType: !269, size: 32, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 32)
!270 = !DISubroutineType(types: !271)
!271 = !{!103, !231, !272}
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_fill", scope: !224, file: !225, line: 384, baseType: !274, size: 32, offset: 160)
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 32)
!275 = !DISubroutineType(types: !276)
!276 = !{!103, !231, !277, !103}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !278, size: 32)
!278 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !176)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "fifo_read", scope: !224, file: !225, line: 393, baseType: !280, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 32)
!281 = !DISubroutineType(types: !282)
!282 = !{!103, !231, !283, !284}
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !103)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_enable", scope: !224, file: !225, line: 402, baseType: !286, size: 32, offset: 224)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 32)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !231}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_disable", scope: !224, file: !225, line: 405, baseType: !286, size: 32, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_ready", scope: !224, file: !225, line: 408, baseType: !252, size: 32, offset: 288)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_enable", scope: !224, file: !225, line: 411, baseType: !286, size: 32, offset: 320)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_disable", scope: !224, file: !225, line: 414, baseType: !286, size: 32, offset: 352)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "irq_tx_complete", scope: !224, file: !225, line: 417, baseType: !252, size: 32, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "irq_rx_ready", scope: !224, file: !225, line: 420, baseType: !252, size: 32, offset: 416)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_enable", scope: !224, file: !225, line: 423, baseType: !286, size: 32, offset: 448)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "irq_err_disable", scope: !224, file: !225, line: 426, baseType: !286, size: 32, offset: 480)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "irq_is_pending", scope: !224, file: !225, line: 429, baseType: !252, size: 32, offset: 512)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "irq_update", scope: !224, file: !225, line: 432, baseType: !252, size: 32, offset: 544)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "irq_callback_set", scope: !224, file: !225, line: 435, baseType: !300, size: 32, offset: 576)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 32)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !231, !303, !102}
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "uart_irq_callback_user_data_t", file: !225, line: 142, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 32)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !231, !102}
!307 = !{!217, !308, !314}
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "console_rxbuf", scope: !219, file: !310, line: 15, type: !311, isLocal: true, isDefinition: true)
!310 = !DIFile(filename: "zephyr/subsys/console/getchar.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 512, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 64)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "console_txbuf", scope: !219, file: !310, line: 16, type: !316, isLocal: true, isDefinition: true)
!316 = !DICompositeType(tag: DW_TAG_array_type, baseType: !176, size: 4096, elements: !317)
!317 = !{!318}
!318 = !DISubrange(count: 512)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tty_serial", file: !320, line: 18, size: 544, elements: !321)
!320 = !DIFile(filename: "zephyr/include/zephyr/console/tty.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!321 = !{!322, !323, !350, !351, !352, !355, !356, !358, !359, !360, !361, !362, !363}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "uart_dev", scope: !319, file: !320, line: 19, baseType: !231, size: 32)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "rx_sem", scope: !319, file: !320, line: 21, baseType: !324, size: 128, offset: 32)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_sem", file: !325, line: 2909, size: 128, elements: !326)
!325 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!326 = !{!327, !348, !349}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !324, file: !325, line: 2910, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !329, line: 233, baseType: !330)
!329 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !329, line: 231, size: 64, elements: !331)
!331 = !{!332}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !330, file: !329, line: 232, baseType: !333, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !334, line: 48, baseType: !335)
!334 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !334, line: 37, size: 64, elements: !336)
!336 = !{!337, !343}
!337 = !DIDerivedType(tag: DW_TAG_member, scope: !335, file: !334, line: 38, baseType: !338, size: 32)
!338 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !335, file: !334, line: 38, size: 32, elements: !339)
!339 = !{!340, !342}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !338, file: !334, line: 39, baseType: !341, size: 32)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !338, file: !334, line: 40, baseType: !341, size: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, scope: !335, file: !334, line: 42, baseType: !344, size: 32, offset: 32)
!344 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !335, file: !334, line: 42, size: 32, elements: !345)
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !344, file: !334, line: 43, baseType: !341, size: 32)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !344, file: !334, line: 44, baseType: !341, size: 32)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !324, file: !325, line: 2911, baseType: !32, size: 32, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !324, file: !325, line: 2912, baseType: !32, size: 32, offset: 96)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "rx_ringbuf", scope: !319, file: !320, line: 22, baseType: !283, size: 32, offset: 160)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "rx_ringbuf_sz", scope: !319, file: !320, line: 23, baseType: !132, size: 32, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "rx_get", scope: !319, file: !320, line: 24, baseType: !353, size: 16, offset: 224)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !354)
!354 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "rx_put", scope: !319, file: !320, line: 24, baseType: !353, size: 16, offset: 240)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rx_timeout", scope: !319, file: !320, line: 25, baseType: !357, size: 32, offset: 256)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !23, line: 74, baseType: !103)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tx_sem", scope: !319, file: !320, line: 27, baseType: !324, size: 128, offset: 288)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ringbuf", scope: !319, file: !320, line: 28, baseType: !283, size: 32, offset: 416)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tx_ringbuf_sz", scope: !319, file: !320, line: 29, baseType: !132, size: 32, offset: 448)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tx_get", scope: !319, file: !320, line: 30, baseType: !353, size: 16, offset: 480)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tx_put", scope: !319, file: !320, line: 30, baseType: !353, size: 16, offset: 496)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tx_timeout", scope: !319, file: !320, line: 31, baseType: !357, size: 32, offset: 512)
!364 = !DIGlobalVariableExpression(var: !365, expr: !DIExpression())
!365 = distinct !DIGlobalVariable(name: "static_regions", scope: !366, file: !375, line: 62, type: !511, isLocal: true, isDefinition: true)
!366 = distinct !DICompileUnit(language: DW_LANG_C99, file: !367, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !368, globals: !371, splitDebugInlining: false, nameTableKind: None)
!367 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo")
!368 = !{!369, !103, !132, !102}
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !370, line: 214, baseType: !32)
!370 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!371 = !{!372, !364}
!372 = !DIGlobalVariableExpression(var: !373, expr: !DIExpression())
!373 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !374, file: !375, line: 198, type: !497, isLocal: true, isDefinition: true)
!374 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !375, file: !375, line: 175, type: !376, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !366, retainedNodes: !492)
!375 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!376 = !DISubroutineType(types: !377)
!377 = !{null, !378}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 32)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !380, line: 245, size: 1024, elements: !381)
!380 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!381 = !{!382, !447, !460, !461, !462, !463, !469, !487}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !379, file: !380, line: 247, baseType: !383, size: 384)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !380, line: 57, size: 384, elements: !384)
!384 = !{!385, !412, !419, !420, !421, !432, !433, !434}
!385 = !DIDerivedType(tag: DW_TAG_member, scope: !383, file: !380, line: 60, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !383, file: !380, line: 60, size: 64, elements: !387)
!387 = !{!388, !403}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !386, file: !380, line: 61, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !334, line: 49, baseType: !390)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !334, line: 37, size: 64, elements: !391)
!391 = !{!392, !398}
!392 = !DIDerivedType(tag: DW_TAG_member, scope: !390, file: !334, line: 38, baseType: !393, size: 32)
!393 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !390, file: !334, line: 38, size: 32, elements: !394)
!394 = !{!395, !397}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !393, file: !334, line: 39, baseType: !396, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !393, file: !334, line: 40, baseType: !396, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, scope: !390, file: !334, line: 42, baseType: !399, size: 32, offset: 32)
!399 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !390, file: !334, line: 42, size: 32, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !399, file: !334, line: 43, baseType: !396, size: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !399, file: !334, line: 44, baseType: !396, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !386, file: !380, line: 62, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !405, line: 49, size: 64, elements: !406)
!405 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!406 = !{!407}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !404, file: !405, line: 50, baseType: !408, size: 64)
!408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 64, elements: !410)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 32)
!410 = !{!411}
!411 = !DISubrange(count: 2)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !383, file: !380, line: 68, baseType: !413, size: 32, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !329, line: 233, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !329, line: 231, size: 64, elements: !416)
!416 = !{!417}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !415, file: !329, line: 232, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !334, line: 48, baseType: !390)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !383, file: !380, line: 71, baseType: !176, size: 8, offset: 96)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !383, file: !380, line: 74, baseType: !176, size: 8, offset: 104)
!421 = !DIDerivedType(tag: DW_TAG_member, scope: !383, file: !380, line: 90, baseType: !422, size: 16, offset: 112)
!422 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !383, file: !380, line: 90, size: 16, elements: !423)
!423 = !{!424, !431}
!424 = !DIDerivedType(tag: DW_TAG_member, scope: !422, file: !380, line: 91, baseType: !425, size: 16)
!425 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !422, file: !380, line: 91, size: 16, elements: !426)
!426 = !{!427, !430}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !425, file: !380, line: 96, baseType: !428, size: 8)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !429)
!429 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !425, file: !380, line: 97, baseType: !176, size: 8, offset: 8)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !422, file: !380, line: 100, baseType: !353, size: 16)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !383, file: !380, line: 107, baseType: !132, size: 32, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !383, file: !380, line: 127, baseType: !102, size: 32, offset: 160)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !383, file: !380, line: 131, baseType: !435, size: 192, offset: 192)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !329, line: 244, size: 192, elements: !436)
!436 = !{!437, !438, !444}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !435, file: !329, line: 245, baseType: !389, size: 64)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !435, file: !329, line: 246, baseType: !439, size: 32, offset: 64)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !329, line: 242, baseType: !440)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 32)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !443}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 32)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !435, file: !329, line: 249, baseType: !445, size: 64, offset: 128)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !446)
!446 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !379, file: !380, line: 250, baseType: !448, size: 288, offset: 384)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !449, line: 25, size: 288, elements: !450)
!449 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!450 = !{!451, !452, !453, !454, !455, !456, !457, !458, !459}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !448, file: !449, line: 26, baseType: !132, size: 32)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !448, file: !449, line: 27, baseType: !132, size: 32, offset: 32)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !448, file: !449, line: 28, baseType: !132, size: 32, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !448, file: !449, line: 29, baseType: !132, size: 32, offset: 96)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !448, file: !449, line: 30, baseType: !132, size: 32, offset: 128)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !448, file: !449, line: 31, baseType: !132, size: 32, offset: 160)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !448, file: !449, line: 32, baseType: !132, size: 32, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !448, file: !449, line: 33, baseType: !132, size: 32, offset: 224)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !448, file: !449, line: 34, baseType: !132, size: 32, offset: 256)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !379, file: !380, line: 253, baseType: !102, size: 32, offset: 672)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !379, file: !380, line: 256, baseType: !414, size: 64, offset: 704)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !379, file: !380, line: 294, baseType: !103, size: 32, offset: 768)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !379, file: !380, line: 300, baseType: !464, size: 96, offset: 800)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !380, line: 149, size: 96, elements: !465)
!465 = !{!466, !467, !468}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !464, file: !380, line: 153, baseType: !22, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !464, file: !380, line: 162, baseType: !369, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !464, file: !380, line: 168, baseType: !369, size: 32, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !379, file: !380, line: 325, baseType: !470, size: 32, offset: 896)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 32)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !325, line: 5073, size: 160, elements: !472)
!472 = !{!473, !482, !483}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !471, file: !325, line: 5074, baseType: !474, size: 96)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !475, line: 56, size: 96, elements: !476)
!475 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!476 = !{!477, !480, !481}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !474, file: !475, line: 57, baseType: !478, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 32)
!479 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !475, line: 57, flags: DIFlagFwdDecl)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !474, file: !475, line: 58, baseType: !102, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !474, file: !475, line: 59, baseType: !369, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !471, file: !325, line: 5075, baseType: !414, size: 64, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !471, file: !325, line: 5076, baseType: !484, offset: 160)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !485, line: 43, elements: !486)
!485 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!486 = !{}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !379, file: !380, line: 343, baseType: !488, size: 64, offset: 928)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !449, line: 60, size: 64, elements: !489)
!489 = !{!490, !491}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !488, file: !449, line: 63, baseType: !132, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !488, file: !449, line: 66, baseType: !132, size: 32, offset: 32)
!492 = !{!493, !494, !495, !496}
!493 = !DILocalVariable(name: "thread", arg: 1, scope: !374, file: !375, line: 175, type: !378)
!494 = !DILocalVariable(name: "region_num", scope: !374, file: !375, line: 200, type: !176)
!495 = !DILocalVariable(name: "guard_start", scope: !374, file: !375, line: 265, type: !22)
!496 = !DILocalVariable(name: "guard_size", scope: !374, file: !375, line: 266, type: !369)
!497 = !DICompositeType(tag: DW_TAG_array_type, baseType: !498, size: 96, elements: !509)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !499, line: 52, size: 96, elements: !500)
!499 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!500 = !{!501, !502, !503}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !498, file: !499, line: 53, baseType: !22, size: 32)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !498, file: !499, line: 54, baseType: !369, size: 32, offset: 32)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !498, file: !499, line: 55, baseType: !504, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !505, line: 151, baseType: !506)
!505 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !505, line: 149, size: 32, elements: !507)
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !506, file: !505, line: 150, baseType: !132, size: 32)
!509 = !{!510}
!510 = !DISubrange(count: 1)
!511 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 96, elements: !509)
!512 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!513 = !DIGlobalVariableExpression(var: !514, expr: !DIExpression())
!514 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !515, file: !548, line: 39, type: !176, isLocal: true, isDefinition: true)
!515 = distinct !DICompileUnit(language: DW_LANG_C99, file: !516, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !517, globals: !547, splitDebugInlining: false, nameTableKind: None)
!516 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo")
!517 = !{!518, !102, !103, !535, !176}
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !520, line: 1168, baseType: !521)
!520 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !520, line: 1155, size: 352, elements: !522)
!522 = !{!523, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !521, file: !520, line: 1157, baseType: !524, size: 32)
!524 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !131)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !521, file: !520, line: 1158, baseType: !131, size: 32, offset: 32)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !521, file: !520, line: 1159, baseType: !131, size: 32, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !521, file: !520, line: 1160, baseType: !131, size: 32, offset: 96)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !521, file: !520, line: 1161, baseType: !131, size: 32, offset: 128)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !521, file: !520, line: 1162, baseType: !131, size: 32, offset: 160)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !521, file: !520, line: 1163, baseType: !131, size: 32, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !521, file: !520, line: 1164, baseType: !131, size: 32, offset: 224)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !521, file: !520, line: 1165, baseType: !131, size: 32, offset: 256)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !521, file: !520, line: 1166, baseType: !131, size: 32, offset: 288)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !521, file: !520, line: 1167, baseType: !131, size: 32, offset: 320)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !537)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !538, line: 27, size: 96, elements: !539)
!538 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!539 = !{!540, !541, !542}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !537, file: !538, line: 29, baseType: !132, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !537, file: !538, line: 31, baseType: !168, size: 32, offset: 32)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !537, file: !538, line: 37, baseType: !543, size: 32, offset: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !505, line: 146, baseType: !544)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !505, line: 141, size: 32, elements: !545)
!545 = !{!546}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !544, file: !505, line: 143, baseType: !132, size: 32)
!547 = !{!513}
!548 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!549 = !DIGlobalVariableExpression(var: !550, expr: !DIExpression())
!550 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !551, file: !558, line: 21, type: !117, isLocal: true, isDefinition: true)
!551 = distinct !DICompileUnit(language: DW_LANG_C99, file: !552, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !553, globals: !557, splitDebugInlining: false, nameTableKind: None)
!552 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo")
!553 = !{!554, !103, !102}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 32)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !556, line: 22, baseType: !103)
!556 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!557 = !{!549}
!558 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!559 = !DIGlobalVariableExpression(var: !560, expr: !DIExpression())
!560 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !561, file: !566, line: 13, type: !583, isLocal: true, isDefinition: true)
!561 = distinct !DICompileUnit(language: DW_LANG_C99, file: !562, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !563, splitDebugInlining: false, nameTableKind: None)
!562 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo")
!563 = !{!564, !559}
!564 = !DIGlobalVariableExpression(var: !565, expr: !DIExpression())
!565 = distinct !DIGlobalVariable(name: "mpu_config", scope: !561, file: !566, line: 37, type: !567, isLocal: false, isDefinition: true)
!566 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !538, line: 41, size: 64, elements: !569)
!569 = !{!570, !571}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !568, file: !538, line: 43, baseType: !132, size: 32)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !568, file: !538, line: 45, baseType: !572, size: 32, offset: 32)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !574)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !538, line: 27, size: 96, elements: !575)
!575 = !{!576, !577, !578}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !574, file: !538, line: 29, baseType: !132, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !574, file: !538, line: 31, baseType: !168, size: 32, offset: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !574, file: !538, line: 37, baseType: !579, size: 32, offset: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !505, line: 146, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !505, line: 141, size: 32, elements: !581)
!581 = !{!582}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !580, file: !505, line: 143, baseType: !132, size: 32)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !573, size: 192, elements: !410)
!584 = !DIGlobalVariableExpression(var: !585, expr: !DIExpression())
!585 = distinct !DIGlobalVariable(name: "__init_rf_init", scope: !586, file: !683, line: 36, type: !684, isLocal: true, isDefinition: true, align: 32)
!586 = distinct !DICompileUnit(language: DW_LANG_C99, file: !587, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !588, retainedTypes: !600, globals: !682, splitDebugInlining: false, nameTableKind: None)
!587 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo")
!588 = !{!589, !595}
!589 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_mode", file: !590, line: 506, baseType: !32, size: 32, elements: !591)
!590 = !DIFile(filename: "zephyr/include/zephyr/drivers/gpio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!591 = !{!592, !593, !594}
!592 = !DIEnumerator(name: "GPIO_INT_MODE_DISABLED", value: 2097152)
!593 = !DIEnumerator(name: "GPIO_INT_MODE_LEVEL", value: 4194304)
!594 = !DIEnumerator(name: "GPIO_INT_MODE_EDGE", value: 20971520)
!595 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gpio_int_trig", file: !590, line: 512, baseType: !32, size: 32, elements: !596)
!596 = !{!597, !598, !599}
!597 = !DIEnumerator(name: "GPIO_INT_TRIG_LOW", value: 33554432)
!598 = !DIEnumerator(name: "GPIO_INT_TRIG_HIGH", value: 67108864)
!599 = !DIEnumerator(name: "GPIO_INT_TRIG_BOTH", value: 100663296)
!600 = !{!601, !671, !676, !636, !595, !589, !681, !102}
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_api", file: !590, line: 523, size: 288, elements: !604)
!604 = !{!605, !626, !632, !637, !641, !642, !643, !647, !667}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "pin_configure", scope: !603, file: !590, line: 524, baseType: !606, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 32)
!607 = !DISubroutineType(types: !608)
!608 = !{!103, !609, !624, !625}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 32)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !165, line: 378, size: 192, elements: !612)
!612 = !{!613, !614, !615, !616, !622, !623}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !611, file: !165, line: 380, baseType: !168, size: 32)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !611, file: !165, line: 382, baseType: !13, size: 32, offset: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !611, file: !165, line: 384, baseType: !13, size: 32, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !611, file: !165, line: 386, baseType: !617, size: 32, offset: 96)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 32)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !165, line: 351, size: 16, elements: !619)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !618, file: !165, line: 359, baseType: !176, size: 8)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !618, file: !165, line: 364, baseType: !179, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !611, file: !165, line: 388, baseType: !102, size: 32, offset: 128)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !611, file: !165, line: 396, baseType: !182, size: 32, offset: 160)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_pin_t", file: !590, line: 237, baseType: !176)
!625 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_flags_t", file: !590, line: 257, baseType: !132)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "port_get_raw", scope: !603, file: !590, line: 530, baseType: !627, size: 32, offset: 32)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 32)
!628 = !DISubroutineType(types: !629)
!629 = !{!103, !609, !630}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_value_t", file: !590, line: 229, baseType: !132)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_masked_raw", scope: !603, file: !590, line: 532, baseType: !633, size: 32, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 32)
!634 = !DISubroutineType(types: !635)
!635 = !{!103, !609, !636, !631}
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_port_pins_t", file: !590, line: 216, baseType: !132)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "port_set_bits_raw", scope: !603, file: !590, line: 535, baseType: !638, size: 32, offset: 96)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 32)
!639 = !DISubroutineType(types: !640)
!640 = !{!103, !609, !636}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "port_clear_bits_raw", scope: !603, file: !590, line: 537, baseType: !638, size: 32, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "port_toggle_bits", scope: !603, file: !590, line: 539, baseType: !638, size: 32, offset: 160)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "pin_interrupt_configure", scope: !603, file: !590, line: 541, baseType: !644, size: 32, offset: 192)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 32)
!645 = !DISubroutineType(types: !646)
!646 = !{!103, !609, !624, !589, !595}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "manage_callback", scope: !603, file: !590, line: 544, baseType: !648, size: 32, offset: 224)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 32)
!649 = !DISubroutineType(types: !650)
!650 = !{!103, !609, !651, !179}
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 32)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_callback", file: !590, line: 478, size: 96, elements: !653)
!653 = !{!654, !661, !666}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !652, file: !590, line: 482, baseType: !655, size: 32)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_snode_t", file: !656, line: 33, baseType: !657)
!656 = !DIFile(filename: "zephyr/include/zephyr/sys/slist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_snode", file: !656, line: 29, size: 32, elements: !658)
!658 = !{!659}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !657, file: !656, line: 30, baseType: !660, size: 32)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 32)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !652, file: !590, line: 485, baseType: !662, size: 32, offset: 32)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "gpio_callback_handler_t", file: !590, line: 464, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 32)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !609, !651, !636}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "pin_mask", scope: !652, file: !590, line: 493, baseType: !636, size: 32, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "get_pending_int", scope: !603, file: !590, line: 547, baseType: !668, size: 32, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 32)
!669 = !DISubroutineType(types: !670)
!670 = !{!132, !609}
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_config", file: !590, line: 428, size: 32, elements: !674)
!674 = !{!675}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "port_pin_mask", scope: !673, file: !590, line: 434, baseType: !636, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gpio_driver_data", file: !590, line: 441, size: 32, elements: !679)
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "invert", scope: !678, file: !590, line: 447, baseType: !636, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !678, size: 32)
!682 = !{!584}
!683 = !DIFile(filename: "zephyr/boards/arm/96b_wistrio/rf.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !156, line: 51, size: 64, elements: !686)
!686 = !{!687, !691}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !685, file: !156, line: 60, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 32)
!689 = !DISubroutineType(types: !690)
!690 = !{!103, !609}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !685, file: !156, line: 65, baseType: !609, size: 32, offset: 32)
!692 = !DIGlobalVariableExpression(var: !693, expr: !DIExpression())
!693 = distinct !DIGlobalVariable(name: "exti_irq_table", scope: !694, file: !766, line: 48, type: !841, isLocal: true, isDefinition: true)
!694 = distinct !DICompileUnit(language: DW_LANG_C99, file: !695, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !696, retainedTypes: !752, globals: !763, splitDebugInlining: false, nameTableKind: None)
!695 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo")
!696 = !{!30, !697}
!697 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !127, line: 69, baseType: !103, size: 32, elements: !698)
!698 = !{!699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751}
!699 = !DIEnumerator(name: "NonMaskableInt_IRQn", value: -14)
!700 = !DIEnumerator(name: "HardFault_IRQn", value: -13)
!701 = !DIEnumerator(name: "MemoryManagement_IRQn", value: -12)
!702 = !DIEnumerator(name: "BusFault_IRQn", value: -11)
!703 = !DIEnumerator(name: "UsageFault_IRQn", value: -10)
!704 = !DIEnumerator(name: "SVCall_IRQn", value: -5)
!705 = !DIEnumerator(name: "DebugMonitor_IRQn", value: -4)
!706 = !DIEnumerator(name: "PendSV_IRQn", value: -2)
!707 = !DIEnumerator(name: "SysTick_IRQn", value: -1)
!708 = !DIEnumerator(name: "WWDG_IRQn", value: 0)
!709 = !DIEnumerator(name: "PVD_IRQn", value: 1)
!710 = !DIEnumerator(name: "TAMPER_STAMP_IRQn", value: 2)
!711 = !DIEnumerator(name: "RTC_WKUP_IRQn", value: 3)
!712 = !DIEnumerator(name: "FLASH_IRQn", value: 4)
!713 = !DIEnumerator(name: "RCC_IRQn", value: 5)
!714 = !DIEnumerator(name: "EXTI0_IRQn", value: 6)
!715 = !DIEnumerator(name: "EXTI1_IRQn", value: 7)
!716 = !DIEnumerator(name: "EXTI2_IRQn", value: 8)
!717 = !DIEnumerator(name: "EXTI3_IRQn", value: 9)
!718 = !DIEnumerator(name: "EXTI4_IRQn", value: 10)
!719 = !DIEnumerator(name: "DMA1_Channel1_IRQn", value: 11)
!720 = !DIEnumerator(name: "DMA1_Channel2_IRQn", value: 12)
!721 = !DIEnumerator(name: "DMA1_Channel3_IRQn", value: 13)
!722 = !DIEnumerator(name: "DMA1_Channel4_IRQn", value: 14)
!723 = !DIEnumerator(name: "DMA1_Channel5_IRQn", value: 15)
!724 = !DIEnumerator(name: "DMA1_Channel6_IRQn", value: 16)
!725 = !DIEnumerator(name: "DMA1_Channel7_IRQn", value: 17)
!726 = !DIEnumerator(name: "ADC1_IRQn", value: 18)
!727 = !DIEnumerator(name: "USB_HP_IRQn", value: 19)
!728 = !DIEnumerator(name: "USB_LP_IRQn", value: 20)
!729 = !DIEnumerator(name: "DAC_IRQn", value: 21)
!730 = !DIEnumerator(name: "COMP_IRQn", value: 22)
!731 = !DIEnumerator(name: "EXTI9_5_IRQn", value: 23)
!732 = !DIEnumerator(name: "TIM9_IRQn", value: 25)
!733 = !DIEnumerator(name: "TIM10_IRQn", value: 26)
!734 = !DIEnumerator(name: "TIM11_IRQn", value: 27)
!735 = !DIEnumerator(name: "TIM2_IRQn", value: 28)
!736 = !DIEnumerator(name: "TIM3_IRQn", value: 29)
!737 = !DIEnumerator(name: "TIM4_IRQn", value: 30)
!738 = !DIEnumerator(name: "I2C1_EV_IRQn", value: 31)
!739 = !DIEnumerator(name: "I2C1_ER_IRQn", value: 32)
!740 = !DIEnumerator(name: "I2C2_EV_IRQn", value: 33)
!741 = !DIEnumerator(name: "I2C2_ER_IRQn", value: 34)
!742 = !DIEnumerator(name: "SPI1_IRQn", value: 35)
!743 = !DIEnumerator(name: "SPI2_IRQn", value: 36)
!744 = !DIEnumerator(name: "USART1_IRQn", value: 37)
!745 = !DIEnumerator(name: "USART2_IRQn", value: 38)
!746 = !DIEnumerator(name: "USART3_IRQn", value: 39)
!747 = !DIEnumerator(name: "EXTI15_10_IRQn", value: 40)
!748 = !DIEnumerator(name: "RTC_Alarm_IRQn", value: 41)
!749 = !DIEnumerator(name: "USB_FS_WKUP_IRQn", value: 42)
!750 = !DIEnumerator(name: "TIM6_IRQn", value: 43)
!751 = !DIEnumerator(name: "TIM7_IRQn", value: 44)
!752 = !{!369, !103, !102, !753}
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "EXTI_TypeDef", file: !127, line: 270, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 262, size: 192, elements: !756)
!756 = !{!757, !758, !759, !760, !761, !762}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "IMR", scope: !755, file: !127, line: 264, baseType: !131, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "EMR", scope: !755, file: !127, line: 265, baseType: !131, size: 32, offset: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "RTSR", scope: !755, file: !127, line: 266, baseType: !131, size: 32, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "FTSR", scope: !755, file: !127, line: 267, baseType: !131, size: 32, offset: 96)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "SWIER", scope: !755, file: !127, line: 268, baseType: !131, size: 32, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "PR", scope: !755, file: !127, line: 269, baseType: !131, size: 32, offset: 160)
!763 = !{!764, !770, !786, !797, !814, !692, !816, !829, !831, !833, !835, !837, !839}
!764 = !DIGlobalVariableExpression(var: !765, expr: !DIExpression())
!765 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !694, file: !766, line: 424, type: !767, isLocal: false, isDefinition: true, align: 16)
!766 = !DIFile(filename: "zephyr/drivers/interrupt_controller/intc_exti_stm32.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 64, elements: !768)
!768 = !{!769}
!769 = !DISubrange(count: 4)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "__device_dts_ord_32", scope: !694, file: !766, line: 424, type: !772, isLocal: false, isDefinition: true, align: 32)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !165, line: 378, size: 192, elements: !774)
!774 = !{!775, !776, !777, !778, !784, !785}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !773, file: !165, line: 380, baseType: !168, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !773, file: !165, line: 382, baseType: !13, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !773, file: !165, line: 384, baseType: !13, size: 32, offset: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !773, file: !165, line: 386, baseType: !779, size: 32, offset: 96)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 32)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !165, line: 351, size: 16, elements: !781)
!781 = !{!782, !783}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !780, file: !165, line: 359, baseType: !176, size: 8)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !780, file: !165, line: 364, baseType: !179, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !773, file: !165, line: 388, baseType: !102, size: 32, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !773, file: !165, line: 396, baseType: !182, size: 32, offset: 160)
!786 = !DIGlobalVariableExpression(var: !787, expr: !DIExpression())
!787 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_32", scope: !694, file: !766, line: 424, type: !788, isLocal: true, isDefinition: true, align: 32)
!788 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !789)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !156, line: 51, size: 64, elements: !790)
!790 = !{!791, !796}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !789, file: !156, line: 60, baseType: !792, size: 32)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 32)
!793 = !DISubroutineType(types: !794)
!794 = !{!103, !795}
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 32)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !789, file: !156, line: 65, baseType: !795, size: 32, offset: 32)
!797 = !DIGlobalVariableExpression(var: !798, expr: !DIExpression())
!798 = distinct !DIGlobalVariable(name: "exti_data", scope: !694, file: !766, line: 423, type: !799, isLocal: true, isDefinition: true)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_exti_data", file: !766, line: 107, size: 1024, elements: !800)
!800 = !{!801}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !799, file: !766, line: 109, baseType: !802, size: 1024)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !803, size: 1024, elements: !812)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__exti_cb", file: !766, line: 101, size: 64, elements: !804)
!804 = !{!805, !811}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !803, file: !766, line: 102, baseType: !806, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "stm32_exti_callback_t", file: !807, line: 63, baseType: !808)
!807 = !DIFile(filename: "zephyr/include/zephyr/drivers/interrupt_controller/exti_stm32.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 32)
!809 = !DISubroutineType(types: !810)
!810 = !{null, !103, !102}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !803, file: !766, line: 103, baseType: !102, size: 32, offset: 32)
!812 = !{!813}
!813 = !DISubrange(count: 16)
!814 = !DIGlobalVariableExpression(var: !815, expr: !DIExpression())
!815 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_32", scope: !694, file: !766, line: 424, type: !780, isLocal: true, isDefinition: true, align: 8)
!816 = !DIGlobalVariableExpression(var: !817, expr: !DIExpression())
!817 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_0_irq_0", scope: !818, file: !766, line: 493, type: !823, isLocal: true, isDefinition: true, align: 32)
!818 = distinct !DISubprogram(name: "__stm32_exti_connect_irqs", scope: !766, file: !766, line: 460, type: !819, scopeLine: 461, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !694, retainedNodes: !821)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !795}
!821 = !{!822}
!822 = !DILocalVariable(name: "dev", arg: 1, scope: !818, file: !766, line: 460, type: !795)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_list", file: !10, line: 53, size: 128, elements: !824)
!824 = !{!825, !826, !827, !828}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "irq", scope: !823, file: !10, line: 55, baseType: !357, size: 32)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !823, file: !10, line: 57, baseType: !357, size: 32, offset: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !823, file: !10, line: 59, baseType: !102, size: 32, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "param", scope: !823, file: !10, line: 61, baseType: !13, size: 32, offset: 96)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_1_irq_1", scope: !818, file: !766, line: 497, type: !823, isLocal: true, isDefinition: true, align: 32)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_2_irq_2", scope: !818, file: !766, line: 507, type: !823, isLocal: true, isDefinition: true, align: 32)
!833 = !DIGlobalVariableExpression(var: !834, expr: !DIExpression())
!834 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_3_irq_3", scope: !818, file: !766, line: 512, type: !823, isLocal: true, isDefinition: true, align: 32)
!835 = !DIGlobalVariableExpression(var: !836, expr: !DIExpression())
!836 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_4_irq_4", scope: !818, file: !766, line: 516, type: !823, isLocal: true, isDefinition: true, align: 32)
!837 = !DIGlobalVariableExpression(var: !838, expr: !DIExpression())
!838 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_9_5_irq_5", scope: !818, file: !766, line: 523, type: !823, isLocal: true, isDefinition: true, align: 32)
!839 = !DIGlobalVariableExpression(var: !840, expr: !DIExpression())
!840 = distinct !DIGlobalVariable(name: "__isr___stm32_exti_isr_15_10_irq_6", scope: !818, file: !766, line: 527, type: !823, isLocal: true, isDefinition: true, align: 32)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 512, elements: !812)
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "IRQn_Type", file: !127, line: 127, baseType: !697)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_32", scope: !846, file: !851, line: 21, type: !871, isLocal: false, isDefinition: true, align: 16)
!846 = distinct !DICompileUnit(language: DW_LANG_C99, file: !847, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !848, splitDebugInlining: false, nameTableKind: None)
!847 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo")
!848 = !{!849, !844, !855, !857, !859, !861, !863, !865, !867, !869}
!849 = !DIGlobalVariableExpression(var: !850, expr: !DIExpression())
!850 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !846, file: !851, line: 16, type: !852, isLocal: false, isDefinition: true, align: 16)
!851 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo")
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 176, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 11)
!855 = !DIGlobalVariableExpression(var: !856, expr: !DIExpression())
!856 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_17", scope: !846, file: !851, line: 28, type: !767, isLocal: false, isDefinition: true, align: 16)
!857 = !DIGlobalVariableExpression(var: !858, expr: !DIExpression())
!858 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_54", scope: !846, file: !851, line: 35, type: !767, isLocal: false, isDefinition: true, align: 16)
!859 = !DIGlobalVariableExpression(var: !860, expr: !DIExpression())
!860 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_53", scope: !846, file: !851, line: 42, type: !767, isLocal: false, isDefinition: true, align: 16)
!861 = !DIGlobalVariableExpression(var: !862, expr: !DIExpression())
!862 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_59", scope: !846, file: !851, line: 49, type: !767, isLocal: false, isDefinition: true, align: 16)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_15", scope: !846, file: !851, line: 56, type: !767, isLocal: false, isDefinition: true, align: 16)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_14", scope: !846, file: !851, line: 63, type: !767, isLocal: false, isDefinition: true, align: 16)
!867 = !DIGlobalVariableExpression(var: !868, expr: !DIExpression())
!868 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_42", scope: !846, file: !851, line: 70, type: !767, isLocal: false, isDefinition: true, align: 16)
!869 = !DIGlobalVariableExpression(var: !870, expr: !DIExpression())
!870 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_36", scope: !846, file: !851, line: 77, type: !767, isLocal: false, isDefinition: true, align: 16)
!871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 48, elements: !872)
!872 = !{!873}
!873 = !DISubrange(count: 3)
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "stm32_clock_control_api", scope: !876, file: !920, line: 398, type: !953, isLocal: true, isDefinition: true)
!876 = distinct !DICompileUnit(language: DW_LANG_C99, file: !877, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !878, retainedTypes: !891, globals: !917, splitDebugInlining: false, nameTableKind: None)
!877 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo")
!878 = !{!879, !30, !884}
!879 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !880, line: 190, baseType: !32, size: 32, elements: !881)
!880 = !DIFile(filename: "modules/hal/stm32/stm32cube/stm32l1xx/soc/stm32l1xx.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!881 = !{!882, !883}
!882 = !DIEnumerator(name: "SUCCESS", value: 0)
!883 = !DIEnumerator(name: "ERROR", value: 1)
!884 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "clock_control_status", file: !885, line: 44, baseType: !32, size: 32, elements: !886)
!885 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!886 = !{!887, !888, !889, !890}
!887 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_STARTING", value: 0)
!888 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_OFF", value: 1)
!889 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_ON", value: 2)
!890 = !DIEnumerator(name: "CLOCK_CONTROL_STATUS_UNKNOWN", value: 3)
!891 = !{!102, !103, !132, !892, !910, !916}
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "RCC_TypeDef", file: !127, line: 386, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !127, line: 370, size: 448, elements: !895)
!895 = !{!896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "CR", scope: !894, file: !127, line: 372, baseType: !131, size: 32)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ICSCR", scope: !894, file: !127, line: 373, baseType: !131, size: 32, offset: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "CFGR", scope: !894, file: !127, line: 374, baseType: !131, size: 32, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "CIR", scope: !894, file: !127, line: 375, baseType: !131, size: 32, offset: 96)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "AHBRSTR", scope: !894, file: !127, line: 376, baseType: !131, size: 32, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "APB2RSTR", scope: !894, file: !127, line: 377, baseType: !131, size: 32, offset: 160)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "APB1RSTR", scope: !894, file: !127, line: 378, baseType: !131, size: 32, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "AHBENR", scope: !894, file: !127, line: 379, baseType: !131, size: 32, offset: 224)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "APB2ENR", scope: !894, file: !127, line: 380, baseType: !131, size: 32, offset: 256)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "APB1ENR", scope: !894, file: !127, line: 381, baseType: !131, size: 32, offset: 288)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "AHBLPENR", scope: !894, file: !127, line: 382, baseType: !131, size: 32, offset: 320)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "APB2LPENR", scope: !894, file: !127, line: 383, baseType: !131, size: 32, offset: 352)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "APB1LPENR", scope: !894, file: !127, line: 384, baseType: !131, size: 32, offset: 384)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "CSR", scope: !894, file: !127, line: 385, baseType: !131, size: 32, offset: 416)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stm32_pclken", file: !912, line: 343, size: 64, elements: !913)
!912 = !DIFile(filename: "zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "bus", scope: !911, file: !912, line: 344, baseType: !132, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "enr", scope: !911, file: !912, line: 345, baseType: !132, size: 32, offset: 32)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!917 = !{!918, !924, !940, !951, !874}
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_9", scope: !876, file: !920, line: 752, type: !921, isLocal: false, isDefinition: true, align: 16)
!920 = !DIFile(filename: "zephyr/drivers/clock_control/clock_stm32_ll_common.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 512, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 32)
!924 = !DIGlobalVariableExpression(var: !925, expr: !DIExpression())
!925 = distinct !DIGlobalVariable(name: "__device_dts_ord_9", scope: !876, file: !920, line: 752, type: !926, isLocal: false, isDefinition: true, align: 32)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !927)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !165, line: 378, size: 192, elements: !928)
!928 = !{!929, !930, !931, !932, !938, !939}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !927, file: !165, line: 380, baseType: !168, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !927, file: !165, line: 382, baseType: !13, size: 32, offset: 32)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !927, file: !165, line: 384, baseType: !13, size: 32, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !927, file: !165, line: 386, baseType: !933, size: 32, offset: 96)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 32)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !165, line: 351, size: 16, elements: !935)
!935 = !{!936, !937}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !934, file: !165, line: 359, baseType: !176, size: 8)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !934, file: !165, line: 364, baseType: !179, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !927, file: !165, line: 388, baseType: !102, size: 32, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !927, file: !165, line: 396, baseType: !182, size: 32, offset: 160)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "__init___device_dts_ord_9", scope: !876, file: !920, line: 752, type: !942, isLocal: true, isDefinition: true, align: 32)
!942 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !156, line: 51, size: 64, elements: !944)
!944 = !{!945, !950}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !943, file: !156, line: 60, baseType: !946, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 32)
!947 = !DISubroutineType(types: !948)
!948 = !{!103, !949}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !943, file: !156, line: 65, baseType: !949, size: 32, offset: 32)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(name: "__devstate_dts_ord_9", scope: !876, file: !920, line: 752, type: !934, isLocal: true, isDefinition: true, align: 8)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "clock_control_driver_api", file: !885, line: 100, size: 224, elements: !954)
!954 = !{!955, !961, !962, !971, !976, !981, !987}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "on", scope: !953, file: !885, line: 101, baseType: !956, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control", file: !885, line: 76, baseType: !957)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 32)
!958 = !DISubroutineType(types: !959)
!959 = !{!103, !949, !960}
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_t", file: !885, line: 56, baseType: !102)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !953, file: !885, line: 102, baseType: !956, size: 32, offset: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "async_on", scope: !953, file: !885, line: 103, baseType: !963, size: 32, offset: 64)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_async_on_fn", file: !885, line: 83, baseType: !964)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 32)
!965 = !DISubroutineType(types: !966)
!966 = !{!103, !949, !960, !967, !102}
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_cb_t", file: !885, line: 72, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 32)
!969 = !DISubroutineType(types: !970)
!970 = !{null, !949, !960, !102}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "get_rate", scope: !953, file: !885, line: 104, baseType: !972, size: 32, offset: 96)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get", file: !885, line: 79, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 32)
!974 = !DISubroutineType(types: !975)
!975 = !{!103, !949, !960, !916}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "get_status", scope: !953, file: !885, line: 105, baseType: !977, size: 32, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_get_status_fn", file: !885, line: 88, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 32)
!979 = !DISubroutineType(types: !980)
!980 = !{!884, !949, !960}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "set_rate", scope: !953, file: !885, line: 106, baseType: !982, size: 32, offset: 160)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_set", file: !885, line: 92, baseType: !983)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 32)
!984 = !DISubroutineType(types: !985)
!985 = !{!103, !949, !960, !986}
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_subsys_rate_t", file: !885, line: 64, baseType: !102)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !953, file: !885, line: 107, baseType: !988, size: 32, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_control_configure_fn", file: !885, line: 96, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 32)
!990 = !DISubroutineType(types: !991)
!991 = !{!103, !949, !960, !102}
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "debug_hook_in", scope: !994, file: !998, line: 43, type: !1190, isLocal: true, isDefinition: true)
!994 = distinct !DICompileUnit(language: DW_LANG_C99, file: !995, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !996, retainedTypes: !1005, globals: !1085, splitDebugInlining: false, nameTableKind: None)
!995 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/96b_wistrio/subsys/console/echo")
!996 = !{!30, !997}
!997 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !998, line: 214, baseType: !32, size: 32, elements: !999)
!998 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!999 = !{!1000, !1001, !1002, !1003, !1004}
!1000 = !DIEnumerator(name: "ESC_ESC", value: 0)
!1001 = !DIEnumerator(name: "ESC_ANSI", value: 1)
!1002 = !DIEnumerator(name: "ESC_ANSI_FIRST", value: 2)
!1003 = !DIEnumerator(name: "ESC_ANSI_VAL", value: 3)
!1004 = !DIEnumerator(name: "ESC_ANSI_VAL_2", value: 4)
!1005 = !{!102, !103, !1006, !32, !24}
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 32)
!1007 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !225, line: 336, size: 608, elements: !1009)
!1009 = !{!1010, !1029, !1033, !1037, !1050, !1055, !1059, !1063, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !1008, file: !225, line: 365, baseType: !1011, size: 32)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 32)
!1012 = !DISubroutineType(types: !1013)
!1013 = !{!103, !1014, !246}
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 32)
!1015 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !165, line: 378, size: 192, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1027, !1028}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1016, file: !165, line: 380, baseType: !168, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1016, file: !165, line: 382, baseType: !13, size: 32, offset: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1016, file: !165, line: 384, baseType: !13, size: 32, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1016, file: !165, line: 386, baseType: !1022, size: 32, offset: 96)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 32)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !165, line: 351, size: 16, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !1023, file: !165, line: 359, baseType: !176, size: 8)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !1023, file: !165, line: 364, baseType: !179, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1016, file: !165, line: 388, baseType: !102, size: 32, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !1016, file: !165, line: 396, baseType: !182, size: 32, offset: 160)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !1008, file: !225, line: 366, baseType: !1030, size: 32, offset: 32)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 32)
!1031 = !DISubroutineType(types: !1032)
!1032 = !{null, !1014, !177}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !1008, file: !225, line: 374, baseType: !1034, size: 32, offset: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 32)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{!103, !1014}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !1008, file: !225, line: 377, baseType: !1038, size: 32, offset: 96)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 32)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{!103, !1014, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !225, line: 122, size: 64, elements: !1044)
!1044 = !{!1045, !1046, !1047, !1048, !1049}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !1043, file: !225, line: 123, baseType: !132, size: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !1043, file: !225, line: 124, baseType: !176, size: 8, offset: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !1043, file: !225, line: 125, baseType: !176, size: 8, offset: 40)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !1043, file: !225, line: 126, baseType: !176, size: 8, offset: 48)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !1043, file: !225, line: 127, baseType: !176, size: 8, offset: 56)
