; ModuleID = 'build/arduino_due/drivers/crypto/zephyr/zephyr.elf.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p:32:32-Fi8-i64:64-v128:64:128-a:0:32-n32-S64"
target triple = "thumbv7m-none-unknown-eabi"

%struct._isr_table_entry = type { i8*, void (i8*)* }
%struct.log_source_const_data = type { i8*, i8 }
%struct.mode_test = type { i8*, void (%struct.device*)* }
%struct.device = type { i8*, i8*, i8*, %struct.device_state*, i8*, i16* }
%struct.device_state = type { i8, i8 }
%struct.init_entry = type { i32 (%struct.device*)*, %struct.device* }
%struct.z_arm_mpu_partition = type { i32, i32, %struct.ctr_params }
%struct.ctr_params = type { i32 }
%struct.arm_mpu_region = type { i32, i8*, %struct.ctr_params }
%struct.arm_mpu_config = type { i32, %struct.arm_mpu_region* }
%struct.crypto_driver_api = type { i32 (%struct.device*)*, i32 (%struct.device*, %struct.cipher_ctx*, i32, i32, i32)*, i32 (%struct.device*, %struct.cipher_ctx*)*, i32 (%struct.device*, void (%struct.cipher_pkt*, i32)*)*, i32 (%struct.device*, %struct.hash_ctx*, i32)*, i32 (%struct.device*, %struct.hash_ctx*)*, i32 (%struct.device*, void (%struct.hash_pkt*, i32)*)* }
%struct.cipher_ctx = type { %struct.cipher_ops, %union.anon.4, %struct.device*, i8*, i8*, %union.anon.5, i16, i16 }
%struct.cipher_ops = type { i32, %union.anon.3 }
%union.anon.3 = type { i32 (%struct.cipher_ctx*, %struct.cipher_pkt*)* }
%struct.cipher_pkt = type { i8*, i32, i8*, i32, i32, %struct.cipher_ctx* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_irq_vector_table", scope: !2, file: !7, line: 10, type: !21, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !4, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto/zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto")
!4 = !{!0, !5}
!5 = !DIGlobalVariableExpression(var: !6, expr: !DIExpression())
!6 = distinct !DIGlobalVariable(name: "_sw_isr_table", scope: !2, file: !7, line: 57, type: !8, isLocal: false, isDefinition: true)
!7 = !DIFile(filename: "zephyr/isr_tables.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto")
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 2880, elements: !19)
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_isr_table_entry", file: !10, line: 36, size: 64, elements: !11)
!10 = !DIFile(filename: "zephyr/include/zephyr/sw_isr_table.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!11 = !{!12, !15}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !9, file: !10, line: 37, baseType: !13, size: 32)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 32)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "isr", scope: !9, file: !10, line: 38, baseType: !16, size: 32, offset: 32)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 32)
!17 = !DISubroutineType(types: !18)
!18 = !{null, !13}
!19 = !{!20}
!20 = !DISubrange(count: 45)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !22, size: 1440, elements: !19)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !23, line: 105, baseType: !24)
!23 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdint.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!24 = !DIBasicType(name: "unsigned long", size: 32, encoding: DW_ATE_unsigned)
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "log_const_main", scope: !27, file: !294, line: 18, type: !371, isLocal: false, isDefinition: true)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !29, retainedTypes: !123, globals: !290, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/samples/drivers/crypto/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto")
!29 = !{!30, !39, !42, !46, !116}
!30 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_mode", file: !31, line: 44, baseType: !32, size: 32, elements: !33)
!31 = !DIFile(filename: "zephyr/include/zephyr/crypto/cipher.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!32 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!33 = !{!34, !35, !36, !37, !38}
!34 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_ECB", value: 1)
!35 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CBC", value: 2)
!36 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CTR", value: 3)
!37 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_CCM", value: 4)
!38 = !DIEnumerator(name: "CRYPTO_CIPHER_MODE_GCM", value: 5)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_algo", file: !31, line: 29, baseType: !32, size: 32, elements: !40)
!40 = !{!41}
!41 = !DIEnumerator(name: "CRYPTO_CIPHER_ALGO_AES", value: 1)
!42 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cipher_op", file: !31, line: 34, baseType: !32, size: 32, elements: !43)
!43 = !{!44, !45}
!44 = !DIEnumerator(name: "CRYPTO_CIPHER_OP_DECRYPT", value: 0)
!45 = !DIEnumerator(name: "CRYPTO_CIPHER_OP_ENCRYPT", value: 1)
!46 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "k_objects", file: !47, line: 27, baseType: !32, size: 32, elements: !48)
!47 = !DIFile(filename: "zephyr/include/zephyr/sys/kobject.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115}
!49 = !DIEnumerator(name: "K_OBJ_ANY", value: 0)
!50 = !DIEnumerator(name: "K_OBJ_MEM_SLAB", value: 1)
!51 = !DIEnumerator(name: "K_OBJ_MSGQ", value: 2)
!52 = !DIEnumerator(name: "K_OBJ_MUTEX", value: 3)
!53 = !DIEnumerator(name: "K_OBJ_PIPE", value: 4)
!54 = !DIEnumerator(name: "K_OBJ_QUEUE", value: 5)
!55 = !DIEnumerator(name: "K_OBJ_POLL_SIGNAL", value: 6)
!56 = !DIEnumerator(name: "K_OBJ_SEM", value: 7)
!57 = !DIEnumerator(name: "K_OBJ_STACK", value: 8)
!58 = !DIEnumerator(name: "K_OBJ_THREAD", value: 9)
!59 = !DIEnumerator(name: "K_OBJ_TIMER", value: 10)
!60 = !DIEnumerator(name: "K_OBJ_THREAD_STACK_ELEMENT", value: 11)
!61 = !DIEnumerator(name: "K_OBJ_NET_SOCKET", value: 12)
!62 = !DIEnumerator(name: "K_OBJ_NET_IF", value: 13)
!63 = !DIEnumerator(name: "K_OBJ_SYS_MUTEX", value: 14)
!64 = !DIEnumerator(name: "K_OBJ_FUTEX", value: 15)
!65 = !DIEnumerator(name: "K_OBJ_CONDVAR", value: 16)
!66 = !DIEnumerator(name: "K_OBJ_DRIVER_CRYPTO", value: 17)
!67 = !DIEnumerator(name: "K_OBJ_DRIVER_ADC", value: 18)
!68 = !DIEnumerator(name: "K_OBJ_DRIVER_BBRAM", value: 19)
!69 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN", value: 20)
!70 = !DIEnumerator(name: "K_OBJ_DRIVER_COREDUMP", value: 21)
!71 = !DIEnumerator(name: "K_OBJ_DRIVER_COUNTER", value: 22)
!72 = !DIEnumerator(name: "K_OBJ_DRIVER_DAC", value: 23)
!73 = !DIEnumerator(name: "K_OBJ_DRIVER_DAI", value: 24)
!74 = !DIEnumerator(name: "K_OBJ_DRIVER_DMA", value: 25)
!75 = !DIEnumerator(name: "K_OBJ_DRIVER_EDAC", value: 26)
!76 = !DIEnumerator(name: "K_OBJ_DRIVER_EEPROM", value: 27)
!77 = !DIEnumerator(name: "K_OBJ_DRIVER_ENTROPY", value: 28)
!78 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI", value: 29)
!79 = !DIEnumerator(name: "K_OBJ_DRIVER_ESPI_SAF", value: 30)
!80 = !DIEnumerator(name: "K_OBJ_DRIVER_FLASH", value: 31)
!81 = !DIEnumerator(name: "K_OBJ_DRIVER_FPGA", value: 32)
!82 = !DIEnumerator(name: "K_OBJ_DRIVER_BATTERY", value: 33)
!83 = !DIEnumerator(name: "K_OBJ_DRIVER_GPIO", value: 34)
!84 = !DIEnumerator(name: "K_OBJ_DRIVER_I2C", value: 35)
!85 = !DIEnumerator(name: "K_OBJ_DRIVER_I2S", value: 36)
!86 = !DIEnumerator(name: "K_OBJ_DRIVER_I3C", value: 37)
!87 = !DIEnumerator(name: "K_OBJ_DRIVER_IPM", value: 38)
!88 = !DIEnumerator(name: "K_OBJ_DRIVER_KSCAN", value: 39)
!89 = !DIEnumerator(name: "K_OBJ_DRIVER_LED", value: 40)
!90 = !DIEnumerator(name: "K_OBJ_DRIVER_MBOX", value: 41)
!91 = !DIEnumerator(name: "K_OBJ_DRIVER_MDIO", value: 42)
!92 = !DIEnumerator(name: "K_OBJ_DRIVER_MIPI_DSI", value: 43)
!93 = !DIEnumerator(name: "K_OBJ_DRIVER_PECI", value: 44)
!94 = !DIEnumerator(name: "K_OBJ_DRIVER_PINMUX", value: 45)
!95 = !DIEnumerator(name: "K_OBJ_DRIVER_PS2", value: 46)
!96 = !DIEnumerator(name: "K_OBJ_DRIVER_PTP_CLOCK", value: 47)
!97 = !DIEnumerator(name: "K_OBJ_DRIVER_PWM", value: 48)
!98 = !DIEnumerator(name: "K_OBJ_DRIVER_REGULATOR", value: 49)
!99 = !DIEnumerator(name: "K_OBJ_DRIVER_RESET", value: 50)
!100 = !DIEnumerator(name: "K_OBJ_DRIVER_SDHC", value: 51)
!101 = !DIEnumerator(name: "K_OBJ_DRIVER_SENSOR", value: 52)
!102 = !DIEnumerator(name: "K_OBJ_DRIVER_SPI", value: 53)
!103 = !DIEnumerator(name: "K_OBJ_DRIVER_SYSCON", value: 54)
!104 = !DIEnumerator(name: "K_OBJ_DRIVER_UART", value: 55)
!105 = !DIEnumerator(name: "K_OBJ_DRIVER_W1", value: 56)
!106 = !DIEnumerator(name: "K_OBJ_DRIVER_WDT", value: 57)
!107 = !DIEnumerator(name: "K_OBJ_DRIVER_CAN_TRANSCEIVER", value: 58)
!108 = !DIEnumerator(name: "K_OBJ_DRIVER_UART_MUX", value: 59)
!109 = !DIEnumerator(name: "K_OBJ_DRIVER_EC_HOST_CMD_PERIPH_API", value: 60)
!110 = !DIEnumerator(name: "K_OBJ_DRIVER_ITS", value: 61)
!111 = !DIEnumerator(name: "K_OBJ_DRIVER_PCIE_CTRL", value: 62)
!112 = !DIEnumerator(name: "K_OBJ_DRIVER_TCPC", value: 63)
!113 = !DIEnumerator(name: "K_OBJ_DRIVER_IVSHMEM", value: 64)
!114 = !DIEnumerator(name: "K_OBJ_DRIVER_ETHPHY", value: 65)
!115 = !DIEnumerator(name: "K_OBJ_LAST", value: 66)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hash_algo", file: !117, line: 26, baseType: !32, size: 32, elements: !118)
!117 = !DIFile(filename: "zephyr/include/zephyr/crypto/hash.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!118 = !{!119, !120, !121, !122}
!119 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA224", value: 1)
!120 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA256", value: 2)
!121 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA384", value: 3)
!122 = !DIEnumerator(name: "CRYPTO_HASH_ALGO_SHA512", value: 4)
!123 = !{!124, !125, !126}
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!125 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 32)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_driver_api", file: !128, line: 65, size: 224, elements: !129)
!128 = !DIFile(filename: "zephyr/include/zephyr/crypto/crypto.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!129 = !{!130, !161, !241, !245, !253, !278, !282}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "query_hw_caps", scope: !127, file: !128, line: 66, baseType: !131, size: 32)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 32)
!132 = !DISubroutineType(types: !133)
!133 = !{!125, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !136)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !138)
!137 = !DIFile(filename: "zephyr/include/zephyr/device.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!138 = !{!139, !143, !144, !145, !154, !155}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !136, file: !137, line: 380, baseType: !140, size: 32)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 32)
!141 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !142)
!142 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_unsigned_char)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !136, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !136, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !136, file: !137, line: 386, baseType: !146, size: 32, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 32)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !137, line: 351, size: 16, elements: !148)
!148 = !{!149, !152}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !147, file: !137, line: 359, baseType: !150, size: 8)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !23, line: 88, baseType: !151)
!151 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !147, file: !137, line: 364, baseType: !153, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!153 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !136, file: !137, line: 388, baseType: !124, size: 32, offset: 128)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !136, file: !137, line: 396, baseType: !156, size: 32, offset: 160)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 32)
!157 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "device_handle_t", file: !137, line: 43, baseType: !159)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !23, line: 73, baseType: !160)
!160 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_begin_session", scope: !127, file: !128, line: 69, baseType: !162, size: 32, offset: 32)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 32)
!163 = !DISubroutineType(types: !164)
!164 = !{!125, !134, !165, !39, !30, !42}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 32)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ctx", file: !31, line: 110, size: 256, elements: !167)
!167 = !{!168, !212, !217, !218, !219, !220, !239, !240}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !166, file: !31, line: 116, baseType: !169, size: 64)
!169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ops", file: !31, line: 74, size: 64, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_mode", scope: !169, file: !31, line: 76, baseType: !30, size: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, scope: !169, file: !31, line: 78, baseType: !173, size: 32, offset: 32)
!173 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !169, file: !31, line: 78, size: 32, elements: !174)
!174 = !{!175, !190, !195, !197, !210}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "block_crypt_hndlr", scope: !173, file: !31, line: 79, baseType: !176, size: 32)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_op_t", file: !31, line: 57, baseType: !177)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 32)
!178 = !DISubroutineType(types: !179)
!179 = !{!125, !165, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 32)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_pkt", file: !31, line: 180, size: 192, elements: !182)
!182 = !{!183, !185, !186, !187, !188, !189}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !181, file: !31, line: 183, baseType: !184, size: 32)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !181, file: !31, line: 186, baseType: !125, size: 32, offset: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !181, file: !31, line: 192, baseType: !184, size: 32, offset: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf_max", scope: !181, file: !31, line: 197, baseType: !125, size: 32, offset: 96)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "out_len", scope: !181, file: !31, line: 202, baseType: !125, size: 32, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !181, file: !31, line: 208, baseType: !165, size: 32, offset: 160)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "cbc_crypt_hndlr", scope: !173, file: !31, line: 80, baseType: !191, size: 32)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "cbc_op_t", file: !31, line: 62, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !193, size: 32)
!193 = !DISubroutineType(types: !194)
!194 = !{!125, !165, !180, !184}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_crypt_hndlr", scope: !173, file: !31, line: 81, baseType: !196, size: 32)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "ctr_op_t", file: !31, line: 65, baseType: !192)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_crypt_hndlr", scope: !173, file: !31, line: 82, baseType: !198, size: 32)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "ccm_op_t", file: !31, line: 68, baseType: !199)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 32)
!200 = !DISubroutineType(types: !201)
!201 = !{!125, !165, !202, !184}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 32)
!203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_aead_pkt", file: !31, line: 217, size: 128, elements: !204)
!204 = !{!205, !206, !207, !209}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "pkt", scope: !203, file: !31, line: 219, baseType: !180, size: 32)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !203, file: !31, line: 224, baseType: !184, size: 32, offset: 32)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ad_len", scope: !203, file: !31, line: 227, baseType: !208, size: 32, offset: 64)
!208 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !23, line: 90, baseType: !32)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !203, file: !31, line: 233, baseType: !184, size: 32, offset: 96)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_crypt_hndlr", scope: !173, file: !31, line: 83, baseType: !211, size: 32)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcm_op_t", file: !31, line: 71, baseType: !199)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !166, file: !31, line: 126, baseType: !213, size: 32, offset: 64)
!213 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !31, line: 119, size: 32, elements: !214)
!214 = !{!215, !216}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "bit_stream", scope: !213, file: !31, line: 121, baseType: !184, size: 32)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !213, file: !31, line: 125, baseType: !124, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !166, file: !31, line: 131, baseType: !134, size: 32, offset: 96)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !166, file: !31, line: 140, baseType: !124, size: 32, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "app_sessn_state", scope: !166, file: !31, line: 146, baseType: !124, size: 32, offset: 160)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mode_params", scope: !166, file: !31, line: 156, baseType: !221, size: 32, offset: 192)
!221 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !166, file: !31, line: 152, size: 32, elements: !222)
!222 = !{!223, !230, !234}
!223 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_info", scope: !221, file: !31, line: 153, baseType: !224, size: 32)
!224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ccm_params", file: !31, line: 87, size: 32, elements: !225)
!225 = !{!226, !229}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !224, file: !31, line: 88, baseType: !227, size: 16)
!227 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !23, line: 89, baseType: !228)
!228 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !224, file: !31, line: 89, baseType: !227, size: 16, offset: 16)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_info", scope: !221, file: !31, line: 154, baseType: !231, size: 32)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctr_params", file: !31, line: 92, size: 32, elements: !232)
!232 = !{!233}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_len", scope: !231, file: !31, line: 96, baseType: !208, size: 32)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_info", scope: !221, file: !31, line: 155, baseType: !235, size: 32)
!235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gcm_params", file: !31, line: 99, size: 32, elements: !236)
!236 = !{!237, !238}
!237 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !235, file: !31, line: 100, baseType: !227, size: 16)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !235, file: !31, line: 101, baseType: !227, size: 16, offset: 16)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !166, file: !31, line: 161, baseType: !227, size: 16, offset: 224)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !166, file: !31, line: 169, baseType: !227, size: 16, offset: 240)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_free_session", scope: !127, file: !128, line: 74, baseType: !242, size: 32, offset: 64)
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 32)
!243 = !DISubroutineType(types: !244)
!244 = !{!125, !134, !165}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_async_callback_set", scope: !127, file: !128, line: 77, baseType: !246, size: 32, offset: 96)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 32)
!247 = !DISubroutineType(types: !248)
!248 = !{!125, !134, !249}
!249 = !DIDerivedType(tag: DW_TAG_typedef, name: "cipher_completion_cb", file: !31, line: 242, baseType: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 32)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !180, !125}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "hash_begin_session", scope: !127, file: !128, line: 81, baseType: !254, size: 32, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 32)
!255 = !DISubroutineType(types: !256)
!256 = !{!125, !134, !257, !116}
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 32)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_ctx", file: !117, line: 47, size: 128, elements: !259)
!259 = !{!260, !261, !262, !276, !277}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !258, file: !117, line: 51, baseType: !134, size: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !258, file: !117, line: 60, baseType: !124, size: 32, offset: 32)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "hash_hndlr", scope: !258, file: !117, line: 65, baseType: !263, size: 32, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_op_t", file: !117, line: 38, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 32)
!265 = !DISubroutineType(types: !266)
!266 = !{!125, !257, !267, !153}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 32)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_pkt", file: !117, line: 88, size: 128, elements: !269)
!269 = !{!270, !271, !274, !275}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !268, file: !117, line: 91, baseType: !184, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !268, file: !117, line: 94, baseType: !272, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !273, line: 214, baseType: !32)
!273 = !DIFile(filename: "zephyr-sdk-0.15.2/arm-zephyr-eabi/bin/../lib/gcc/arm-zephyr-eabi/12.1.0/include/stddef.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!274 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !268, file: !117, line: 101, baseType: !184, size: 32, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !268, file: !117, line: 107, baseType: !257, size: 32, offset: 96)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "started", scope: !258, file: !117, line: 70, baseType: !153, size: 8, offset: 96)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !258, file: !117, line: 78, baseType: !227, size: 16, offset: 112)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "hash_free_session", scope: !127, file: !128, line: 84, baseType: !279, size: 32, offset: 160)
!279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 32)
!280 = !DISubroutineType(types: !281)
!281 = !{!125, !134, !257}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "hash_async_callback_set", scope: !127, file: !128, line: 86, baseType: !283, size: 32, offset: 192)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 32)
!284 = !DISubroutineType(types: !285)
!285 = !{!125, !134, !286}
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_completion_cb", file: !117, line: 114, baseType: !287)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 32)
!288 = !DISubroutineType(types: !289)
!289 = !{null, !267, !125}
!290 = !{!25, !291, !314, !316, !318, !320, !324, !327, !329, !334, !339, !344, !349, !351, !356, !361, !366}
!291 = !DIGlobalVariableExpression(var: !292, expr: !DIExpression())
!292 = distinct !DIGlobalVariable(name: "iv", scope: !293, file: !294, line: 227, type: !311, isLocal: true, isDefinition: true)
!293 = distinct !DISubprogram(name: "cbc_mode", scope: !294, file: !294, line: 205, type: !295, scopeLine: 206, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !27, retainedNodes: !297)
!294 = !DIFile(filename: "zephyr/samples/drivers/crypto/src/main.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!295 = !DISubroutineType(types: !296)
!296 = !{null, !134}
!297 = !{!298, !299, !303, !307, !308, !309, !310}
!298 = !DILocalVariable(name: "dev", arg: 1, scope: !293, file: !294, line: 205, type: !134)
!299 = !DILocalVariable(name: "encrypted", scope: !293, file: !294, line: 207, type: !300)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 640, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 80)
!303 = !DILocalVariable(name: "decrypted", scope: !293, file: !294, line: 208, type: !304)
!304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 512, elements: !305)
!305 = !{!306}
!306 = !DISubrange(count: 64)
!307 = !DILocalVariable(name: "ini", scope: !293, file: !294, line: 209, type: !166)
!308 = !DILocalVariable(name: "encrypt", scope: !293, file: !294, line: 214, type: !181)
!309 = !DILocalVariable(name: "decrypt", scope: !293, file: !294, line: 220, type: !181)
!310 = !DILabel(scope: !293, name: "out", file: !294, line: 279)
!311 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 128, elements: !312)
!312 = !{!313}
!313 = !DISubrange(count: 16)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "cap_flags", scope: !27, file: !294, line: 48, type: !208, isLocal: false, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "key", scope: !27, file: !294, line: 34, type: !311, isLocal: true, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "plaintext", scope: !27, file: !294, line: 39, type: !304, isLocal: true, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "cbc_ciphertext", scope: !27, file: !294, line: 195, type: !322, isLocal: true, isDefinition: true)
!322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 640, elements: !301)
!323 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "ctr_ciphertext", scope: !27, file: !294, line: 283, type: !326, isLocal: true, isDefinition: true)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 512, elements: !305)
!327 = !DIGlobalVariableExpression(var: !328, expr: !DIExpression())
!328 = distinct !DIGlobalVariable(name: "ccm_key", scope: !27, file: !294, line: 373, type: !311, isLocal: true, isDefinition: true)
!329 = !DIGlobalVariableExpression(var: !330, expr: !DIExpression())
!330 = distinct !DIGlobalVariable(name: "ccm_data", scope: !27, file: !294, line: 384, type: !331, isLocal: true, isDefinition: true)
!331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 184, elements: !332)
!332 = !{!333}
!333 = !DISubrange(count: 23)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "ccm_hdr", scope: !27, file: !294, line: 381, type: !336, isLocal: true, isDefinition: true)
!336 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 64, elements: !337)
!337 = !{!338}
!338 = !DISubrange(count: 8)
!339 = !DIGlobalVariableExpression(var: !340, expr: !DIExpression())
!340 = distinct !DIGlobalVariable(name: "ccm_nonce", scope: !27, file: !294, line: 377, type: !341, isLocal: true, isDefinition: true)
!341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 104, elements: !342)
!342 = !{!343}
!343 = !DISubrange(count: 13)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "ccm_expected", scope: !27, file: !294, line: 388, type: !346, isLocal: true, isDefinition: true)
!346 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 248, elements: !347)
!347 = !{!348}
!348 = !DISubrange(count: 31)
!349 = !DIGlobalVariableExpression(var: !350, expr: !DIExpression())
!350 = distinct !DIGlobalVariable(name: "gcm_key", scope: !27, file: !294, line: 485, type: !311, isLocal: true, isDefinition: true)
!351 = !DIGlobalVariableExpression(var: !352, expr: !DIExpression())
!352 = distinct !DIGlobalVariable(name: "gcm_data", scope: !27, file: !294, line: 496, type: !353, isLocal: true, isDefinition: true)
!353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 336, elements: !354)
!354 = !{!355}
!355 = !DISubrange(count: 42)
!356 = !DIGlobalVariableExpression(var: !357, expr: !DIExpression())
!357 = distinct !DIGlobalVariable(name: "gcm_hdr", scope: !27, file: !294, line: 492, type: !358, isLocal: true, isDefinition: true)
!358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 160, elements: !359)
!359 = !{!360}
!360 = !DISubrange(count: 20)
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "gcm_nonce", scope: !27, file: !294, line: 489, type: !363, isLocal: true, isDefinition: true)
!363 = !DICompositeType(tag: DW_TAG_array_type, baseType: !150, size: 96, elements: !364)
!364 = !{!365}
!365 = !DISubrange(count: 12)
!366 = !DIGlobalVariableExpression(var: !367, expr: !DIExpression())
!367 = distinct !DIGlobalVariable(name: "gcm_expected", scope: !27, file: !294, line: 502, type: !368, isLocal: true, isDefinition: true)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 464, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 58)
!371 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !372)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !374)
!373 = !DIFile(filename: "zephyr/include/zephyr/logging/log_instance.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!374 = !{!375, !376}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !372, file: !373, line: 17, baseType: !140, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !372, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!377 = !DIGlobalVariableExpression(var: !378, expr: !DIExpression())
!378 = distinct !DIGlobalVariable(name: "log_const_cbprintf_package", scope: !379, file: !395, line: 18, type: !396, isLocal: false, isDefinition: true)
!379 = distinct !DICompileUnit(language: DW_LANG_C99, file: !380, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !381, globals: !394, splitDebugInlining: false, nameTableKind: None)
!380 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto")
!381 = !{!22, !124, !24, !382, !384, !386, !272, !125, !387, !388, !390, !392, !393, !184, !227, !140}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 32)
!383 = !DIBasicType(name: "long double", size: 64, encoding: DW_ATE_float)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 32)
!385 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 32)
!389 = !DIBasicType(name: "long", size: 32, encoding: DW_ATE_signed)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 32)
!391 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 32)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 32)
!394 = !{!377}
!395 = !DIFile(filename: "zephyr/lib/os/cbprintf_packaged.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!396 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !398)
!398 = !{!399, !400}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !397, file: !373, line: 17, baseType: !140, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !397, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!401 = !DIGlobalVariableExpression(var: !402, expr: !DIExpression())
!402 = distinct !DIGlobalVariable(name: "_char_out", scope: !403, file: !408, line: 54, type: !409, isLocal: false, isDefinition: true)
!403 = distinct !DICompileUnit(language: DW_LANG_C99, file: !404, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !406, globals: !407, splitDebugInlining: false, nameTableKind: None)
!404 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto")
!405 = !{!46}
!406 = !{!124, !125}
!407 = !{!401}
!408 = !DIFile(filename: "zephyr/lib/os/printk.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 32)
!410 = !DISubroutineType(types: !411)
!411 = !{!125, !125}
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "__init_atmel_sam3x_init", scope: !414, file: !479, line: 235, type: !480, isLocal: true, isDefinition: true, align: 32)
!414 = distinct !DICompileUnit(language: DW_LANG_C99, file: !415, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !416, globals: !478, splitDebugInlining: false, nameTableKind: None)
!415 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto")
!416 = !{!124, !125, !417, !428}
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "Efc", file: !419, line: 46, baseType: !420)
!419 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/efc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !419, line: 41, size: 128, elements: !421)
!421 = !{!422, !424, !425, !427}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FMR", scope: !420, file: !419, line: 42, baseType: !423, size: 32)
!423 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !208)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FCR", scope: !420, file: !419, line: 43, baseType: !423, size: 32, offset: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FSR", scope: !420, file: !419, line: 44, baseType: !426, size: 32, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "EEFC_FRR", scope: !420, file: !419, line: 45, baseType: !426, size: 32, offset: 96)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 32)
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "Pmc", file: !430, line: 75, baseType: !431)
!430 = !DIFile(filename: "modules/hal/atmel/asf/sam/include/sam3x/component/pmc.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!431 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !430, line: 41, size: 2176, elements: !432)
!432 = !{!433, !434, !435, !436, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !456, !460, !461, !462, !463, !464, !465, !466, !467, !471, !472, !473, !474, !475, !476, !477}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCER", scope: !431, file: !430, line: 42, baseType: !423, size: 32)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCDR", scope: !431, file: !430, line: 43, baseType: !423, size: 32, offset: 32)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SCSR", scope: !431, file: !430, line: 44, baseType: !426, size: 32, offset: 64)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved1", scope: !431, file: !430, line: 45, baseType: !437, size: 32, offset: 96)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 32, elements: !438)
!438 = !{!439}
!439 = !DISubrange(count: 1)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER0", scope: !431, file: !430, line: 46, baseType: !423, size: 32, offset: 128)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR0", scope: !431, file: !430, line: 47, baseType: !423, size: 32, offset: 160)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR0", scope: !431, file: !430, line: 48, baseType: !426, size: 32, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_UCKR", scope: !431, file: !430, line: 49, baseType: !423, size: 32, offset: 224)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MOR", scope: !431, file: !430, line: 50, baseType: !423, size: 32, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_MCFR", scope: !431, file: !430, line: 51, baseType: !426, size: 32, offset: 288)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "CKGR_PLLAR", scope: !431, file: !430, line: 52, baseType: !423, size: 32, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved2", scope: !431, file: !430, line: 53, baseType: !437, size: 32, offset: 352)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_MCKR", scope: !431, file: !430, line: 54, baseType: !423, size: 32, offset: 384)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved3", scope: !431, file: !430, line: 55, baseType: !437, size: 32, offset: 416)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_USB", scope: !431, file: !430, line: 56, baseType: !423, size: 32, offset: 448)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved4", scope: !431, file: !430, line: 57, baseType: !437, size: 32, offset: 480)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCK", scope: !431, file: !430, line: 58, baseType: !453, size: 96, offset: 512)
!453 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 96, elements: !454)
!454 = !{!455}
!455 = !DISubrange(count: 3)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved5", scope: !431, file: !430, line: 59, baseType: !457, size: 160, offset: 608)
!457 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 160, elements: !458)
!458 = !{!459}
!459 = !DISubrange(count: 5)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IER", scope: !431, file: !430, line: 60, baseType: !423, size: 32, offset: 768)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IDR", scope: !431, file: !430, line: 61, baseType: !423, size: 32, offset: 800)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_SR", scope: !431, file: !430, line: 62, baseType: !426, size: 32, offset: 832)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_IMR", scope: !431, file: !430, line: 63, baseType: !426, size: 32, offset: 864)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSMR", scope: !431, file: !430, line: 64, baseType: !423, size: 32, offset: 896)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FSPR", scope: !431, file: !430, line: 65, baseType: !423, size: 32, offset: 928)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_FOCR", scope: !431, file: !430, line: 66, baseType: !423, size: 32, offset: 960)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved6", scope: !431, file: !430, line: 67, baseType: !468, size: 832, offset: 992)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !426, size: 832, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 26)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPMR", scope: !431, file: !430, line: 68, baseType: !423, size: 32, offset: 1824)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_WPSR", scope: !431, file: !430, line: 69, baseType: !426, size: 32, offset: 1856)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "Reserved7", scope: !431, file: !430, line: 70, baseType: !457, size: 160, offset: 1888)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCER1", scope: !431, file: !430, line: 71, baseType: !423, size: 32, offset: 2048)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCDR1", scope: !431, file: !430, line: 72, baseType: !423, size: 32, offset: 2080)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCSR1", scope: !431, file: !430, line: 73, baseType: !426, size: 32, offset: 2112)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "PMC_PCR", scope: !431, file: !430, line: 74, baseType: !423, size: 32, offset: 2144)
!478 = !{!412}
!479 = !DIFile(filename: "zephyr/soc/arm/atmel_sam/sam3x/soc.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !481)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !482, line: 51, size: 64, elements: !483)
!482 = !DIFile(filename: "zephyr/include/zephyr/init.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!483 = !{!484, !503}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !481, file: !482, line: 60, baseType: !485, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 32)
!486 = !DISubroutineType(types: !487)
!487 = !{!125, !488}
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !490)
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !491)
!491 = !{!492, !493, !494, !495, !501, !502}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !490, file: !137, line: 380, baseType: !140, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !490, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !490, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !490, file: !137, line: 386, baseType: !496, size: 32, offset: 96)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 32)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !137, line: 351, size: 16, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !497, file: !137, line: 359, baseType: !150, size: 8)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !497, file: !137, line: 364, baseType: !153, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !490, file: !137, line: 388, baseType: !124, size: 32, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !490, file: !137, line: 396, baseType: !156, size: 32, offset: 160)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !481, file: !482, line: 65, baseType: !488, size: 32, offset: 32)
!504 = !DIGlobalVariableExpression(var: !505, expr: !DIExpression())
!505 = distinct !DIGlobalVariable(name: "inv_sbox", scope: !506, file: !520, line: 37, type: !521, isLocal: true, isDefinition: true)
!506 = distinct !DICompileUnit(language: DW_LANG_C99, file: !507, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !508, globals: !519, splitDebugInlining: false, nameTableKind: None)
!507 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/modules/crypto/tinycrypt/lib/source/aes_decrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto")
!508 = !{!184, !509, !510, !150}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 32)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCAesKeySched_t", file: !511, line: 66, baseType: !512)
!511 = !DIFile(filename: "modules/crypto/tinycrypt/lib/include/tinycrypt/aes.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 32)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tc_aes_key_sched_struct", file: !511, line: 64, size: 1408, elements: !514)
!514 = !{!515}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !513, file: !511, line: 65, baseType: !516, size: 1408)
!516 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 1408, elements: !517)
!517 = !{!518}
!518 = !DISubrange(count: 44)
!519 = !{!504}
!520 = !DIFile(filename: "modules/crypto/tinycrypt/lib/source/aes_decrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 2048, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 256)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "sbox", scope: !526, file: !535, line: 37, type: !521, isLocal: true, isDefinition: true)
!526 = distinct !DICompileUnit(language: DW_LANG_C99, file: !527, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !528, globals: !534, splitDebugInlining: false, nameTableKind: None)
!527 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/modules/crypto/tinycrypt/lib/source/aes_encrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto")
!528 = !{!529, !509, !184, !150}
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "TCAesKeySched_t", file: !511, line: 66, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 32)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tc_aes_key_sched_struct", file: !511, line: 64, size: 1408, elements: !532)
!532 = !{!533}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !531, file: !511, line: 65, baseType: !516, size: 1408)
!534 = !{!524}
!535 = !DIFile(filename: "modules/crypto/tinycrypt/lib/source/aes_encrypt.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!536 = !DIGlobalVariableExpression(var: !537, expr: !DIExpression())
!537 = distinct !DIGlobalVariable(name: "log_const_mpu", scope: !538, file: !545, line: 17, type: !685, isLocal: false, isDefinition: true)
!538 = distinct !DICompileUnit(language: DW_LANG_C99, file: !539, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !540, globals: !541, splitDebugInlining: false, nameTableKind: None)
!539 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto")
!540 = !{!272, !125, !208, !124}
!541 = !{!536, !542, !681}
!542 = !DIGlobalVariableExpression(var: !543, expr: !DIExpression())
!543 = distinct !DIGlobalVariable(name: "dynamic_regions", scope: !544, file: !545, line: 198, type: !669, isLocal: true, isDefinition: true)
!544 = distinct !DISubprogram(name: "z_arm_configure_dynamic_mpu_regions", scope: !545, file: !545, line: 175, type: !546, scopeLine: 176, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !538, retainedNodes: !664)
!545 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_core_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!546 = !DISubroutineType(types: !547)
!547 = !{null, !548}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 32)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_thread", file: !550, line: 245, size: 1024, elements: !551)
!550 = !DIFile(filename: "zephyr/include/zephyr/kernel/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!551 = !{!552, !618, !631, !632, !633, !634, !640, !659}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !549, file: !550, line: 247, baseType: !553, size: 384)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_base", file: !550, line: 57, size: 384, elements: !554)
!554 = !{!555, !583, !591, !592, !593, !604, !605, !606}
!555 = !DIDerivedType(tag: DW_TAG_member, scope: !553, file: !550, line: 60, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !553, file: !550, line: 60, size: 64, elements: !557)
!557 = !{!558, !574}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_dlist", scope: !556, file: !550, line: 61, baseType: !559, size: 64)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dnode_t", file: !560, line: 49, baseType: !561)
!560 = !DIFile(filename: "zephyr/include/zephyr/sys/dlist.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_dnode", file: !560, line: 37, size: 64, elements: !562)
!562 = !{!563, !569}
!563 = !DIDerivedType(tag: DW_TAG_member, scope: !561, file: !560, line: 38, baseType: !564, size: 32)
!564 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !561, file: !560, line: 38, size: 32, elements: !565)
!565 = !{!566, !568}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !564, file: !560, line: 39, baseType: !567, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 32)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !564, file: !560, line: 40, baseType: !567, size: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, scope: !561, file: !560, line: 42, baseType: !570, size: 32, offset: 32)
!570 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !561, file: !560, line: 42, size: 32, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !570, file: !560, line: 43, baseType: !567, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !570, file: !560, line: 44, baseType: !567, size: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "qnode_rb", scope: !556, file: !550, line: 62, baseType: !575, size: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode", file: !576, line: 49, size: 64, elements: !577)
!576 = !DIFile(filename: "zephyr/include/zephyr/sys/rb.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!577 = !{!578}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !575, file: !576, line: 50, baseType: !579, size: 64)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 64, elements: !581)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 32)
!581 = !{!582}
!582 = !DISubrange(count: 2)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "pended_on", scope: !553, file: !550, line: 68, baseType: !584, size: 32, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 32)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "_wait_q_t", file: !586, line: 233, baseType: !587)
!586 = !DIFile(filename: "zephyr/include/zephyr/kernel_structs.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !586, line: 231, size: 64, elements: !588)
!588 = !{!589}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !587, file: !586, line: 232, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "sys_dlist_t", file: !560, line: 48, baseType: !561)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "user_options", scope: !553, file: !550, line: 71, baseType: !150, size: 8, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "thread_state", scope: !553, file: !550, line: 74, baseType: !150, size: 8, offset: 104)
!593 = !DIDerivedType(tag: DW_TAG_member, scope: !553, file: !550, line: 90, baseType: !594, size: 16, offset: 112)
!594 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !553, file: !550, line: 90, size: 16, elements: !595)
!595 = !{!596, !603}
!596 = !DIDerivedType(tag: DW_TAG_member, scope: !594, file: !550, line: 91, baseType: !597, size: 16)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !594, file: !550, line: 91, size: 16, elements: !598)
!598 = !{!599, !602}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "prio", scope: !597, file: !550, line: 96, baseType: !600, size: 8)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !23, line: 72, baseType: !601)
!601 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "sched_locked", scope: !597, file: !550, line: 97, baseType: !150, size: 8, offset: 8)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "preempt", scope: !594, file: !550, line: 100, baseType: !227, size: 16)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "order_key", scope: !553, file: !550, line: 107, baseType: !208, size: 32, offset: 128)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "swap_data", scope: !553, file: !550, line: 127, baseType: !124, size: 32, offset: 160)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !553, file: !550, line: 131, baseType: !607, size: 192, offset: 192)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_timeout", file: !586, line: 244, size: 192, elements: !608)
!608 = !{!609, !610, !616}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !607, file: !586, line: 245, baseType: !559, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "fn", scope: !607, file: !586, line: 246, baseType: !611, size: 32, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "_timeout_func_t", file: !586, line: 242, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 32)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !615}
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "dticks", scope: !607, file: !586, line: 249, baseType: !617, size: 64, offset: 128)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !23, line: 75, baseType: !391)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "callee_saved", scope: !549, file: !550, line: 250, baseType: !619, size: 288, offset: 384)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_callee_saved", file: !620, line: 25, size: 288, elements: !621)
!620 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/thread.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!621 = !{!622, !623, !624, !625, !626, !627, !628, !629, !630}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "v1", scope: !619, file: !620, line: 26, baseType: !208, size: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "v2", scope: !619, file: !620, line: 27, baseType: !208, size: 32, offset: 32)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "v3", scope: !619, file: !620, line: 28, baseType: !208, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "v4", scope: !619, file: !620, line: 29, baseType: !208, size: 32, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "v5", scope: !619, file: !620, line: 30, baseType: !208, size: 32, offset: 128)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "v6", scope: !619, file: !620, line: 31, baseType: !208, size: 32, offset: 160)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "v7", scope: !619, file: !620, line: 32, baseType: !208, size: 32, offset: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "v8", scope: !619, file: !620, line: 33, baseType: !208, size: 32, offset: 224)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "psp", scope: !619, file: !620, line: 34, baseType: !208, size: 32, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "init_data", scope: !549, file: !550, line: 253, baseType: !124, size: 32, offset: 672)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "join_queue", scope: !549, file: !550, line: 256, baseType: !585, size: 64, offset: 704)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "errno_var", scope: !549, file: !550, line: 294, baseType: !125, size: 32, offset: 768)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "stack_info", scope: !549, file: !550, line: 300, baseType: !635, size: 96, offset: 800)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_stack_info", file: !550, line: 149, size: 96, elements: !636)
!636 = !{!637, !638, !639}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !635, file: !550, line: 153, baseType: !22, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !635, file: !550, line: 162, baseType: !272, size: 32, offset: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "delta", scope: !635, file: !550, line: 168, baseType: !272, size: 32, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "resource_pool", scope: !549, file: !550, line: 325, baseType: !641, size: 32, offset: 896)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 32)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_heap", file: !643, line: 5073, size: 160, elements: !644)
!643 = !DIFile(filename: "zephyr/include/zephyr/kernel.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!644 = !{!645, !654, !655}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !642, file: !643, line: 5074, baseType: !646, size: 96)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_heap", file: !647, line: 56, size: 96, elements: !648)
!647 = !DIFile(filename: "zephyr/include/zephyr/sys/sys_heap.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!648 = !{!649, !652, !653}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "heap", scope: !646, file: !647, line: 57, baseType: !650, size: 32)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 32)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "z_heap", file: !647, line: 57, flags: DIFlagFwdDecl)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "init_mem", scope: !646, file: !647, line: 58, baseType: !124, size: 32, offset: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "init_bytes", scope: !646, file: !647, line: 59, baseType: !272, size: 32, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "wait_q", scope: !642, file: !643, line: 5075, baseType: !585, size: 64, offset: 96)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !642, file: !643, line: 5076, baseType: !656, offset: 160)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "k_spinlock", file: !657, line: 43, elements: !658)
!657 = !DIFile(filename: "zephyr/include/zephyr/spinlock.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!658 = !{}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !549, file: !550, line: 343, baseType: !660, size: 64, offset: 928)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_thread_arch", file: !620, line: 60, size: 64, elements: !661)
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "basepri", scope: !660, file: !620, line: 63, baseType: !208, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "swap_return_value", scope: !660, file: !620, line: 66, baseType: !208, size: 32, offset: 32)
!664 = !{!665, !666, !667, !668}
!665 = !DILocalVariable(name: "thread", arg: 1, scope: !544, file: !545, line: 175, type: !548)
!666 = !DILocalVariable(name: "region_num", scope: !544, file: !545, line: 200, type: !150)
!667 = !DILocalVariable(name: "guard_start", scope: !544, file: !545, line: 265, type: !22)
!668 = !DILocalVariable(name: "guard_size", scope: !544, file: !545, line: 266, type: !272)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 96, elements: !438)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "z_arm_mpu_partition", file: !671, line: 52, size: 96, elements: !672)
!671 = !DIFile(filename: "zephyr/arch/arm/include/kernel_arch_data.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!672 = !{!673, !674, !675}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "start", scope: !670, file: !671, line: 53, baseType: !22, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !670, file: !671, line: 54, baseType: !272, size: 32, offset: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !670, file: !671, line: 55, baseType: !676, size: 32, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "k_mem_partition_attr_t", file: !677, line: 151, baseType: !678)
!677 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu_v7m.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !677, line: 149, size: 32, elements: !679)
!679 = !{!680}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "rasr_attr", scope: !678, file: !677, line: 150, baseType: !208, size: 32)
!681 = !DIGlobalVariableExpression(var: !682, expr: !DIExpression())
!682 = distinct !DIGlobalVariable(name: "static_regions", scope: !538, file: !545, line: 62, type: !683, isLocal: true, isDefinition: true)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 96, elements: !438)
!684 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !670)
!685 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !687)
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !686, file: !373, line: 17, baseType: !140, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !686, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "static_regions_num", scope: !692, file: !724, line: 39, type: !150, isLocal: true, isDefinition: true)
!692 = distinct !DICompileUnit(language: DW_LANG_C99, file: !693, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !694, globals: !723, splitDebugInlining: false, nameTableKind: None)
!693 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto")
!694 = !{!695, !124, !125, !711, !150}
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 32)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "MPU_Type", file: !697, line: 1168, baseType: !698)
!697 = !DIFile(filename: "modules/hal/cmsis/CMSIS/Core/Include/core_cm3.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !697, line: 1155, size: 352, elements: !699)
!699 = !{!700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "TYPE", scope: !698, file: !697, line: 1157, baseType: !426, size: 32)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "CTRL", scope: !698, file: !697, line: 1158, baseType: !423, size: 32, offset: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "RNR", scope: !698, file: !697, line: 1159, baseType: !423, size: 32, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR", scope: !698, file: !697, line: 1160, baseType: !423, size: 32, offset: 96)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "RASR", scope: !698, file: !697, line: 1161, baseType: !423, size: 32, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A1", scope: !698, file: !697, line: 1162, baseType: !423, size: 32, offset: 160)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A1", scope: !698, file: !697, line: 1163, baseType: !423, size: 32, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A2", scope: !698, file: !697, line: 1164, baseType: !423, size: 32, offset: 224)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A2", scope: !698, file: !697, line: 1165, baseType: !423, size: 32, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "RBAR_A3", scope: !698, file: !697, line: 1166, baseType: !423, size: 32, offset: 288)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "RASR_A3", scope: !698, file: !697, line: 1167, baseType: !423, size: 32, offset: 320)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 32)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !713)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !714, line: 27, size: 96, elements: !715)
!714 = !DIFile(filename: "zephyr/include/zephyr/arch/arm/aarch32/mpu/arm_mpu.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!715 = !{!716, !717, !718}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !713, file: !714, line: 29, baseType: !208, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !713, file: !714, line: 31, baseType: !140, size: 32, offset: 32)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !713, file: !714, line: 37, baseType: !719, size: 32, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !677, line: 146, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !677, line: 141, size: 32, elements: !721)
!721 = !{!722}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !720, file: !677, line: 143, baseType: !208, size: 32)
!723 = !{!690}
!724 = !DIFile(filename: "zephyr/arch/arm/core/aarch32/mpu/arm_mpu.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "_stdout_hook", scope: !727, file: !734, line: 21, type: !409, isLocal: true, isDefinition: true)
!727 = distinct !DICompileUnit(language: DW_LANG_C99, file: !728, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !729, globals: !733, splitDebugInlining: false, nameTableKind: None)
!728 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto")
!729 = !{!730, !125, !124}
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 32)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !732, line: 22, baseType: !125)
!732 = !DIFile(filename: "zephyr/lib/libc/minimal/include/stdio.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!733 = !{!725}
!734 = !DIFile(filename: "zephyr/lib/libc/minimal/source/stdout/stdout_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!735 = !DIGlobalVariableExpression(var: !736, expr: !DIExpression())
!736 = distinct !DIGlobalVariable(name: "mpu_regions", scope: !737, file: !742, line: 13, type: !759, isLocal: true, isDefinition: true)
!737 = distinct !DICompileUnit(language: DW_LANG_C99, file: !738, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !739, splitDebugInlining: false, nameTableKind: None)
!738 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto")
!739 = !{!740, !735}
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "mpu_config", scope: !737, file: !742, line: 37, type: !743, isLocal: false, isDefinition: true)
!742 = !DIFile(filename: "zephyr/soc/arm/common/cortex_m/arm_mpu_regions.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!743 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !744)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_config", file: !714, line: 41, size: 64, elements: !745)
!745 = !{!746, !747}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !744, file: !714, line: 43, baseType: !208, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "mpu_regions", scope: !744, file: !714, line: 45, baseType: !748, size: 32, offset: 32)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 32)
!749 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !750)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region", file: !714, line: 27, size: 96, elements: !751)
!751 = !{!752, !753, !754}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !750, file: !714, line: 29, baseType: !208, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !750, file: !714, line: 31, baseType: !140, size: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "attr", scope: !750, file: !714, line: 37, baseType: !755, size: 32, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "arm_mpu_region_attr_t", file: !677, line: 146, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arm_mpu_region_attr", file: !677, line: 141, size: 32, elements: !757)
!757 = !{!758}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "rasr", scope: !756, file: !677, line: 143, baseType: !208, size: 32)
!759 = !DICompositeType(tag: DW_TAG_array_type, baseType: !749, size: 192, elements: !581)
!760 = !DIGlobalVariableExpression(var: !761, expr: !DIExpression())
!761 = distinct !DIGlobalVariable(name: "__init_uart_console_init", scope: !762, file: !819, line: 603, type: !821, isLocal: true, isDefinition: true, align: 32)
!762 = distinct !DICompileUnit(language: DW_LANG_C99, file: !763, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !405, retainedTypes: !764, globals: !816, splitDebugInlining: false, nameTableKind: None)
!763 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto")
!764 = !{!124, !125, !765}
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_driver_api", file: !768, line: 336, size: 160, elements: !769)
!768 = !DIFile(filename: "zephyr/include/zephyr/drivers/uart.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!769 = !{!770, !790, !794, !798, !811}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "poll_in", scope: !767, file: !768, line: 365, baseType: !771, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 32)
!772 = !DISubroutineType(types: !773)
!773 = !{!125, !774, !789}
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 32)
!775 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !777)
!777 = !{!778, !779, !780, !781, !787, !788}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !776, file: !137, line: 380, baseType: !140, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !776, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !776, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !776, file: !137, line: 386, baseType: !782, size: 32, offset: 96)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 32)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !137, line: 351, size: 16, elements: !784)
!784 = !{!785, !786}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !783, file: !137, line: 359, baseType: !150, size: 8)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !783, file: !137, line: 364, baseType: !153, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !776, file: !137, line: 388, baseType: !124, size: 32, offset: 128)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !776, file: !137, line: 396, baseType: !156, size: 32, offset: 160)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "poll_out", scope: !767, file: !768, line: 366, baseType: !791, size: 32, offset: 32)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 32)
!792 = !DISubroutineType(types: !793)
!793 = !{null, !774, !151}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "err_check", scope: !767, file: !768, line: 374, baseType: !795, size: 32, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 32)
!796 = !DISubroutineType(types: !797)
!797 = !{!125, !774}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "configure", scope: !767, file: !768, line: 377, baseType: !799, size: 32, offset: 96)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 32)
!800 = !DISubroutineType(types: !801)
!801 = !{!125, !774, !802}
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 32)
!803 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "uart_config", file: !768, line: 122, size: 64, elements: !805)
!805 = !{!806, !807, !808, !809, !810}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "baudrate", scope: !804, file: !768, line: 123, baseType: !208, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "parity", scope: !804, file: !768, line: 124, baseType: !150, size: 8, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "stop_bits", scope: !804, file: !768, line: 125, baseType: !150, size: 8, offset: 40)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "data_bits", scope: !804, file: !768, line: 126, baseType: !150, size: 8, offset: 48)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "flow_ctrl", scope: !804, file: !768, line: 127, baseType: !150, size: 8, offset: 56)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "config_get", scope: !767, file: !768, line: 379, baseType: !812, size: 32, offset: 128)
!812 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !813, size: 32)
!813 = !DISubroutineType(types: !814)
!814 = !{!125, !774, !815}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 32)
!816 = !{!760, !817}
!817 = !DIGlobalVariableExpression(var: !818, expr: !DIExpression())
!818 = distinct !DIGlobalVariable(name: "uart_console_dev", scope: !762, file: !819, line: 38, type: !820, isLocal: true, isDefinition: true)
!819 = !DIFile(filename: "zephyr/drivers/console/uart_console.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!820 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !774)
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !482, line: 51, size: 64, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !822, file: !482, line: 60, baseType: !795, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !822, file: !482, line: 65, baseType: !774, size: 32, offset: 32)
!826 = !DIGlobalVariableExpression(var: !827, expr: !DIExpression())
!827 = distinct !DIGlobalVariable(name: "log_const_tinycrypt", scope: !828, file: !834, line: 22, type: !1004, isLocal: false, isDefinition: true)
!828 = distinct !DICompileUnit(language: DW_LANG_C99, file: !829, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !830, globals: !831, splitDebugInlining: false, nameTableKind: None)
!829 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/crypto/crypto_tc_shim.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto")
!830 = !{!30, !39, !42, !116}
!831 = !{!826, !832, !836, !852, !863, !865, !993}
!832 = !DIGlobalVariableExpression(var: !833, expr: !DIExpression())
!833 = distinct !DIGlobalVariable(name: "__devicehdl_crypto_tinycrypt", scope: !828, file: !834, line: 324, type: !835, isLocal: false, isDefinition: true, align: 16)
!834 = !DIFile(filename: "zephyr/drivers/crypto/crypto_tc_shim.c", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!835 = !DICompositeType(tag: DW_TAG_array_type, baseType: !157, size: 48, elements: !454)
!836 = !DIGlobalVariableExpression(var: !837, expr: !DIExpression())
!837 = distinct !DIGlobalVariable(name: "__device_crypto_tinycrypt", scope: !828, file: !834, line: 324, type: !838, isLocal: true, isDefinition: true, align: 32)
!838 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !840)
!840 = !{!841, !842, !843, !844, !850, !851}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !839, file: !137, line: 380, baseType: !140, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !839, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !839, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !839, file: !137, line: 386, baseType: !845, size: 32, offset: 96)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 32)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device_state", file: !137, line: 351, size: 16, elements: !847)
!847 = !{!848, !849}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "init_res", scope: !846, file: !137, line: 359, baseType: !150, size: 8)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "initialized", scope: !846, file: !137, line: 364, baseType: !153, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 8)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !839, file: !137, line: 388, baseType: !124, size: 32, offset: 128)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "handles", scope: !839, file: !137, line: 396, baseType: !156, size: 32, offset: 160)
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "__init___device_crypto_tinycrypt", scope: !828, file: !834, line: 324, type: !854, isLocal: true, isDefinition: true, align: 32)
!854 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "init_entry", file: !482, line: 51, size: 64, elements: !856)
!856 = !{!857, !862}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "init", scope: !855, file: !482, line: 60, baseType: !858, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 32)
!859 = !DISubroutineType(types: !860)
!860 = !{!125, !861}
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 32)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !855, file: !482, line: 65, baseType: !861, size: 32, offset: 32)
!863 = !DIGlobalVariableExpression(var: !864, expr: !DIExpression())
!864 = distinct !DIGlobalVariable(name: "__devstate_crypto_tinycrypt", scope: !828, file: !834, line: 324, type: !846, isLocal: true, isDefinition: true, align: 8)
!865 = !DIGlobalVariableExpression(var: !866, expr: !DIExpression())
!866 = distinct !DIGlobalVariable(name: "crypto_enc_funcs", scope: !828, file: !834, line: 317, type: !867, isLocal: true, isDefinition: true)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "crypto_driver_api", file: !128, line: 65, size: 224, elements: !868)
!868 = !{!869, !870, !946, !950, !958, !981, !985}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "query_hw_caps", scope: !867, file: !128, line: 66, baseType: !858, size: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_begin_session", scope: !867, file: !128, line: 69, baseType: !871, size: 32, offset: 32)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 32)
!872 = !DISubroutineType(types: !873)
!873 = !{!125, !861, !874, !39, !30, !42}
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 32)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ctx", file: !31, line: 110, size: 256, elements: !876)
!876 = !{!877, !919, !924, !925, !926, !927, !944, !945}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !875, file: !31, line: 116, baseType: !878, size: 64)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_ops", file: !31, line: 74, size: 64, elements: !879)
!879 = !{!880, !881}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_mode", scope: !878, file: !31, line: 76, baseType: !30, size: 32)
!881 = !DIDerivedType(tag: DW_TAG_member, scope: !878, file: !31, line: 78, baseType: !882, size: 32, offset: 32)
!882 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !878, file: !31, line: 78, size: 32, elements: !883)
!883 = !{!884, !898, !903, !905, !917}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "block_crypt_hndlr", scope: !882, file: !31, line: 79, baseType: !885, size: 32)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_op_t", file: !31, line: 57, baseType: !886)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 32)
!887 = !DISubroutineType(types: !888)
!888 = !{!125, !874, !889}
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 32)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_pkt", file: !31, line: 180, size: 192, elements: !891)
!891 = !{!892, !893, !894, !895, !896, !897}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !890, file: !31, line: 183, baseType: !184, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !890, file: !31, line: 186, baseType: !125, size: 32, offset: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !890, file: !31, line: 192, baseType: !184, size: 32, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf_max", scope: !890, file: !31, line: 197, baseType: !125, size: 32, offset: 96)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "out_len", scope: !890, file: !31, line: 202, baseType: !125, size: 32, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !890, file: !31, line: 208, baseType: !874, size: 32, offset: 160)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "cbc_crypt_hndlr", scope: !882, file: !31, line: 80, baseType: !899, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "cbc_op_t", file: !31, line: 62, baseType: !900)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 32)
!901 = !DISubroutineType(types: !902)
!902 = !{!125, !874, !889, !184}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_crypt_hndlr", scope: !882, file: !31, line: 81, baseType: !904, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "ctr_op_t", file: !31, line: 65, baseType: !900)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_crypt_hndlr", scope: !882, file: !31, line: 82, baseType: !906, size: 32)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "ccm_op_t", file: !31, line: 68, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 32)
!908 = !DISubroutineType(types: !909)
!909 = !{!125, !874, !910, !184}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 32)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cipher_aead_pkt", file: !31, line: 217, size: 128, elements: !912)
!912 = !{!913, !914, !915, !916}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "pkt", scope: !911, file: !31, line: 219, baseType: !889, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !911, file: !31, line: 224, baseType: !184, size: 32, offset: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "ad_len", scope: !911, file: !31, line: 227, baseType: !208, size: 32, offset: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "tag", scope: !911, file: !31, line: 233, baseType: !184, size: 32, offset: 96)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_crypt_hndlr", scope: !882, file: !31, line: 83, baseType: !918, size: 32)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcm_op_t", file: !31, line: 71, baseType: !907)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !875, file: !31, line: 126, baseType: !920, size: 32, offset: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !875, file: !31, line: 119, size: 32, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "bit_stream", scope: !920, file: !31, line: 121, baseType: !184, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !920, file: !31, line: 125, baseType: !124, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !875, file: !31, line: 131, baseType: !861, size: 32, offset: 96)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !875, file: !31, line: 140, baseType: !124, size: 32, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "app_sessn_state", scope: !875, file: !31, line: 146, baseType: !124, size: 32, offset: 160)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "mode_params", scope: !875, file: !31, line: 156, baseType: !928, size: 32, offset: 192)
!928 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !875, file: !31, line: 152, size: 32, elements: !929)
!929 = !{!930, !935, !939}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ccm_info", scope: !928, file: !31, line: 153, baseType: !931, size: 32)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ccm_params", file: !31, line: 87, size: 32, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !931, file: !31, line: 88, baseType: !227, size: 16)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !931, file: !31, line: 89, baseType: !227, size: 16, offset: 16)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_info", scope: !928, file: !31, line: 154, baseType: !936, size: 32)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ctr_params", file: !31, line: 92, size: 32, elements: !937)
!937 = !{!938}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "ctr_len", scope: !936, file: !31, line: 96, baseType: !208, size: 32)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "gcm_info", scope: !928, file: !31, line: 155, baseType: !940, size: 32)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gcm_params", file: !31, line: 99, size: 32, elements: !941)
!941 = !{!942, !943}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "tag_len", scope: !940, file: !31, line: 100, baseType: !227, size: 16)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "nonce_len", scope: !940, file: !31, line: 101, baseType: !227, size: 16, offset: 16)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "keylen", scope: !875, file: !31, line: 161, baseType: !227, size: 16, offset: 224)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !875, file: !31, line: 169, baseType: !227, size: 16, offset: 240)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_free_session", scope: !867, file: !128, line: 74, baseType: !947, size: 32, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 32)
!948 = !DISubroutineType(types: !949)
!949 = !{!125, !861, !874}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "cipher_async_callback_set", scope: !867, file: !128, line: 77, baseType: !951, size: 32, offset: 96)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 32)
!952 = !DISubroutineType(types: !953)
!953 = !{!125, !861, !954}
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "cipher_completion_cb", file: !31, line: 242, baseType: !955)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 32)
!956 = !DISubroutineType(types: !957)
!957 = !{null, !889, !125}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "hash_begin_session", scope: !867, file: !128, line: 81, baseType: !959, size: 32, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 32)
!960 = !DISubroutineType(types: !961)
!961 = !{!125, !861, !962, !116}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 32)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_ctx", file: !117, line: 47, size: 128, elements: !964)
!964 = !{!965, !966, !967, !979, !980}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "device", scope: !963, file: !117, line: 51, baseType: !861, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "drv_sessn_state", scope: !963, file: !117, line: 60, baseType: !124, size: 32, offset: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "hash_hndlr", scope: !963, file: !117, line: 65, baseType: !968, size: 32, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_op_t", file: !117, line: 38, baseType: !969)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 32)
!970 = !DISubroutineType(types: !971)
!971 = !{!125, !962, !972, !153}
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 32)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hash_pkt", file: !117, line: 88, size: 128, elements: !974)
!974 = !{!975, !976, !977, !978}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "in_buf", scope: !973, file: !117, line: 91, baseType: !184, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "in_len", scope: !973, file: !117, line: 94, baseType: !272, size: 32, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "out_buf", scope: !973, file: !117, line: 101, baseType: !184, size: 32, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", scope: !973, file: !117, line: 107, baseType: !962, size: 32, offset: 96)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "started", scope: !963, file: !117, line: 70, baseType: !153, size: 8, offset: 96)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !963, file: !117, line: 78, baseType: !227, size: 16, offset: 112)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "hash_free_session", scope: !867, file: !128, line: 84, baseType: !982, size: 32, offset: 160)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 32)
!983 = !DISubroutineType(types: !984)
!984 = !{!125, !861, !962}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "hash_async_callback_set", scope: !867, file: !128, line: 86, baseType: !986, size: 32, offset: 192)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 32)
!987 = !DISubroutineType(types: !988)
!988 = !{!125, !861, !989}
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_completion_cb", file: !117, line: 114, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 32)
!991 = !DISubroutineType(types: !992)
!992 = !{null, !972, !125}
!993 = !DIGlobalVariableExpression(var: !994, expr: !DIExpression())
!994 = distinct !DIGlobalVariable(name: "tc_driver_state", scope: !828, file: !834, line: 26, type: !995, isLocal: true, isDefinition: true)
!995 = !DICompositeType(tag: DW_TAG_array_type, baseType: !996, size: 2880, elements: !581)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tc_shim_drv_state", file: !997, line: 22, size: 1440, elements: !998)
!997 = !DIFile(filename: "zephyr/drivers/crypto/crypto_tc_shim_priv.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "in_use", scope: !996, file: !997, line: 23, baseType: !125, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "session_key", scope: !996, file: !997, line: 24, baseType: !1001, size: 1408, offset: 32)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tc_aes_key_sched_struct", file: !511, line: 64, size: 1408, elements: !1002)
!1002 = !{!1003}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "words", scope: !1001, file: !511, line: 65, baseType: !516, size: 1408)
!1004 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "log_source_const_data", file: !373, line: 16, size: 64, elements: !1006)
!1006 = !{!1007, !1008}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1005, file: !373, line: 17, baseType: !140, size: 32)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "level", scope: !1005, file: !373, line: 18, baseType: !150, size: 8, offset: 32)
!1009 = !DIGlobalVariableExpression(var: !1010, expr: !DIExpression())
!1010 = distinct !DIGlobalVariable(name: "__devicehdl_crypto_tinycrypt", scope: !1011, file: !1016, line: 17, type: !835, isLocal: false, isDefinition: true, align: 16)
!1011 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1012, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !1013, splitDebugInlining: false, nameTableKind: None)
!1012 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto/zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto")
!1013 = !{!1014, !1017, !1009}
!1014 = !DIGlobalVariableExpression(var: !1015, expr: !DIExpression())
!1015 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_26", scope: !1011, file: !1016, line: 7, type: !835, isLocal: false, isDefinition: true, align: 16)
!1016 = !DIFile(filename: "zephyr/dev_handles.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto")
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(name: "__devicehdl_dts_ord_21", scope: !1011, file: !1016, line: 12, type: !835, isLocal: false, isDefinition: true, align: 16)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(name: "log_const_wdt_sam", scope: !1021, file: !1082, line: 28, type: !1131, isLocal: false, isDefinition: true)
!1021 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1022, producer: "Ubuntu clang version 14.0.6", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !1023, globals: !1079, splitDebugInlining: false, nameTableKind: None)
!1022 = !DIFile(filename: "/home/mjshen/RTOSExploration/zephyrproject/zephyr/drivers/watchdog/wdt_sam.c", directory: "/home/mjshen/RTOSExploration/zephyrproject/zephyr-build/build/arduino_due/drivers/crypto")
!1023 = !{!1024, !208}
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "wdt_driver_api", file: !1027, line: 134, size: 128, elements: !1028)
!1027 = !DIFile(filename: "zephyr/include/zephyr/drivers/watchdog.h", directory: "/home/mjshen/RTOSExploration/zephyrproject")
!1028 = !{!1029, !1049, !1054, !1074}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "setup", scope: !1026, file: !1027, line: 135, baseType: !1030, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "wdt_api_setup", file: !1027, line: 113, baseType: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 32)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!125, !1034, !150}
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "device", file: !137, line: 378, size: 192, elements: !1037)
!1037 = !{!1038, !1039, !1040, !1041, !1047, !1048}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1036, file: !137, line: 380, baseType: !140, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !1036, file: !137, line: 382, baseType: !13, size: 32, offset: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "api", scope: !1036, file: !137, line: 384, baseType: !13, size: 32, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1036, file: !137, line: 386, baseType: !1042, size: 32, offset: 96)
